{
    "word": "abstract",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈæb.strækt"
                            ],
                            "us": [
                                "ˈæb.strækt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "existing as an idea, feeling, or quality, not as a material object: ",
                            "examples": [
                                "Truth and beauty are abstract concepts."
                            ]
                        },
                        {
                            "explanation": "An abstract argument or discussion is general and not based on particular examples: ",
                            "examples": [
                                "This debate is becoming too abstract - let's have some hard facts!"
                            ]
                        },
                        {
                            "explanation": "general ideas: ",
                            "examples": [
                                "So far we've only discussed the question in the abstract (= without referring to any real examples).",
                                "I have difficulty dealing with the abstract - let's discuss particular cases."
                            ]
                        },
                        {
                            "explanation": "used to refer to a type of painting, drawing, or sculpture that uses shapes, lines, and colour in a way that does not try to represent the appearance of people or things: ",
                            "examples": [
                                "abstract art",
                                "an abstract painter"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæb.strækt"
                            ],
                            "us": [
                                "ˈæb.strækt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a short form of a speech, article, book, etc., giving only the most important facts or ideas: ",
                            "examples": [
                                "There is a section at the end of the magazine that includes abstracts of recent articles/books."
                            ]
                        },
                        {
                            "explanation": "a painting that uses shapes, lines, and colour in a way that does not try to represent the appearance of people or things",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "æbˈstrækt"
                            ],
                            "us": [
                                "æbˈstrækt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to consider something in a general way or make a general judgment after looking at particular details: ",
                            "examples": [
                                "Most interviewees focus on their own experience and do not generalize or abstract the situation.",
                                "A general rule is arrived at by abstracting from the data. "
                            ]
                        },
                        {
                            "explanation": "to remove or separate someone or something from a place or context (= the situation, facts, words, etc. that exist around something): ",
                            "examples": [
                                "It was impossible to abstract children from their social environment with all its dangers.",
                                "Relevant information was abstracted from the database or from medical records."
                            ]
                        },
                        {
                            "explanation": "to give a summary or abstract (= a short description giving the most important ideas) of something: ",
                            "examples": [
                                "If you find an article you think should be abstracted in our journal, submit it for consideration."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}