{
    "word": "abuse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈbjuːz"
                            ],
                            "us": [
                                "əˈbjuːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use something for the wrong purpose in a way that is harmful or morally wrong: ",
                            "examples": [
                                "She is continually abusing her position/authority by getting other people to do things for her.",
                                "I never expected that he would abuse the trust I placed in him.",
                                "He fears that his brother may be abusing alcohol."
                            ]
                        },
                        {
                            "explanation": "to treat someone cruelly or violently: ",
                            "examples": [
                                "The therapist works with children who have been sexually abused. ",
                                "The dog showed signs of being physically abused. ",
                                "Men who abuse their partners are good at portraying themselves as the real victims."
                            ]
                        },
                        {
                            "explanation": "to speak to someone rudely or cruelly: ",
                            "examples": [
                                "The athlete was being verbally abused by a drunk fan in the crowd. ",
                                "The crowd started abusing him after he failed to save a goal."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˈbjuːs"
                            ],
                            "us": [
                                "əˈbjuːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the use of something in a way that is harmful or morally wrong: ",
                            "examples": [
                                "The investigation revealed abuses of power committed by the governor's office. ",
                                "The actress disclosed that she was seeking treatment for alcohol abuse. ",
                                "Chronic drug abuse can lead to gradual brain damage. ",
                                "He had struggled with substance abuse for much of his life. ",
                                "It was an abuse of her kindness to keep asking Ms Lawson for favours. "
                            ]
                        },
                        {
                            "explanation": "cruel, violent, or unfair treatment of someone: ",
                            "examples": [
                                "She claimed to have been a victim of child abuse.",
                                "She endured physical abuse (= bad treatment) from her stepfather.",
                                "He was arrested for the sexual abuse of a minor.",
                                "The nasty way he treats his colleagues borders on abuse."
                            ]
                        },
                        {
                            "explanation": "rude and offensive words said to another person: ",
                            "examples": [
                                "He had apparently experienced a lot of verbal abuse from his co-workers.",
                                "They hurled/unleashed a torrent of abuse at the actors (= they said a lot of rude and offensive things to the actors).",
                                "\"Idiot!\" is a term of abuse (= an insulting expression).",
                                "I was astonished at the stream of abuse coming from his lips. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}