{
    "word": "accommodation",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˌkɒm.əˈdeɪ.ʃən"
                            ],
                            "us": [
                                "əˌkɑː.məˈdeɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a place to stay or live: ",
                            "examples": [
                                "They paid for his flights and hotel accommodation.",
                                "There's a shortage of cheap accommodation in the city.",
                                "There is accommodation for about five hundred students on campus.",
                                "Hostels are a temporary solution until the families can be housed in permanent accommodation."
                            ]
                        },
                        {
                            "explanation": "a particular type of place to sit or sleep on a train, boat, etc.: ",
                            "examples": [
                                "We were assigned first-class accommodation on the train."
                            ]
                        },
                        {
                            "explanation": "an agreement between two groups who have different opinions on a subject, or the process of reaching an agreement like this: ",
                            "examples": [
                                "She may be able to reach an accommodation with other EU members on the question of immigration.",
                                "He sought accommodation with the United States."
                            ]
                        },
                        {
                            "explanation": "a special arrangement that is made for a person or group that has different needs to others: ",
                            "examples": [
                                "The hotel tries to make accommodations for people with small children.",
                                "Companies should make reasonable accommodations for disabled employees.",
                                "As a host, what do you consider to be a reasonable accommodation for someone with a medically restricted diet?",
                                "As a business we offer flexible work hours and other accommodations for parents.",
                                "My children had no recognized disability so I did not qualify for any accommodation with regard to work hours."
                            ]
                        },
                        {
                            "explanation": "the process by which an eye is able to focus (= see clearly) by changing the shape of the lens",
                            "examples": []
                        },
                        {
                            "explanation": "the process in which someone changes their accent (= the way that people who come from a particular area, social group, etc. pronounce words) or other things about the way that they speak according to the speech style or behaviour of the person who they are speaking to: ",
                            "examples": [
                                "When two people from different social backgrounds meet, there is often a tendency for their ways of speaking to alter so that they become more alike, a process known as accommodation.",
                                "She carried out a study of linguistic accommodation in social settings.",
                                "Speech accommodation theory holds that communicators are motivated to adjust aspects of their speech styles as a way of expressing attitudes and intentions. "
                            ]
                        },
                        {
                            "explanation": "a process in which a speech sound is changed according to the sound that comes directly before or after it: ",
                            "examples": [
                                "One of the most common forms of accommodation is that consonants tend to be labialized when followed by a rounded vowel, as in cool or rude."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}