{
    "word": "account",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˈkaʊnt"
                            ],
                            "us": [
                                "əˈkaʊnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an arrangement with a bank to keep your money there and to allow you to take it out when you need to: ",
                            "examples": [
                                "I withdrew my money and asked the bank to close my account. ",
                                "I've opened an account with a building society .",
                                "I paid the money into my account this morning.",
                                "She paid the cheque into her account.",
                                "She deposited the check in/into her account.",
                                "I need to withdraw some money from my account."
                            ]
                        },
                        {
                            "explanation": "a written or spoken description or record of an event: ",
                            "examples": [
                                "She gave a thrilling account of her life in the jungle.",
                                "He kept a detailed account of the suspect's movements.",
                                "Several eyewitnesses' accounts differed considerably from the official version of events."
                            ]
                        },
                        {
                            "explanation": "as said by most people: ",
                            "examples": [
                                "By all accounts, San Francisco is a city that's easy to fall in love with."
                            ]
                        },
                        {
                            "explanation": "If something is true by your own account, what you say is true although you have not proved it: ",
                            "examples": [
                                "By his own account, he's quite wealthy."
                            ]
                        },
                        {
                            "explanation": "because of something: ",
                            "examples": [
                                "He doesn't drink alcohol on account of his poor health."
                            ]
                        },
                        {
                            "explanation": "an agreement with a shop or business that allows you to buy things and pay for them later: ",
                            "examples": [
                                "Could you put it on/charge it to my account (= can I pay for it later), please?",
                                "Do you have an account at this store/with us, madam? ",
                                "Could you please settle your account in full (= give us all the money you owe us)?"
                            ]
                        },
                        {
                            "explanation": "a customer who does business with a company: ",
                            "examples": [
                                "If the advertising agency loses this account, it will make a big dent in their profits."
                            ]
                        },
                        {
                            "explanation": "an arrangement to use a social media website or internet service by a particular person who gives their name and some personal details: ",
                            "examples": [
                                "I decided to delete my account.",
                                "She thought that her Instagram account had been hacked."
                            ]
                        },
                        {
                            "explanation": "to not be important: ",
                            "examples": [
                                "It's of no account to me whether he comes or not."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈkaʊnt"
                            ],
                            "us": [
                                "əˈkaʊnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to think of someone or something in the stated way: ",
                            "examples": [
                                "She was accounted a genius by all who knew her work."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}