{
    "word": "acquisition",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌæk.wɪˈzɪʃ.ən"
                            ],
                            "us": [
                                "ˌæk.wəˈzɪʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the process of getting something: ",
                            "examples": [
                                "The acquisition of huge amounts of data has helped our research enormously.",
                                "Their main methods of food acquisition were hunting and fishing. "
                            ]
                        },
                        {
                            "explanation": "the process of gradually learning something or gaining something such as a skill: ",
                            "examples": [
                                "Education is not merely about the acquisition of knowledge.",
                                "Anxiety can interfere with the acquisition of new skills.",
                                "Language acquisition starts at a very young age."
                            ]
                        },
                        {
                            "explanation": "something that someone buys, often to add to a collection of things: ",
                            "examples": [
                                "I like your earrings - are they a recent acquisition? (= Did you get them recently?)",
                                "The museum's latest acquisition is a four-million-dollar sculpture."
                            ]
                        },
                        {
                            "explanation": "something such as a building, another company, or a piece of land that is bought by a company, or the act of buying it: ",
                            "examples": [
                                "She worked on mergers and acquisitions, specializing in asset valuation.",
                                "The company is considering a number of acquisitions.",
                                "Several small media companies are his next likely targets for acquisition."
                            ]
                        },
                        {
                            "explanation": "the right to sell or publish something, such as a particular work or work by a particular author, that is bought or obtained by a company or person; the act of buying or obtaining this right: ",
                            "examples": [
                                "They are very pleased with another new acquisition, a biography of the former Prime Minister.",
                                "He built the firm into a leading publisher with his clever acquisitions, including Robert Louis Stephenson's \"Treasure Island\". ",
                                "Acquisition of digital rights for new books is now a standard part of contract negotiations."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}