{
    "word": "acquire",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈkwaɪər"
                            ],
                            "us": [
                                "əˈkwaɪɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to get or obtain something: ",
                            "examples": [
                                "From humble beginnings he went on to acquire great wealth. ",
                                "I was wearing a newly acquired jacket.",
                                "The museum will put the recently acquired Picasso on display this spring.",
                                "I seem to have acquired (= have got although I don't know how) two copies of this book."
                            ]
                        },
                        {
                            "explanation": "to buy a business or property, or buy shares in a business: ",
                            "examples": [
                                "He acquired the firm in 2008.",
                                "In 1949 the property was acquired by United Steel Companies. ",
                                "The airline will acquire a 49 percent share of its rival.",
                                "It took several years to find and acquire the land needed for the project."
                            ]
                        },
                        {
                            "explanation": "to buy or obtain the right to sell or publish something, for example the right to publish a particular work or the works of a particular writer: ",
                            "examples": [
                                "He acquired Winnie the Pooh merchandising rights from A. A. Milne, the author of the children's stories.",
                                "The book was acquired by Sarah McGill, an editor at Riverdale Books.",
                                "Warner Bros. acquired the rights to the movie in North America."
                            ]
                        },
                        {
                            "explanation": "to gradually learn or gain something such as a language or skill: ",
                            "examples": [
                                "We want to understand more about how children acquire language.",
                                "The purpose of university is to acquire knowledge and critical thinking skills.",
                                "With practice, students can acquire better study habits. ",
                                "He has acquired a reputation for being difficult to work with.",
                                "I soon acquired a taste for the local cuisine."
                            ]
                        },
                        {
                            "explanation": "to develop a medical condition or catch a disease that you were not born with: ",
                            "examples": [
                                "They develop gene therapy products for the treatment of acquired and inherited diseases.",
                                "They estimate that millions of patients every year acquire infections while in hospital."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}