{
    "word": "action",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæk.ʃən"
                            ],
                            "us": [
                                "ˈæk.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the process of doing something, especially when dealing with a problem or difficulty: ",
                            "examples": [
                                "This problem calls for swift/prompt action from the government.",
                                "Action to prevent the spread of the disease is high on the government's agenda.",
                                "So what's the plan of action? (= What are we going to do?)",
                                "The complaints system swings into action (= starts to work) as soon as a claim is made.",
                                "We must take action (= do something) to deal with the problem before it spreads to other areas.",
                                "The committee was spurred into action (= encouraged to do something) by the threat of government cuts."
                            ]
                        },
                        {
                            "explanation": "something that you do: ",
                            "examples": [
                                "She has to accept the consequences of her actions.",
                                "I asked him to explain his actions."
                            ]
                        },
                        {
                            "explanation": "a physical movement: ",
                            "examples": [
                                "I'll say the words and you can mime the actions.",
                                "It only needs a small wrist action (= movement of the wrist) to start the process."
                            ]
                        },
                        {
                            "explanation": "things that are happening, especially exciting or important things: ",
                            "examples": [
                                "I like movies with a lot of action.",
                                "In her last novel, the action (= the main events) moves between Greece and southern Spain."
                            ]
                        },
                        {
                            "explanation": "a style of film in which a lot of exciting and often violent things happen: ",
                            "examples": [
                                "His filmmaking style blends action, horror, and comedy. ",
                                "The action genre is often assumed to appeal more to men."
                            ]
                        },
                        {
                            "explanation": "at the place where something important or interesting is happening: ",
                            "examples": [
                                "A journalist has to be where the action is."
                            ]
                        },
                        {
                            "explanation": "the effect something has on another thing: ",
                            "examples": [
                                "They recorded the action of the drug on the nervous system."
                            ]
                        },
                        {
                            "explanation": "fighting in a war: ",
                            "examples": [
                                "He saw action in the trenches.",
                                "Her younger son was killed in action."
                            ]
                        },
                        {
                            "explanation": "A soldier or other member of the armed forces who is missing in action cannot be found after a battle or other military action, so it is not possible to say if they are dead or alive. : ",
                            "examples": [
                                "He was reported missing in action."
                            ]
                        },
                        {
                            "explanation": "the way something moves or works: ",
                            "examples": [
                                "We studied the action of the digestive system.",
                                "The car has a very smooth braking action."
                            ]
                        },
                        {
                            "explanation": "a legal process that is decided in a law court: ",
                            "examples": [
                                "She brought an action (for negligence) against the hospital.",
                                "The book was halted in South Africa by a threat of legal action.",
                                "a libel action",
                                "A criminal action was brought against him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈæk.ʃən"
                            ],
                            "us": [
                                "ˈæk.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to do something to deal with a particular problem or matter: ",
                            "examples": [
                                "I'll just run through the minutes of the last meeting, raising those points that still have to be actioned."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}