{
    "word": "add",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "æd"
                            ],
                            "us": [
                                "æd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put two or more numbers or amounts together to get a total: ",
                            "examples": [
                                "It's $45 - $50 if you add in the cost of postage.",
                                "Don't forget to add on your travelling expenses.",
                                "We'll keep a running subtotal and add the tax on at the end.",
                                "If you add (= calculate the total of) three and four you get seven."
                            ]
                        },
                        {
                            "explanation": "to put something with something else to increase the number or amount or to improve the whole: ",
                            "examples": [
                                "She's added a Picasso to her collection.",
                                "Beat the butter and sugar together and slowly add the eggs.",
                                "Her colleagues' laughter only added to her embarrassment."
                            ]
                        },
                        {
                            "explanation": "to say another thing: ",
                            "examples": [
                                "She was sad, she said, but added (= said also) that she felt she had made the right decision.",
                                "\"Oh, and thank you for all your help!\" he added as he was leaving."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌeɪ.diːˈdiː"
                            ],
                            "us": [
                                "ˌeɪ.diːˈdiː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "abbreviation for Attention Deficit Disorder: a name used mainly in the 1980s for a condition in which someone, especially a child, is often in a state of activity or excitement and unable to direct their attention towards what they are doing: ",
                            "examples": [
                                "A person with ADHD, previously known as ADD (attention-deficit disorder), has trouble focusing on activities, organizing and finishing tasks, and following instructions.",
                                "She said her child's teacher thought he might have ADD."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}