{
    "word": "addition",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˈdɪʃ.ən"
                            ],
                            "us": [
                                "əˈdɪʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the process of adding numbers or amounts together: ",
                            "examples": [
                                "Twice a week the children are tested in basic mathematical skills such as addition (= calculating the total of different numbers put together) and subtraction."
                            ]
                        },
                        {
                            "explanation": "as well (as): ",
                            "examples": [
                                "In addition to his apartment in Manhattan, he has a villa in Italy and a castle in Scotland."
                            ]
                        },
                        {
                            "explanation": "something that has been added to something else: ",
                            "examples": [
                                "He admits tofu is a useful addition to the range of meat alternatives available.",
                                "Her latest novel is a worthy addition to the spy thriller genre.",
                                "Fresh summer vegetables are a welcome addition to many recipes.",
                                "I have many exotic plants in my collection, and this orchid is my latest addition.",
                                "The new model is the latest addition to the range."
                            ]
                        },
                        {
                            "explanation": "someone new who has joined or been added to a group: ",
                            "examples": [
                                "We have had several new additions to the family recently.",
                                "A new secretary would be a welcome addition."
                            ]
                        },
                        {
                            "explanation": "the act of adding a substance or thing to something else: ",
                            "examples": [
                                "Most working environments are improved by the addition of (= by adding) a few plants and pictures."
                            ]
                        },
                        {
                            "explanation": "a new part added to a house or other building: ",
                            "examples": [
                                "We're building an addition to our house."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}