{
    "word": "adopt",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈdɒpt"
                            ],
                            "us": [
                                "əˈdɑːpt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to legally take another person's child into your own family and take care of him or her as your own child: ",
                            "examples": [
                                "They've adopted a baby girl.",
                                "She had the child adopted (= she gave her baby to someone else to take care of).",
                                "They have no children of their own, but they're hoping to adopt."
                            ]
                        },
                        {
                            "explanation": "to take an animal that has been left in a place such as a rescue centre, and keep it as your pet: ",
                            "examples": [
                                "Only about 20 percent of all dogs and cats that come into the rescue centre will be adopted.",
                                "She lives in a 3-bedroomed home with five dogs she adopted from an animal shelter."
                            ]
                        },
                        {
                            "explanation": "to accept or start to use something new: ",
                            "examples": [
                                "I think it's time to adopt a different strategy in my dealings with him.",
                                "The new tax would force companies to adopt energy-saving measures.",
                                "He's adopted a remarkably light-hearted attitude towards the situation."
                            ]
                        },
                        {
                            "explanation": "to choose someone or something or take something as your own: ",
                            "examples": [
                                "Dr Kennedy has been adopted as the party's candidate for South Cambridge."
                            ]
                        },
                        {
                            "explanation": "to start behaving in a particular way, especially by choice: ",
                            "examples": [
                                "Roz has adopted one or two funny mannerisms since she's been away."
                            ]
                        },
                        {
                            "explanation": "to pay money in order to have your name connected with a particular thing, especially in order to help an organization raise money: ",
                            "examples": [
                                "For just $25, you can adopt a word for an entire year."
                            ]
                        },
                        {
                            "explanation": "to agree to be responsible for a road being maintained (= kept in good condition): ",
                            "examples": [
                                "The council said the road was never adopted and so it is not obliged to repair it."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}