{
    "word": "advocate",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈæd.və.keɪt"
                            ],
                            "us": [
                                "ˈæd.və.keɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to publicly support or suggest an idea, development, or way of doing something: ",
                            "examples": [
                                "She advocates taking a more long-term view.",
                                "He advocates the return of capital punishment.",
                                "We will continue to advocate for a regional, cooperative approach to the construction project."
                            ]
                        },
                        {
                            "explanation": "to speak for, support, or represent a person or group of people who may need extra help or protection: ",
                            "examples": [
                                "A lot of people living in desperate poverty are taken advantage of and need someone to advocate for them.",
                                "The Education Trust advocates on behalf of disadvantaged and minority students."
                            ]
                        },
                        {
                            "explanation": "to speak for or defend someone in a court of law: ",
                            "examples": [
                                "At least in court a defendant has a lawyer to advocate for him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæd.və.kət"
                            ],
                            "us": [
                                "ˈæd.və.kət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a lawyer who speaks for or defends someone in a court of law: ",
                            "examples": [
                                "She has been the advocate for plaintiffs in many successful libel cases.",
                                "Candidates for the post need to have at least 5 years experience as a solicitor or advocate."
                            ]
                        },
                        {
                            "explanation": "someone who speaks for, supports, or represents a person or group of people who may need extra help or protection: ",
                            "examples": [
                                "Advocates and community leaders say that support services for homeless children are inadequate.",
                                "We work as patient advocates for people living in mental health facilities."
                            ]
                        },
                        {
                            "explanation": "someone who publicly supports or recommends an idea, a policy, etc.: ",
                            "examples": [
                                "He's a strong advocate of state ownership of the railways.",
                                "She is known as an advocate for tax cuts. ",
                                "I'm an advocate of drinking plenty of water."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}