{
    "word": "aesthetic",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "iːsˈθet.ɪk"
                            ],
                            "us": [
                                "esˈθet̬.ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to the enjoyment or study of beauty: ",
                            "examples": [
                                "The new building has little aesthetic value/appeal."
                            ]
                        },
                        {
                            "explanation": "An aesthetic object or a work of art is one that shows great beauty: ",
                            "examples": [
                                "furniture that is both aesthetic and functional"
                            ]
                        },
                        {
                            "explanation": "intended to improve someone's appearance: ",
                            "examples": [
                                "He specializes in aesthetic dentistry.",
                                "Aesthetic treatments include everything from skincare products to injectables."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "esˈθet.ɪk",
                                "iːsˈθet.ɪk"
                            ],
                            "us": [
                                "esˈθet̬.ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a set of principles used in a particular artistic movement (= a group of artists with the same ideas or style): ",
                            "examples": [
                                "the Surrealist/Modernist aesthetic"
                            ]
                        },
                        {
                            "explanation": "the particular style of appearance that something or someone has: ",
                            "examples": [
                                "The room has a \"country cottage\" aesthetic.",
                                "Martha's personal aesthetic is very theatrical."
                            ]
                        },
                        {
                            "explanation": "the formal study of art, especially in relation to the idea of beauty: ",
                            "examples": [
                                "She was made professor of aesthetics in 2015.",
                                "He had no interest in art, architecture, or aesthetics."
                            ]
                        },
                        {
                            "explanation": "the quality of beauty that something or someone is considered to have: ",
                            "examples": [
                                "It's better for the aesthetics of the dish if the top doesn't crack, but it makes no difference to the taste."
                            ]
                        },
                        {
                            "explanation": "treatments and processes that do not involve surgery (= cutting into the body) and that are intended to improve someone's appearance, especially by making their skin appear younger: ",
                            "examples": [
                                "The clinic specializes in facial aesthetics such as dermal fillers, microneedling, and chemical peels.",
                                "Her interest in aesthetics prompted her to attend advanced training classes in laser treatments."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}