{
    "word": "against",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "əˈɡenst",
                                "əˈɡeɪnst"
                            ],
                            "us": [
                                "əˈɡenst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "disagreeing with a plan or activity: ",
                            "examples": [
                                "She spoke against the decision to close the college.",
                                "50 people voted against the new proposal.",
                                "I'm very much against the idea that it is the woman's job to bring up the child.",
                                "Germany are playing against Brazil in the cup final tonight.",
                                "She's always rebelled against authority.",
                                "She sold the house even though it was against his wishes.",
                                "They called a demonstration to protest against proposed job cuts.",
                                "Are you for or against my proposal?",
                                "Sanctions against the country should be lifted.",
                                "Stricter controls will help in the fight against inflation.",
                                "Criminal charges will be brought against the driver.",
                                "They decided not to take legal action against him.",
                                "They were up against a powerful pressure group.",
                                "We came up against a lot of problems in the course of building our extension.",
                                "The chances/odds against you winning such a competition are enormous.",
                                "It's against the law (= illegal) to leave children under a certain age alone in the house.",
                                "It's against my beliefs/principles to be nice to someone I dislike just because they're in a senior position.",
                                "Against all probability (= although it was extremely unlikely) we found ourselves in the same hotel.",
                                "I wouldn't dare say anything against him (= criticize him) to his mother!"
                            ]
                        },
                        {
                            "explanation": "If you have something against someone, you dislike them for a reason: ",
                            "examples": [
                                "I've nothing against him - I just don't have much in common with him."
                            ]
                        },
                        {
                            "explanation": "If something counts/goes/works against you, it gives you a disadvantage: ",
                            "examples": [
                                "Lack of experience will generally count against you in an interview."
                            ]
                        },
                        {
                            "explanation": "next to and touching or being supported by (something): ",
                            "examples": [
                                "Why don't we put the bed against the wall?",
                                "He loved the feel of her soft hair against his skin.",
                                "The rain beat against her face as she struggled through the wind.",
                                "The police officer had him up against the wall, both arms behind his back.",
                                "She leaned against the door."
                            ]
                        },
                        {
                            "explanation": "in front of or compared to: ",
                            "examples": [
                                "Paintings look best against a simple white wall."
                            ]
                        },
                        {
                            "explanation": "in the opposite direction to: ",
                            "examples": [
                                "The last part of the course was hard because I was running against the wind.",
                                "Commuting is not so bad when you are travelling against the traffic."
                            ]
                        },
                        {
                            "explanation": "as a protection or defence from the bad effects of: ",
                            "examples": [
                                "We've insured the car against fire, theft, and accident.",
                                "The police have to arm themselves against attack."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}