{
    "word": "air",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "eər"
                            ],
                            "us": [
                                "er"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the mixture of gases that surrounds the earth and that we breathe: ",
                            "examples": [
                                "I went outside to get some fresh air.",
                                "You should put some air in your tyres - they look flat to me."
                            ]
                        },
                        {
                            "explanation": "the space above the ground, especially high above the ground: ",
                            "examples": [
                                "The air was filled with the scent of roses.",
                                "Throw your gun down and put your hands in the air.",
                                "The police fired into the air to clear the demonstrators from the streets."
                            ]
                        },
                        {
                            "explanation": "travel in an aircraft: ",
                            "examples": [
                                "I don't travel much by air.",
                                "an air crash/disaster",
                                "air travel"
                            ]
                        },
                        {
                            "explanation": "manner or appearance: ",
                            "examples": [
                                "She has an air of confidence about her."
                            ]
                        },
                        {
                            "explanation": "If a programme or a person is on/off (the) air, they are/are not broadcasting on radio or television: ",
                            "examples": [
                                "The radio station is on air from 6 a.m."
                            ]
                        },
                        {
                            "explanation": "a simple tune: ",
                            "examples": [
                                "Bach's Air on a G String"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "eər"
                            ],
                            "us": [
                                "er"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make opinions or complaints known to other people: ",
                            "examples": [
                                "Putting a complaint in the suggestions box is one way of airing your grievances.",
                                "He'll air his views on the war whether people want to listen or not."
                            ]
                        },
                        {
                            "explanation": "to become dry and/or fresh, or to cause to become dry and/or fresh: ",
                            "examples": [
                                "My mother always airs the sheets before she makes the beds.",
                                "Leave the windows open to let the room air a bit."
                            ]
                        },
                        {
                            "explanation": "to broadcast something or be broadcast on radio or television: ",
                            "examples": [
                                "The game will be aired live on CBS at 7.00 tonight.",
                                "The interview with the president will air tomorrow morning."
                            ]
                        },
                        {
                            "explanation": "to intentionally ignore or not answer someone: ",
                            "examples": [
                                "Why is he airing me?",
                                "You asked a question and you got aired."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}