{
    "word": "all in",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˌɔːlˈɪn"
                            ],
                            "us": [
                                "ˌɑːlˈɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a way that risks all your money in a game such as poker: ",
                            "examples": [
                                "I bet, he raised me, I raised back and then he went all in. ",
                                "He took the view that rather than pass he had better raise all-in."
                            ]
                        },
                        {
                            "explanation": "in a way that shows a lot of determination and a willingness to take a big risk in order to achieve something: ",
                            "examples": [
                                "Rather than take the safer path and keep his day job, Merkley went all in and quit his executive post.",
                                "Congress and the President have gone all-in to prop up the economy."
                            ]
                        },
                        {
                            "explanation": "in a way that includes everything in a price or total: ",
                            "examples": [
                                "I calculated that as long as a new fridge cost less than £360 all in, it would have paid for itself in the first year.",
                                "Making this delicious almond and raisin lamb curry takes just an hour, all-in."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌɔːlˈɪn"
                            ],
                            "us": [
                                "ˌɑːlˈɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "including everything in a price or total: ",
                            "examples": [
                                "The all-in cost was £695, including the first consultation. ",
                                "His estimate of $12-billion is \"all in,\" and includes costs like site preparation and financing."
                            ]
                        },
                        {
                            "explanation": "risking all your money in a game such as poker: ",
                            "examples": [
                                "There was no betting on the round because the player was all in."
                            ]
                        },
                        {
                            "explanation": "showing a lot of determination and a willingness to take a big risk in order to achieve something: ",
                            "examples": [
                                "He wants the war to end but he is committed and all in.",
                                "The actor is known for his daring, all-in style."
                            ]
                        },
                        {
                            "explanation": "very tired, so you are unable to do anything more: ",
                            "examples": [
                                "I'm going home now - I'm all in."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}