{
    "word": "all right",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌɔːl ˈraɪt"
                            ],
                            "us": [
                                "ˌɑːl ˈraɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(in a way that is) satisfactory or reasonably good: ",
                            "examples": [
                                "I wouldn't say she's rich, but she's doing all right.",
                                "Is everything all right, madam?"
                            ]
                        },
                        {
                            "explanation": "only just good enough: ",
                            "examples": [
                                "\"What did you think of the film?\" \"It was all right. Nothing special.\"",
                                "The food was all right, I suppose, but I've had better."
                            ]
                        },
                        {
                            "explanation": "not unpleasant or bad: ",
                            "examples": [
                                "This wine's all right, isn't it?",
                                "Her mum's really strict, but her dad's all right."
                            ]
                        },
                        {
                            "explanation": "very good: ",
                            "examples": [
                                "You can work at home? That's all right, isn't it?"
                            ]
                        },
                        {
                            "explanation": "used to show that you think someone is lucky or has an easy life when the same is not true for you: ",
                            "examples": [
                                "It's all right for you - your mum takes care of the children whenever you want."
                            ]
                        },
                        {
                            "explanation": "safe, well, or not harmed: ",
                            "examples": [
                                "She was very ill for a while but she's all right now.",
                                "Did you get home all right (= safely) last night?"
                            ]
                        },
                        {
                            "explanation": "able to manage: ",
                            "examples": [
                                "Are you managing all right in your new job?",
                                "Are you sure you'll be all right on your own?",
                                "Are you all right with those cases?"
                            ]
                        },
                        {
                            "explanation": "used to refuse the offer of food or drink: ",
                            "examples": [
                                "\"Can I get you a drink?\" \"No, I'm all right, thanks.\""
                            ]
                        },
                        {
                            "explanation": "used to show that something is agreed, understood, or acceptable: ",
                            "examples": [
                                "I'd rather not go to Tricia's party if that's all right with you.",
                                "She seems to think that it's perfectly all right to break the law.",
                                "All right, I'll lend you the money.",
                                "All right, that's enough noise!",
                                "Tell me if you start to feel sick, all right?",
                                "\"Are you sure you won't come with us?\" \"All right then. If you insist.\"",
                                "All right, so I made a mistake (= I accept that I was wrong).",
                                "Would it be all right if I came?",
                                "Chris wants to know if it'll be all right to come over to see us this evening."
                            ]
                        },
                        {
                            "explanation": "an answer to someone who has just thanked you for something or just said sorry for something they have done: ",
                            "examples": [
                                "\"Thank you for the flowers.\" \"It's all right (= there's no need to thank me). I thought they might cheer you up.\""
                            ]
                        },
                        {
                            "explanation": "certainly or without any doubt: ",
                            "examples": [
                                "\"Are you sure it was Gillian with him?\" \"Oh, it was her all right.\""
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "ˌɔːl ˈraɪt"
                            ],
                            "us": [
                                "ˌɑːl ˈraɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to greet someone at the same time as asking if they are well: ",
                            "examples": [
                                "\"All right, John?\" \"Not bad thanks, and you?\""
                            ]
                        },
                        {
                            "explanation": "said with the main emphasis on \"right\", expressing approval of what has been said or done: ",
                            "examples": [
                                "\"Did you hear I hit that creep who'd been pestering me?\" \"All right!\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}