{
    "word": "all",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "ɔːl"
                            ],
                            "us": [
                                "ɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "every one (of), or the complete amount or number (of), or the whole (of): ",
                            "examples": [
                                "The judge cleared the court of all but (= everyone except) herself and the witness.",
                                "I've been trying all day to contact you.",
                                "Did you really drink all of the milk?",
                                "Why do you get so angry with me all the time (= very often)?",
                                "It's very kind of you to come all the way to meet me.",
                                "So long as he's happy - that's all that matters.",
                                "All animals have to eat in order to live.",
                                "She has four children, all under the age of five.",
                                "The cast all lined up on stage to take their bow.",
                                "Have you drunk it all?",
                                "All the eggs got broken.",
                                "We left the grill on and used up all (of) the propane. ",
                                "Now the money's all mine!",
                                "All my friends agree.",
                                "She had £2,000 under the bed and the thieves took it all.",
                                "Remember all that trouble we had with the police last year?",
                                "I had to use all my powers of persuasion to get her to agree."
                            ]
                        },
                        {
                            "explanation": "the only thing: ",
                            "examples": [
                                "All I need is a roof over my head and a decent meal."
                            ]
                        },
                        {
                            "explanation": "considering all the different parts of the situation together: ",
                            "examples": [
                                "All in all, I think you've done very well."
                            ]
                        },
                        {
                            "explanation": "used when you make a comment or criticism, so that it seems less severe or is less likely to offend someone: ",
                            "examples": [
                                "All I'm saying is I think the end part could have been a little shorter."
                            ]
                        },
                        {
                            "explanation": "the only and small amount or number of something you have: ",
                            "examples": [
                                "Her parents died when she was a baby, so I was all the family she ever had."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɔːl"
                            ],
                            "us": [
                                "ɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "completely: ",
                            "examples": [
                                "The princess lived all alone in the middle of the forest.",
                                "Can you believe he built that house all by himself?",
                                "We had a difficult time but it's all over now.",
                                "The baby got food all over her dress.",
                                "The cake was all eaten last night.",
                                "The downstairs rooms were painted all in greens and blues.",
                                "Don't let her get you all upset.",
                                "She's been all over town looking for you.",
                                "I've been hearing all about your weekend!"
                            ]
                        },
                        {
                            "explanation": "used after a number to mean that both teams or players in a game have equal points: ",
                            "examples": [
                                "The score at half-time was still four all."
                            ]
                        },
                        {
                            "explanation": "almost: ",
                            "examples": [
                                "The game was all but over by the time we arrived."
                            ]
                        },
                        {
                            "explanation": "in every way: ",
                            "examples": [
                                "It was a ghastly business all round."
                            ]
                        },
                        {
                            "explanation": "even or much better, stronger, more exciting, etc.: ",
                            "examples": [
                                "She felt all the better for the drink."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "ɔːl-"
                            ],
                            "us": [
                                "ɑːl-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used in front of many nouns to form adjectives meaning \"every\", \"every type of\", or \"the whole of\" that particular thing: ",
                            "examples": [
                                "an all-night bar (= a bar that is open for the whole night)"
                            ]
                        },
                        {
                            "explanation": "used in front of many adjectives and present participles to mean \"everything\" or \"everyone\": ",
                            "examples": [
                                "an all-inclusive price",
                                "all-conquering armies"
                            ]
                        },
                        {
                            "explanation": "used in front of many nouns and adjectives to mean \"completely\": ",
                            "examples": [
                                "all-cotton socks (= socks that are made completely of cotton)",
                                "When cooking the sauce, don't forget that all-important (= most or very important) ingredient, fresh basil.",
                                "Do you believe in an all-powerful god (= one with unlimited power)?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}