{
    "word": "allowed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nallow ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈlaʊ"
                            ],
                            "us": [
                                "əˈlaʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give permission for someone to do something, or to not prevent something from happening: ",
                            "examples": [
                                "Do you think Dad will allow you to go to Jamie's party?",
                                "You're not allowed to talk during the exam.",
                                "Her proposals would allow (= make it possible for) more people to stay in full-time education.",
                                "The loophole has allowed hundreds of drink-drivers to avoid prosecution.",
                                "The government has refused to allow foreign journalists into the area for several weeks.",
                                "Prisoners have been moved to allow the demolition of part of the prison.",
                                "Pets aren't allowed in this hotel.",
                                "Smoking is not allowed in this restaurant.",
                                "He didn't allow us enough time to finish the test.",
                                "Red Cross officials were allowed access to the prison for the first time a few days ago.",
                                "The referee decided to allow (= officially accept) the goal.",
                                "At the weekend I allow myself (= I give myself the special pleasure of having) a box of chocolates.",
                                "How much time do you allow yourself (= make available to yourself) to get ready in the morning?"
                            ]
                        },
                        {
                            "explanation": "a polite expression used when offering to help in some way: ",
                            "examples": [
                                "You can't carry all those bags yourself - please, allow me."
                            ]
                        },
                        {
                            "explanation": "to admit or agree that something is true: ",
                            "examples": [
                                "She allowed that she might have been too suspicious."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}