{
    "word": "analog",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈæn.ə.lɒɡ"
                            ],
                            "us": [
                                "ˈæn.ə.lɑːɡ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "An analog recording is one that is made by changing the sound waves into electrical signals of the same type. An analog signal is a signal of this type: ",
                            "examples": [
                                "We started talking about digital versus analog recording. ",
                                "The adapter converts the phone's analog signal into a digital one that can travel over the Internet."
                            ]
                        },
                        {
                            "explanation": "Analog television is broadcast using analog signals, rather than using digital signals: ",
                            "examples": [
                                "The Federal Communications Commission started phasing out analog TV transmission in 2006.",
                                "Customers on a budget might ignore the digital TV deadline and buy an analog set. "
                            ]
                        },
                        {
                            "explanation": "An analog camera or analog photography records images on film, rather than in a form that can be looked at on a computer: ",
                            "examples": [
                                "We used to take photographs with an analog camera, then drop the film off at the store to be developed. ",
                                "I am a photographer who adores analog photography."
                            ]
                        },
                        {
                            "explanation": "An analog clock or watch shows the time using numbers around the edge and hands that point to the numbers: ",
                            "examples": [
                                "Use standard analog clocks at home to help your child learn how to tell time."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæn.ə.lɒɡ"
                            ],
                            "us": [
                                "ˈæn.ə.lɑːɡ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that is similar to or can be used instead of something else: ",
                            "examples": [
                                "I'm a vegetarian but I don't like vegetarian sausage, fake bacon and other meat analogs.",
                                "Memes are the analogs of genes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}