{
    "word": "analogue",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈæn.ə.lɒɡ"
                            ],
                            "us": [
                                "ˈæn.ə.lɑːɡ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "An analogue recording is one that is made by changing the sound waves into electrical signals of the same type. An analogue signal is a signal of this type: ",
                            "examples": [
                                "I started recording the sounds on analogue reel-to-reel tape.",
                                "This is the standard method used to convert analogue signals to digital."
                            ]
                        },
                        {
                            "explanation": "Analogue television is broadcast using analogue signals, rather than using digital signals: ",
                            "examples": [
                                "Grants can be given to people who still watch analogue broadcasts on old television sets to help them cover the cost of a digital converter."
                            ]
                        },
                        {
                            "explanation": "An analogue camera or analogue photography records images on film, rather than in a form that can be looked at on a computer: ",
                            "examples": [
                                "Many manufacturers are discontinuing their lines of analogue cameras.",
                                "If your camera is analogue, you'll need to install a video-capture device that will convert the analogue signal from your camera into digital code. ",
                                "Analogue photography appears to be back in fashion right now."
                            ]
                        },
                        {
                            "explanation": "An analogue clock or watch shows the time using numbers around the edge and hands that point to the numbers: ",
                            "examples": [
                                "You can choose to have the time display as an analogue or digital clock.",
                                "She still uses an old-fashioned analogue alarm clock."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæn.ə.lɒɡ"
                            ],
                            "us": [
                                "ˈæn.ə.lɑːɡ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that is similar to or can be used instead of something else: ",
                            "examples": [
                                "He has been studying the European analogues of the British Parliament.",
                                "An analogue to penguins, the extinct plotopterids, appeared in the North Pacific about 37 million years ago."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}