{
    "word": "angle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæŋ.ɡəl"
                            ],
                            "us": [
                                "ˈæŋ.ɡəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the space between two lines or surfaces at the point at which they touch each other, measured in degrees: ",
                            "examples": [
                                "The interior angles of a square are right angles or angles of 90 degrees.",
                                "The boat settled into the mud at a 35° angle/at an angle of 35°."
                            ]
                        },
                        {
                            "explanation": "not horizontal or vertical, but sloping in one direction: ",
                            "examples": [
                                "The picture was hanging at an angle."
                            ]
                        },
                        {
                            "explanation": "the corner of a building, table, or anything with straight sides: ",
                            "examples": [
                                "His head cracked against the angle of the door pillar.",
                                "The shot struck the angle of the goalpost and crossbar."
                            ]
                        },
                        {
                            "explanation": "a position from which something is looked at: ",
                            "examples": [
                                "You can see the nest when you look at the tree from any angle.",
                                "The tower is visible from every angle.",
                                "Are you seeing it from the right angle?",
                                "I realized I was looking at it from the wrong angle."
                            ]
                        },
                        {
                            "explanation": "a way of considering, judging, or dealing with something: ",
                            "examples": [
                                "The press was looking for a fresh angle on the situation. ",
                                "Try looking at the issue from a different angle. ",
                                "Try looking at the problem from another angle."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈæŋ.ɡəl"
                            ],
                            "us": [
                                "ˈæŋ.ɡəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to aim, turn, or position something in a direction that is not horizontal or vertical: ",
                            "examples": [
                                "The stage had been steeply angled (= was sloping very noticeably).",
                                "She angled her service return perfectly so that it dropped just inside the line."
                            ]
                        },
                        {
                            "explanation": "to direct information at a particular group of people: ",
                            "examples": [
                                "The magazine is angled at the 20 to 35-year-old women's market."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}