{
    "word": "animal",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæn.ɪ.məl"
                            ],
                            "us": [
                                "ˈæn.ɪ.məl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that lives and moves but is not a human, bird, fish, or insect: ",
                            "examples": [
                                "wild/domestic animals",
                                "Both children are real animal lovers.",
                                "Surveys show that animal welfare has recently become a major concern for many schoolchildren."
                            ]
                        },
                        {
                            "explanation": "anything that lives and moves, including people, birds, etc.: ",
                            "examples": [
                                "Humans, insects, reptiles, birds, and mammals are all animals."
                            ]
                        },
                        {
                            "explanation": "an unpleasant, cruel person or someone who behaves badly: ",
                            "examples": [
                                "He's a real animal when he's had too much to drink."
                            ]
                        },
                        {
                            "explanation": "used to describe what type of person or thing someone or something is: ",
                            "examples": [
                                "At heart she is a political animal.",
                                "She is that rare animal (= she is very unusual), a brilliant scientist who can communicate her ideas to ordinary people.",
                                "Feminism in France and England are rather different animals (= are different)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈæn.ɪ.məl"
                            ],
                            "us": [
                                "ˈæn.ɪ.məl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "made or obtained from an animal or animals: ",
                            "examples": [
                                "animal products",
                                "animal fat/skins"
                            ]
                        },
                        {
                            "explanation": "relating to, or taking the form of, an animal or animals rather than a plant or human being: ",
                            "examples": [
                                "The island was devoid of all animal life (= there were no animals on the island)."
                            ]
                        },
                        {
                            "explanation": "relating to physical desires or needs, and not spiritual or mental ones: ",
                            "examples": [
                                "As an actor, he has a sort of animal magnetism.",
                                "She knew that Dave wasn't the right man for her but she couldn't deny the animal attraction between them."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}