{
    "word": "any",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "ˈen.i"
                            ],
                            "us": [
                                "ˈen.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "some, or even the smallest amount or number of: ",
                            "examples": [
                                "Is there any of that lemon cake left?",
                                "There was hardly any food left by the time we got there.",
                                "\"Is there some butter I could use?\" \"No, there's some margarine but there isn't any butter.\"",
                                "\"Is there any more soup?\" \"No, I'm afraid there isn't any left.\"",
                                "I haven't seen any of his movies.",
                                "I don't expect we'll have any more trouble from him.",
                                "I go to church for weddings but not for any other reason.",
                                "Are you sure there isn't any way of solving this problem?"
                            ]
                        },
                        {
                            "explanation": "one of or each of a particular type of person or thing when it is not important which: ",
                            "examples": [
                                "Any food would be better than nothing at all.",
                                "\"Which of these cakes may I eat?\" \"Any.\"",
                                "The offer was that you could have any three items of clothing you liked for $30.",
                                "On Sundays I just wear any old thing (= anything) that I happen to find lying around.",
                                "Any of you should be able to answer this question.",
                                "Any idiot with a basic knowledge of French should be able to book a hotel room in Paris.",
                                "Any advice (= whatever advice) that you can give me would be greatly appreciated.",
                                "Any minute/day/time now (= very soon) there's going to be a massive quarrel between those two.",
                                "There were a lot of computers at the exhibition, any (one) of which would have suited me perfectly."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈen.i"
                            ],
                            "us": [
                                "ˈen.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at all or in the least: ",
                            "examples": [
                                "Can't you run any faster?",
                                "Those trousers don't look any different from the others.",
                                "Are you feeling any better after your illness?",
                                "Houses in this area used to be a real bargain, but they're not cheap any more (= now).",
                                "This radio isn't any good (= it's useless) - I'll have to buy another.",
                                "I used to walk to work every day, but not any longer (= not now).",
                                "I tried talking him out of it, but that didn't help any - he still left home."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}