{
    "word": "appealed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past participle, past simple of \nappeal ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈpiːl"
                            ],
                            "us": [
                                "əˈpiːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a serious or formal request, especially to the public, for money, information, or help: ",
                            "examples": [
                                "They're appealing for clothes and blankets to send to the devastated region.",
                                "The police are appealing to the public for any information about the missing girl.",
                                "I tried to appeal to (= ask for support based on) his sense of loyalty, stressing how good the company had been to him.",
                                "Church leaders have appealed to the government to halt the war."
                            ]
                        },
                        {
                            "explanation": "to request a higher court of law to consider again a decision made by a lower court, especially in order to reduce or prevent a punishment: ",
                            "examples": [
                                "The teenager has been given leave (= allowed) by the High Court to appeal against her two-year sentence.",
                                "They're appealing to the court to reduce the sentence to a fine."
                            ]
                        },
                        {
                            "explanation": "to formally request that a legal or official decision be changed: ",
                            "examples": [
                                "The parents appealed against the school's decision not to admit the child.",
                                "The players appealed to the referee for a free kick."
                            ]
                        },
                        {
                            "explanation": "to interest or attract someone: ",
                            "examples": [
                                "It's a programme designed to appeal mainly to 16 to 25-year-olds.",
                                "I think what appeals to me about his painting is his use of colour.",
                                "I haven't been skiing - it's never really appealed."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}