{
    "word": "appearing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nappear ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈpɪər"
                            ],
                            "us": [
                                "əˈpɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to start to be seen or to be present: ",
                            "examples": [
                                "He suddenly appeared in the doorway.",
                                "We'd been in the house a month when dark stains started appearing on the wall.",
                                "His name appears in the film credits for lighting."
                            ]
                        },
                        {
                            "explanation": "If you appear in court, you are there officially because you are involved in a trial: ",
                            "examples": [
                                "Both women will be appearing before magistrates later this week."
                            ]
                        },
                        {
                            "explanation": "to seem: ",
                            "examples": [
                                "You've got to appear (to be) calm in an interview even if you're terrified underneath.",
                                "To people who don't know him he probably appears (to be) rather unfriendly.",
                                "Things aren't always what they appear to be.",
                                "She appears to actually like the man, which I find incredible.",
                                "There appears to be some mistake.",
                                "It appears (that) she left the party alone.",
                                "It appears to me (that) (= I think that) we need to make some changes.",
                                "It would appear (that) (= it seems that) nobody on board the aircraft actually had a licence to fly it.",
                                "It appears as if/as though I was wrong.",
                                "Everything was not as it appeared - secret deals had been done.",
                                "I know how it must appear, but it's not really as bad as it looks.",
                                "\"Has he left?\" \"It appears not/so.\"",
                                "\"I think we're late.\" \"So it appears.\""
                            ]
                        },
                        {
                            "explanation": "to perform publicly in a play, film, or show: ",
                            "examples": [
                                "She will be appearing in the latest adaptation of \"Bleak House\".",
                                "She appears briefly in the new Bond film."
                            ]
                        },
                        {
                            "explanation": "to start to exist or become available: ",
                            "examples": [
                                "I've noticed that smaller cars are starting to appear (= be produced or sold) again.",
                                "The film, currently showing in the States, will be appearing on our screens (= we will be able to see it) later this year."
                            ]
                        },
                        {
                            "explanation": "to arrive: ",
                            "examples": [
                                "If she hasn't appeared by ten o'clock I'm going without her."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}