{
    "word": "applying",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \napply ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈplaɪ"
                            ],
                            "us": [
                                "əˈplaɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to request something, usually officially, especially in writing or by sending in a form: ",
                            "examples": [
                                "By the time I saw the job advertised it was already too late to apply.",
                                "I've applied for a new job with the local newspaper.",
                                "Please apply in writing to the address below.",
                                "We've applied to a charitable organization for a grant for the project.",
                                "Mandy applied to join the police."
                            ]
                        },
                        {
                            "explanation": "(especially of rules or laws) to have a connection or be important: ",
                            "examples": [
                                "That part of the form is for UK citizens - it doesn't apply to you.",
                                "Those were old regulations - they don't apply any more."
                            ]
                        },
                        {
                            "explanation": "to make use of something or use it for a practical purpose: ",
                            "examples": [
                                "He wants a job in which he can apply his foreign languages.",
                                "The court heard how the driver had failed to apply his brakes in time.",
                                "If you apply pressure to a cut it's meant to stop the bleeding."
                            ]
                        },
                        {
                            "explanation": "to spread or rub a substance such as cream or paint on a surface: ",
                            "examples": [
                                "Apply the cream liberally to exposed areas every three hours and after swimming.",
                                "The paint should be applied thinly and evenly."
                            ]
                        },
                        {
                            "explanation": "If you apply yourself to something, you work hard at it, directing your abilities and efforts in a determined way so that you succeed: ",
                            "examples": [
                                "You can solve any problem if you apply yourself."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}