{
    "word": "arm",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɑːm"
                            ],
                            "us": [
                                "ɑːrm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "either of the two long parts of the upper body that are attached to the shoulders and have the hands at the end: ",
                            "examples": [
                                "He held her in his arms (= held her closely).",
                                "She threw her arms around me and gave me a hug.",
                                "My arms ache from carrying this bag."
                            ]
                        },
                        {
                            "explanation": "The arm of a piece of clothing or furniture is a part of it that you put your arm in or on: ",
                            "examples": [
                                "the arm of a jacket",
                                "the arm of a chair"
                            ]
                        },
                        {
                            "explanation": "When two people are arm in arm, they both have one arm bent at the elbow and passing around and supporting, or being supported by, the arm of the other person: ",
                            "examples": [
                                "We walked arm in arm along the river bank."
                            ]
                        },
                        {
                            "explanation": "If you have someone on your arm at an event, they go to the event with you as your friend or romantic partner: ",
                            "examples": [
                                "Bill arrived at the party with his new girlfriend on his arm."
                            ]
                        },
                        {
                            "explanation": "weapons and equipment used to kill and injure people: ",
                            "examples": [
                                "They have been charged with supplying arms to the guerrillas."
                            ]
                        },
                        {
                            "explanation": "to stop fighting: ",
                            "examples": [
                                "The minister has called on the terrorists to lay down their arms."
                            ]
                        },
                        {
                            "explanation": "to prepare to fight or to start fighting: ",
                            "examples": [
                                "They are willing to take up arms if they have to."
                            ]
                        },
                        {
                            "explanation": "a long, moving part of a machine or piece of equipment: ",
                            "examples": [
                                "In both videodisc players and record players an arm moves back and forth across the disc.",
                                "a robotic/robot arm"
                            ]
                        },
                        {
                            "explanation": "An arm of land or water is a long, thin part of it that is joined to a larger area.",
                            "examples": []
                        },
                        {
                            "explanation": "An arm of an organization is a part of it that is responsible for a particular activity or place: ",
                            "examples": [
                                "The British company is one arm of a large multinational."
                            ]
                        },
                        {
                            "explanation": "If you say that a sports player has a good arm, you mean that they can throw the ball very hard or throw it a very long way: ",
                            "examples": [
                                "A lot of our fielders have great arms.",
                                "This guy has one of the best arms in baseball."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɑːm"
                            ],
                            "us": [
                                "ɑːrm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to provide yourself or others with a weapon or weapons: ",
                            "examples": [
                                "Nobody knows who is arming the terrorists.",
                                "I armed myself with a baseball bat and went to investigate the noise.",
                                "They are currently arming for war."
                            ]
                        },
                        {
                            "explanation": "to provide yourself or others with equipment or knowledge in order to complete a particular task: ",
                            "examples": [
                                "I went to the meeting armed with the relevant facts and figures.",
                                "She armed herself for the interview by finding out all she could about the company in advance."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}