{
    "word": "astroturf",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈæs.trəʊ.tɜːf"
                            ],
                            "us": [
                                "ˈæs.troʊ.tɝːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "involving the publishing of opinions or comments on the internet, in the media, etc. that appear to come from ordinary members of the public but actually come from a particular company or political group, as a way of making it seem that a product, policy, opinion, etc. is very popular or has a lot of public support: ",
                            "examples": [
                                "Allowing lobby groups to raise money without disclosing donors makes it easier for them to mount astroturf campaigns.",
                                "She argued that the change would enable astroturf groups posing as grassroots organizations to pressurize and bully schools according to their agendas. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈæs.trəʊ.tɜːf"
                            ],
                            "us": [
                                "ˈæs.troʊ.tɝːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to publish opinions or comments on the internet, in the media, etc. that appear to come from ordinary members of the public but actually come from a particular company or political group, as a way to make it seem that a product, policy, opinion, etc. is very popular or has a lot of public support: ",
                            "examples": [
                                "Lobby groups actually hired people to astroturf as farmers to fight the tax.",
                                "I’ve never known someone so excited about a product. Are you astroturfing for the company or something? "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈæs.trəʊ.tɜːf"
                            ],
                            "us": [
                                "ˈæs.troʊ.tɝːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a brand name for a type of artificial grass surface, used especially for sports fields",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}