{
    "word": "at",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "æt",
                                "ət"
                            ],
                            "us": [
                                "æt",
                                "ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show an exact position or particular place: ",
                            "examples": [
                                "We'll meet you at the entrance.",
                                "That bit at the beginning of the film was brilliant.",
                                "She's sitting at the table in the corner.",
                                "She was standing at the top of the stairs.",
                                "The dog came and lay down at (= next to) my feet.",
                                "There's someone at the door (= someone is outside and wants to come in).",
                                "We spent the afternoon at a football match.",
                                "I enjoyed my three years at university.",
                                "I called her but she was at lunch (= away, eating her lunch)."
                            ]
                        },
                        {
                            "explanation": "used to show an exact or a particular time: ",
                            "examples": [
                                "There's a meeting at 2.30 this afternoon.",
                                "Are you free at lunchtime?",
                                "In theory, women can still have children at the age of 50.",
                                "The bells ring at regular intervals through the day.",
                                "At no time/point did the company do anything illegal.",
                                "I'm busy at the moment (= now) - can you call back later?",
                                "It's a shame I wasn't here to meet you - I was overseas at the time (= then)."
                            ]
                        },
                        {
                            "explanation": "in the direction of: ",
                            "examples": [
                                "She smiled at me.",
                                "They waved at us as we drove by.",
                                "She aimed at the target.",
                                "\"Look at me! Look at me!\" called the little girl.",
                                "He's always shouting at the children."
                            ]
                        },
                        {
                            "explanation": "used to show the cause of something, especially a feeling: ",
                            "examples": [
                                "We were surprised at the news.",
                                "I was quite excited at the prospect.",
                                "Why does no one ever laugh at my jokes?"
                            ]
                        },
                        {
                            "explanation": "used to show the activity in which someone's ability is being judged: ",
                            "examples": [
                                "I was never very good at sports.",
                                "He's very good at getting on with people.",
                                "She's hopeless at organizing things."
                            ]
                        },
                        {
                            "explanation": "the @ symbol that joins the name of a person or a department in an organization to a domain name to make an email address: ",
                            "examples": [
                                "\"What's your email address?\" \"It's dictionary at cambridge dot org.\""
                            ]
                        },
                        {
                            "explanation": "used to show a price, temperature, rate, speed, etc.: ",
                            "examples": [
                                "I'm not going to buy those shoes at $150!",
                                "Inflation is running at 5 percent.",
                                "He was driving at 120 mph when the police spotted him."
                            ]
                        },
                        {
                            "explanation": "used in financial records to show the price, rate, etc. of a particular thing or of each of a number of things on a list: ",
                            "examples": [
                                "50 units @ £4.75"
                            ]
                        },
                        {
                            "explanation": "used to show a state, condition, or continuous activity: ",
                            "examples": [
                                "a country at war",
                                "children at play"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}