{
    "word": "attack",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈtæk"
                            ],
                            "us": [
                                "əˈtæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to try to hurt or defeat using violence: ",
                            "examples": [
                                "He was attacked and seriously injured by a gang of youths.",
                                "Army forces have been attacking the town since dawn.",
                                "Most wild animals won't attack unless they are provoked."
                            ]
                        },
                        {
                            "explanation": "to criticize someone strongly: ",
                            "examples": [
                                "She wrote an article attacking the judges and their conduct of the trial.",
                                "The report attacks the idea of exams for seven and eight-year-olds."
                            ]
                        },
                        {
                            "explanation": "If something, such as a disease or a chemical, attacks something, it damages it: ",
                            "examples": [
                                "AIDS attacks the body's immune system.",
                                "My rose bushes are being attacked by aphids."
                            ]
                        },
                        {
                            "explanation": "If players in a team attack, they move forward to try to score points, goals, etc.",
                            "examples": []
                        },
                        {
                            "explanation": "to deal with something quickly and in an effective way: ",
                            "examples": [
                                "We have to attack these problems now and find some solutions.",
                                "The children rushed in and eagerly attacked the food (= quickly started to eat it)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˈtæk"
                            ],
                            "us": [
                                "əˈtæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a violent act intended to hurt or damage someone or something: ",
                            "examples": [
                                "a racist attack",
                                "Enemy forces have made an attack on the city.",
                                "These bomb blasts suggest that the terrorists are (going) on the attack (= trying to defeat or hurt other people) again.",
                                "The town was once again under attack (= being attacked)."
                            ]
                        },
                        {
                            "explanation": "a strong criticism of someone or something: ",
                            "examples": [
                                "a scathing attack on the president",
                                "The government has come under attack from all sides for cutting education spending."
                            ]
                        },
                        {
                            "explanation": "a sudden and short period of illness: ",
                            "examples": [
                                "an attack of asthma/flu/malaria",
                                "an attack of the giggles"
                            ]
                        },
                        {
                            "explanation": "the part of a team in some sports that tries to score points: ",
                            "examples": [
                                "The team has a strong attack, but its defence is weak.",
                                "The team is strong inattack but useless in defence."
                            ]
                        },
                        {
                            "explanation": "determination in the way you play a sport, trying hard to score points: ",
                            "examples": [
                                "The team needs to put some more attack into its game."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}