{
    "word": "attention",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˈten.ʃən"
                            ],
                            "us": [
                                "əˈten.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "notice, thought, or interest: ",
                            "examples": [
                                "Ladies and gentlemen, could I have your attention, please?",
                                "They're organizing a campaign to draw people's attention to the environmentally harmful effects of using their cars.",
                                "Wait a moment and I'll give you my full/undivided attention (= I'll listen to and think about only you).",
                                "After an hour, my attention started to wander (= I stopped taking notice)."
                            ]
                        },
                        {
                            "explanation": "to make someone notice you: ",
                            "examples": [
                                "I knocked on the window to get her attention."
                            ]
                        },
                        {
                            "explanation": "to watch, listen to, or think about something or someone carefully or with interest: ",
                            "examples": [
                                "If you don't pay attention now, you'll get it all wrong later."
                            ]
                        },
                        {
                            "explanation": "the thing or person that a lot of people notice: ",
                            "examples": [
                                "He likes telling jokes and being the centre of attention at parties."
                            ]
                        },
                        {
                            "explanation": "interest, often sexual interest, that someone directs towards a particular person or thing: ",
                            "examples": [
                                "She attracted the attentions of a variety of suitors.",
                                "He was flattered by her attentions, but did not take them seriously.",
                                "I suffered the unwanted attentions of bullies."
                            ]
                        },
                        {
                            "explanation": "to start to think about or consider a particular thing or person: ",
                            "examples": [
                                "Many countries are starting to turn their attention to new forms of energy."
                            ]
                        },
                        {
                            "explanation": "special care or treatment: ",
                            "examples": [
                                "The paintwork will need a little attention.",
                                "If symptoms persist, seek medical attention."
                            ]
                        },
                        {
                            "explanation": "(especially in the armed forces) a way of standing, with the feet together, arms by your sides, head up, and shoulders back, and not moving: ",
                            "examples": [
                                "soldiers standing at/to attention"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "əˈten.ʃən"
                            ],
                            "us": [
                                "əˈten.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in the armed forces, an instruction to stand to attention (= not moving, with your feet together, arms by your sides, head up, and shoulders back): ",
                            "examples": [
                                "The command comes: \"Attention!\" The men fire their rifles. The flag is folded."
                            ]
                        },
                        {
                            "explanation": "an instruction for people to listen or look carefully because they need to know something important: ",
                            "examples": [
                                "Attention please! Luggage must not be left unattended!",
                                "There was a sign at the ticket desk: \"Attention! Visitors are informed that there is video surveillance in the building.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}