{
    "word": "away",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "əˈweɪ"
                            ],
                            "us": [
                                "əˈweɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "somewhere else, or to or in a different place, position, or situation: ",
                            "examples": [
                                "I've given away all my old clothes to charity.",
                                "Just go away and leave me alone!",
                                "Keep away from the fire. ",
                                "The children were told to stay away from the dog. ",
                                "Ms Watson is away on holiday until the end of the week.",
                                "The sight was so horrible that I had to look/turn away.",
                                "The recent flood has swept away the footbridge.",
                                "Would you like your burger to eat in or take away?"
                            ]
                        },
                        {
                            "explanation": "at a distance (of or from here): ",
                            "examples": [
                                "How far away is the station?",
                                "The office is a half-hour drive away.",
                                "We live five kilometres away from each other.",
                                "Life's so much quieter away from the city.",
                                "Oh, it's miles away (= a long distance from here)."
                            ]
                        },
                        {
                            "explanation": "in or into the usual or a suitable place, especially one that can be closed: ",
                            "examples": [
                                "Would you put the ice cream away in the freezer?",
                                "My grandparents had £800 hidden away in an old shoe box."
                            ]
                        },
                        {
                            "explanation": "gradually until mostly or completely gone: ",
                            "examples": [
                                "All the snow had melted away.",
                                "The music faded away as the procession moved slowly up the street.",
                                "We used to while away the weekends at my aunt's house in the country.",
                                "We danced the night away (= until the night was over)."
                            ]
                        },
                        {
                            "explanation": "in the future: ",
                            "examples": [
                                "My English exam's only a week away and I haven't even started to prepare."
                            ]
                        },
                        {
                            "explanation": "continuously or repeatedly, or in a busy way: ",
                            "examples": [
                                "I was still writing away when the exam finished.",
                                "Chris has been working away in the garden all day.",
                                "We were chatting away at the back and didn't hear what he said."
                            ]
                        },
                        {
                            "explanation": "at an opposing team's sports ground: ",
                            "examples": [
                                "The team was playing away at Old Trafford.",
                                "We have won away from home a couple of times this season."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "əˈweɪ"
                            ],
                            "us": [
                                "əˈweɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "An away match or game is played at an opposing team's sports ground: ",
                            "examples": [
                                "We lost the away game but won both home games.",
                                "Everton unveiled their new yellow-and-blue away strip.",
                                "They were wearing their new away kit for the first time at Saturday's game."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}