{
    "word": "back",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "bæk"
                            ],
                            "us": [
                                "bæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in, into, or towards a previous place or condition, or an earlier time: ",
                            "examples": [
                                "He looked back and saw they were following him.",
                                "When you take the scissors, remember to put them back.",
                                "Looking at her old photographs brought back (= made her remember) a lot of memories.",
                                "He left a note saying \"Gone out. Back soon.\"",
                                "She went to Brazil for two years, but now she's back.",
                                "I was woken by a thunderstorm, and I couldn't get back to sleep (= could not sleep again).",
                                "The last time we saw Lowell was back (= at an earlier time) in January.",
                                "This tradition dates back to the 16th century."
                            ]
                        },
                        {
                            "explanation": "in return: ",
                            "examples": [
                                "If he hits me, I'll hit him back.",
                                "You're not just going to let her say those things about you without fighting back, are you?"
                            ]
                        },
                        {
                            "explanation": "in reply: ",
                            "examples": [
                                "I'm busy at the moment - can I call you back?",
                                "I wrote to Donna several months ago, but she hasn't written back yet."
                            ]
                        },
                        {
                            "explanation": "used about watching something that has been recorded, especially after experiencing it in real life: ",
                            "examples": [
                                "I haven't watched the race back on video and I think I never will.",
                                "It is a good idea to record the conversation, then the customer can view it back at his or her convenience.",
                                "When I saw the tackle back on video, it was clear that a penalty should have been given."
                            ]
                        },
                        {
                            "explanation": "further away in distance: ",
                            "examples": [
                                "If we push the table back against the wall, we'll have more room.",
                                "\"Keep back!\" he shouted, \"Don't come any closer!\"",
                                "He sat back on the sofa.",
                                "She threw back her head and laughed uproariously.",
                                "The house is set back from the street."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bæk"
                            ],
                            "us": [
                                "bæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the inside or outside part of an object, vehicle, building, etc. that is furthest from the front: ",
                            "examples": [
                                "Ted was out the back.",
                                "If there's no reply at the front door, come round the back.",
                                "He jotted her name down on the back of an envelope.",
                                "I found my tennis racket at the back of the cupboard.",
                                "We sat at the back of the bus.",
                                "Our seats were right at the back of the auditorium.",
                                "There is a beautiful garden at the back of (= behind) the house.",
                                "He put his jacket on the back of his chair (= the part of the chair that you put your back against when you sit on it)."
                            ]
                        },
                        {
                            "explanation": "close together and facing in opposite directions: ",
                            "examples": [
                                "The office was full of computers, and we had to sit back to back in long rows."
                            ]
                        },
                        {
                            "explanation": "happening one after another, without interruption: ",
                            "examples": [
                                "Coming up after the break, three Rolling Stones classics back to back."
                            ]
                        },
                        {
                            "explanation": "with the back part of something where the front should be: ",
                            "examples": [
                                "You've put your jumper on back to front."
                            ]
                        },
                        {
                            "explanation": "the side of your hand that has hair growing on it: ",
                            "examples": [
                                "He kissed the back of her hand."
                            ]
                        },
                        {
                            "explanation": "the part of your body that is opposite to the front, from your shoulders to your bottom: ",
                            "examples": [
                                "He lay on his back, staring at the ceiling.",
                                "I turned my back while she dressed.",
                                "I have a bad back.",
                                "Sleeping on a bed that is too soft can be bad for your back."
                            ]
                        },
                        {
                            "explanation": "to cause a serious injury to your back: ",
                            "examples": [
                                "She put her back out lifting a box.",
                                "He has had to withdraw from the competition after putting his back out."
                            ]
                        },
                        {
                            "explanation": "(in some sports, such as football) one of the players in a team who try to stop players from the other team from scoring goals, rather than trying to score goals themselves: ",
                            "examples": [
                                "He plays at left back."
                            ]
                        },
                        {
                            "explanation": "in sports such as American football and rugby, one of the players in the team who stand farthest away from the ball when the action starts: ",
                            "examples": [
                                "The big back scored all three of the team's touchdowns. ",
                                "We rarely managed to get the ball out to the backs."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bæk"
                            ],
                            "us": [
                                "bæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give support to someone or something with money or words: ",
                            "examples": [
                                "The management has refused to back our proposals."
                            ]
                        },
                        {
                            "explanation": "to risk money by saying that you think a horse, team, etc. will win a race, game, or competition in order to win more money if they do: ",
                            "examples": [
                                "The horse I backed came in last."
                            ]
                        },
                        {
                            "explanation": "to (cause to) move backwards: ",
                            "examples": [
                                "Please could you back your car up a few feet so that I can get mine out of the driveway?",
                                "Ann gave up driving when she backed the car into the garage door."
                            ]
                        },
                        {
                            "explanation": "to cover the back of something with a material, often to make it stronger or thicker: ",
                            "examples": [
                                "The material is backed with a heavy lining."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "bæk"
                            ],
                            "us": [
                                "bæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at or near the back of something: ",
                            "examples": [
                                "She left the house by the back door. ",
                                "The back seat of the car folds down."
                            ]
                        },
                        {
                            "explanation": "paid after the end of a period of time when it should have been paid: ",
                            "examples": [
                                "They owe the staff several thousand in back pay.",
                                "He owes a lot in back taxes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}