{
    "word": "background",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbæk.ɡraʊnd"
                            ],
                            "us": [
                                "ˈbæk.ɡraʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the things that can be seen behind the main things or people in a picture: ",
                            "examples": [
                                "The little figure that you can just see in the background of the photograph is me.",
                                "The artist himself did not paint the backgrounds to his pictures - they were done by his pupils.",
                                "He has photographed her against lots of different backgrounds.",
                                "They were filmed against a background of dark fir trees.",
                                "The book's cover has white lettering on a blue background."
                            ]
                        },
                        {
                            "explanation": "sounds that can be heard behind other sounds that are louder: ",
                            "examples": [
                                "We couldn't hear what they were saying on the tape - there was too much background noise.",
                                "If you listen carefully to this piece of music, you can hear a flute in the background."
                            ]
                        },
                        {
                            "explanation": "the conditions that existed before a particular event happened, and that help to explain why it happened: ",
                            "examples": [
                                "These decisions have had to be made against a background of high unemployment."
                            ]
                        },
                        {
                            "explanation": "information about something that helps people understand it : ",
                            "examples": [
                                "Can you give me some background on the situation?",
                                "The official website has a wealth of background on the history of the tournament."
                            ]
                        },
                        {
                            "explanation": "If someone or something is in the background, they are not or it is not the main point of attention: ",
                            "examples": [
                                "He stayed in the background, but the others would do nothing without his approval.",
                                "Her worries about her job have faded into the background since she learned about her father's illness."
                            ]
                        },
                        {
                            "explanation": "your family and your experience of education, living conditions, money, etc.: ",
                            "examples": [
                                "She has a background in publishing, so she might be able to help you with your book. ",
                                "The school has students from many different ethnic/cultural/religious backgrounds.",
                                "They come from a privileged/wealthy background."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈbæk.ɡraʊnd"
                            ],
                            "us": [
                                "ˈbæk.ɡraʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to something that is done before, and in preparation for, something else: ",
                            "examples": [
                                "The book provides background information on the history of the region.",
                                "Students are expected to do some background reading before the course starts."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}