{
    "word": "backspin",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbæk.spɪn"
                            ],
                            "us": [
                                "ˈbæk.spɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the movement of a ball turning round very quickly in the air or on a surface so that the ball moves backwards after landing or hitting something: ",
                            "examples": [
                                "The backspin on his approach to the green took the ball back towards the hole.",
                                "The ball got so much back spin on it that when it landed, it bounced back into the net."
                            ]
                        },
                        {
                            "explanation": "a way of describing or discussing something that attempts to change its meaning, or change how people think about it, after it has happened: ",
                            "examples": [
                                "No amount of backspin by publicists can alter the fact that the club is in trouble.",
                                "The newspaper added to the backspin against military action with a critical piece. "
                            ]
                        },
                        {
                            "explanation": "the action of moving your body quickly around in circles while lying on your back, as part of a dance: ",
                            "examples": [
                                "50 competitors showed off their robot dances and backspins.",
                                "The routine included moves such as the backspin, where you lie on your back and spin round."
                            ]
                        },
                        {
                            "explanation": "the action of spinning a record, or playing recorded music, backwards in order to find a particular place in the recording or to achieve a particular sound effect: ",
                            "examples": [
                                "DJs use backspin to transition between tracks.",
                                "You can improve your mix with a well-placed backspin."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbæk.spɪn"
                            ],
                            "us": [
                                "ˈbæk.spɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to spin a record, or to play recorded music, backwards in order to find a particular place in the recording or to achieve a particular sound effect: ",
                            "examples": [
                                "The device allows users to cue up, stop, backspin and scratch songs on CD just as they would on a vinyl turntable.",
                                "On his 1981 record Grandmaster Flash displayed every DJ technique in the book, crossfading, backspinning, cutting and scratching."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}