{
    "word": "badge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bædʒ"
                            ],
                            "us": [
                                "bædʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small piece of metal or plastic with words or a picture on it, that you carry with you or fasten to your clothing or something else, in order to show who you are, that you are a member of a group, etc.: ",
                            "examples": [
                                "Everyone at the conference wore a badge with their name on .",
                                "Don't forget to display your ID badge. "
                            ]
                        },
                        {
                            "explanation": "a flat metal or plastic object, usually round, with a picture or message on it, that can be fastened to clothes with a pin, often in order to show that you like or support a particular group, idea, belief, etc.: ",
                            "examples": [
                                "They used to go round wearing badges with slogans like \"No nukes\" and \"Save the whale\".",
                                "The birthday girl was wearing a badge with a nine on it."
                            ]
                        },
                        {
                            "explanation": "a small piece of cloth with words or a picture on it, that can be sewn onto clothes to show who you are, your rank, that you are a member of a particular group or organization, etc.: ",
                            "examples": [
                                "He sewed the school badge neatly onto his uniform.",
                                "He collects old army badges."
                            ]
                        },
                        {
                            "explanation": "a small piece of metal carried by a police officer to prove who he or she is: ",
                            "examples": [
                                "The cop showed me her badge.",
                                "He was asked to surrender his gun and badge."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bædʒ"
                            ],
                            "us": [
                                "bædʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a badge or other mark on something: ",
                            "examples": [
                                "The car will be badged as an Opel for sale mainly in continental Europe and as a Vauxhall for sale in the UK."
                            ]
                        },
                        {
                            "explanation": "to give someone a badge: ",
                            "examples": [
                                "These self-printing badge kiosks ensure that attendees can be badged in moments."
                            ]
                        },
                        {
                            "explanation": "to describe something in a particular way: ",
                            "examples": [
                                "The allowance would be badged as a savings measure because of the welfare payments it would spare."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}