{
    "word": "bagger",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbæɡ.ər"
                            ],
                            "us": [
                                "ˈbæɡ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person whose job is to put your shopping into bags for you in a shop: ",
                            "examples": [
                                "The Market Basket supermarket in his home town hired him as a bagger when he was 16.",
                                "She worked part-time as a grocery bagger."
                            ]
                        },
                        {
                            "explanation": "a device or piece of equipment that puts something into bags: ",
                            "examples": [
                                "Lawn mower baggers can be attached to a push mower or riding mower, and work best when the grass is dry.",
                                "A new flour bagger accessory is now available for the mill, which you can use to grind nutritious flour from grains and beans at home."
                            ]
                        },
                        {
                            "explanation": "an investment (= something such as shares in a business, bought in the hope of making a profit) that is the stated number of times more valuable than it was when it was made: ",
                            "examples": [
                                "The shares have doubled in value since I bought them, and I'm hoping they'll be my first ten-bagger within a year or two.",
                                "The stock will present investors with the potential to become a 5 bagger based on its current valuation."
                            ]
                        },
                        {
                            "explanation": "someone who likes to climb as many mountains as they can, as a hobby: ",
                            "examples": [
                                "Everest remains the most prestigious peak in the world, which any peak bagger dreams of adding to their list.",
                                "He was a wine lover, an opera fan, and a great bagger of Munros (= mountains in Scotland higher than 3000 feet)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}