{
    "word": "bail",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "beɪl"
                            ],
                            "us": [
                                "beɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an amount of money that a person who has been accused of a crime pays to a law court so that they can be released until their trial. The payment is a way of making certain that the person will return to court for trial: ",
                            "examples": [
                                "He was out on bail awaiting trial.",
                                "He was released on bail of $100,000.",
                                "He is free on bail and due back in court in October. ",
                                "She has been released on police bail pending further inquiries.",
                                "Because of a previous conviction, the judge refused to grant bail (= allow the accused person to be released)."
                            ]
                        },
                        {
                            "explanation": "the two small pieces of wood on top of the stumps in a game of cricket, that can be knocked off with the ball to make the player who is batting (= hitting the ball) out: ",
                            "examples": [
                                "The bowler dislodged the bails with his second ball."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "beɪl"
                            ],
                            "us": [
                                "beɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to remove water from a boat using a container: ",
                            "examples": [
                                "The boat's sinking! Start bailing quickly!"
                            ]
                        },
                        {
                            "explanation": "If someone accused of a crime is bailed, they are released until their trial after paying bail to the court: ",
                            "examples": [
                                "She was yesterday bailed for three weeks on drink-driving offences.",
                                "He was bailed to appear at the Magistrates' Court next month."
                            ]
                        },
                        {
                            "explanation": "to stop doing something or leave a place before something is finished: ",
                            "examples": [
                                "It was so boring I bailed early."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}