{
    "word": "balance",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbæl.əns"
                            ],
                            "us": [
                                "ˈbæl.əns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the ability to remain standing, especially because your weight is equally distributed (= spread): ",
                            "examples": [
                                "The toddler wobbled and lost his balance (= started to fall sideways).",
                                "She had to hold onto the railings to keep her balance (= to stop herself from falling).",
                                "These canals inside the ear are responsible for helping the body maintain balance."
                            ]
                        },
                        {
                            "explanation": "a situation where different things are given equal importance, or are considered or divided equally or fairly: ",
                            "examples": [
                                "We must strike a balance between reckless spending and penny-pinching (= try to have something between these two things).",
                                "New tax measures are designed to redress the balance (= make the situation more equal) between rich and poor.",
                                "She says finding the right balance between her own ideas and those of her tutors was initially confusing.",
                                "The gender balance is improving as we are now training more female paramedics.",
                                "Life is all about balance, and the happiest people seem to be those who manage to maintain that balance."
                            ]
                        },
                        {
                            "explanation": "after thinking about all the different facts or opinions: ",
                            "examples": [
                                "I would say that, on balance, it hasn't been a bad year.",
                                "On balance, I believe he was a good president.",
                                "I think that on balance, this is a safe city to live in.",
                                "On balance, we support wind power as a source of clean energy.",
                                "They have created a show that is, on balance, pretty entertaining."
                            ]
                        },
                        {
                            "explanation": "The balance on a piece of electronic equipment for playing music is the particular mixture of different sounds, or the device that controls this.",
                            "examples": []
                        },
                        {
                            "explanation": "a device used for weighing things, consisting of two dishes hanging on a bar that shows when the contents of both dishes weigh the same",
                            "examples": []
                        },
                        {
                            "explanation": "the amount of money you have in a bank account, or the amount of something that you have left after you have spent or used up the rest: ",
                            "examples": [
                                "Once we know how much money we'll need, let's spend the balance.",
                                "The company's success is reflected in its healthy bank balance.",
                                "The bank doesn't pay interest on current account balances."
                            ]
                        },
                        {
                            "explanation": "the money that is returned to someone who has paid for something that costs less than the amount that they gave",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbæl.əns"
                            ],
                            "us": [
                                "ˈbæl.əns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be in a position where you will stand without falling to either side, or to put something in this position: ",
                            "examples": [
                                "The flamingos balanced gracefully on one leg.",
                                "She balanced a huge pot effortlessly on her head and walked down to the river."
                            ]
                        },
                        {
                            "explanation": "to give several things equal amounts of importance, time, or money so that a situation is successful: ",
                            "examples": [
                                "I struggle to balance work and family commitments."
                            ]
                        },
                        {
                            "explanation": "to arrange a system that relates to money so that the amount of money spent is not more than the amount received: ",
                            "examples": [
                                "Check your bank statements, balance your accounts and add up your expenses. ",
                                "Stringent measures were introduced so that the government could balance the budget."
                            ]
                        },
                        {
                            "explanation": "to make certain that the amount of money spent is not more than the amount of money received: ",
                            "examples": [
                                "If the business loses any more money, we won't be able to balance the books this year."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}