{
    "word": "balloon",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bəˈluːn"
                            ],
                            "us": [
                                "bəˈluːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small, thin rubber bag that you blow air into or fill with a light gas until it is round in shape, used for decoration, as a children's toy, or for other purposes such as medical treatment or scientific research : ",
                            "examples": [
                                "We tied balloons and streamers to the ceiling ready for the party.",
                                "Angioplasty is a medical procedure in which a balloon is used to stretch open a narrow or blocked artery. "
                            ]
                        },
                        {
                            "explanation": "a very large balloon that is filled with hot air or gas and can carry people in a basket (= open container ) hanging under it: ",
                            "examples": [
                                "People first flew in a balloon in 1783."
                            ]
                        },
                        {
                            "explanation": "a round shape drawn next to the head of a character in a cartoon (= a story or joke told using drawings), in which the character's words or thoughts are written : ",
                            "examples": [
                                "The words appear inside a cartoon-style balloon hovering above the figures.",
                                "He produced many of the best-known images of American Pop Art, especially frames from comic books complete with speech balloons.",
                                "You can edit the photos, for example by adding thought balloons. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bəˈluːn"
                            ],
                            "us": [
                                "bəˈluːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to quickly increase in size, weight, or importance: ",
                            "examples": [
                                "Medical costs are likely to balloon for families as life spans increase.",
                                "The rumours soon ballooned into a full-blown scandal."
                            ]
                        },
                        {
                            "explanation": "to get bigger and rounder, usually by filling with air: ",
                            "examples": [
                                "The silk of the parachute ballooned above me."
                            ]
                        },
                        {
                            "explanation": "to travel using a hot-air balloon: ",
                            "examples": [
                                "He planned to become the first person to balloon over the North Pole. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}