{
    "word": "band",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bænd"
                            ],
                            "us": [
                                "bænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of musicians who play modern music together: ",
                            "examples": [
                                "a jazz/rock band",
                                "The Beatles were probably the most famous band in the world."
                            ]
                        },
                        {
                            "explanation": "a group of young men or women who perform popular songs together and dance as a group: ",
                            "examples": [
                                "He made his name in the 90s boy band Boyzone, before going on to a highly successful solo career."
                            ]
                        },
                        {
                            "explanation": "a thin, flat piece of cloth, elastic, metal, or other material put around something, or a long, narrow piece of colour, light, etc. that is different from what surrounds it: ",
                            "examples": [
                                "a wrist band",
                                "a red silk band",
                                "A narrow band of grass separated the greenhouse from the vegetable garden."
                            ]
                        },
                        {
                            "explanation": "a particular range of values, numbers, etc.: ",
                            "examples": [
                                "The scheme is devised for young people in the 15–20 age band."
                            ]
                        },
                        {
                            "explanation": "a group of people who share the same interests or beliefs, or who have joined together for a special purpose: ",
                            "examples": [
                                "The former president still has a small band of supporters."
                            ]
                        },
                        {
                            "explanation": "a group of indigenous North American people, usually a group who are related to each other, and who form part of a larger tribe: ",
                            "examples": [
                                "An advocacy group for indigenous bands says many Native languages face imminent extinction.",
                                "In the late 1880s, five Indian bands lived along the San Luis Rey River."
                            ]
                        },
                        {
                            "explanation": "a group that is a unit of government for Canadian First Nations people: ",
                            "examples": [
                                "He is a tribal councilman for the Cold Lake First Nations band.",
                                "Each First Nation is typically represented by a band council."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bænd"
                            ],
                            "us": [
                                "bænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a band on something, especially an animal: ",
                            "examples": [
                                "We banded the birds (= put bands around their legs) so that we could identify them later."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}