{
    "word": "bank",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bæŋk"
                            ],
                            "us": [
                                "bæŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an organization where people and businesses can invest or borrow money, change it to foreign money, etc., or a building where these services are offered: ",
                            "examples": [
                                "The big banks have been accused of exploiting small firms.",
                                "I need to go to the bank at lunchtime.",
                                "I had to take out a bank loan to start my own business."
                            ]
                        },
                        {
                            "explanation": "In gambling, the bank is money that belongs to the owner and can be won by the players.",
                            "examples": []
                        },
                        {
                            "explanation": "sloping raised land, especially along the sides of a river: ",
                            "examples": [
                                "By the time we reached the opposite bank, the boat was sinking fast.",
                                "These flowers generally grow on river banks and near streams."
                            ]
                        },
                        {
                            "explanation": "a pile or mass of earth, clouds, etc.: ",
                            "examples": [
                                "A dark bank of cloud loomed on the horizon."
                            ]
                        },
                        {
                            "explanation": "a row of similar things, especially machines or parts of machines: ",
                            "examples": [
                                "a bank of switches"
                            ]
                        },
                        {
                            "explanation": "A bank of something, such as blood or human organs for medical use, is a place that stores these things for later use: ",
                            "examples": [
                                "a blood bank",
                                "a sperm bank"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bæŋk"
                            ],
                            "us": [
                                "bæŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to keep your money in a particular bank, or to put money into a bank: ",
                            "examples": [
                                "I used to bank with Lloyd's."
                            ]
                        },
                        {
                            "explanation": "to win or earn a particular amount of money: ",
                            "examples": [
                                "She banked £500 in tips that day!"
                            ]
                        },
                        {
                            "explanation": "(of an aircraft) to fly with one wing higher than the other when turning: ",
                            "examples": [
                                "We felt the plane bank steeply as it changed direction."
                            ]
                        },
                        {
                            "explanation": "to collect in or form into a mass, or to make something do this: ",
                            "examples": [
                                "The snow had banked up in the corner of the garden.",
                                "We banked up the fire (= put more coal on it) to keep it burning all night."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}