{
    "word": "base",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "beɪs"
                            ],
                            "us": [
                                "beɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the bottom part of an object, on which it rests, or the lowest part of something: ",
                            "examples": [
                                "a crystal glass with a heavy base",
                                "At the base of the cliff was a rocky beach.",
                                "This cream provides an excellent base for your make-up (= a good bottom layer on which other layers can be put)."
                            ]
                        },
                        {
                            "explanation": "the main place where a person lives and works, or a place that a company does business from: ",
                            "examples": [
                                "I spend a lot of time in Brussels, but London is still my base.",
                                "Nice is an excellent base for (= place to stay when) exploring the French Riviera."
                            ]
                        },
                        {
                            "explanation": "a place where there are military buildings and weapons and where members of the armed forces live: ",
                            "examples": [
                                "an old naval base"
                            ]
                        },
                        {
                            "explanation": "one of the four positions on a square that a player must reach to score a point in the game of baseball",
                            "examples": []
                        },
                        {
                            "explanation": "the activity or people from which someone or something gets most of their or its support, money, etc.: ",
                            "examples": [
                                "A strong economy depends on a healthy manufacturing base.",
                                "We're aiming to expand our customer base."
                            ]
                        },
                        {
                            "explanation": "the main part of something: ",
                            "examples": [
                                "a cocktail with a whisky base"
                            ]
                        },
                        {
                            "explanation": "the number on which a counting system is built: ",
                            "examples": [
                                "A binary number is a number written in base 2, using the two numbers 0 and 1."
                            ]
                        },
                        {
                            "explanation": "a chemical that dissolves in water and combines with an acid to create a salt",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "beɪs"
                            ],
                            "us": [
                                "beɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not showing any honour and having no morals: ",
                            "examples": [
                                "I accused him of having base motives."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "beɪs"
                            ],
                            "us": [
                                "beɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have a particular town or area, etc. as the main place that you live and work in, or where you do business from: ",
                            "examples": [
                                "Where is your firm based?",
                                "He was based in (= he lived in or was at a military establishment in) Birmingham during the war."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}