{
    "word": "battery",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbæt.ər.i"
                            ],
                            "us": [
                                "ˈbæt̬.ɚ.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device that produces electricity to provide power for electronic devices, cars, etc.: ",
                            "examples": [
                                "a rechargeable battery",
                                "This alarm clock takes two medium-sized batteries.",
                                "My phone's battery is about to die (= to run out of power).",
                                "I got back to the car to find that the battery was flat (= had lost all its power).",
                                "a battery-operated hairdryer"
                            ]
                        },
                        {
                            "explanation": "a number of things of a similar type: ",
                            "examples": [
                                "In the kitchen an impressive battery of stainless steel utensils hangs on the wall."
                            ]
                        },
                        {
                            "explanation": "a number of large guns and similar weapons operating together in the same place: ",
                            "examples": [
                                "The shore battery opened fire."
                            ]
                        },
                        {
                            "explanation": "the crime of using physical force or violence on another person without their permission, even when this does not cause physical harm: ",
                            "examples": [
                                "The singer's former personal assistant sued her for battery.",
                                "He is accused of battery and indecent assault.",
                                "He served 10 years for battery on a police officer. "
                            ]
                        },
                        {
                            "explanation": "In a baseball team, the pitcher (= the player who throws the ball) and the catcher (= the player who catches balls that are not hit) are sometimes referred to as the battery: ",
                            "examples": [
                                "Paige and Gibson combined to form the greatest battery in baseball history.",
                                "A catcher needs to develop a good rapport with his battery mate."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈbæt.ər.i"
                            ],
                            "us": [
                                "ˈbæt̬.ɚ.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "using a system of producing a large number of eggs cheaply by keeping a lot of chickens in rows of small cages (= boxes made of wire): ",
                            "examples": [
                                "battery farming ",
                                "battery hens/eggs "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}