{
    "word": "batter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbæt.ər"
                            ],
                            "us": [
                                "ˈbæt̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to hit something with force many times: ",
                            "examples": [
                                "The waves battered against the rocks at the bottom of the cliff.",
                                "The burglars had battered down the door of the house (= hit it so hard that it broke and fell down).",
                                "He was battered to death with a rifle butt.",
                                "He was battering on the door with his fists and howling."
                            ]
                        },
                        {
                            "explanation": "to hit and behave violently towards a person repeatedly over a long period of time: ",
                            "examples": [
                                "Campaigners are concerned that the new laws on domestic violence do not show enough understanding of the lives of people who are battered. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbæt.ər"
                            ],
                            "us": [
                                "ˈbæt̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a mixture of flour, eggs, and milk or another liquid, used to make pancakes or to cover food before frying it: ",
                            "examples": [
                                "Add the sour cream to the batter, beating well.",
                                "Pour the pancake batter into the pan.",
                                "I find that fish fried in batter is lighter and crispier.",
                                "Crepes and pancakes are made with different batters.",
                                "Chefs over the world include tempura dishes on their menus, using a wide variety of different batters and ingredients."
                            ]
                        },
                        {
                            "explanation": "a mixture containing ingredients such as flour, butter, sugar, and eggs that will be baked and become a cake or cakes: ",
                            "examples": [
                                "I used to love eating the last bits of cake batter from the bowl.",
                                "Divide the batter among 12 muffin cups.",
                                "In most classic cake batters you typically add eggs to the batter."
                            ]
                        },
                        {
                            "explanation": "the person in baseball, cricket, or rounders who hits the ball: ",
                            "examples": [
                                "The batter swings and misses.",
                                "The International Cricket Council (ICC) announced that the word \"batsman\" would be replaced by the ungendered word \"batter\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}