{
    "word": "bear",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "beər"
                            ],
                            "us": [
                                "ber"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to accept, tolerate, or endure something, especially something unpleasant: ",
                            "examples": [
                                "The strain must have been enormous but she bore it well.",
                                "Tell me now! I can't bear the suspense!",
                                "He couldn't bear to see the dog in pain.",
                                "I can't bear being bored."
                            ]
                        },
                        {
                            "explanation": "to be responsible for something: ",
                            "examples": [
                                "It's your decision - you have to bear the responsibility if things go wrong.",
                                "They say that landlords should bear the burden of these repairs and not tenants.",
                                "I suggest you claim on your insurance rather than bearing the cost yourselves."
                            ]
                        },
                        {
                            "explanation": "to be too unpleasant or frightening to think about: ",
                            "examples": [
                                "\"What if she'd been driving faster?\" \"It doesn't bear thinking about.\""
                            ]
                        },
                        {
                            "explanation": "to have or continue to have something: ",
                            "examples": [
                                "Thank you for your advice - I'll bear it in mind (= I will remember and consider it).",
                                "Their baby bears a strong resemblance to strong to its grandfather.",
                                "The stone plaque bearing his name was smashed to pieces.",
                                "On display were boxing gloves that bore Rocky Marciano's signature.",
                                "I don't bear them any ill feeling (= I do not continue to be angry with or dislike them)."
                            ]
                        },
                        {
                            "explanation": "to hold or support something: ",
                            "examples": [
                                "The chair, too fragile to bear her weight, collapsed.",
                                "I don't think that the table will bear the weight of the heavy machinery."
                            ]
                        },
                        {
                            "explanation": "to give birth to young, or (of a tree or plant) to give or produce fruit or flowers: ",
                            "examples": [
                                "The pear tree they planted has never borne fruit. ",
                                "She had borne six children by the time she was 30.",
                                "When his wife bore him a child he could not hide his delight.",
                                "Most animals bear their young in the spring."
                            ]
                        },
                        {
                            "explanation": "to carry and move something to a place: ",
                            "examples": [
                                "At Christmas the family all arrive at the house bearing gifts.",
                                "Countless waiters bore trays of drinks into the room.",
                                "The sound of the ice cream van was borne into the office on the wind."
                            ]
                        },
                        {
                            "explanation": "to change direction slightly so that you are going in a particular direction: ",
                            "examples": [
                                "After you go past the church keep bearing left.",
                                "Bear right at the fork in the road. ",
                                "The path followed the coastline for several miles, then bore inland."
                            ]
                        },
                        {
                            "explanation": "to say you know from your own experience that something happened or is true: ",
                            "examples": [
                                "She bore witness to his patience and diligence."
                            ]
                        },
                        {
                            "explanation": "If something bears testimony to a fact, it proves that it is true: ",
                            "examples": [
                                "The iron bridge bears testimony to the skills developed in that era."
                            ]
                        },
                        {
                            "explanation": "to lie: ",
                            "examples": [
                                "He accused his neighbour of bearing false witness against him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "beər"
                            ],
                            "us": [
                                "ber"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large, strong wild mammal with a thick fur coat that lives especially in colder parts of Europe, Asia, and North America: ",
                            "examples": [
                                "a bear cub (= young bear)",
                                "a brown/black bear"
                            ]
                        },
                        {
                            "explanation": "an older gay man who is large and has a lot of hair on his body ",
                            "examples": []
                        },
                        {
                            "explanation": "a person who sells shares when prices are expected to fall, in order to make a profit by buying them back again at a lower price",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}