{
    "word": "beat",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "biːt"
                            ],
                            "us": [
                                "biːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to defeat or do better than: ",
                            "examples": [
                                "Simon always beats me at tennis.",
                                "The Miami Heat beat the Pacers by five points, 95-90. ",
                                "Holland beat Belgium (by) 3–1.",
                                "Our team was comfortably/easily/soundly beaten in the first round of the competition.",
                                "The Nationalists were narrowly beaten in the election.",
                                "He beat me fair and square (= without cheating).",
                                "They were beaten hands down (= completely) by their opponents.",
                                "She has beaten her own record of three minutes ten seconds."
                            ]
                        },
                        {
                            "explanation": "to be better or more enjoyable than another activity or experience: ",
                            "examples": [
                                "Taking the bus beats the hell out of (= is much better than) walking all the way there.",
                                "You can't beat (= there is nothing more enjoyable than) a cold beer on a hot afternoon.",
                                "Taking the bus sure beats walking."
                            ]
                        },
                        {
                            "explanation": "To beat something that is going to happen is to take action before the thing happens: ",
                            "examples": [
                                "I always do my shopping early to beat the rush.",
                                "Let's try to beat the traffic by leaving early in the morning."
                            ]
                        },
                        {
                            "explanation": "to do something before someone else does it: ",
                            "examples": [
                                "I was just going to clean the kitchen, but you beat me to it."
                            ]
                        },
                        {
                            "explanation": "to hit repeatedly: ",
                            "examples": [
                                "The rain was beating down incessantly on the tin roof.",
                                "She was beaten to death.",
                                "They saw him beating his dog with a stick.",
                                "The child had been brutally/savagely beaten.",
                                "He was beaten senseless.",
                                "Beat the drum."
                            ]
                        },
                        {
                            "explanation": "to form a path in an area where long grass or bushes grow closely together, by hitting the plants with your hands or an object, or by stepping on them: ",
                            "examples": [
                                "We beat a path through the undergrowth."
                            ]
                        },
                        {
                            "explanation": "to mix something repeatedly using a utensil such as a spoon or whisk: ",
                            "examples": [
                                "To make an omelette you first beat the eggs."
                            ]
                        },
                        {
                            "explanation": "to (cause to) make a regular movement or sound: ",
                            "examples": [
                                "The doctor could feel no pulse beating.",
                                "Her heart started to beat faster.",
                                "The hummingbird beats its wings at great speed."
                            ]
                        },
                        {
                            "explanation": "to make a regular sound or movement to music: ",
                            "examples": [
                                "He beat time on the table to mark the rhythm of the poem."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "biːt"
                            ],
                            "us": [
                                "biːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "extremely tired: ",
                            "examples": [
                                "You've been working too hard—you look dead beat.",
                                "I'm beat - I'm going to bed."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "biːt"
                            ],
                            "us": [
                                "biːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a regular movement or sound, especially that made by your heart: ",
                            "examples": [
                                "My heart skipped a beat (= I felt very excited) when she said, \"Yes, I'll marry you.\"",
                                "I put my head on his chest but I could feel no heartbeat."
                            ]
                        },
                        {
                            "explanation": "in music, a regular emphasis, or a place in the music where such an emphasis is expected: ",
                            "examples": [
                                "Make sure you play on the beat.",
                                "He tapped his foot to the beat (= rhythm) of the music.",
                                "The guitar comes in on the third beat."
                            ]
                        },
                        {
                            "explanation": "an area for which someone, such as a police officer, has responsibility as part of their job: ",
                            "examples": [
                                "Bob has worked as an officer on this particular beat for 20 years."
                            ]
                        },
                        {
                            "explanation": "A police officer who is on the beat or walking the beat is on duty, walking around rather than driving in a police car: ",
                            "examples": [
                                "Most people would like to see more bobbies on the beat in their area."
                            ]
                        },
                        {
                            "explanation": "an important moment, event, or subject in a story, film, etc.: ",
                            "examples": [
                                "The moment is gruesome, but it’s also an important beat in the story.",
                                "The director effortlessly handles the plot twists and emotional beats."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}