{
    "word": "before",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "bɪˈfɔːr"
                            ],
                            "us": [
                                "bɪˈfɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at or during a time earlier than (the thing mentioned): ",
                            "examples": [
                                "You should always wash your hands before meals.",
                                "Before leaving he said goodbye to each of them.",
                                "She's always up before dawn.",
                                "Before he could reach the door, she quickly closed it.",
                                "Before we make a decision, does anyone want to say anything else?",
                                "She had to give the doorman a tip before he would help her with her suitcases (= he would not do it until she had given him a tip)."
                            ]
                        },
                        {
                            "explanation": "until (the event mentioned): ",
                            "examples": [
                                "It was an hour before the police arrived."
                            ]
                        },
                        {
                            "explanation": "in the past: ",
                            "examples": [
                                "He said he had never seen her before.",
                                "I feel as though I've been here before."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "bɪˈfɔːr"
                            ],
                            "us": [
                                "bɪˈfɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in front of: ",
                            "examples": [
                                "The letter K comes before L in the English alphabet.",
                                "Many mothers put their children's needs before their own.",
                                "We have the whole weekend before us - what do you want to do?",
                                "He stood up before a whole roomful of people, and asked her to marry him."
                            ]
                        },
                        {
                            "explanation": "If a place is before another place, you will arrive at it first when you are travelling towards the second place: ",
                            "examples": [
                                "The bus stop is just before the school."
                            ]
                        },
                        {
                            "explanation": "If something is before someone or before a group of people, it will be formally considered or examined by that person or group: ",
                            "examples": [
                                "The proposal before the committee is that we try and reduce our spending by ten percent.",
                                "The men appeared before the judge yesterday."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}