{
    "word": "best",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "best"
                            ],
                            "us": [
                                "best"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "of the highest quality, or being the most suitable, pleasing, or effective type of thing or person: ",
                            "examples": [
                                "This is the best meal I've ever had.",
                                "He's one of our best students.",
                                "Are you sure this is the best way of doing it?",
                                "What's the best (= shortest or quickest) way to get to their house?",
                                "Your parents only want what is best for you.",
                                "She was my best friend (= the friend I liked most).",
                                "It's best (= it is wise) to get to the supermarket early."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "best"
                            ],
                            "us": [
                                "best"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in the most suitable, pleasing, or satisfactory way, or to the greatest degree: ",
                            "examples": [
                                "Which evening would suit you best for the party?",
                                "The Grand Canyon is best seen at sunset.",
                                "He couldn't decide which one he liked best (= preferred)."
                            ]
                        },
                        {
                            "explanation": "to the greatest degree when used as the superlative of adjectives beginning with \"good\" or \"well\": ",
                            "examples": [
                                "They were the best-dressed couple at the party.",
                                "He was voted the best-looking (= most attractive) actor in Hollywood."
                            ]
                        },
                        {
                            "explanation": "as well as you can: ",
                            "examples": [
                                "It is a difficult passage, but just translate it as best you can."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "best"
                            ],
                            "us": [
                                "best"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the most excellent in a group of things or people: ",
                            "examples": [
                                "My tastes are simple - I only like the best.",
                                "He wanted the best for his children - good schools, a nice house, and trips abroad.",
                                "I like all of Hitchcock's films, but I think \"Notorious\" is the best.",
                                "Chris and I are the best of friends (= we are very close friends)."
                            ]
                        },
                        {
                            "explanation": "used at the end of a friendly message or letter before writing your name: ",
                            "examples": [
                                "I'll call you early next week to set up a lunch date. Can't wait to meet you. Best, Beth Morris"
                            ]
                        },
                        {
                            "explanation": "used to say goodbye, or to end a letter to someone you know well, or to send good wishes to someone: ",
                            "examples": [
                                "All the best to your parents!"
                            ]
                        },
                        {
                            "explanation": "even when considered in the most positive way: ",
                            "examples": [
                                "The food was bland at best, and at worst completely inedible."
                            ]
                        },
                        {
                            "explanation": "at the highest standard that can be achieved: ",
                            "examples": [
                                "The documentary was an example of investigative journalism at its best."
                            ]
                        },
                        {
                            "explanation": "to be as active or intelligent as you can be: ",
                            "examples": [
                                "I'm not at my best in the morning."
                            ]
                        },
                        {
                            "explanation": "this is the most pleasing thing: ",
                            "examples": [
                                "There was wonderful food, good company, and, best of all, a jazz band."
                            ]
                        },
                        {
                            "explanation": "used to wish someone success before a test, etc. or a difficult activity: ",
                            "examples": [
                                "Best of luck on your finals!"
                            ]
                        },
                        {
                            "explanation": "In a sport such as tennis, if you play the best of a particular number of games, you play that number of games and the winner is the player who wins the greatest number of those games: ",
                            "examples": [
                                "Shall we play the best of five?"
                            ]
                        },
                        {
                            "explanation": "to make the greatest effort possible: ",
                            "examples": [
                                "It doesn't matter if you fail, just do your best."
                            ]
                        },
                        {
                            "explanation": "If you have had the best of something, you have enjoyed the most pleasant part of it, and everything that is left is worse: ",
                            "examples": [
                                "I think we've already had the best of the hot weather this summer."
                            ]
                        },
                        {
                            "explanation": "as well as you can: ",
                            "examples": [
                                "Just do the job to the best of your ability."
                            ]
                        },
                        {
                            "explanation": "from what I know and understand from the information that I have: ",
                            "examples": [
                                "To the best of my knowledge, the chemicals which were found are not dangerous."
                            ]
                        },
                        {
                            "explanation": "If an action is for the best, it is done to improve a situation or produce a good result, although it might seem unpleasant at the time: ",
                            "examples": [
                                "Ending a relationship is always hard but in this case it's for the best."
                            ]
                        },
                        {
                            "explanation": "to make an unsatisfactory situation as pleasant as possible: ",
                            "examples": [
                                "We'll have to spend the night here, so we might as well make the best of it."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "best"
                            ],
                            "us": [
                                "best"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to defeat someone in a fight or competition: ",
                            "examples": [
                                "He bested his opponent in just two rounds."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}