{
    "word": "better",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈbet.ər"
                            ],
                            "us": [
                                "ˈbet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "comparative of \ngood : of a higher standard, or more suitable, pleasing, or effective than other things or people: ",
                            "examples": [
                                "He stood near the front to get a better view.",
                                "Relations between the two countries have never been better.",
                                "It's much better to have a small, cosy room than a big, cold one.",
                                "The book was better than I expected.",
                                "She is much better at tennis than I am.",
                                "It is far (= much) better to save some of your money than to spend it all at once.",
                                "Fresh vegetables are better for you (= more beneficial to you) than canned ones.",
                                "The longer you keep this wine, the better it tastes (= it has a better flavour if you keep it for a long time).",
                                "The bed was hard, but it was better than nothing (= than not having a bed)."
                            ]
                        },
                        {
                            "explanation": "If you are or get better after an illness or injury, you are healthy again: ",
                            "examples": [
                                "I hope you get better soon."
                            ]
                        },
                        {
                            "explanation": "to improve: ",
                            "examples": [
                                "After the ceasefire, the situation in the capital got better."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈbet.ər"
                            ],
                            "us": [
                                "ˈbet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a more suitable, pleasing, or satisfactory way, or to a greater degree: ",
                            "examples": [
                                "The next time he took the test, he was better prepared.",
                                "They did much better (= were more successful) in the second half of the game.",
                                "I like this jacket much better than (= I prefer it to) the other one.",
                                "She knows her way around the college better than I do."
                            ]
                        },
                        {
                            "explanation": "to a greater degree, when used as the comparative of adjectives beginning with \"good\" or \"well\": ",
                            "examples": [
                                "She is better-looking (= more attractive) than her brother.",
                                "He is much better known for his poetry than his songwriting."
                            ]
                        },
                        {
                            "explanation": "used to say that a particular choice would be more satisfactory: ",
                            "examples": [
                                "Why don't you give her a call or, better still, go and see her?"
                            ]
                        },
                        {
                            "explanation": "used to give advice or to make a threat: ",
                            "examples": [
                                "You'd better (= you should) go home now before the rain starts.",
                                "He'd better pay me back that money he owes me soon, or else.",
                                "It's late - we'd better get going.",
                                "You'd better warn her not to be late.",
                                "You'd better not be lying to me! "
                            ]
                        },
                        {
                            "explanation": "it would be wiser: ",
                            "examples": [
                                "You would do better to bring the plants inside when the weather gets colder."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbet.ər"
                            ],
                            "us": [
                                "ˈbet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that is of a higher standard than something else: ",
                            "examples": [
                                "He ran the 100 metres in 9.91 seconds, and I have not seen better (= a faster result) this year."
                            ]
                        },
                        {
                            "explanation": "behaviour, work, or treatment that is more suitable, pleasing, or satisfactory: ",
                            "examples": [
                                "You shouldn't be so mean to your mother - she deserves better.",
                                "I didn't think he would go out without telling me - I expected better of him."
                            ]
                        },
                        {
                            "explanation": "people of a higher rank or social position than you: ",
                            "examples": [
                                "As children, we were taught not to argue with our elders and betters."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbet.ər"
                            ],
                            "us": [
                                "ˈbet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to improve a situation: ",
                            "examples": [
                                "The organization was established to better conditions for the disabled."
                            ]
                        },
                        {
                            "explanation": "to improve your social position, often by getting a better job or education: ",
                            "examples": [
                                "He tried to better himself by taking evening classes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}