{
    "word": "between",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "bɪˈtwiːn"
                            ],
                            "us": [
                                "bɪˈtwiːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or into the space that separates two places, people, or objects: ",
                            "examples": [
                                "The town lies halfway between Rome and Florence.",
                                "Standing between the two adults was a small child.",
                                "She squeezed between the parked cars and ran out into the road.",
                                "There were two houses with a narrow path in between."
                            ]
                        },
                        {
                            "explanation": "If something is between two amounts, it is greater than the first amount but smaller than the second: ",
                            "examples": [
                                "She weighs between 55 and 60 kilograms.",
                                "The competition is open to children between six and twelve years of age.",
                                "The room was either extremely cold or hot, never anything in between (= in the middle)."
                            ]
                        },
                        {
                            "explanation": "in the period of time that separates two different times or events: ",
                            "examples": [
                                "You shouldn't eat between meals.",
                                "There is a break of ten minutes between classes.",
                                "The office is closed for lunch between 12.30 and 1.30.",
                                "In between sobs, he managed to tell them what had happened.",
                                "He visits his parents every month and sometimes in between."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "bɪˈtwiːn"
                            ],
                            "us": [
                                "bɪˈtwiːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "among two or more people or things: ",
                            "examples": [
                                "The money was divided equally between several worthy causes.",
                                "We drank two bottles of wine between the four of us.",
                                "Trade between the two countries (= their trade with each other) has increased sharply in the past year.",
                                "There is a great deal of similarity between Caroline and her mother (= they are very similar)."
                            ]
                        },
                        {
                            "explanation": "A discussion, argument, or game between two or more people or groups of people involves both people or groups: ",
                            "examples": [
                                "The negotiations between the union and management have broken down.",
                                "There has always been a fierce rivalry between the two schools.",
                                "Tonight's game is between the New Orleans Saints and the St. Louis Rams."
                            ]
                        },
                        {
                            "explanation": "If you choose between two things, you choose one thing or the other: ",
                            "examples": [
                                "You'll have to choose between a holiday or a new washing machine.",
                                "She was torn between loyalty to her father and love for her husband (= she could not decide which one to support)."
                            ]
                        },
                        {
                            "explanation": "connecting two or more places, things, or people: ",
                            "examples": [
                                "There is a regular train service between Glasgow and Edinburgh.",
                                "The survey shows a link between asthma and air pollution."
                            ]
                        },
                        {
                            "explanation": "from one place to another: ",
                            "examples": [
                                "He commutes daily between Baltimore and Washington, D.C."
                            ]
                        },
                        {
                            "explanation": "separating two places or things: ",
                            "examples": [
                                "The wall between East and West Berlin came down in 1989.",
                                "The report states that the gap between the rich and the poor has increased dramatically over the past decade."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}