{
    "word": "beyond",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "biˈjɒnd"
                            ],
                            "us": [
                                "biˈjɑːnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "further away in the distance (than something): ",
                            "examples": [
                                "In the distance, beyond the river, was a small town.",
                                "From the top of the hill we could see our house and the woods beyond."
                            ]
                        },
                        {
                            "explanation": "outside or after (a stated limit): ",
                            "examples": [
                                "Few people live beyond the age of a hundred.",
                                "We cannot allow the work to continue beyond the end of the year.",
                                "I've got nothing to tell you beyond (= in addition to) what I told you earlier.",
                                "The repercussions will be felt throughout the industry and beyond (= in other areas).",
                                "Tonight's performance has been cancelled due to circumstances beyond our control (= events that we are unable to deal with).",
                                "She has always lived beyond her means (= spent more than she has earned)."
                            ]
                        },
                        {
                            "explanation": "to be more than or not limited to something: ",
                            "examples": [
                                "The appeal of this device goes beyond convenience."
                            ]
                        },
                        {
                            "explanation": "too great or bad for anyone to believe, repair, recognize, etc.: ",
                            "examples": [
                                "His thoughtlessness is beyond belief."
                            ]
                        },
                        {
                            "explanation": "extremely excited, serious, angry, etc.: ",
                            "examples": [
                                "She says she is beyond excited to see her son for the first time in more than three years."
                            ]
                        },
                        {
                            "explanation": "If a legal case or a person's guilt is proved beyond reasonable doubt, there is enough proof for the person accused of a crime to be judged guilty: ",
                            "examples": [
                                "Her guilt was established beyond reasonable doubt."
                            ]
                        },
                        {
                            "explanation": "If something is beyond you, you are unable to understand it: ",
                            "examples": [
                                "Physics is completely beyond me."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}