{
    "word": "bias",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbaɪ.əs"
                            ],
                            "us": [
                                "ˈbaɪ.əs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the action of supporting or opposing a particular person or thing in an unfair way, because of allowing personal opinions to influence your judgment: ",
                            "examples": [
                                "The senator has accused the media of bias.",
                                "Reporters must be impartial and not show political bias.",
                                "There was clear evidence of a strong bias against her.",
                                "There has always been a slight bias towards employing liberal arts graduates in the company.",
                                "Unconscious bias (= that the person with the bias is not aware of) can influence decisions in recruitment, promotion, and performance management."
                            ]
                        },
                        {
                            "explanation": "the fact of preferring a particular subject or thing: ",
                            "examples": [
                                "She showed a scientific bias at an early age."
                            ]
                        },
                        {
                            "explanation": "the fact of a collection of data containing more information that supports a particular opinion than you would expect to find if the collection had been made by chance: ",
                            "examples": [
                                "Understanding the bias introduced by human annotation of data is a crucial problem in AI research.",
                                "A selection bias in the personality study might have meant that only confident, extroverted people volunteered to take part. ",
                                "He describes how publication bias can mean that negative results aren't reported. ",
                                "The methodological failings of the report included survivorship bias: the tendency for failed companies to be excluded from performance studies."
                            ]
                        },
                        {
                            "explanation": "in bowls (= a game in which the players roll a large black or brown ball as close as possible to a smaller white ball), the shape given to one side of the ball that makes it not round: ",
                            "examples": [
                                "A bowl will turn towards the side with the bias when rolled."
                            ]
                        },
                        {
                            "explanation": "a direction at an angle across the threads of woven material",
                            "examples": []
                        },
                        {
                            "explanation": "If a piece of clothing is cut on the bias, the cloth has been cut in a diagonal direction: ",
                            "examples": [
                                "I like to wear skirts cut on the bias.",
                                "The dresses in his new winter collection are all cut on the bias.",
                                "Anything cut on the bias tends to make my hips look big.",
                                "Leila's dress was cut on the bias so that it floated outwards from her whenever she moved.",
                                "She wore a dress that was cut on the bias and studded with rhinestones.",
                                "The collection includes bias-cut dresses and skirts with embroidered hems.",
                                "The shoes would look fabulous with a simple, bias-cut silk dress."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbaɪ.əs"
                            ],
                            "us": [
                                "ˈbaɪ.əs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "UK also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause someone or something to have a bias: ",
                            "examples": [
                                "The judge ruled that the information should be withheld on the grounds that it would bias the jury against the accused."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}