{
    "word": "bid",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bɪd"
                            ],
                            "us": [
                                "bɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to offer a particular amount of money for something that is for sale and compete against other people to buy it, especially at a public sale of goods or property: ",
                            "examples": [
                                "She knew she couldn't afford it, so she didn't bid.",
                                "The communications group has shown an interest in bidding for the company.",
                                "A foreign collector has bid $500,000 for the portrait.",
                                "What am I bid for this fine vase?"
                            ]
                        },
                        {
                            "explanation": "If two or more people bid for a job, they compete with each other to do the work by offering to do it for a particular amount of money: ",
                            "examples": [
                                "The department is trying to ensure fairer competition among firms bidding for city contracts."
                            ]
                        },
                        {
                            "explanation": "If someone bids to do something, they compete with other people to do it: ",
                            "examples": [
                                "Paris is bidding to host the next Olympics."
                            ]
                        },
                        {
                            "explanation": "(in some card games) to say, before play starts, how many points you expect to win in a particular game: ",
                            "examples": [
                                "Before you decide how to bid, you need to evaluate how strong the hand of cards you are holding is. ",
                                "She bid three diamonds."
                            ]
                        },
                        {
                            "explanation": "to give a greeting to someone, or to ask someone to do something: ",
                            "examples": [
                                "They bade her good morning.",
                                "I must now bid you farewell (= say goodbye to you).",
                                "She bade her hopes farewell (= she stopped being hopeful).",
                                "He bade (= asked) them (to) leave at once."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bɪd"
                            ],
                            "us": [
                                "bɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an offer of a particular amount of money for something that is for sale: ",
                            "examples": [
                                "I made a bid of $150 for the painting.",
                                "She put in a bid of £69,000 for the flat, which was accepted."
                            ]
                        },
                        {
                            "explanation": "an offer to do something when you are competing with other people to do it: ",
                            "examples": [
                                "Sydney made a successful bid to host the Olympic Games.",
                                "I gave the job to the contractors who made the lowest bid (= who offered to do the work for the lowest amount of money)."
                            ]
                        },
                        {
                            "explanation": "(in some card games) a statement, made before play starts, of how many points a player thinks he or she will get in a particular game : ",
                            "examples": [
                                "The declarer must make as many tricks as his bid has promised."
                            ]
                        },
                        {
                            "explanation": "an attempt to achieve or get something: ",
                            "examples": [
                                "Her bid for re-election was unsuccessful.",
                                "The company has managed to fight off a hostile takeover bid (= an attempt by another company to take control of it)."
                            ]
                        },
                        {
                            "explanation": "in order to try to get or do something: ",
                            "examples": [
                                "They have reduced the cost of borrowing in a bid to get the economy moving again.",
                                "She wants to recruit more police officers in a bid to reduce crime in the city.",
                                "The examiners set the pass mark lower in a bid to keep results in line with previous years.",
                                "In a bid to boost environmentally friendly tourism, the council has set up a series of recharging points for electric vehicles.",
                                "Local people have formed a pressure group in a bid to block the development."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}