{
    "word": "binding",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈbaɪn.dɪŋ"
                            ],
                            "us": [
                                "ˈbaɪn.dɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(especially of an agreement) that cannot be legally avoided or stopped: ",
                            "examples": [
                                "a binding agreement",
                                "The contract wasn't legally binding."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbaɪn.dɪŋ"
                            ],
                            "us": [
                                "ˈbaɪn.dɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the type of cover that a book has: ",
                            "examples": [
                                "She took a book from the shelf, admiring the gold edges to the pages and the green leather binding."
                            ]
                        },
                        {
                            "explanation": "a thin strip of material that can be sewn along the edges of clothes or other objects: ",
                            "examples": [
                                "The jacket is beautifully finished, and binding on the seams and pockets adds strength."
                            ]
                        },
                        {
                            "explanation": "a device that is fixed to a ski, for holding a boot firmly: ",
                            "examples": [
                                "I need to adjust these bindings – they are too tight."
                            ]
                        },
                        {
                            "explanation": "the act, usually done by transgender people (= people whose gender does not match the body they were born with), of making your chest appear flatter by wrapping it very tightly with a piece of cloth or a binder (= a special piece of clothing used for this purpose) that helps hold your breasts flat: ",
                            "examples": [
                                "Binding can help reduce gender dysphoria and improve mental health for trans men.",
                                "Chest binding is common among people who want their chest to look less feminine.",
                                "We recommend that you talk to a healthcare provider if you experience negative side effects from binding, such as shortness of breath. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}