{
    "word": "bipolar",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌbaɪˈpəʊ.lər"
                            ],
                            "us": [
                                "ˌbaɪˈpoʊ.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "affected by bipolar disorder (= a mental health condition in which a person can at times be very depressed and at other times very excited and energetic): ",
                            "examples": [
                                "I now realize I have been bipolar since my teens.",
                                "She has three children, including an older bipolar daughter."
                            ]
                        },
                        {
                            "explanation": "of a cell, having only one structure projecting (= sticking out) from it: ",
                            "examples": [
                                "retinal bipolar cells"
                            ]
                        },
                        {
                            "explanation": "in which two countries or areas have most of the power: ",
                            "examples": [
                                "It quickly became apparent that they did not fit into the bipolar world that both the Soviets and the United States thought they'd created. "
                            ]
                        },
                        {
                            "explanation": "relating to or having two poles (= ends of a magnet where the force is strongest, one that attracts and one that pushes away iron and steel): ",
                            "examples": [
                                "a bipolar magnet"
                            ]
                        },
                        {
                            "explanation": "consisting of two parts, choices, etc., especially when these are opposites: ",
                            "examples": [
                                "We could move away from a straightforward bipolar system, in which each side has only one of two options."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌbaɪˈpəʊ.lər"
                            ],
                            "us": [
                                "ˌbaɪˈpoʊ.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "short for bipolar disorder: a mental health condition in which a person can at times be very depressed and at other times very excited and energetic: ",
                            "examples": [
                                "My parents thought they could cure my sister's bipolar by taking her camping and getting her eating well."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}