{
    "word": "birth",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bɜːθ"
                            ],
                            "us": [
                                "bɝːθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the time when a baby or young animal comes out of its mother's body: ",
                            "examples": [
                                "It was a difficult birth.",
                                "He weighed eight pounds at birth.",
                                "More men are present at the births of their children these days.",
                                "The application form will ask for your country/place of birth (= where you were born)."
                            ]
                        },
                        {
                            "explanation": "a child that is born: ",
                            "examples": [
                                "The percentage of live births (= children who are born alive and continue to live) continues to increase.",
                                "Registration of births and deaths became compulsory in 1871."
                            ]
                        },
                        {
                            "explanation": "the position of the family into which you are born, especially its social position: ",
                            "examples": [
                                "He had received all the advantages of birth (= having been born into a family of a high social class) and an expensive education."
                            ]
                        },
                        {
                            "explanation": "born in a particular place or having parents of a particular nationality: ",
                            "examples": [
                                "Oscar Wilde was Irish by birth."
                            ]
                        },
                        {
                            "explanation": "the beginning of something: ",
                            "examples": [
                                "These asteroids were formed at the birth of the solar system."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bɜːθ"
                            ],
                            "us": [
                                "bɝːθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to produce a baby or young animal from your body: ",
                            "examples": [
                                "She birthed and raised eight children.",
                                "An elephant in the zoo birthed a calf.",
                                "In the United States, more and more women are choosing to birth in water. "
                            ]
                        },
                        {
                            "explanation": "to help a baby or young animal to be born: ",
                            "examples": [
                                "Many of these midwives have decades of experience birthing babies.",
                                "A team of elephant keepers and trainers helped to birth the calf."
                            ]
                        },
                        {
                            "explanation": "to produce or create something; to cause something to start existing: ",
                            "examples": [
                                "Greece is the nation that birthed the Olympics.",
                                "I wanted him to be involved in the film because after all, he birthed the idea."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}