{
    "word": "bisque",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "biːsk",
                                "bɪsk"
                            ],
                            "us": [
                                "bɪsk",
                                "biːsk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thick soup, especially one that is made from shellfish (= sea creatures that live in shells): ",
                            "examples": [
                                "We started with a bowl of creamy lobster bisque.",
                                "crayfish/langoustine/shrimp bisque",
                                "Light soups such as cream soups, bisques, or vegetable soups are usually the introduction to a meal rather than the main course."
                            ]
                        },
                        {
                            "explanation": "a pale pinkish-brown colour similar to the colour of this soup: ",
                            "examples": [
                                "Refrigerators are available in white, black, stainless steel, and bisque (beige)."
                            ]
                        },
                        {
                            "explanation": "a material made out of clay that has been fired (= heated in a special oven so it becomes hard) once and not yet glazed (= covered with a shiny layer and heated again): ",
                            "examples": [
                                "Bisque is not water-safe until it has been painted with glaze and then fired again.",
                                "I love these rustic bisque tiles."
                            ]
                        },
                        {
                            "explanation": "in sports such as croquet, tennis, or golf, an extra turn that is given to a weaker player: ",
                            "examples": [
                                "The balls were placed so badly that I decided to take a bisque."
                            ]
                        },
                        {
                            "explanation": "special permission not to do something: ",
                            "examples": [
                                "This was a debate in which one would choose to take a bisque."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "biːsk",
                                "bɪsk"
                            ],
                            "us": [
                                "bɪsk",
                                "biːsk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fire clay objects (= heat them in a special oven) once, usually before glazing them (= covering them with a shiny layer and heating them again): ",
                            "examples": [
                                "To bisque is to fire the clay for the first time.",
                                "Bisqueware or biscuit ware is a term for pots that have been bisqued.",
                                "Bisqued pots are often pinkish in colour."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}