{
    "word": "block",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "blɒk"
                            ],
                            "us": [
                                "blɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the distance along a street from where one road crosses it to the place where the next road crosses it, or one part of a street like this, especially in a town or city: ",
                            "examples": [
                                "The museum is just six blocks away.",
                                "My friend and I live on the same block."
                            ]
                        },
                        {
                            "explanation": "a square group of buildings or houses with roads on each side: ",
                            "examples": [
                                "I took a walk around the block."
                            ]
                        },
                        {
                            "explanation": "on the next street that crosses this street: ",
                            "examples": [
                                "He lives just around the block."
                            ]
                        },
                        {
                            "explanation": "a solid, straight-sided piece of hard material: ",
                            "examples": [
                                "a block of wood/ice"
                            ]
                        },
                        {
                            "explanation": "(in the past) a large piece of wood on which criminals had their head cut off: ",
                            "examples": [
                                "Anne Boleyn went to (= was killed on) the block."
                            ]
                        },
                        {
                            "explanation": "a large, usually tall building divided into separate parts for use as offices or homes by several different organizations or people: ",
                            "examples": [
                                "an office block",
                                "a tower block",
                                "a block of flats"
                            ]
                        },
                        {
                            "explanation": "a group of things bought, dealt with, or considered together: ",
                            "examples": [
                                "a block of tickets/seats/shares",
                                "Corporate hospitality firms make block bookings (= buy large numbers of seats) at big sporting events."
                            ]
                        },
                        {
                            "explanation": "something that blocks a tube or opening: ",
                            "examples": [
                                "A block in (= an object blocking) the pipe was preventing the water from coming through."
                            ]
                        },
                        {
                            "explanation": "in sport, the act of stopping an opponent or the ball from moving forwards: ",
                            "examples": [
                                "The defender made a lunging block."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "blɒk"
                            ],
                            "us": [
                                "blɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to prevent movement through something: ",
                            "examples": [
                                "A fallen tree is blocking the road.",
                                "As she left the court, an angry crowd tried to block her way."
                            ]
                        },
                        {
                            "explanation": "to be between someone and the thing they are looking at, so that they cannot see: ",
                            "examples": [
                                "My view was blocked by a tall man in front of me."
                            ]
                        },
                        {
                            "explanation": "to stop something from happening or succeeding: ",
                            "examples": [
                                "She was very talented and I felt her parents were blocking her progress.",
                                "A group of politicians blocked the proposal."
                            ]
                        },
                        {
                            "explanation": "in sport, to stop an opponent or the ball from moving forwards: ",
                            "examples": [
                                "Nobody blocked him as he ran into the open space.",
                                "She jumped up and blocked the shot."
                            ]
                        },
                        {
                            "explanation": "If a bank blocks someone's account, they make it impossible for that person to remove money from it: ",
                            "examples": [
                                "Federal agents blocked the accounts of five money-transfer operations in the city."
                            ]
                        },
                        {
                            "explanation": "to stop emails, text messages, phone calls, etc. from being received: ",
                            "examples": [
                                "The carriers said they have rigorous filters to block spam, and they allow customers to block messages from certain numbers.",
                                "Prosecutors say Wilson allegedly made the calls from a blocked phone number."
                            ]
                        },
                        {
                            "explanation": "on social media, to stop a particular person from being able to communicate with you or read what you have written: ",
                            "examples": [
                                "My mom found out that I blocked her on Twitter and gave me another serious talk.",
                                "In the Block Users section you should see a list of people you've blocked.",
                                "Someone you’ve blocked won’t be able to add you to a group."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}