{
    "word": "blocker",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈblɒk.ər"
                            ],
                            "us": [
                                "ˈblɑː.kɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something or someone that prevents something from happening or succeeding: ",
                            "examples": [
                                "I've installed an ad blocker so I don't get all those annoying adverts popping up when I'm browsing. ",
                                "The school needs to identify staff who are blockers of progress."
                            ]
                        },
                        {
                            "explanation": "something that prevents something from passing through it to reach a place: ",
                            "examples": [
                                "Titanium and zinc are effective blockers of ultraviolet radiation. "
                            ]
                        },
                        {
                            "explanation": "a substance or medicine that stops a particular process from happening in the body: ",
                            "examples": [
                                "Calcium channel blockers help control an irregular heart beat.",
                                "To test whether opiates were responsible for the effects, researchers gave subjects an opiate receptor blocker."
                            ]
                        },
                        {
                            "explanation": "in American football, a player who stops players from the other team from reaching the player carrying the ball: ",
                            "examples": [
                                "His size and speed made him both an excellent blocker and a useful offensive player.",
                                "He was so good at sacking the quarterback that teams sometimes used as many as three blockers to keep him away."
                            ]
                        },
                        {
                            "explanation": "in ice hockey (= a game played on ice), a large, thick piece of material worn on the hand and arm of a goaltender (= the player who stands in the team's goal to try to stop the other team from scoring): ",
                            "examples": [
                                "Right-handed goaltenders will wear the blocker on the right hand.",
                                "The puck bounced clear off the goalie's blocker."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}