{
    "word": "board",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bɔːd"
                            ],
                            "us": [
                                "bɔːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thin, flat piece of cut wood or other hard material, often used for a particular purpose: ",
                            "examples": [
                                "Cheeses were laid out on a board.",
                                "There was a \"For Sale\" board outside the house."
                            ]
                        },
                        {
                            "explanation": "a flat piece of wood or other hard material with a special pattern on it, used for playing games: ",
                            "examples": [
                                "a chess board"
                            ]
                        },
                        {
                            "explanation": "a \nblackboard  or \nwhiteboard : ",
                            "examples": [
                                "The teacher wrote her name up on the board."
                            ]
                        },
                        {
                            "explanation": "a \nnoticeboard UK : ",
                            "examples": [
                                "I stuck the notice (up) on the board."
                            ]
                        },
                        {
                            "explanation": "a \ndiving board : ",
                            "examples": [
                                "I dived off the top board today, Dad."
                            ]
                        },
                        {
                            "explanation": "the wooden fence surrounding the ice surface in ice hockey: ",
                            "examples": [
                                "He'd crashed into the boards and hurt his leg quite badly."
                            ]
                        },
                        {
                            "explanation": "the stage in a theatre: ",
                            "examples": [
                                "It was over two decades since he had trodden the boards (= acted in a theatre)."
                            ]
                        },
                        {
                            "explanation": "the group of people who are responsible for controlling and organizing a company or organization: ",
                            "examples": [
                                "Every decision has to be approved by the board of directors. ",
                                "The board of governors meet/meets once a month to discuss school policy.",
                                "She started in the firm after college and now she's on the board/a board member."
                            ]
                        },
                        {
                            "explanation": "an official examination given by some medical and business organizations in the US: ",
                            "examples": [
                                "This is my last chance to pass the boards."
                            ]
                        },
                        {
                            "explanation": "on a boat, train, or aircraft: ",
                            "examples": [
                                "As soon as I was on board, I began to have second thoughts about leaving."
                            ]
                        },
                        {
                            "explanation": "as part of a group or team, especially for a special purpose: ",
                            "examples": [
                                "Let's bring Rob on board for the Saudi deal - he's the expert."
                            ]
                        },
                        {
                            "explanation": "in agreement with a particular course of action, especially so that you get involved with it: ",
                            "examples": [
                                "Seeing his enthusiasm and expertise, others quickly got on board with his grand ideas."
                            ]
                        },
                        {
                            "explanation": "meals provided when you are staying somewhere, usually for money",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bɔːd"
                            ],
                            "us": [
                                "bɔːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to get onto or allow people to get onto a boat, train, or aircraft: ",
                            "examples": [
                                "At London airport she boarded a plane to Australia.",
                                "Will passengers waiting to board please go to the ticket counter?"
                            ]
                        },
                        {
                            "explanation": "to pay to sleep and eat meals in someone's house: ",
                            "examples": [
                                "During his stay in England he boarded with a family in Bath."
                            ]
                        },
                        {
                            "explanation": "to sleep and eat at school during the school term: ",
                            "examples": [
                                "When you went to school were you a day student or did you board?"
                            ]
                        },
                        {
                            "explanation": "to arrange for a pet animal to be temporarily taken care of at a place other than its home: ",
                            "examples": [
                                "He boards the dog out when he goes on business trips."
                            ]
                        },
                        {
                            "explanation": "to slide on the snow by standing on a specially shaped board: ",
                            "examples": [
                                "I love to go boarding in the winter."
                            ]
                        },
                        {
                            "explanation": "in ice hockey, to make a dangerous hit that sends an opponent into one of the boards that surround the rink (= playing area): ",
                            "examples": [
                                "He was given a penalty for boarding."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}