{
    "word": "body",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbɒd.i"
                            ],
                            "us": [
                                "ˈbɑː.di"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the whole physical structure that forms a person or animal: ",
                            "examples": [
                                "A good diet and plenty of exercise will help you to keep your body healthy.",
                                "She rubbed suncream over her entire body."
                            ]
                        },
                        {
                            "explanation": "the main part of a person's or animal's body, without the head, or without the head, arms, and legs: ",
                            "examples": [
                                "He had a fat body but thin legs and arms."
                            ]
                        },
                        {
                            "explanation": "a dead person: ",
                            "examples": [
                                "A body was washed up on the beach last week."
                            ]
                        },
                        {
                            "explanation": "the painted metal shell of a vehicle, such as a car or an aircraft",
                            "examples": []
                        },
                        {
                            "explanation": "a person: ",
                            "examples": [
                                "How is a body supposed to live in these conditions?"
                            ]
                        },
                        {
                            "explanation": "a piece of tight-fitting women's clothing that covers the top half of the body and fastens between the legs",
                            "examples": []
                        },
                        {
                            "explanation": "a group of people who have joined together for a particular reason: ",
                            "examples": [
                                "The sport's governing body announced changes to some rules for the coming season. ",
                                "Chatsworth High School's student body raised £5,000 for the charity. ",
                                "The committee serves as an advisory body to the organization. ",
                                "The RSPCA is a respected body working for animal welfare.",
                                "There is a large body of people who are unaware of their basic rights."
                            ]
                        },
                        {
                            "explanation": "If people do something in a body, they do it together as a group, in an official way: ",
                            "examples": [
                                "The cleaning staff went in a body to the manager to complain."
                            ]
                        },
                        {
                            "explanation": "a large amount of something: ",
                            "examples": [
                                "There is a growing body of evidence to support their claim.",
                                "She collected a huge body of information on the subject.",
                                "A substantial body of opinion (= a large group of people with the same opinion) is opposed to any change."
                            ]
                        },
                        {
                            "explanation": "A body of water is a large area of water, such as a lake.",
                            "examples": []
                        },
                        {
                            "explanation": "the main part of a book, article, etc.: ",
                            "examples": [
                                "I thought the most interesting details in the book were not in the body of the text, but in the notes at the end."
                            ]
                        },
                        {
                            "explanation": "the main part of a large building: ",
                            "examples": [
                                "to enter the body of the cathedral"
                            ]
                        },
                        {
                            "explanation": "a separate object or mass: ",
                            "examples": [
                                "The distance between the two bodies in space was measured daily."
                            ]
                        },
                        {
                            "explanation": "a strong or thick quality: ",
                            "examples": [
                                "This Bordeaux has plenty of body (= strong flavour).",
                                "Conditioner can give your hair more body."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}