{
    "word": "boil",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bɔɪl"
                            ],
                            "us": [
                                "bɔɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to reach, or cause something to reach, the temperature at which a liquid starts to turn into a gas: ",
                            "examples": [
                                "Liquid nitrogen boils at a very low temperature.",
                                "She scalded herself on some boiling water.",
                                "If you give water to a small baby to drink, you have to boil it first."
                            ]
                        },
                        {
                            "explanation": "to heat a container, especially one used for cooking, until the liquid in it starts to turn into a gas: ",
                            "examples": [
                                "The pan's boiling.",
                                "Could you boil the kettle for me?"
                            ]
                        },
                        {
                            "explanation": "to cook food by putting it in water that is boiling: ",
                            "examples": [
                                "I've boiled some potatoes for dinner.",
                                "boiled carrots"
                            ]
                        },
                        {
                            "explanation": "If a container or food boils dry, all the liquid in the container in which the food was cooking turns to gas: ",
                            "examples": [
                                "He'd left a pan of water on the stove and it had boiled dry."
                            ]
                        },
                        {
                            "explanation": "to wash clothes in a container of very hot water",
                            "examples": []
                        },
                        {
                            "explanation": "to be extremely angry: ",
                            "examples": [
                                "He was boiling with rage."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bɔɪl"
                            ],
                            "us": [
                                "bɔɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a painful swelling on the skin that is filled with pus (= thick, yellow liquid)",
                            "examples": []
                        },
                        {
                            "explanation": "the act of washing or cooking something in very hot water",
                            "examples": []
                        },
                        {
                            "explanation": "the state of boiling: ",
                            "examples": [
                                "Bring the water to a boil, then add the pasta.",
                                "Bring the water to the boil, then add the pasta.",
                                "Let the liquid come to a boil and then reduce the heat.",
                                "As the liquid comes to a boil, whisk it lightly.",
                                "Bring the sauce very gently to a boil and let it simmer for ten minutes. ",
                                "Add half a teaspoon of salt and bring to the boil."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}