{
    "word": "bomb",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bɒm"
                            ],
                            "us": [
                                "bɑːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a weapon that explodes and is used to kill or hurt people or to damage buildings: ",
                            "examples": [
                                "During World War II, the British dropped a huge number of bombs on Dresden.",
                                "A 100-pound bomb exploded in a market today, injuring three people.",
                                "A bomb went off near a hospital in Baghdad.",
                                "The terrorists had planted a bomb near the police station."
                            ]
                        },
                        {
                            "explanation": "one or more atom bombs: ",
                            "examples": [
                                "The US was the first country to have the bomb."
                            ]
                        },
                        {
                            "explanation": "something that has failed: ",
                            "examples": [
                                "The play was a real bomb."
                            ]
                        },
                        {
                            "explanation": "a lot of money: ",
                            "examples": [
                                "That coat must have cost a bomb.",
                                "Their wine is really good but it costs a bomb.",
                                "Festival tickets cost a bomb.",
                                "What a present! It must be worth a bomb!",
                                "This knock-off cream is just as good as the expensive stuff and you'll save a bomb on skin care.",
                                "He spent a bomb on his daughter's wedding."
                            ]
                        },
                        {
                            "explanation": "in sports such as rugby, a kick where the ball goes very high in the air: ",
                            "examples": [
                                "Smith hoisted a dangerous bomb to the far corner.",
                                "The first try came when Jackson made a mess of dealing with a high bomb. "
                            ]
                        },
                        {
                            "explanation": "in baseball, a home run (= a point scored by hitting the ball so far that you have time to run all the way around the four corners of the playing field before it is returned): ",
                            "examples": [
                                "Griffey launched a three-run bomb in the eighth inning.",
                                "He hit thirty bombs last season."
                            ]
                        },
                        {
                            "explanation": "in sports such as American football, a very long, high pass: ",
                            "examples": [
                                "Smith hoisted a bomb to the ten-yard line."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bɒm"
                            ],
                            "us": [
                                "bɑːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to drop bombs on something: ",
                            "examples": [
                                "Planes bombed the city every night."
                            ]
                        },
                        {
                            "explanation": "to destroy something by exploding a bomb inside it: ",
                            "examples": [
                                "This hotel was bombed a few years ago."
                            ]
                        },
                        {
                            "explanation": "to travel very fast in a vehicle: ",
                            "examples": [
                                "He was bombing along on his motorbike."
                            ]
                        },
                        {
                            "explanation": "to fail: ",
                            "examples": [
                                "Her last book really bombed."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}