{
    "word": "book",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bʊk"
                            ],
                            "us": [
                                "bʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a written text that can be published in printed or electronic form: ",
                            "examples": [
                                "Have you read any good books recently?",
                                "He has a new book out (= published).",
                                "She wrote a book on car maintenance."
                            ]
                        },
                        {
                            "explanation": "a set of pages that have been fastened together inside a cover to be read or written in: ",
                            "examples": [
                                "a hardback/paperback book",
                                "I took a book with me to read on the plane.",
                                "He writes all his expenses in a little book he carries with him."
                            ]
                        },
                        {
                            "explanation": "one of the parts that a very long book, such as the Bible, is divided into: ",
                            "examples": [
                                "the book of Job"
                            ]
                        },
                        {
                            "explanation": "a number of one type of thing fastened together flat inside a cover: ",
                            "examples": [
                                "a book of stamps/tickets/matches"
                            ]
                        },
                        {
                            "explanation": "the written records of money that a business has spent or received: ",
                            "examples": [
                                "Running a school is much more of a business than it used to be - by law we have to balance our books."
                            ]
                        },
                        {
                            "explanation": "the situation in which a bookmaker accepts and pays out amounts of money that are risked on a particular result: ",
                            "examples": [
                                "They've already opened/started a book on the result of the next World Cup."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bʊk"
                            ],
                            "us": [
                                "bʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrange to have a seat, room, performer, etc. at a particular time in the future: ",
                            "examples": [
                                "I'd like to go but I'm booked up (= I have arranged to do other things) until the weekend.",
                                "Unfortunately the restaurant was fully booked (= there were no tables available).",
                                "I've booked us two tickets to see \"Carmen\"/I've booked two tickets for us to see \"Carmen\".",
                                "She'd booked a table for four at their favourite restaurant.",
                                "Will booked a seat on the evening flight to Los Angeles.",
                                "We were advised to book early if we wanted to get a room.",
                                "They booked a jazz band for their wedding."
                            ]
                        },
                        {
                            "explanation": "If a police officer, referee, etc. books someone, they write down the person's name in an official record because they have done something wrong: ",
                            "examples": [
                                "A football player who is booked twice in a game is sent off the field.",
                                "My grandmother was booked for speeding last week."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}