{
    "word": "boot",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "buːt"
                            ],
                            "us": [
                                "buːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a type of shoe that covers the whole foot and the lower part of the leg: ",
                            "examples": [
                                "walking boots",
                                "riding boots"
                            ]
                        },
                        {
                            "explanation": "a type of special shoe, usually one with studs (= small, pointed parts that stick out from the bottom of the shoe), worn when playing some sports: ",
                            "examples": [
                                "Don't forget your boots and shin pads.",
                                "rugby boots"
                            ]
                        },
                        {
                            "explanation": "a covered space at the back of a car, for storing things in: ",
                            "examples": [
                                "I always keep a blanket and a toolkit in the boot for emergencies.",
                                "Stolen goods were found in the boot of her car."
                            ]
                        },
                        {
                            "explanation": "the situation in which your job is taken away from you, usually because you have done something wrong or badly: ",
                            "examples": [
                                "She got the boot for stealing money from the cash register.",
                                "Williams has been given the boot from the team."
                            ]
                        },
                        {
                            "explanation": "a kick with the foot: ",
                            "examples": [
                                "He gave the ball a good boot."
                            ]
                        },
                        {
                            "explanation": "a metal device attached to the wheel of an illegally parked car that will only be removed when the owner pays an amount of money",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "buːt"
                            ],
                            "us": [
                                "buːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to kick someone or something hard with the foot: ",
                            "examples": [
                                "They booted him in the head."
                            ]
                        },
                        {
                            "explanation": "When a computer boots (up), it becomes ready for use by getting the necessary information into its memory, and when you boot (up) a computer, you cause it to do this.",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}