{
    "word": "bother",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbɒð.ər"
                            ],
                            "us": [
                                "ˈbɑː.ðɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make the effort to do something: ",
                            "examples": [
                                "He hasn't even bothered to write.",
                                "You could have phoned us but you just didn't bother.",
                                "Don't bother making the bed - I'll do it later.",
                                "You'd have found it if you'd bothered looking/to look.",
                                "You won't get any credit for doing it, so why bother?"
                            ]
                        },
                        {
                            "explanation": "If you can't be bothered doing/to do something, you are too lazy or tired to do it: ",
                            "examples": [
                                "I can't be bothered to iron my clothes."
                            ]
                        },
                        {
                            "explanation": "to make someone feel worried or upset: ",
                            "examples": [
                                "Does it bother you that he's out so much of the time?",
                                "Living on my own has never bothered me.",
                                "I don't care if he doesn't come - it doesn't bother me.",
                                "It bothers me that he doesn't seem to notice."
                            ]
                        },
                        {
                            "explanation": "to annoy or cause problems for someone: ",
                            "examples": [
                                "Don't bother your father when he's working.",
                                "I'm sorry to bother you, but could you help me lift this suitcase?",
                                "I didn't want to bother her with work matters on her day off.",
                                "The noise was beginning to bother us, so we left.",
                                "She threatened to call the police if he didn't stop bothering her."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbɒð.ər"
                            ],
                            "us": [
                                "ˈbɑː.ðɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "trouble or problems: ",
                            "examples": [
                                "I can take you there - it's really no bother.",
                                "Please don't go to any bother on my account (= don't make any special effort for me).",
                                "I had a bit of bother getting hold of his phone number."
                            ]
                        },
                        {
                            "explanation": "the effort that is necessary to achieve something: ",
                            "examples": [
                                "Some people don't get married because they don't want the bother.",
                                "It hardly seems worth the bother to go all that way just for two nights.",
                                "If this change is going to disrupt people's lives so much, it's not worth the bother.",
                                "Many employers don't want to go through the bother of sponsoring a worker for a visa.",
                                "You might as well shave off your beard and save yourself the bother.",
                                "She asked the question, which spared me the bother."
                            ]
                        },
                        {
                            "explanation": "an annoying person or situation: ",
                            "examples": [
                                "I'm sorry to be a bother, but could I have that number again?",
                                "It's such a bother having to do everything twice."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "ˈbɒð.ər"
                            ],
                            "us": [
                                "ˈbɑː.ðɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to express anger: ",
                            "examples": [
                                "Oh bother! It's raining and I left my umbrella at home."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}