{
    "word": "bottom",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈbɒt.əm"
                            ],
                            "us": [
                                "ˈbɑː.t̬əm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the lowest part of something: ",
                            "examples": [
                                "He stood at the bottom of the stairs and called up to me.",
                                "Extra information will be found at the bottom of the page.",
                                "The ship had sunk to the bottom of the sea/the sea bottom.",
                                "At school, Einstein was (at the) bottom of (= the least successful student in) his class.",
                                "The manager of the hotel started at the bottom (= in one of the least important jobs) 30 years ago, as a porter.",
                                "The rich usually get richer, while the people at the bottom (= at the lowest position in society) stay there."
                            ]
                        },
                        {
                            "explanation": "the lower part of a piece of clothing that consists of two parts: ",
                            "examples": [
                                "I've found my bikini bottoms but not my top."
                            ]
                        },
                        {
                            "explanation": "in baseball, the second part of an inning (= period of play), when the team that is playing at home (= on its own field) has its turn to try to hit the ball and score: ",
                            "examples": [
                                "He made a crucial error in the bottom of the ninth inning.",
                                "Cleveland scored a run in the bottom of the second."
                            ]
                        },
                        {
                            "explanation": "the farthest part of something: ",
                            "examples": [
                                "His feet stuck out from the bottom of the bed.",
                                "They live at the bottom of our street (= the other end of the street from us)."
                            ]
                        },
                        {
                            "explanation": "the part of your body that you sit on: ",
                            "examples": [
                                "She slipped and fell on her bottom."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}