{
    "word": "bounce",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "baʊns"
                            ],
                            "us": [
                                "baʊns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) move up or away after hitting a surface: ",
                            "examples": [
                                "The ball bounced off the goalpost and into the net.",
                                "Television pictures from all over the world are bounced off satellites (= are sent to and returned from them).",
                                "She bounced the ball quickly.",
                                "Her bag bounced (= moved up and down) against her side as she walked.",
                                "He bounced the baby on his knee.",
                                "The children had broken the bed by bouncing (= jumping up and down) on it."
                            ]
                        },
                        {
                            "explanation": "to move in an energetic and enthusiastic manner: ",
                            "examples": [
                                "Tom bounced in, smiling broadly."
                            ]
                        },
                        {
                            "explanation": "to (cause a cheque to) not be paid or accepted by a bank because there is no money in the account: ",
                            "examples": [
                                "I had to pay a penalty fee when my cheque bounced.",
                                "To my horror the bank bounced the cheque."
                            ]
                        },
                        {
                            "explanation": "If an email that you send bounces or is bounced, it comes back to you because the address is wrong or there is a computer problem.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "baʊns"
                            ],
                            "us": [
                                "baʊns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of bouncing, or the quality that makes something able to bounce: ",
                            "examples": [
                                "In tennis you have to hit the ball before its second bounce.",
                                "This shampoo will give your hair bounce (= make it look attractively thick) and shine."
                            ]
                        },
                        {
                            "explanation": "an improvement or change to a higher level, for example in how popular a politician or party is: ",
                            "examples": [
                                "His speech to the convention may have given him a bounce.",
                                "The city has seen a bounce in homicide."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}