{
    "word": "bow",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "baʊ"
                            ],
                            "us": [
                                "baʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to bend your head or body forward, especially as a way of showing someone respect or expressing thanks to people who have watched you perform: ",
                            "examples": [
                                "They bowed to the Queen.",
                                "We bowed our heads in prayer.",
                                "He stood at the back, head bowed in silent contemplation.",
                                "He bowed down before (= in front of) the king and begged for mercy."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "baʊ"
                            ],
                            "us": [
                                "baʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the movement of bending your head or body forward, especially as a way of showing someone respect or expressing thanks to people who have watched you perform: ",
                            "examples": [
                                "The audience applauded enthusiastically, and she came back on stage to take another bow."
                            ]
                        },
                        {
                            "explanation": "the front part of a boat or ship",
                            "examples": []
                        },
                        {
                            "explanation": "in the sport of rowing, the rowing position closest to the front of the boat: ",
                            "examples": [
                                "She has moved from the number 5 seat to row at bow.",
                                "The man in the bow seat is the youngest in the crew."
                            ]
                        },
                        {
                            "explanation": "in the sport of rowing, the person sitting closest to the front of the boat: ",
                            "examples": [
                                "He was bow in his University's eight."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bəʊ"
                            ],
                            "us": [
                                "boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a knot with two curved parts and two loose ends, used as a decoration or to tie shoes: ",
                            "examples": [
                                "I tied the ribbon around the present in a pretty bow."
                            ]
                        },
                        {
                            "explanation": "a weapon for shooting arrows, made of a long, thin piece of wood or fibreglass bent into a curve by a tightly stretched string: ",
                            "examples": [
                                "He made his own bow and arrows.",
                                "The arrow had been shot from a bow.",
                                "So-called recurve bows are used in Olympic archery competitions."
                            ]
                        },
                        {
                            "explanation": "a long, thin piece of wood with hair from the tail of a horse stretched along it, used to play musical instruments that have strings: ",
                            "examples": [
                                "Violins are played with bows."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bəʊ"
                            ],
                            "us": [
                                "boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to play an instrument that has strings, using a long, thin piece of wood with hair from the tail of a horse stretched along it: ",
                            "examples": [
                                "I'm not bowing, but using my fingers pizzicato.",
                                "You can achieve a completely different tone by bowing the strings nearer to the bridge."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}