{
    "word": "bowl",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bəʊl"
                            ],
                            "us": [
                                "boʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a round container that is open at the top and is deep enough to hold fruit, sugar, etc.: ",
                            "examples": [
                                "a soup/cereal/salad/sugar bowl",
                                "a bowl of soup/rice/porridge",
                                "She eats a bowl of cereal every morning.",
                                "Just put the dirty dishes in the washing-up bowl, and I'll do them later."
                            ]
                        },
                        {
                            "explanation": "a dish made of layers of different foods served in a bowl: ",
                            "examples": [
                                "The healthy acai bowl has three layers: a blended, yogurt-like bottom of acai and hemp milk, homemade granola in the middle, and fresh bananas and strawberries on top. ",
                                "I always order a burrito bowl with chicken, salsa, beans, corn, guacamole, and extra lettuce, because I just don't like tortillas. "
                            ]
                        },
                        {
                            "explanation": "the rounded inside part of something: ",
                            "examples": [
                                "The toilet bowl was cracked and stained, and the walls were covered in mould."
                            ]
                        },
                        {
                            "explanation": "a large bowl-shaped building or structure, used for important sports events or musical performances: ",
                            "examples": [
                                "the Hollywood Bowl"
                            ]
                        },
                        {
                            "explanation": "a game played either outside on smooth grass or inside on an artificial surface, in which the players roll a large black or brown ball as close as possible to a smaller white ball: ",
                            "examples": [
                                "Bowls is one of the most popular sports in the UK."
                            ]
                        },
                        {
                            "explanation": "a large ball used in the game of bowls",
                            "examples": []
                        },
                        {
                            "explanation": "(in the US) a special game of American football usually played after the season has finished ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bəʊl"
                            ],
                            "us": [
                                "boʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to roll a ball along a smooth surface during a game of bowls or bowling",
                            "examples": []
                        },
                        {
                            "explanation": "to throw a ball towards a batsman (= the player who hits the ball) using a vertical circular movement of the arm while running: ",
                            "examples": [
                                "Pringle was tired after bowling for an hour."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}