{
    "word": "brand",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "brænd"
                            ],
                            "us": [
                                "brænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a type of product made by a particular company and sold under a particular name: ",
                            "examples": [
                                "This isn't my usual brand of deodorant.",
                                "She has worked on ad campaigns for well-known brands.",
                                "Most people associate the brand with high quality.",
                                "The manufacturer's brands include many popular cosmetic ranges.",
                                "The ultimate goal of many marketing campaigns is to create brand loyalty."
                            ]
                        },
                        {
                            "explanation": "the set of qualities that people connect with a particular product or organization: ",
                            "examples": [
                                "Our brand stands for quality and reliability.",
                                "The company spent a lot of money and energy establishing its brand.",
                                "His actions risk badly damaging the party's brand."
                            ]
                        },
                        {
                            "explanation": "the set of qualities that people connect with a particular person, or the idea of themselves that the person tries to present to others: ",
                            "examples": [
                                "A spokesperson for the company said, \"She is the perfect ambassador for us because her personal brand is very much aligned with our corporate mission.\"",
                                "I have to be careful what pictures I post on social media, because I don't want to tarnish my brand."
                            ]
                        },
                        {
                            "explanation": "a particular type of something, or way of doing something: ",
                            "examples": [
                                "a team that plays a distinctive brand of football"
                            ]
                        },
                        {
                            "explanation": "a piece of burning wood used to give light",
                            "examples": []
                        },
                        {
                            "explanation": "a mark that is burned or frozen into the skin of an animal such as a cow to show who owns it: ",
                            "examples": [
                                "The brand was still visible on the animal's hide."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "brænd"
                            ],
                            "us": [
                                "brænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to say that someone or something is a particular bad thing, usually when this is unfair: ",
                            "examples": [
                                "Because of one mistake he was branded a criminal.",
                                "She was arrested and falsely branded a terror suspect.",
                                "The media branded him racist.",
                                "He claims the report unfairly branded him as a bad credit risk.",
                                "His supporters immediately branded the pictures as fake."
                            ]
                        },
                        {
                            "explanation": "to make a product, organization, person, or place easy to recognize as different from others by connecting it with a particular name, design, symbol, set of qualities, etc.: ",
                            "examples": [
                                "In my job I've learned how to brand and promote a product.",
                                "You can brand the website with your own colours and logo. ",
                                "They have branded the service as an ethical, environmentally-friendly investment option. ",
                                "This is not good enough for an airline that brands itself as a premium luxury carrier.",
                                "He branded himself \"The New Vegan Chef.\""
                            ]
                        },
                        {
                            "explanation": "to mark an animal such as a cow by burning or freezing its skin to show you own it: ",
                            "examples": [
                                "The cattle were rounded up and branded."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}