{
    "word": "bridge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "brɪdʒ"
                            ],
                            "us": [
                                "brɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a structure that is built over a river, road, or railway to allow people and vehicles to cross from one side to the other: ",
                            "examples": [
                                "To get to the restaurant, you need to go over the bridge. ",
                                "We drove across the bridge.",
                                "the Brooklyn Bridge"
                            ]
                        },
                        {
                            "explanation": "something that makes it easier to make a change from one situation to another: ",
                            "examples": [
                                "Part-time work can provide a bridge between staying at home and working full-time."
                            ]
                        },
                        {
                            "explanation": "the raised part of a ship on which the captain and other officers stand and from where they control the movement of the ship",
                            "examples": []
                        },
                        {
                            "explanation": "the top part of the nose, between the eyes, or (on a pair of glasses) the piece that is supported by the top part of the nose: ",
                            "examples": [
                                "The blow caught him right on the bridge of his nose."
                            ]
                        },
                        {
                            "explanation": "a card game for four players who play in pairs",
                            "examples": []
                        },
                        {
                            "explanation": "a piece of material that contains one or more artificial teeth and is kept in place by being fastened to the natural teeth",
                            "examples": []
                        },
                        {
                            "explanation": "a small piece of wood over which the strings are stretched on a musical instrument such as a guitar or violin",
                            "examples": []
                        },
                        {
                            "explanation": "in yoga and other forms of exercise, a position in which you have the back of your head, your shoulders and arms, and your feet on the floor and your hips and knees lifted: ",
                            "examples": [
                                "I recommend you warm up thoroughly before doing your bridges.",
                                "Bridge pose works your hips and thighs."
                            ]
                        },
                        {
                            "explanation": "part of a song or piece of music that is played between two other parts that are similar to each other: ",
                            "examples": [
                                "The song is composed of two verses each followed by a chorus, then the bridge, then another verse followed by the chorus. ",
                                "The lead guitarist improvised an extended solo during the bridge. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "brɪdʒ"
                            ],
                            "us": [
                                "brɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make the difference or division between two things smaller or less severe: ",
                            "examples": [
                                "We must bridge the gap between employees and management."
                            ]
                        },
                        {
                            "explanation": "to build a bridge over or across something: ",
                            "examples": [
                                "The river had been bridged at its narrowest point."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}