{
    "word": "bumping",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nbump ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bʌmp"
                            ],
                            "us": [
                                "bʌmp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to hit something with force: ",
                            "examples": [
                                "She bumped into his tray, knocking the food onto his lap."
                            ]
                        },
                        {
                            "explanation": "to hurt part of your body by hitting it against something hard: ",
                            "examples": [
                                "I bumped my head on the shelf as I stood up."
                            ]
                        },
                        {
                            "explanation": "to travel, usually in a vehicle, in an uncomfortable way because the surface you are moving over is rough: ",
                            "examples": [
                                "We bumped along the dirt road in our car, holding on to our seats.",
                                "The bottom of the boat was bumping over a coral reef."
                            ]
                        },
                        {
                            "explanation": "to remove someone or something from a particular position, sometimes to a different one: ",
                            "examples": [
                                "He had been playing badly and was bumped from the team.",
                                "These movies may be well loved but they're never going to bump Casablanca or Citizen Kane off the classic film lists.",
                                "The 18-year-old has been bumping other players down the rankings ever since he started in competitive tennis. "
                            ]
                        },
                        {
                            "explanation": "to refuse to let someone fly on a plane on which they have booked a seat and put them on a different flight, or to move a passenger to a different type of seat: ",
                            "examples": [
                                "If you are bumped from an oversold flight you are entitled to compensation.",
                                "They asked if any passengers were willing to be bumped.",
                                "If you're lucky you might get bumped up to business class."
                            ]
                        },
                        {
                            "explanation": "to add something to an old thread (= a series of messages and replies) on an online message board so that it moves up to the top, and people notice it and start replying to it again: ",
                            "examples": [
                                "I'm bumping this old thread because I have a few relevant recommendations.",
                                "I'm glad you bumped this thread back up because I hadn't seen it and I'm going through the exact same thing."
                            ]
                        },
                        {
                            "explanation": "to increase something: ",
                            "examples": [
                                "Increased demand has led to businesses bumping prices. ",
                                "Minimum wage in the state was bumped 55 cents an hour to $5.85. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}