{
    "word": "burlesque",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bɜːˈlesk"
                            ],
                            "us": [
                                "bɝːˈlesk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a type of writing or acting that tries to make something serious seem stupid and funny: ",
                            "examples": [
                                "The dance scene is in part a burlesque of Bollywood films.",
                                "The political burlesques are not very hard-hitting and rather bland.",
                                "The comedy is subtle and nuanced; it never tips over into burlesque."
                            ]
                        },
                        {
                            "explanation": "a type of theatre entertainment in the US in the late 19th and early 20th centuries that had funny acts and a striptease (= a performance in which someone removes their clothes): ",
                            "examples": [
                                "He worked for many years in vaudeville and burlesque.",
                                "They describe the show as an old-fashioned musical burlesque."
                            ]
                        },
                        {
                            "explanation": "a modern type of entertainment that includes dancing and striptease (= a performer removing their clothes): ",
                            "examples": [
                                "Naked dancing has become accepted as a form of arty entertainment in the growing fashion for burlesque."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "bɜːˈlesk"
                            ],
                            "us": [
                                "bɝːˈlesk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to or in the style of burlesque entertainment: ",
                            "examples": [
                                "I really like performing, and I wanted to do something burlesque and a little gaudy.",
                                "He worked in night clubs as a burlesque acrobat."
                            ]
                        },
                        {
                            "explanation": "showing or writing about something serious in a way that tries to make it seem stupid and funny: ",
                            "examples": [
                                "The piece she wrote was a burlesque treatment of a religious sermon. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}