{
    "word": "burying",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nbury ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈber.i"
                            ],
                            "us": [
                                "ˈber.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a dead body into the ground: ",
                            "examples": [
                                "His father is buried in the cemetery on the hill."
                            ]
                        },
                        {
                            "explanation": "to put something into a hole in the ground and cover it: ",
                            "examples": [
                                "The dog trotted off to bury its bone.",
                                "buried treasure"
                            ]
                        },
                        {
                            "explanation": "to cover something or someone completely with a large quantity of something: ",
                            "examples": [
                                "If an avalanche strikes, skiers can be buried alive by snow."
                            ]
                        },
                        {
                            "explanation": "If someone says they buried someone, usually a close relation, they mean that the person died: ",
                            "examples": [
                                "She buried both her parents last year.",
                                "No-one should have to bury their child."
                            ]
                        },
                        {
                            "explanation": "to put something in a place where it is difficult or impossible to find or see: ",
                            "examples": [
                                "I found the article buried away in the business section of the newspaper.",
                                "She buried her face in her hands and began to sob."
                            ]
                        },
                        {
                            "explanation": "to try to prevent people from finding out about something that has happened: ",
                            "examples": [
                                "This was an attempt to bury the truth about the senator's death.",
                                "One of the oldest tricks for burying bad news is to release it on the last day of the parliamentary session."
                            ]
                        },
                        {
                            "explanation": "to try to forget an unpleasant experience or try not to feel an unpleasant emotion: ",
                            "examples": [
                                "He'd had to bury his pain over the years.",
                                "Many of us have been hurt in relationships, and a frequent form of defence is to bury your feelings."
                            ]
                        },
                        {
                            "explanation": "to send a ball into the net of a goal with a lot of force: ",
                            "examples": [
                                "He made a zig-zagging run before burying the ball with his left foot.",
                                "Thornton buried the shot into the left-hand side of the net."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}