{
    "word": "busy",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈbɪz.i"
                            ],
                            "us": [
                                "ˈbɪz.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you are busy, you are working hard, or giving your attention to a particular thing: ",
                            "examples": [
                                "Mum was busy in the kitchen.",
                                "The kids are busy with their homework.",
                                "She's busy writing out the wedding invitations.",
                                "I've got plenty of jobs to keep you busy.",
                                "He was too busy talking to notice us come in."
                            ]
                        },
                        {
                            "explanation": "If you are busy, you are not free or available to do something: ",
                            "examples": [
                                "Would you like to come over at the weekend, or are you busy?",
                                "I'm busy on Tuesday morning but we could meet in the afternoon."
                            ]
                        },
                        {
                            "explanation": "A busy place is full of activity or people: ",
                            "examples": [
                                "a busy restaurant",
                                "Their house is near a very busy road."
                            ]
                        },
                        {
                            "explanation": "In a busy period, you have a lot of things to do: ",
                            "examples": [
                                "I have a busy week ahead of me.",
                                "You've had a busy day."
                            ]
                        },
                        {
                            "explanation": "If a phone line is busy, someone is using it: ",
                            "examples": [
                                "I tried calling you but the line was busy."
                            ]
                        },
                        {
                            "explanation": "having too much decoration or too many colours: ",
                            "examples": [
                                "The jacket was a bit too busy for my tastes - I'd prefer something plainer."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈbɪz.i"
                            ],
                            "us": [
                                "ˈbɪz.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make the time pass by doing something: ",
                            "examples": [
                                "I busied myself with tidying up my desk.",
                                "I busied myself in the kitchen and tried hard not to worry. ",
                                "I busied myself with voluntary work and, in time, forgot that I was miserable.",
                                "Anna busied herself in the garden till lunch.",
                                "Tom left the women to talk and busied himself arranging the children's toys.",
                                "My mother busied herself with dinner preparations while my father and brother chatted."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}