{
    "word": "buzz",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "bʌz"
                            ],
                            "us": [
                                "bʌz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a continuous, low sound such as the one a bee makes: ",
                            "examples": [
                                "I can hear an insect buzzing.",
                                "My phone buzzed at five in the morning and woke me."
                            ]
                        },
                        {
                            "explanation": "to press a buzzer in order to get someone's attention: ",
                            "examples": [
                                "I buzzed him but there was no answer.",
                                "The first person to buzz may answer."
                            ]
                        },
                        {
                            "explanation": "to allow someone to enter a place by pressing a button that opens a door and makes a buzzing sound: ",
                            "examples": [
                                "Press the intercom and I'll buzz you in.",
                                "We were buzzed into the lobby.",
                                "A secretary buzzed them up to the conference room on the top floor."
                            ]
                        },
                        {
                            "explanation": "to move around quickly or with a lot of energy: ",
                            "examples": [
                                "Reporters were buzzing around, trying to get the full story.",
                                "From here you can see cars buzzing along the motorway."
                            ]
                        },
                        {
                            "explanation": "(of a place) to be full of people or activity: ",
                            "examples": [
                                "The airport is buzzing as Christmas nears.",
                                "At this time on a Saturday, the restaurant is buzzing with customers.",
                                "The whole town buzzed with rumours."
                            ]
                        },
                        {
                            "explanation": "(of a person or their mind) to be thinking about many different things at the same time: ",
                            "examples": [
                                "I had so many questions - my head was buzzing.",
                                "My mind was buzzing and I just couldn't get to sleep.",
                                "Karina's on great form. She's buzzing with new ideas and projects.",
                                "His mind buzzed with all the possibilities that lay before him."
                            ]
                        },
                        {
                            "explanation": "to talk in an excited way about something: ",
                            "examples": [
                                "Everyone was buzzing about how cool this place was.",
                                "Political bloggers buzzed over this unexpected turn of events.",
                                "Her latest movie has got everyone buzzing."
                            ]
                        },
                        {
                            "explanation": "to be very excited and happy or energetic: ",
                            "examples": [
                                "It's all going really well for me here. I'm buzzing!"
                            ]
                        },
                        {
                            "explanation": "If an aircraft buzzes a place or people, it flies over it or them very low and fast.",
                            "examples": []
                        },
                        {
                            "explanation": "to cut someone's hair very short using a special machine",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "bʌz"
                            ],
                            "us": [
                                "bʌz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a continuous, low sound: ",
                            "examples": [
                                "I heard a buzz and then saw the plane in the distance."
                            ]
                        },
                        {
                            "explanation": "a feeling of excitement, energy, and pleasure that something gives you: ",
                            "examples": [
                                "I love riding fast - it gives me a real buzz.",
                                "I get a buzz out of public speaking."
                            ]
                        },
                        {
                            "explanation": "an exciting, busy atmosphere (= feeling or mood) in a place: ",
                            "examples": [
                                "The streets surrounding the stadium had a buzz about them that hasn't been felt for many years.",
                                "There's a real buzz in the streets of Covent Garden."
                            ]
                        },
                        {
                            "explanation": "excited, usually positive, talk about something or someone: ",
                            "examples": [
                                "There's such a buzz about sustainability now.",
                                "His hairstyles generated more buzz than his music."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}