{
    "word": "call",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɔːl"
                            ],
                            "us": [
                                "kɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give someone or something a name, or to know or address someone by a particular name: ",
                            "examples": [
                                "They've called the twins Edward and Thomas.",
                                "What's that actor called that we saw in the film last night?",
                                "His real name is Jonathan, but they've always called him Johnny.",
                                "What's her new novel called?",
                                "I wish he wouldn't keep calling me \"dear\" - it's so patronizing!"
                            ]
                        },
                        {
                            "explanation": "If a person, especially a child, calls someone names, they address that person with a name that is intended to be offensive: ",
                            "examples": [
                                "Tom's worried that if he wears glasses at school the other children will call him names."
                            ]
                        },
                        {
                            "explanation": "to use a phone to talk to someone: ",
                            "examples": [
                                "He called (you) last night when you were out.",
                                "She called (me) this morning at the office and we had a brief chat.",
                                "I've been calling all morning but I can't get through.",
                                "Do you think we should call the police?"
                            ]
                        },
                        {
                            "explanation": "to make a phone call that is paid for by the person who receives it: ",
                            "examples": [
                                "She got his phone number from another inmate and called collect."
                            ]
                        },
                        {
                            "explanation": "to consider someone or something to be: ",
                            "examples": [
                                "He knows a lot of people, but only one or two that he'd call close friends.",
                                "One sandwich and a lettuce leaf - I don't call that a meal!",
                                "I'm not calling you a liar - I'm just suggesting that you misunderstood the facts of the situation."
                            ]
                        },
                        {
                            "explanation": "to consider something as belonging to you: ",
                            "examples": [
                                "I don't aspire to anything very grand - I just want a place I can call my own."
                            ]
                        },
                        {
                            "explanation": "to say something in a loud voice, especially in order to attract someone's attention, or (of animals) to make a loud, high sound, especially to another animal: ",
                            "examples": [
                                "Someone in the crowd called (out) his name.",
                                "Did you call?",
                                "\"Hey, you! Come over here!\" she called.",
                                "The blackbird called to its mate."
                            ]
                        },
                        {
                            "explanation": "to ask people in a meeting to stop talking so that the meeting can continue: ",
                            "examples": [
                                "She called for order/called the meeting to order."
                            ]
                        },
                        {
                            "explanation": "in American football, to say what the next play will be: ",
                            "examples": [
                                "The coach calls the plays from the sideline."
                            ]
                        },
                        {
                            "explanation": "to describe a sports game as it is happening, especially on radio or television: ",
                            "examples": [
                                "He called the game for ABC."
                            ]
                        },
                        {
                            "explanation": "to ask someone to come to you: ",
                            "examples": [
                                "She called me over to where she was sitting.",
                                "I keep the bedroom door open in case the children call (for) me in the night.",
                                "I was called to an emergency meeting this morning.",
                                "At school she was always being called into the headteacher's office."
                            ]
                        },
                        {
                            "explanation": "to visit someone, especially for a short time: ",
                            "examples": [
                                "The electrician must have called (round) this morning when we were out - there's a note on the door mat."
                            ]
                        },
                        {
                            "explanation": "to decide officially to have a particular event or take particular action: ",
                            "examples": [
                                "The managing director has called a meeting to discuss pay levels.",
                                "The papers are predicting that the prime minister will call an election in the spring.",
                                "It's reckoned that the unions will call a strike if management will not agree to their demands.",
                                "They had to call a halt to (= end) the match because of the heavy rain."
                            ]
                        },
                        {
                            "explanation": "If a sports official calls something, they make a decision about an action by a player or about a shot (= a kick, hit, or throw of the ball): ",
                            "examples": [
                                "The line judge called the ball out.",
                                "The third base umpire called Nixon out at third.",
                                "Baseball umpires still call balls and strikes."
                            ]
                        },
                        {
                            "explanation": "In cricket, if an umpire (= official) calls a bowler (= the player throwing the ball ), they decide that they have bowled a no-ball (= thrown the ball in a way that is not allowed): ",
                            "examples": [
                                "The umpire called him for throwing.",
                                "The umpire called Waqar for a second over-shoulder-high bouncer to Smith in his next over."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɔːl"
                            ],
                            "us": [
                                "kɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of using the phone: ",
                            "examples": [
                                "I got a call from an old college friend last night.",
                                "If there are any calls for me, could you write them down next to the phone?",
                                "I've just got a couple of calls to make.",
                                "That decorator you called about painting the house - did he ever return your call?",
                                "The radio station received a lot of calls complaining about the show's bad language.",
                                "Before six o'clock, calls are charged at peak rate."
                            ]
                        },
                        {
                            "explanation": "the sound an animal makes or the sound of someone shouting something: ",
                            "examples": [
                                "The whale has a very distinctive call.",
                                "She could hear calls for help from inside the burning building.",
                                "I'll be in the next room, so give me a call if you need any help."
                            ]
                        },
                        {
                            "explanation": "the fact of people wanting or needing a particular thing: ",
                            "examples": [
                                "There's not much call for fur coats these days.",
                                "I certainly don't think there's any call for that sort of language, young lady!"
                            ]
                        },
                        {
                            "explanation": "a demand for something to happen: ",
                            "examples": [
                                "Management have so far ignored the union's calls for stricter safety regulations."
                            ]
                        },
                        {
                            "explanation": "a short visit, especially an official one made by someone whose job is connected with health: ",
                            "examples": [
                                "Doctor Seward is out on a call this morning.",
                                "The nurse has got a few calls to make this afternoon.",
                                "I thought I'd pay a call on (= visit) an old friend of mine this weekend."
                            ]
                        },
                        {
                            "explanation": "a decision: ",
                            "examples": [
                                "It was a tough call, but eventually I decided to give up my job.",
                                "The decision to extend Army tours from one year to 15 months was a good call.",
                                "More investment? That's got to be your call - you're the one that's paying!"
                            ]
                        },
                        {
                            "explanation": "a decision by a sports official about an action by a player or a shot (= a throw, hit, or kick of the ball): ",
                            "examples": [
                                "At the start of the second set, he challenged a questionable line call.",
                                "The refs made a number of controversial calls."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}