{
    "word": "canon",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkæn.ən"
                            ],
                            "us": [
                                "ˈkæn.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a Christian priest with special duties in a cathedral",
                            "examples": []
                        },
                        {
                            "explanation": "a rule, principle, or law, especially in the Christian Church",
                            "examples": []
                        },
                        {
                            "explanation": "the writings or other works that are generally agreed to be good, important, and worth studying: ",
                            "examples": [
                                "He has made it into the canon of English poetry.",
                                "She argues that the canon must be opened up to more non-European writers.",
                                "People sometimes think the classical music canon finishes around 1900."
                            ]
                        },
                        {
                            "explanation": "all the writings or other works known to be by a particular person: ",
                            "examples": [
                                "the Shakespearean canon",
                                "This is as important a piece of music as any in the Mahler canon."
                            ]
                        },
                        {
                            "explanation": "a book, TV show, film, etc. that its fans (= people who like it very much) use to base their own stories, activities, etc. on: ",
                            "examples": [
                                "Things fans might produce in honour of a canon include paintings, comics, videos, fan fiction and cosplay.",
                                "Many Harry Potter fans don't consider anything but the published books to be canon."
                            ]
                        },
                        {
                            "explanation": "a piece of music, or a way of singing or chanting in which one voice sings a part and then other voices sing the same part one at a time in a way that is slightly different: ",
                            "examples": [
                                "The phrases are chanted in canon by the monks as a form of meditation. ",
                                "The music teacher taught the class to sing in a canon. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}