{
    "word": "capital",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkæp.ɪ.təl"
                            ],
                            "us": [
                                "ˈkæp.ə.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a city that is the centre of government of a country or smaller political area: ",
                            "examples": [
                                "Australia's capital city is Canberra."
                            ]
                        },
                        {
                            "explanation": "the most important place for a particular business or activity: ",
                            "examples": [
                                "London used to be the financial capital of the world."
                            ]
                        },
                        {
                            "explanation": "a letter of the alphabet in the form and larger size that is used at the beginning of sentences and names: ",
                            "examples": [
                                "Please print your name in capitals.",
                                "A proper noun should start with a capital."
                            ]
                        },
                        {
                            "explanation": "money and possessions, especially a large amount of money used for producing more wealth or for starting a new business: ",
                            "examples": [
                                "She leaves her capital untouched in the bank and lives off the interest.",
                                "We put $20,000 capital into the business, but we're unlikely to see any return for a few years."
                            ]
                        },
                        {
                            "explanation": "the top part of a column",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkæp.ɪ.təl"
                            ],
                            "us": [
                                "ˈkæp.ə.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a letter of the alphabet) in the form and larger size that is used at the beginning of sentences and names: ",
                            "examples": [
                                "Do you write \"calvinist\" with a capital \"C\" or not?"
                            ]
                        },
                        {
                            "explanation": "(of a crime) that can be punished by death; (of a case) involving a crime that can be punished by death: ",
                            "examples": [
                                "In some countries, importing drugs is a capital offence.",
                                "She could face charges of treason, a capital crime.",
                                "As a prosecutor she tried over 800 cases, including capital cases. "
                            ]
                        },
                        {
                            "explanation": "very good or excellent: ",
                            "examples": [
                                "That's a capital idea!"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}