{
    "word": "capture",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkæp.tʃər"
                            ],
                            "us": [
                                "ˈkæp.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to take someone as a prisoner, or to take something into your possession, especially by force: ",
                            "examples": [
                                "Two of the soldiers were killed and the rest were captured.",
                                "Rebel forces captured the city after a week-long battle."
                            ]
                        },
                        {
                            "explanation": "to succeed in getting something when you are competing with other people: ",
                            "examples": [
                                "The Democratic Party candidate captured 70 percent of the vote."
                            ]
                        },
                        {
                            "explanation": "to represent or describe something very accurately using words or images: ",
                            "examples": [
                                "It would be impossible to capture her beauty in a painting."
                            ]
                        },
                        {
                            "explanation": "to record or take a picture of something using a camera: ",
                            "examples": [
                                "A passer-by captured the whole incident on film."
                            ]
                        },
                        {
                            "explanation": "If a computer or similar machine captures information, it takes it in and stores it.",
                            "examples": []
                        },
                        {
                            "explanation": "If something captures your imagination or attention, you feel very interested and excited by it: ",
                            "examples": [
                                "The American drive to land a man on the Moon captured the imagination/attention of the whole world."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkæp.tʃər"
                            ],
                            "us": [
                                "ˈkæp.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "that act of taking someone as a prisoner, or taking something into your possession, especially by force: ",
                            "examples": [
                                "People who commit cybercrime often evade capture.",
                                "They witnessed the capture of the city by rebel troops."
                            ]
                        },
                        {
                            "explanation": "the process of collecting a natural product so that it can be stored or used: ",
                            "examples": [
                                "Rainwater capture will ensure water conservation is a priority."
                            ]
                        },
                        {
                            "explanation": "the act of recording an image, sound, or other information using a computer or camera, or the image or other information that is recorded: ",
                            "examples": [
                                "The device is designed for the capture of visual images. ",
                                "A screen capture of the incident was circulated online."
                            ]
                        },
                        {
                            "explanation": "a photograph; used especially when commenting on a photograph on social media: ",
                            "examples": [
                                "We are sharing this great capture of a rainbow over the city.",
                                "Nice capture!"
                            ]
                        },
                        {
                            "explanation": "(of a computer or similar machine) the act of taking in and storing information: ",
                            "examples": [
                                "It is important to ensure accuracy in the capture of machine interpretable data.",
                                "The company develops information capture software."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}