{
    "word": "card",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɑːd"
                            ],
                            "us": [
                                "kɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small, rectangular piece of card or plastic, often with your signature, photograph, or other information proving who you are, that allows you to do something, such as make a payment, get money from a bank, or enter a particular place: ",
                            "examples": [
                                "I don't have any cash - can I put this on (= pay using) my (credit/charge) card?",
                                "A lot of shops won't accept cheques unless you have a cheque card with you.",
                                "The bank's closed now, but I can get some money out with my (cash) card.",
                                "I don't have any change for the phone but I do have a (phone) card, if that's of any use.",
                                "You usually have to show your (membership) card at the door."
                            ]
                        },
                        {
                            "explanation": "one of a set of 52 small rectangular pieces of stiff paper each with a number and one of four signs printed on it, used in games: ",
                            "examples": [
                                "After dinner, Ted got out a pack of cards",
                                "John shuffled (= mixed up) the cards before he dealt them (out) (= gave them to the players).",
                                "Whist is my favourite card game.",
                                "a card table"
                            ]
                        },
                        {
                            "explanation": "any of a range of games played with cards, such as poker, whist, and bridge: ",
                            "examples": [
                                "I've never been much good at cards."
                            ]
                        },
                        {
                            "explanation": "a rectangular piece of stiff paper, folded in half, with a picture on the front and often a message printed inside, sent on a special occasion: ",
                            "examples": [
                                "anniversary/get-well cards",
                                "It's Steve's birthday on Thursday - I must send him a card."
                            ]
                        },
                        {
                            "explanation": "a \npostcard ",
                            "examples": []
                        },
                        {
                            "explanation": "a small, rectangular piece of stiff paper with information printed on it, especially a person's job title, business address, and phone number: ",
                            "examples": [
                                "Here, let me give you my (business) card."
                            ]
                        },
                        {
                            "explanation": "a small, rectangular piece of stiff paper with a picture of someone or something, especially a sports player, and information about them, for people to collect and exchange with other people: ",
                            "examples": [
                                "I can't believe I'm playing against guys whose cards I collected as a kid. ",
                                "a football/baseball card"
                            ]
                        },
                        {
                            "explanation": "(a piece of) thick stiff paper",
                            "examples": []
                        },
                        {
                            "explanation": "a thin plate inside a computer that contains very small electronic circuits and controls certain operations of the computer: ",
                            "examples": [
                                "a graphics/sound card"
                            ]
                        },
                        {
                            "explanation": "a funny or strange person: ",
                            "examples": [
                                "You're such a card, Patrick!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɑːd"
                            ],
                            "us": [
                                "kɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to ask someone to show you a document, especially an identity card, in order to prove how old they are",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}