{
    "word": "career",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəˈrɪər"
                            ],
                            "us": [
                                "kəˈrɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the job or series of jobs that you do during your working life, especially if you continue to get better jobs and earn more money: ",
                            "examples": [
                                "He's hoping for a career in the police force/as a police officer.",
                                "When he retires he will be able to look back over a brilliant career (= a working life that has been very successful).",
                                "It helps if you can move a few rungs up the career ladder before taking time off to have a baby.",
                                "I took this new job because I felt that the career prospects were much better.",
                                "Judith is very career-minded/-oriented (= gives a lot of attention to her job)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kəˈrɪər"
                            ],
                            "us": [
                                "kəˈrɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a job or position as part of the career that you are trained for and are normally paid to do, rather than being chosen for it as a member or supporter of a government or political party: ",
                            "examples": [
                                "The White House asked the Senate to approve 60 political and career appointees, including a new housing secretary.",
                                "a career diplomat/ambassador"
                            ]
                        },
                        {
                            "explanation": "doing something regularly for most of your life, especially as your main way of making money: ",
                            "examples": [
                                "Even though he already has begun his campaign for re-election, he insists he is not a career politician.",
                                "The perpetrator was a career criminal with a long series of drugs convictions."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kəˈrɪər"
                            ],
                            "us": [
                                "kəˈrɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(especially of a vehicle) to move fast and in a way that is out of control: ",
                            "examples": [
                                "The coach careered down a slope and collided with a bank."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}