{
    "word": "care",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "keər"
                            ],
                            "us": [
                                "ker"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the process of protecting someone or something and providing what that person or thing needs: ",
                            "examples": [
                                "The standard of care at our local hospital is excellent.",
                                "Mira's going to be very weak for a long time after the operation, so she'll need a lot of care.",
                                "Nurseries are responsible for the children in their care."
                            ]
                        },
                        {
                            "explanation": "used as a combining form: ",
                            "examples": [
                                "skincare/healthcare/childcare"
                            ]
                        },
                        {
                            "explanation": "to protect someone or something and provide the things that that person or thing needs: ",
                            "examples": [
                                "Take good care of that girl of yours, Patrick - she's very special."
                            ]
                        },
                        {
                            "explanation": "Children who are in care or who have been taken/put into care are not living with their natural parents but instead with a national or local government organization or another family: ",
                            "examples": [
                                "Both children were taken into care when their parents died."
                            ]
                        },
                        {
                            "explanation": "a system in which people with mental illness or reduced mental ability are allowed to continue living in their own homes, with treatment and help, and are not kept in hospital: ",
                            "examples": [
                                "These people are supposed to be getting care in the community, but it's just not happening."
                            ]
                        },
                        {
                            "explanation": "serious attention, especially to the details of a situation or thing: ",
                            "examples": [
                                "She painted the window frames with great care so that no paint got onto the glass.",
                                "You need to take a bit more care with your spelling.",
                                "The roads are icy, so drive with care.",
                                "Take care on these busy roads (= drive with attention so that you do not have an accident).",
                                "Take care not to (= make certain that you do not) spill your coffee.",
                                "Take care (= make certain) that you don't fall.",
                                "The parcel had a label on it saying \"Handle with care\"."
                            ]
                        },
                        {
                            "explanation": "to deal with something: ",
                            "examples": [
                                "If you can see to the drinks for the party, I'll take care of the food."
                            ]
                        },
                        {
                            "explanation": "a feeling of worry or anxiety: ",
                            "examples": [
                                "She seemed weighed down by all her cares."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "keər"
                            ],
                            "us": [
                                "ker"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to think that something is important and to feel interested in it or upset about it: ",
                            "examples": [
                                "She's never cared very much about her appearance.",
                                "I really don't care whether we go out or not.",
                                "I don't care how much it costs, just buy it.",
                                "\"Was Lorna happy about the arrangements?\" \"I don't know and I don't care.\"",
                                "Your parents are only doing this because they care about (= love) you."
                            ]
                        },
                        {
                            "explanation": "used to emphasize rudely that you are not interested in or worried about something or someone: ",
                            "examples": [
                                "\"Mike's really fed up about it.\" \"I couldn't care less.\""
                            ]
                        },
                        {
                            "explanation": "used to say that you are not interested in or worried about what someone else is doing: ",
                            "examples": [
                                "You can go to the match with Paula, for all I care."
                            ]
                        },
                        {
                            "explanation": "used to say that you are not interested in or worried about something that has happened or that someone has said: ",
                            "examples": [
                                "He said he didn't approve of what I'd done, as if I cared."
                            ]
                        },
                        {
                            "explanation": "used to emphasize rudely that you do not think something is important: ",
                            "examples": [
                                "\"It looks as if we are going to lose.\" \"Who cares?\"."
                            ]
                        },
                        {
                            "explanation": "used in polite offers and suggestions: ",
                            "examples": [
                                "Would you care for a drink?",
                                "Would you care to join us for dinner?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}