{
    "word": "carom",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkær.əm"
                            ],
                            "us": [
                                "ˈker.əm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to hit something and bounce back, especially at an angle: ",
                            "examples": [
                                "She had her final shot carom off the back of the rim. ",
                                "Kids run wild and beach balls carom around the lobby."
                            ]
                        },
                        {
                            "explanation": "to move or change in an uncontrolled way between different places, things, or subjects: ",
                            "examples": [
                                "We must not give the virus the chance to carom wildly through human hosts as it does in a flock of chickens or ducks.",
                                "The book has 84 short chapters that carom from one issue to the next and fail to tackle anything in much depth."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkær.əm"
                            ],
                            "us": [
                                "ˈker.əm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in billiards or pool, an occasion when the ball hits two other balls one after the other: ",
                            "examples": [
                                "A carom can be useful in pool and they’re deadly if used at the right time. "
                            ]
                        },
                        {
                            "explanation": "a game similar to billiards played on a table without pockets: ",
                            "examples": [
                                "The place is mainly a spot for people to play cards or three-ball pocketless carom billiards. "
                            ]
                        },
                        {
                            "explanation": "a rebound (= an occasion when something such as a ball bounces back after hitting a hard surface), especially at an angle: ",
                            "examples": [
                                "The ball took a carom, shooting back toward the right-field line."
                            ]
                        },
                        {
                            "explanation": "a seed that is used as a spice, especially in South Asian cooking: ",
                            "examples": [
                                "The seeds are known as bishop's weed, ajwain and carom.",
                                "Carom seeds, or ajwain as they are called in India, are somewhat similar to thyme in flavour, though more pungent. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}