{
    "word": "carried",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \ncarry ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkær.i"
                            ],
                            "us": [
                                "ˈker.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to hold something or someone with your hands, arms, or on your back and transport it, him, or her from one place to another: ",
                            "examples": [
                                "Would you like me to carry your bag for you?",
                                "She carried her tired child upstairs to bed.",
                                "These books are too heavy for me to carry.",
                                "We only had a small suitcase, so we were able to carry it onto the plane.",
                                "Robson injured his leg in the second half of the match and had to be carried off.",
                                "Thieves broke the shop window and carried off (= removed) jewellery worth thousands of pounds."
                            ]
                        },
                        {
                            "explanation": "to move someone or something from one place to another: ",
                            "examples": [
                                "The bus that was involved in the accident was carrying children to school.",
                                "The Brooklyn Bridge carries traffic across the East River from Brooklyn to Manhattan.",
                                "Police think that the body was carried down the river (= was transported by the flow of the river).",
                                "Underground cables carry electricity to all parts of the city.",
                                "Rubbish left on the beach during the day is carried away (= removed) at night by the tide."
                            ]
                        },
                        {
                            "explanation": "to have something with you all the time: ",
                            "examples": [
                                "Police officers in Britain do not usually carry guns.",
                                "He will carry the memory of the accident with him (= will remember the accident) for ever."
                            ]
                        },
                        {
                            "explanation": "to have something as a part, quality, or result: ",
                            "examples": [
                                "All cigarette packets carry a government health warning.",
                                "Our cars carry a twelve-month guarantee.",
                                "His speech carried so much conviction that I had to agree with him.",
                                "In some countries, murder carries the death penalty.",
                                "I'm afraid my opinion doesn't carry any weight with (= influence) my boss.",
                                "The salesclerk said they didn't carry (= have a supply of) sportswear."
                            ]
                        },
                        {
                            "explanation": "to take something from one person or thing and give it to another person or thing: ",
                            "examples": [
                                "Malaria is a disease carried by mosquitoes."
                            ]
                        },
                        {
                            "explanation": "to support the weight of something without moving or breaking: ",
                            "examples": [
                                "The weight of the cathedral roof is carried by two rows of pillars."
                            ]
                        },
                        {
                            "explanation": "to support, keep in operation, or make a success: ",
                            "examples": [
                                "We can no longer afford to carry people who don't work as hard as they should.",
                                "Luckily they had a very strong actor in the main part and he managed to carry the whole play (= make a success of it through his own performance)."
                            ]
                        },
                        {
                            "explanation": "to win the support, agreement, or sympathy of a group of people: ",
                            "examples": [
                                "The bosses' plans to reorganize the company won't succeed unless they can carry the workforce with them."
                            ]
                        },
                        {
                            "explanation": "to give approval, especially by voting: ",
                            "examples": [
                                "The motion/proposal/resolution/bill was carried by 210 votes to 160."
                            ]
                        },
                        {
                            "explanation": "(of a newspaper or radio or television broadcast) to contain particular information: ",
                            "examples": [
                                "This morning's newspapers all carry the same story on their front page."
                            ]
                        },
                        {
                            "explanation": "to be able to reach or travel a particular distance: ",
                            "examples": [
                                "The sound of the explosion carried for miles.",
                                "The ball carried high into the air and landed the other side of the fence."
                            ]
                        },
                        {
                            "explanation": "to develop or continue something: ",
                            "examples": [
                                "Lenin carried Marx's ideas a stage further by putting them into practice.",
                                "If we carry this argument to its logical conclusion, we realize that further investment is not a good idea.",
                                "She carries tidiness to extremes/to its limits (= she is too tidy).",
                                "We must end here, but we can carry today's discussion forward at our next meeting.",
                                "He always carries his jokes too far (= he continues making jokes when he should have stopped)."
                            ]
                        },
                        {
                            "explanation": "to move your body in a particular way: ",
                            "examples": [
                                "You can tell she's a dancer from the way that she carries herself."
                            ]
                        },
                        {
                            "explanation": "to put a number into another column when doing addition",
                            "examples": []
                        },
                        {
                            "explanation": "to be pregnant with a child: ",
                            "examples": [
                                "It was quite a shock to learn that she was carrying twins.",
                                "I was enormous when I was carrying Josh."
                            ]
                        },
                        {
                            "explanation": "in American football, to carry the ball forward across the field, gaining an advantage for your team: ",
                            "examples": [
                                "Every running back wants to carry the ball.",
                                "Johnson carried 26 times for 202 yards."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}