{
    "word": "case",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "keɪs"
                            ],
                            "us": [
                                "keɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a particular situation or example of something: ",
                            "examples": [
                                "She was suffering from an extreme case of sunburn.",
                                "We have lots of applications from people who want to study here and in each case we consider the candidate very carefully.",
                                "Over a hundred people were injured, in several cases seriously.",
                                "Jobs are hard to find but in his case that's not the problem because he has so much experience.",
                                "I wouldn't normally agree but I'll make an exception in this case.",
                                "The number of new cases of the illness appears to be declining."
                            ]
                        },
                        {
                            "explanation": "because of the mentioned situation: ",
                            "examples": [
                                "There's no coffee left? In that case I'll have tea."
                            ]
                        },
                        {
                            "explanation": "(not) true: ",
                            "examples": [
                                "If that is the case then I will be very disappointed."
                            ]
                        },
                        {
                            "explanation": "also: ",
                            "examples": [
                                "I don't want to go and in any case, I haven't been invited."
                            ]
                        },
                        {
                            "explanation": "because of a possibility of something happening, being needed, etc.: ",
                            "examples": [
                                "I don't think I'll need any money but I'll bring some just in case."
                            ]
                        },
                        {
                            "explanation": "if something happens, or in preparation for when something happens: ",
                            "examples": [
                                "The camping area has ready access to water, in case of fire."
                            ]
                        },
                        {
                            "explanation": "in connection with someone or something, or in the situation of something: ",
                            "examples": [
                                "The law will apply equally to men and women except in the case of maternity leave."
                            ]
                        },
                        {
                            "explanation": "used when a situation is of a particular type: ",
                            "examples": [
                                "She doesn't want to work full-time, it's a case of having to."
                            ]
                        },
                        {
                            "explanation": "an example that shows that what you are saying is true or helps to explain why you are saying it: ",
                            "examples": [
                                "Lack of communication causes serious problems and their marriage is a case in point."
                            ]
                        },
                        {
                            "explanation": "in the same way that it happens: ",
                            "examples": [
                                "As is often the case with children, Amy was completely better by the time the doctor arrived."
                            ]
                        },
                        {
                            "explanation": "one of the stated possibilities that is true: ",
                            "examples": [
                                "When the election is called in April, or June, as the case might be, we shall be ready for it."
                            ]
                        },
                        {
                            "explanation": "a problem, a series of events, or a person being dealt with by police, doctors, lawyers, etc.: ",
                            "examples": [
                                "The detective on the case (= responsible for solving it) has been suspended from duty.",
                                "Several social workers have looked into the child's case.",
                                "When he first went for treatment at the hospital he seemed to be a hopeless case (= a person who could not be cured)."
                            ]
                        },
                        {
                            "explanation": "a matter to be decided by a judge in a law court: ",
                            "examples": [
                                "a murder case",
                                "The case will go before the European Court next month.",
                                "She accused her employer of unlawful dismissal and won/lost her case."
                            ]
                        },
                        {
                            "explanation": "a container or box for storing something in: ",
                            "examples": [
                                "The telescope comes with a case.",
                                "She took her violin out of its case.",
                                "The flag is on display inside a glass case."
                            ]
                        },
                        {
                            "explanation": "a large, rectangular container with a handle, for carrying clothes and possessions while travelling: ",
                            "examples": [
                                "Will you bring your cases out to the car?",
                                "He went upstairs to pack his case."
                            ]
                        },
                        {
                            "explanation": "a box holding twelve or more bottles of wine or another type of drink, or the bottles and their contents: ",
                            "examples": [
                                "He bought his brother a case of wine for his birthday.",
                                "Can you get some more lemonade? We've drunk the whole case."
                            ]
                        },
                        {
                            "explanation": "arguments, facts, and reasons in support of or against something: ",
                            "examples": [
                                "There's a good case for/against bringing in new regulations.",
                                "The case against cigarette advertising is becoming stronger all the time.",
                                "She's very busy so don't overstate the case - just give her the facts."
                            ]
                        },
                        {
                            "explanation": "in some languages, any of the various forms of a noun, pronoun, or adjective that show the work it does in a sentence, for example by a special word ending: ",
                            "examples": [
                                "The definite article is not standard before a noun in the vocative case.",
                                "\"He\" and \"him\" express different grammatical cases.",
                                "Cases can evolve as a language evolves (for instance, in Ancient Greek, the locative case merged with the dative case)."
                            ]
                        },
                        {
                            "explanation": "each of the two forms, capital or small, in which a letter of the alphabet may be written or printed: ",
                            "examples": [
                                "upper-case/lower-case letters"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "keɪs"
                            ],
                            "us": [
                                "keɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to look at a place with the intention of stealing from it later: ",
                            "examples": [
                                "He looked around shiftily, as if he was casing the joint."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}