{
    "word": "catchup",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkætʃ.ʌp"
                            ],
                            "us": [
                                "ˈkætʃ.ʌp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a meeting or conversation in which people discuss what has happened since the last time that they met: ",
                            "examples": [
                                "I'm seeing my boss for a catch-up next week.",
                                "Whether it's an after-work dinner, a catchup with friends or family, or a romantic meal for two, this restaurant has what you need."
                            ]
                        },
                        {
                            "explanation": "the process of reaching the same standard, stage, or level as someone or something else: ",
                            "examples": [
                                "These companies have a lot of catch-up to do, and whole product lines to replace with modern technology.",
                                "This is a much needed catch-up after years of underinvestment."
                            ]
                        },
                        {
                            "explanation": "to try to reach the same standard, stage, or level as others after you have fallen behind them: ",
                            "examples": [
                                "They raced ahead into new markets, leaving other companies to play catch-up.",
                                "England had to play catchup, twice overcoming one-goal deficits."
                            ]
                        },
                        {
                            "explanation": "→ \ncatch-up TV : ",
                            "examples": [
                                "You can watch it on catch-up."
                            ]
                        },
                        {
                            "explanation": "another spelling of \nketchup : ",
                            "examples": [
                                "The burger has catchup and mustard."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkætʃ.ʌp"
                            ],
                            "us": [
                                "ˈkætʃ.ʌp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe something that helps you reach the same standard, stage, or level as others, usually after you have missed something such as lessons or opportunities to practise: ",
                            "examples": [
                                "If there is a shortfall, you may be required to make hefty catch-up payments.",
                                "catchup classes/sessions"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}