{
    "word": "censor",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsen.sər"
                            ],
                            "us": [
                                "ˈsen.sɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person responsible for examining books, films, works of art, or communications, and deciding whether to prevent parts or the whole of them from being seen or made available to the public because they are considered to be offensive or harmful, or because they contain information that someone wishes to keep secret, often for political reasons: ",
                            "examples": [
                                "Military censors prevented the publication of some details.",
                                "a government censor"
                            ]
                        },
                        {
                            "explanation": "a computer tool used to hide parts of a text, image, recording or communication, or to prevent it from being shared: ",
                            "examples": [
                                "They try to filter out offensive posts using automatic censors."
                            ]
                        },
                        {
                            "explanation": "the part of a person’s mind that stops them from doing or saying things that they want to do or say, if those things would be unsuitable: ",
                            "examples": [
                                "The show was accused of exploiting insecure people who lack an internal censor."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsen.sər"
                            ],
                            "us": [
                                "ˈsen.sɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to prevent part or the whole of a book, film, work of art, document, or other kind of communication from being seen or made available to the public, because it is considered to be offensive or harmful, or because it contains information that someone wishes to keep secret, often for political reasons: ",
                            "examples": [
                                "The book was heavily censored when first published.",
                                "Is it possible to censor the internet?"
                            ]
                        },
                        {
                            "explanation": "to stop yourself from doing or saying things that you want to do or say, but that you know would be unsuitable: ",
                            "examples": [
                                "She is brutally frank, and doesn't censor herself in any way.",
                                "I don't censor myself and if people don't like what I write, well, they can stop reading it.",
                                "I don't like having to censor myself. It makes for very dull writing.",
                                "His perceived reluctance to censor himself may yet turn out to be his great strength.",
                                "Her views proved to be very controversial and, in time, she learned to censor herself."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}