{
    "word": "certain",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsɜː.tən"
                            ],
                            "us": [
                                "ˈsɝː.tən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having no doubt or knowing exactly that something is true, or known to be true, correct, exact, or effective: ",
                            "examples": [
                                "Are you absolutely certain (that) you gave them the right number?",
                                "I feel certain (that) you're doing the right thing.",
                                "You should make certain (that) everyone understands the instructions.",
                                "The police seem certain (that) they will find the people responsible for the attack.",
                                "I'm not certain how much it will cost.",
                                "He was quite certain about/of his attacker's identity.",
                                "One thing is certain - she won't resign willingly."
                            ]
                        },
                        {
                            "explanation": "to know or say something without doubt: ",
                            "examples": [
                                "I don't know for certain if she's coming."
                            ]
                        },
                        {
                            "explanation": "impossible to avoid or extremely likely: ",
                            "examples": [
                                "The population explosion is certain to cause widespread famine.",
                                "Oil prices are certain to rise following the agreement to limit production.",
                                "After all his hard work, he's certain to pass his exams.",
                                "The team looks almost certain to win the match.",
                                "It is virtually certain (that) she will win the gold medal.",
                                "Even if a ceasefire can be agreed, how can they make certain (that) neither side breaks it?",
                                "Cancer sufferers no longer face certain death as they once did.",
                                "This scandal will mean certain defeat for the party in the election."
                            ]
                        },
                        {
                            "explanation": "named but neither famous nor known well: ",
                            "examples": [
                                "I had lunch today with a certain George Michael - not the George Michael, I should explain."
                            ]
                        },
                        {
                            "explanation": "limited: ",
                            "examples": [
                                "I like modern art to a certain extent/degree, but I don't like the really experimental stuff."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "ˈsɜː.tən"
                            ],
                            "us": [
                                "ˈsɝː.tən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "particular but not named or described: ",
                            "examples": [
                                "We have certain reasons for our decision, which have to remain confidential.",
                                "Do you think war is justifiable in certain circumstances?",
                                "Certain members of the audience may disagree with what I'm about to say."
                            ]
                        },
                        {
                            "explanation": "used before a noun when it is difficult to describe something exactly or give its exact amount: ",
                            "examples": [
                                "The song has a certain appeal, but I'm not sure what it is.",
                                "I felt a certain sense of joy that his candidacy had failed.",
                                "I must admit that she has a certain glamour about her.",
                                "For all his fine qualities, he lacked a certain self-restraint.",
                                "It's an entertaining movie, but there's a certain predictability about it."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "pronoun",
                        "ipa": {
                            "uk": [
                                "ˈsɜː.tən"
                            ],
                            "us": [
                                "ˈsɝː.tən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "some: ",
                            "examples": [
                                "Certain of the candidates were well below the usual standard, but others were very good indeed."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}