{
    "word": "chain",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʃeɪn"
                            ],
                            "us": [
                                "tʃeɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a series of things of the same type connected in a line, or a series of people standing in a line: ",
                            "examples": [
                                "The synthetic polymer is a plastic composed of long chains of molecules.",
                                "As part of the centenary celebrations a chain of beacons was lit across the country.",
                                "Peace campaigners formed a chain around the military base."
                            ]
                        },
                        {
                            "explanation": "a line of connected mountains: ",
                            "examples": [
                                "The Rockies are a mountain chain in the western USA.",
                                "These peaks are all part of the same Himalaya chain."
                            ]
                        },
                        {
                            "explanation": "a set of connected events, usually where one causes the next: ",
                            "examples": [
                                "His resignation was followed by a remarkable chain of events.",
                                "In the story, a chain of cause and effect leads us on an emotional journey of two families.",
                                "Intervention like this can break the chain of debt and worry."
                            ]
                        },
                        {
                            "explanation": "a group of shops, restaurants, hotels, or other businesses owned by the same company : ",
                            "examples": [
                                "The supermarket chain announced that it was cutting the cost of all its fresh and frozen meat.",
                                "She has built up a chain of 180 bookshops across the country.",
                                "I prefer to shop at independent shops rather than chains. "
                            ]
                        },
                        {
                            "explanation": "(a length of) rings usually made of metal that are connected together and used for fastening, pulling, supporting, or limiting freedom, or as jewellery: ",
                            "examples": [
                                "The gates were locked with a padlock and a heavy steel chain.",
                                "Put the chain on the door if you are alone in the house.",
                                "Mary was wearing a beautiful silver chain around her neck."
                            ]
                        },
                        {
                            "explanation": "another word for \nsnow chains : ",
                            "examples": [
                                "Bear in mind that you can only use chains where snow or ice protects the road surface from damage."
                            ]
                        },
                        {
                            "explanation": "a series of metal rings that are attached to two posts, used in American football to measure the distance between two points on the field : ",
                            "examples": [
                                "The referees had to bring out the chains to determine if the ball carrier got a first down. "
                            ]
                        },
                        {
                            "explanation": "tied with chains: ",
                            "examples": [
                                "The hostages were kept in chains for 23 hours a day."
                            ]
                        },
                        {
                            "explanation": "a fact or situation that limits a person's freedom: ",
                            "examples": [
                                "At last the country has freed itself from the chains of the authoritarian regime."
                            ]
                        },
                        {
                            "explanation": "a situation in which someone selling a house cannot complete the sale because the person who wants to buy it needs to sell their house first: ",
                            "examples": [
                                "Some sellers refuse to exchange contracts with buyers who are in a chain."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃeɪn"
                            ],
                            "us": [
                                "tʃeɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fasten someone or something using a chain: ",
                            "examples": [
                                "It's so cruel to keep a pony chained up like that all the time.",
                                "They chained themselves to lampposts in protest at the judge's decision."
                            ]
                        },
                        {
                            "explanation": "to join objects together so that they form one long connected object: ",
                            "examples": [
                                "The beads are chained together in 7-foot lengths. ",
                                "He succeeded in chaining together a long string of synthetic genes to re-create a portion of the DNA of a simple bacterium. "
                            ]
                        },
                        {
                            "explanation": "to connect things so that they happen together, one after another: ",
                            "examples": [
                                "The system allows you to send individual commands or chain them together.",
                                "These filters can be chained to each other to create sequences of filters.",
                                "The second operation may be chained with the first operation, or performed separately."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}