{
    "word": "challenge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtʃæl.ɪndʒ"
                            ],
                            "us": [
                                "ˈtʃæl.ɪndʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(the situation of being faced with) something that needs great mental or physical effort in order to be done successfully and therefore tests a person's ability: ",
                            "examples": [
                                "Finding a solution to this problem is one of the greatest challenges faced by scientists today.",
                                "You know me - I like a challenge.",
                                "It's going to be a difficult job but I'm sure she'll rise to the challenge."
                            ]
                        },
                        {
                            "explanation": "an invitation to compete or take part, especially in a game or argument: ",
                            "examples": [
                                "\"I bet you can't eat all that food on your plate.\" \"Is that a challenge?\"",
                                "She issued a challenge to her rival candidates to take part in a public debate."
                            ]
                        },
                        {
                            "explanation": "an invitation to do something difficult, funny, or embarrassing, especially on social media, often as a way of raising money for a good cause: ",
                            "examples": [
                                "The Ice Bucket Challenge, in which people filmed themselves being doused with icy water, raised awareness and over $100 million for the ALS Association."
                            ]
                        },
                        {
                            "explanation": "asking if something is true or legal: ",
                            "examples": [
                                "The result of the vote poses a serious challenge to the government's credibility.",
                                "Because of the way this research was conducted, its findings are open to challenge."
                            ]
                        },
                        {
                            "explanation": "an instruction given by a soldier or guard at a border or gate, telling someone to stand still and say their name and reasons for being there",
                            "examples": []
                        },
                        {
                            "explanation": "the act of refusing to accept someone as a member of a jury: ",
                            "examples": [
                                "A challenge to a member of the jury should be made before the trial begins."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtʃæl.ɪndʒ"
                            ],
                            "us": [
                                "ˈtʃæl.ɪndʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to invite someone to compete or take part, especially in a game or argument: ",
                            "examples": [
                                "Tina has challenged me to a game of poker"
                            ]
                        },
                        {
                            "explanation": "to question if something is true or legal: ",
                            "examples": [
                                "Children challenge their parents' authority far more nowadays than they did in the past."
                            ]
                        },
                        {
                            "explanation": "to test someone's ability or determination",
                            "examples": []
                        },
                        {
                            "explanation": "to tell someone at a border or gate to stand still and say their name and reasons for being there",
                            "examples": []
                        },
                        {
                            "explanation": "to refuse to accept someone as a member of a jury",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}