{
    "word": "champagne",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃæmˈpeɪn"
                            ],
                            "us": [
                                "ʃæmˈpeɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an expensive white or pink fizzy (= with bubbles) wine made in the Champagne area of Eastern France. Champagne is often drunk to celebrate something: ",
                            "examples": [
                                "We always celebrate our wedding anniversary with a bottle of champagne.",
                                "The champagne corks were popping (= bottles of champagne were opened) when Guy got his new job.",
                                "The cool climate and chalky soil are ideal for producing Champagne."
                            ]
                        },
                        {
                            "explanation": "a fizzy (= with bubbles) wine or drink that looks similar to champagne: ",
                            "examples": [
                                "There is non-alcoholic elderflower champagne for those that prefer it."
                            ]
                        },
                        {
                            "explanation": "a pale gold colour similar to the colour of champagne: ",
                            "examples": [
                                "Make your eyes twinkle with neutral eye shadow shades like silver or champagne.",
                                "This stylish phone is available in chic shades such as smoke, charcoal and champagne."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ʃæmˈpeɪn"
                            ],
                            "us": [
                                "ʃæmˈpeɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a pale gold colour similar to the colour of champagne: ",
                            "examples": [
                                "She has three beautiful silk blouses—one dove grey, one champagne, and one sky blue.",
                                "This season, retailers say champagne shades are popular for shoes. "
                            ]
                        },
                        {
                            "explanation": "A champagne event is one at which champagne is served: ",
                            "examples": [
                                "He hosted a champagne reception for the cast and crew when they finished filming.",
                                "Her fiancé treated her to a champagne breakfast.",
                                "She was recovering from a night of champagne partying in nightclubs."
                            ]
                        },
                        {
                            "explanation": "A champagne life involves a lot of expensive pleasures: ",
                            "examples": [
                                "He turned his back on his champagne lifestyle when he got married.",
                                "Her champagne life in top hotels was funded by crime. ",
                                "Imitation designer clothes are aimed at those with champagne tastes but a beer budget."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}