{
    "word": "channel",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtʃæn.əl"
                            ],
                            "us": [
                                "ˈtʃæn.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a television or radio station (= an organization that broadcasts television or radio programmes): ",
                            "examples": [
                                "a cable/terrestrial/satellite channel",
                                "a music/movie/news/shopping/sports channel",
                                "the news on Channel 4",
                                "She switched/turned to another channel to watch football.",
                                "Millions tune in to our channel every morning to hear the local news."
                            ]
                        },
                        {
                            "explanation": "a range of frequencies (= the numbers of waves produced within a particular period, especially one second) used to broadcast signals or radio or television programmes, especially those used by a particular station: ",
                            "examples": [
                                "Pilots are supposed to monitor one of two emergency radio channels in case they need to communicate with fighter interceptors.",
                                "They broadcast on high-frequency channels."
                            ]
                        },
                        {
                            "explanation": "a passage for water or other liquids to flow along, or a part of a river or other area of water that is deep and wide enough to provide a route for ships to travel along: ",
                            "examples": [
                                "There are drainage/irrigation channels all over this flat agricultural land.",
                                "The boats all have to pass through this narrow channel."
                            ]
                        },
                        {
                            "explanation": "the area of sea that separates England from France: ",
                            "examples": [
                                "We're going to have a day-trip across the Channel.",
                                "We took the car to France overnight on a (cross-)channel ferry."
                            ]
                        },
                        {
                            "explanation": "a way of communicating with people or getting something done: ",
                            "examples": [
                                "We must open the channels of communication between the two countries.",
                                "The government pursued every diplomatic/official channel to free the hostages.",
                                "Complaints should be made through the proper/usual channels."
                            ]
                        },
                        {
                            "explanation": "an electric circuit (= a closed system through which electricity can flow) that allows a signal to travel: ",
                            "examples": [
                                "For higher sound resolution, two of the audio channels can be combined. "
                            ]
                        },
                        {
                            "explanation": "a way of making a product, information, etc. available: ",
                            "examples": [
                                "The insurer sells its products through a variety of distribution channels, including banks."
                            ]
                        },
                        {
                            "explanation": "a route or way out of an airport or port where travellers' bags are examined: ",
                            "examples": [
                                "If you have nothing to declare, go through the green channel.",
                                "Goods to declare - use the red channel."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtʃæn.əl"
                            ],
                            "us": [
                                "ˈtʃæn.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US usually"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to direct something into a particular place or situation: ",
                            "examples": [
                                "Ditches were constructed to channel water away from the buildings.",
                                "If she could only channel all that energy into something useful.",
                                "A lot of money has been channelled into research in that particular field."
                            ]
                        },
                        {
                            "explanation": "to behave like or copy another person, so that you almost seem to be that other person: ",
                            "examples": [
                                "The band were dressed in 1960s outfits and seemed to be channelling the Beatles."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}