{
    "word": "chance",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʃɑːns"
                            ],
                            "us": [
                                "tʃæns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion that allows something to be done: ",
                            "examples": [
                                "I didn't get/have a chance to speak to her.",
                                "If you give me a chance to speak, I'll explain.",
                                "Society has to give prisoners a second chance when they come out of jail.",
                                "He left and I missed my chance to say goodbye to him.",
                                "I'd go now given half a chance (= if I had the slightest opportunity)."
                            ]
                        },
                        {
                            "explanation": "the level of possibility that something will happen: ",
                            "examples": [
                                "You'd have a better chance/more chance of passing your exams if you worked a bit harder.",
                                "There's a good chance (that) I'll have this essay finished by tomorrow.",
                                "There's a slim/slight chance (that) I might have to go to Manchester next week.",
                                "If we hurry, there's still an outside (= very small) chance of catching the plane.",
                                "\"Is there any chance of speaking to him?\" \"Not a/No chance, I'm afraid.\"",
                                "I don't think I stand/have a chance of winning.",
                                "John thinks they're in with a chance (= they have a possibility of doing or getting what they want).",
                                "Her resignation has improved my chances of promotion.",
                                "What are her chances of survival?",
                                "What are the chances that they'll win?"
                            ]
                        },
                        {
                            "explanation": "a possibility that something negative will happen: ",
                            "examples": [
                                "I'm delivering my work by hand - I'm not taking any chances.",
                                "There's a chance of injury in almost any sport."
                            ]
                        },
                        {
                            "explanation": "the force that causes things to happen without any known cause or reason for doing so: ",
                            "examples": [
                                "Roulette is a game of chance.",
                                "I got this job completely by chance.",
                                "It was pure/sheer chance (that) we met.",
                                "We must double-check everything and leave nothing to chance."
                            ]
                        },
                        {
                            "explanation": "used to ask a question or request in a polite way: ",
                            "examples": [
                                "Are you Hungarian, by any chance?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃɑːns"
                            ],
                            "us": [
                                "tʃæns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to risk something: ",
                            "examples": [
                                "You'd be a fool to chance your life savings on a single investment."
                            ]
                        },
                        {
                            "explanation": "to happen or do something by chance: ",
                            "examples": [
                                "They chanced to be in the restaurant when I arrived.",
                                "I chanced on/upon (= found unexpectedly) some old love letters in a drawer.",
                                "Ten years after leaving school, we chanced on/upon (= unexpectedly met) each other in Regent Street."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "tʃɑːns"
                            ],
                            "us": [
                                "tʃæns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "happening in a way that is not planned or does not have any known cause or reason: ",
                            "examples": [
                                "Her chance discovery of the letters led to their publication.",
                                "a chance meeting/encounter"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}