{
    "word": "change",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃeɪndʒ"
                            ],
                            "us": [
                                "tʃeɪndʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to exchange one thing for another thing, especially of a similar type: ",
                            "examples": [
                                "She's just changed jobs.",
                                "Let's change the subject (= talk about something different)."
                            ]
                        },
                        {
                            "explanation": "to make or become different: ",
                            "examples": [
                                "I almost didn't recognize her - she'd changed so much.",
                                "That was 20 years ago and things have changed since then.",
                                "Nothing changes, does it - I've been away two years and the office still looks exactly the same.",
                                "People have changed their diets a lot over the past few years.",
                                "I'm going to change my hairstyle."
                            ]
                        },
                        {
                            "explanation": "to take something you have bought back to a shop and exchange it for something else: ",
                            "examples": [
                                "I had to change those trousers I bought for (= take them back to the shop in order to get) a bigger pair."
                            ]
                        },
                        {
                            "explanation": "to form a new opinion or make a new decision about something that is different from your old one: ",
                            "examples": [
                                "If you change your mind about coming tonight, just give me a call."
                            ]
                        },
                        {
                            "explanation": "to improve: ",
                            "examples": [
                                "Her attitude has definitely changed for the better since she started this new job."
                            ]
                        },
                        {
                            "explanation": "to improve the bad parts of your behaviour: ",
                            "examples": [
                                "If he wants to carry on living here, he's going to have to change his ways and learn to be a bit less messy."
                            ]
                        },
                        {
                            "explanation": "to get off a train, bus, etc. and catch another in order to continue a journey: ",
                            "examples": [
                                "I had to change (trains) twice to get there.",
                                "Change at Peterborough for York."
                            ]
                        },
                        {
                            "explanation": "to get or give money in exchange for money, either because you want it in smaller units, or because you want the same value in foreign money: ",
                            "examples": [
                                "Could you change a £10 note (for two fives), please?",
                                "Could you change a £5 note for me?",
                                "I need to change my dollars for/into English money."
                            ]
                        },
                        {
                            "explanation": "to remove one set of clothes and put a different set on yourself or a young child, especially a baby, or to remove dirty sheets from a bed and put clean ones on it: ",
                            "examples": [
                                "You don't need to change - you look great as you are.",
                                "I'll just change into (= get dressed in) something a bit smarter.",
                                "Give me five minutes to change out of (= remove) my work clothes and I'll come out with you.",
                                "How often do you think he changes his shirt?",
                                "Could you change the baby (= the baby's nappy)?",
                                "I've changed the sheets/the bed (= the sheets on the bed) in the guest room."
                            ]
                        },
                        {
                            "explanation": "When the wind or the tide (= the rise and fall of the sea) changes, it starts to move in a different direction: ",
                            "examples": [
                                "The tide is starting to change."
                            ]
                        },
                        {
                            "explanation": "to put a vehicle into a different gear, usually in order to change the speed at which it is moving: ",
                            "examples": [
                                "to change gear",
                                "I changed into fourth (gear).",
                                "Change down to go round the corner."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʃeɪndʒ"
                            ],
                            "us": [
                                "tʃeɪndʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of becoming different, or the result of something becoming different: ",
                            "examples": [
                                "Let me know if there's any change in the situation.",
                                "We're living in a time of great change.",
                                "We need a change of government.",
                                "a change in lifestyle",
                                "They've made a lot of changes to the house.",
                                "The new management will make fundamental/radical/sweeping changes (= do things in a very different way)."
                            ]
                        },
                        {
                            "explanation": "something that is pleasant or interesting because it is unusual or new: ",
                            "examples": [
                                "It's nice to see her smile for a change.",
                                "\"Shall we we eat in the garden?\" \"Why not - it'll make a change.\"",
                                "We've always had a red car - it's time we had a change!"
                            ]
                        },
                        {
                            "explanation": "a new situation: ",
                            "examples": [
                                "She'd been with the same company for too many years and felt she needed a change of scene, so she applied for a job as a stage manager."
                            ]
                        },
                        {
                            "explanation": "money in the form of coins rather than notes: ",
                            "examples": [
                                "She gave me €5 in change.",
                                "My dad always used to carry a lot of loose/small change (= coins) in his pocket."
                            ]
                        },
                        {
                            "explanation": "smaller units of money given in exchange for larger units of the same amount: ",
                            "examples": [
                                "Do you have change for a 20-dollar bill?"
                            ]
                        },
                        {
                            "explanation": "the money that is returned to someone who has paid for something that costs less than the amount that they gave: ",
                            "examples": [
                                "I think you've given me the wrong change."
                            ]
                        },
                        {
                            "explanation": "the action of putting on different clothes: ",
                            "examples": [
                                "She did a quick change before going on TV."
                            ]
                        },
                        {
                            "explanation": "a set of clothes as well as the ones that you are wearing: ",
                            "examples": [
                                "You'll need a change of clothes if you're staying overnight."
                            ]
                        },
                        {
                            "explanation": "the action of getting off a train, bus, etc. and catching another in order to continue a journey: ",
                            "examples": [
                                "I hate journeys where you've got a lot of changes."
                            ]
                        },
                        {
                            "explanation": "another name for a \nchangeup : ",
                            "examples": [
                                "He mixes his fastball in with a change and a slider."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}