{
    "word": "chaperone",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈʃæp.ə.rəʊn"
                            ],
                            "us": [
                                "ˈʃæp.ɚ.oʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(especially in the past) an older person, especially a woman, who stays with and takes care of a younger woman who is not married when she is in public: ",
                            "examples": [
                                "She asked me to go to the cinema with her and Andrew, I think as a sort of chaperone."
                            ]
                        },
                        {
                            "explanation": "a female nurse who is in the same room when a female patient is examined by a male doctor, or a police officer who protects a person injured by a criminal when they are in public",
                            "examples": []
                        },
                        {
                            "explanation": "an older person who is present at a social event for young people to encourage correct behaviour: ",
                            "examples": [
                                "Several parents acted as chaperones for the school dance."
                            ]
                        },
                        {
                            "explanation": "an adult who takes care of child actors when they are working: ",
                            "examples": [
                                "Her mother and sister acted as chaperones during filming."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈʃæp.ə.rəʊn"
                            ],
                            "us": [
                                "ˈʃæp.ɚ.oʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(especially in the past) to stay with and take care of a young woman who is not married when she is in public: ",
                            "examples": [
                                "Do you trust him on your own or do you want me to chaperone you?"
                            ]
                        },
                        {
                            "explanation": "to be present as an adult at a social event for young people to encourage correct behaviour: ",
                            "examples": [
                                "Several parents volunteered to chaperone class field trips."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}