{
    "word": "charging",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \ncharge ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃɑːdʒ"
                            ],
                            "us": [
                                "tʃɑːrdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to ask an amount of money for something, especially a service or activity: ",
                            "examples": [
                                "How much/What do you charge for a haircut and blow-dry?",
                                "The bank charged commission to change my traveller's cheques.",
                                "They charge you $20 just to get in the nightclub.",
                                "The local museum doesn't charge for admission."
                            ]
                        },
                        {
                            "explanation": "to record an amount that a customer has spent for them to pay at a later time, according to an agreement between a business and the customer: ",
                            "examples": [
                                "Charge the bill to my account, please.",
                                "Shall we charge the flowers to your account?"
                            ]
                        },
                        {
                            "explanation": "(of the police) to make a formal statement saying that someone is accused of a crime: ",
                            "examples": [
                                "She's been charged with murder.",
                                "She is charged with murdering her husband."
                            ]
                        },
                        {
                            "explanation": "to publicly accuse someone of doing something bad: ",
                            "examples": [
                                "The paper charged her with using the company's money for her own purposes."
                            ]
                        },
                        {
                            "explanation": "to move forward quickly and violently, especially towards something that has caused difficulty or anger: ",
                            "examples": [
                                "The bull lowered its horns and charged.",
                                "The violence began when the police charged (at) a crowd of demonstrators."
                            ]
                        },
                        {
                            "explanation": "to hurry from one place to another: ",
                            "examples": [
                                "I've been charging about/around all day and I'm exhausted.",
                                "He came charging up the stairs to tell me the good news."
                            ]
                        },
                        {
                            "explanation": "to put enough explosive into a gun to fire it once",
                            "examples": []
                        },
                        {
                            "explanation": "to order someone to do something: ",
                            "examples": [
                                "He was charged with taking care of the premises."
                            ]
                        },
                        {
                            "explanation": "When a judge charges a jury, he or she explains the details of the law to them.",
                            "examples": []
                        },
                        {
                            "explanation": "to put electricity into an electrical device such as a battery: ",
                            "examples": [
                                "She drove the car round the block to charge (up) its batteries.",
                                "It's not working - I don't think the battery is charging."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}