{
    "word": "character",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkær.ək.tər"
                            ],
                            "us": [
                                "ˈker.ək.tɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the particular combination of qualities in a person or place that makes them different from others: ",
                            "examples": [
                                "Politeness is traditionally part of the British character.",
                                "It would be very out of character (= not typical) of her to lie.",
                                "One of the joys of being a parent is watching the child's character develop.",
                                "The idea was to modernize various aspects of the house without changing its essential character.",
                                "It's not in his character to be (= he is not usually) jealous."
                            ]
                        },
                        {
                            "explanation": "qualities that are interesting and unusual: ",
                            "examples": [
                                "a hotel of character",
                                "I'd prefer an old place with a bit of character.",
                                "Old books are said to give a room character.",
                                "As people grow older, their faces acquire more character."
                            ]
                        },
                        {
                            "explanation": "the quality of being determined and able to deal with difficult situations: ",
                            "examples": [
                                "She has such strength of character."
                            ]
                        },
                        {
                            "explanation": "a person represented in a film, play, or story: ",
                            "examples": [
                                "The film revolves around three main characters.",
                                "She had Mickey Mouse or some other cartoon/Disney character on her sweater.",
                                "He made his name as a character actor (= an actor who plays unusual and often humorous people)."
                            ]
                        },
                        {
                            "explanation": "a person, especially when you are describing a particular quality that they have: ",
                            "examples": [
                                "She's a curious character - I don't really know what to think of her.",
                                "There were one or two strange-looking characters hanging around the bar."
                            ]
                        },
                        {
                            "explanation": "someone whose behaviour is different from most people's, especially in a way that is interesting or funny: ",
                            "examples": [
                                "Ted's quite a character/a real character - he's 70 now and still riding that motorbike."
                            ]
                        },
                        {
                            "explanation": "a letter, number, or other mark or sign used in writing or printing, or the space one of these takes: ",
                            "examples": [
                                "a string of characters (= a line of marks)",
                                "The address was written in Chinese/Japanese characters (= systems of writing).",
                                "The computer screen on this laptop is 66 characters (= spaces) wide."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}