{
    "word": "charge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃɑːdʒ"
                            ],
                            "us": [
                                "tʃɑːrdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to ask an amount of money for something, especially a service or activity: ",
                            "examples": [
                                "How much/What do you charge for a haircut and blow-dry?",
                                "The bank charged commission to change my traveller's cheques.",
                                "They charge you $20 just to get in the nightclub.",
                                "The local museum doesn't charge for admission."
                            ]
                        },
                        {
                            "explanation": "to record an amount that a customer has spent for them to pay at a later time, according to an agreement between a business and the customer: ",
                            "examples": [
                                "Charge the bill to my account, please."
                            ]
                        },
                        {
                            "explanation": "(of the police) to make a formal statement saying that someone is accused of a crime: ",
                            "examples": [
                                "She's been charged with murder.",
                                "She is charged with murdering her husband."
                            ]
                        },
                        {
                            "explanation": "to publicly accuse someone of doing something bad: ",
                            "examples": [
                                "The paper charged her with using the company's money for her own purposes."
                            ]
                        },
                        {
                            "explanation": "to move forward quickly and violently, especially towards something that has caused difficulty or anger: ",
                            "examples": [
                                "The bull lowered its horns and charged.",
                                "The violence began when the police charged (at) a crowd of demonstrators."
                            ]
                        },
                        {
                            "explanation": "to hurry from one place to another: ",
                            "examples": [
                                "I've been charging about/around all day and I'm exhausted.",
                                "He came charging up the stairs to tell me the good news."
                            ]
                        },
                        {
                            "explanation": "in sports such as basketball, to run into another player in a way that is not allowed by the rules: ",
                            "examples": [
                                "The referee blew the whistle because the forward charged the defender. "
                            ]
                        },
                        {
                            "explanation": "to put enough explosive into a gun to fire it once",
                            "examples": []
                        },
                        {
                            "explanation": "to order someone to do something: ",
                            "examples": [
                                "He was charged with taking care of the premises."
                            ]
                        },
                        {
                            "explanation": "When a judge charges a jury, he or she explains the details of the law to them.",
                            "examples": []
                        },
                        {
                            "explanation": "to put electricity into an electrical device such as a battery: ",
                            "examples": [
                                "She drove the car round the block to charge (up) its batteries.",
                                "It's not working - I don't think the battery is charging."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʃɑːdʒ"
                            ],
                            "us": [
                                "tʃɑːrdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the amount of money that you have to pay for something, especially for an activity or service: ",
                            "examples": [
                                "Is there a charge for children or do they go free?",
                                "There's an admission charge of £5.",
                                "They fixed my watch free of charge."
                            ]
                        },
                        {
                            "explanation": "a formal police statement saying that someone is accused of a crime: ",
                            "examples": [
                                "The 19-year-old will be appearing in court on Thursday where she will face criminal charges.",
                                "He has been arrested on a charge of murder.",
                                "The police brought a charge of theft against him.",
                                "The police have had to drop (= stop) charges against her because they couldn't find any evidence.",
                                "He claimed he had been arrested on a trumped-up (= false) charge."
                            ]
                        },
                        {
                            "explanation": "the act of accusing someone of something bad: ",
                            "examples": [
                                "The president responded angrily to the charge that she had lost touch with her country's people.",
                                "Her refusal to condemn the violence laid/left her open to the charge of positive support for the campaign (= allowed people to say that she supported it)."
                            ]
                        },
                        {
                            "explanation": "being the person who has control of or is responsible for someone or something: ",
                            "examples": [
                                "Who will be in charge of the department when Sophie leaves?"
                            ]
                        },
                        {
                            "explanation": "responsibility for controlling or caring for something: ",
                            "examples": [
                                "Her ex-husband has charge of the children during the week and she has them at the weekend.",
                                "His boss asked him to take charge of the office for a few days while she was away."
                            ]
                        },
                        {
                            "explanation": "a person, especially a child, who is in your care and who you are responsible for",
                            "examples": []
                        },
                        {
                            "explanation": "the amount of explosive to be fired at one time, or the bullet or other explosive object shot from a gun",
                            "examples": []
                        },
                        {
                            "explanation": "an attack in which people or animals suddenly run forward: ",
                            "examples": [
                                "a charge of buffalo/elephants",
                                "a police charge"
                            ]
                        },
                        {
                            "explanation": "an order to do something",
                            "examples": []
                        },
                        {
                            "explanation": "the amount or type of electricity that an electrical device stores or that a substance carries: ",
                            "examples": [
                                "My phone had run out of charge.",
                                "The electron has a negative charge and the proton has a positive charge."
                            ]
                        },
                        {
                            "explanation": "If something is on charge, you are putting an amount of electricity into it: ",
                            "examples": [
                                "Is it all right to leave/put the battery on charge overnight?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}