{
    "word": "cheap",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "tʃiːp"
                            ],
                            "us": [
                                "tʃiːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "costing little money or less than is usual or expected: ",
                            "examples": [
                                "I got a cheap flight at the last minute.",
                                "Food is usually cheaper in supermarkets.",
                                "Children and the elderly are entitled to cheap train tickets.",
                                "The system is simple and cheap to operate.",
                                "During times of mass unemployment, there's a pool of cheap labour for employers to draw from.",
                                "In a war, human life becomes very cheap (= seems to be of little value)."
                            ]
                        },
                        {
                            "explanation": "If a shop or restaurant is cheap, it charges low prices: ",
                            "examples": [
                                "I go to the cheapest hairdresser's in town."
                            ]
                        },
                        {
                            "explanation": "cheap but good or enjoyable: ",
                            "examples": [
                                "There's a restaurant round the corner that serves cheap and cheerful food."
                            ]
                        },
                        {
                            "explanation": "If you get goods on the cheap, you get them for a low price: ",
                            "examples": [
                                "There's a big store near here where you can buy designer clothes on the cheap."
                            ]
                        },
                        {
                            "explanation": "for a low price: ",
                            "examples": [
                                "Do you like this? I got it for cheap."
                            ]
                        },
                        {
                            "explanation": "used to describe goods that are both low in quality and low in price: ",
                            "examples": [
                                "I bought some cheap wine for cooking with.",
                                "He bought some cheap shoes that fell apart after a couple of months."
                            ]
                        },
                        {
                            "explanation": "costing little and of very bad quality: ",
                            "examples": [
                                "They sold cheap and nasty watches at hugely inflated prices."
                            ]
                        },
                        {
                            "explanation": "unwilling to spend money: ",
                            "examples": [
                                "He's so cheap he didn't even buy me a card for my birthday."
                            ]
                        },
                        {
                            "explanation": "If you describe the way a person is dressed as cheap, you mean that it is very obvious that they are trying to sexually attract other people.",
                            "examples": []
                        },
                        {
                            "explanation": "unpleasant and unkind: ",
                            "examples": [
                                "I wish you'd stop making cheap jokes about my friends."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "tʃiːp"
                            ],
                            "us": [
                                "tʃiːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "for little money or for less than is usual: ",
                            "examples": [
                                "I got some shoes cheap in the sale.",
                                "There were some chairs in the market going cheap (= they were not expensive)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}