{
    "word": "cheat",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃiːt"
                            ],
                            "us": [
                                "tʃiːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to behave in a dishonest way in order to get what you want: ",
                            "examples": [
                                "Anyone caught cheating will be immediately disqualified from the exam.",
                                "He cheats at cards?",
                                "She cheated in the test by copying from the boy in front.",
                                "I suspect he cheats on his taxes (= avoids paying as much tax as he should).",
                                "They cheat people by charging too much for building materials."
                            ]
                        },
                        {
                            "explanation": "to have a secret sexual relationship with someone who is not your husband, wife, or usual sexual partner: ",
                            "examples": [
                                "She found out that he'd been cheating on her.",
                                "I've been cheated on before, and it's awful.",
                                "I love my wife and I would never cheat.",
                                "What would you do if you caught your partner cheating?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʃiːt"
                            ],
                            "us": [
                                "tʃiːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who behaves in a dishonest way: ",
                            "examples": [
                                "Trouble broke out in the match when one of the players called a member of the other team a cheat."
                            ]
                        },
                        {
                            "explanation": "something dishonest that makes people believe that something is true when it is not: ",
                            "examples": [
                                "You can use cocoa powder to make the cake rather than chocolate - it's a bit of a cheat, but nobody notices the difference."
                            ]
                        },
                        {
                            "explanation": "a collection of instructions or special information that someone can use to help them play a computer game more successfully: ",
                            "examples": [
                                "the latest game cheats",
                                "cheat codes"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}