{
    "word": "checking",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \ncheck ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃek"
                            ],
                            "us": [
                                "tʃek"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make certain that something or someone is correct, safe, or suitable by examining it, him, or her quickly: ",
                            "examples": [
                                "You should always check your oil, water, and tyres before taking your car on a long trip.",
                                "Customs stopped us and checked (= searched) our bags for alcohol and cigarettes.",
                                "After I'd finished the exam, I checked my answers for mistakes.",
                                "The doctor will call next week to check on your progress.",
                                "I check on (= visits) our elderly neighbour every few days to make sure that he's alright.",
                                "I always check (that) I've shut the windows before I leave the house.",
                                "He double-checked all the doors (= checked them all twice) before leaving the house."
                            ]
                        },
                        {
                            "explanation": "to find out about something: ",
                            "examples": [
                                "I called them yesterday to check when they were arriving.",
                                "If you're near the garage, could you check to see (= ask) if the car's ready?",
                                "If you're unsure of your legal rights, I would check with (= ask) a lawyer."
                            ]
                        },
                        {
                            "explanation": "to stop someone from doing or saying something, or to prevent something from increasing or continuing: ",
                            "examples": [
                                "They have begun to vaccinate children in an attempt to check the spread of the disease."
                            ]
                        },
                        {
                            "explanation": "to give your bags to airport employees to be put on a plane for you, rather than carrying them on and off the plane yourself : ",
                            "examples": [
                                "I got my boarding pass and checked my suitcase.",
                                "Many airlines charge extra for checked bags/baggage/luggage."
                            ]
                        },
                        {
                            "explanation": "to leave something with someone at a particular place, so that they can take care of it for a short time: ",
                            "examples": [
                                "It was hot so we checked our coats before going round the gallery."
                            ]
                        },
                        {
                            "explanation": "If information checks, it agrees with other information: ",
                            "examples": [
                                "Her statement checks with most of the eye-witness reports."
                            ]
                        },
                        {
                            "explanation": "to mark something with a check: ",
                            "examples": [
                                "Check (off) each item on the list as you complete it."
                            ]
                        },
                        {
                            "explanation": "in the game of chess, to put the other player's king under direct attack, so that he or she is forced to defend against the attack in the next move",
                            "examples": []
                        },
                        {
                            "explanation": "in some sports such as ice hockey, to try to make another player lose the ball or puck, for example, by pushing them",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}