{
    "word": "chicken scratch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtʃɪk.ɪn ˌskrætʃ"
                            ],
                            "us": [
                                "ˈtʃɪk.ɪn ˌskrætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "writing that is untidy and difficult to read: ",
                            "examples": [
                                "You might end up with the wrong medication if your pharmacist can’t read your doctor’s chicken scratch.",
                                "Understanding his chicken scratches would've been difficult enough, but his English was really old-fashioned as well.",
                                "Using the chicken-scratch cursive scrawl of his left hand, he began writing."
                            ]
                        },
                        {
                            "explanation": "a thin straight mark on a surface: ",
                            "examples": [
                                "I gave my daughter some chalk and she made chicken scratches and sounded out her name."
                            ]
                        },
                        {
                            "explanation": "food that chickens enjoy, usually a mixture of seeds, dropped on the ground for them to find in addition to their main food: ",
                            "examples": [
                                "Given that chicken scratch is a treat, it should not exceed 10% of their daily intake.",
                                "As its name implies, chicken scratch is something that chickens will scratch around in the dirt to find and eat."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtʃɪk.ɪn ˌskrætʃ"
                            ],
                            "us": [
                                "ˈtʃɪk.ɪn ˌskrætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to write something in an untidy way that is difficult to read: ",
                            "examples": [
                                "Here are a couple of back-of-the-napkin examples that I chicken scratched over lunch. ",
                                "He struggled to read her chicken-scratched notes.",
                                "Most men do not decorate their penmanship. They just chicken-scratch."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}