{
    "word": "class",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "klɑːs"
                            ],
                            "us": [
                                "klæs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of students who are taught together at school, college, or university: ",
                            "examples": [
                                "Which class are you in this year?",
                                "She gave the whole class extra homework for a week.",
                                "My class (= the people in my class) was/were rather noisy this morning.",
                                "Okay, class, settle down and open your books."
                            ]
                        },
                        {
                            "explanation": "a period of time in which students are taught something: ",
                            "examples": [
                                "My last class ends at four o'clock.",
                                "I was told off for talking in class.",
                                "Who takes your environmental studies class?",
                                "I teach a class on crochet at the weekends.",
                                "I missed my aerobics class yesterday.",
                                "Classes have been cancelled today because of a staff meeting."
                            ]
                        },
                        {
                            "explanation": "a group of students who successfully finished their studies in a particular year: ",
                            "examples": [
                                "The class of 2004 achieved the highest ever SAT scores in this district."
                            ]
                        },
                        {
                            "explanation": "a group of people within society who have the same economic and social position: ",
                            "examples": [
                                "The Labour Party has lost a lot of support among the working class.",
                                "She belongs to the rich American upper class.",
                                "We live in a middle class neighbourhood.",
                                "She comes from an upper middle class background.",
                                "He was a member of the ruling classes.",
                                "She's studying the class structure of Japan."
                            ]
                        },
                        {
                            "explanation": "a group into which goods, services, or people are put according to their standard: ",
                            "examples": [
                                "Whenever I travel by train, I always travel first class.",
                                "second class mail",
                                "a business class ticket",
                                "I purchased a ticket in economy class."
                            ]
                        },
                        {
                            "explanation": "in the UK, the standard that someone has reached in their university degree: ",
                            "examples": [
                                "What class of degree did you get?",
                                "He graduated with a second-class honours degree in physics."
                            ]
                        },
                        {
                            "explanation": "in UK law, a group of illegal drugs classified according to how dangerous they are thought to be and how severe the punishment is for using or selling them, with class A the most dangerous : ",
                            "examples": [
                                "He was charged with possession of a class A drug, namely heroin."
                            ]
                        },
                        {
                            "explanation": "to be the best at a particular activity: ",
                            "examples": [
                                "As a long-distance runner, she's in a class of her own."
                            ]
                        },
                        {
                            "explanation": "to be something of such a high quality that nothing can be compared to it: ",
                            "examples": [
                                "In New York, it is clear that Dominican hair salons are in a class of their own."
                            ]
                        },
                        {
                            "explanation": "to be the best or much better than other people at a particular activity: ",
                            "examples": [
                                "When it comes to mathematics, he's in a different class from his peers."
                            ]
                        },
                        {
                            "explanation": "to be much better at doing something than another person: ",
                            "examples": [
                                "I can't play chess with him. He's completely out of my class!"
                            ]
                        },
                        {
                            "explanation": "the quality of being stylish or fashionable: ",
                            "examples": [
                                "She's got real class."
                            ]
                        },
                        {
                            "explanation": "a group of related plants or animals, in the general classification of plants and animals",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "klɑːs"
                            ],
                            "us": [
                                "klæs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to consider someone or something to belong to a particular group because of their or its qualities: ",
                            "examples": [
                                "I'm 17, but I'm still classed as a child when I travel by bus.",
                                "I would class her among the top ten American novelists."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "klɑːs"
                            ],
                            "us": [
                                "klæs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "very good: ",
                            "examples": [
                                "a class act",
                                "He's a class golfer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}