{
    "word": "classic",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈklæs.ɪk"
                            ],
                            "us": [
                                "ˈklæs.ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a high quality or standard against which other things are judged: ",
                            "examples": [
                                "Fielding's classic novel \"Tom Jones\"",
                                "Another classic goal there from Corley!"
                            ]
                        },
                        {
                            "explanation": "extremely or unusually funny, bad, or annoying: ",
                            "examples": [
                                "Then she fell over backwards into the flowerbed - it was absolutely classic!",
                                "That was classic! That van-driver signalled right, and then turned left."
                            ]
                        },
                        {
                            "explanation": "having all the characteristics or qualities that you expect: ",
                            "examples": [
                                "He's a classic example of a kid who's clever but lazy.",
                                "He had all the classic symptoms of the disease."
                            ]
                        },
                        {
                            "explanation": "bad or unpleasant, but not very surprising or unexpected: ",
                            "examples": [
                                "It's classic - you arrive at the station on time and find that the train's left early."
                            ]
                        },
                        {
                            "explanation": "having a simple, traditional style that is always fashionable: ",
                            "examples": [
                                "She wore a classic navy suit."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈklæs.ɪk"
                            ],
                            "us": [
                                "ˈklæs.ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of writing, a musical recording, or a film that is well known and of a high standard and lasting value: ",
                            "examples": [
                                "Jane Austen's \"Pride and Prejudice\" is a classic of English literature.",
                                "Many of the Rolling Stones' records have become rock classics."
                            ]
                        },
                        {
                            "explanation": "the most famous works of literature: ",
                            "examples": [
                                "I spent my childhood reading the classics."
                            ]
                        },
                        {
                            "explanation": "the study of ancient Greek and Roman culture, especially their languages and literature: ",
                            "examples": [
                                "She studied classics at Cambridge.",
                                "a classics scholar.",
                                "He helped to establish the classics department at the University of Massachusetts.",
                                "Her aunt was a classics professor at Cambridge University.",
                                "He spent a year teaching classics at a Chicago university.",
                                "Latin is certainly useful for a classics degree."
                            ]
                        },
                        {
                            "explanation": "a piece of clothing that is always fashionable: ",
                            "examples": [
                                "A long wool coat is a classic no one should be without."
                            ]
                        },
                        {
                            "explanation": "an important race or competition in a number of different sports including horse racing, golf, and tennis: ",
                            "examples": [
                                "The Fall Classic grew out of a casual wager between the owners of the Boston and Pittsburgh baseball clubs.",
                                "He tries to take the golf classic and fundraising auction to the next level every year."
                            ]
                        },
                        {
                            "explanation": "in the UK, any of the five main races in the flat racing (= where the horses do not jump over fences) season: ",
                            "examples": [
                                "The five Classics each have their own identity.",
                                "Within the first five years, geldings were banned from the Classics."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}