{
    "word": "claw",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "klɔː"
                            ],
                            "us": [
                                "klɑː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "one of the sharp curved nails at the end of each of the toes of some animals and birds: ",
                            "examples": [
                                "Our cat likes to sharpen her claws on the legs of the dining table."
                            ]
                        },
                        {
                            "explanation": "one of the two pointed parts, used for holding things, at the end of the legs of some insects and sea creatures: ",
                            "examples": [
                                "Keep your fingers away from the crab's claws when you pick it up."
                            ]
                        },
                        {
                            "explanation": "a human hand that is curved or twisted so that it looks like the claws of an animal, bird, or insect: ",
                            "examples": [
                                "Since her stroke, she has to keep her hand mobile, or the fingers tend to bend into a rigid claw."
                            ]
                        },
                        {
                            "explanation": "an object or tool for picking things up that looks something like the claws of an animal, bird, or insect: ",
                            "examples": [
                                "An iron claw lifts metal scraps from one pile to another.",
                                "It was one of those old-fashioned arcade games where you pick up prizes with a mechanical claw.",
                                "The machine's giant claw ripped the roof off the house like it was paper."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "klɔː"
                            ],
                            "us": [
                                "klɑː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use claws to tear something or someone: ",
                            "examples": [
                                "He was seriously injured when one of the lions clawed his back.",
                                "When our cat is hungry, she starts clawing at my legs."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}