{
    "word": "cleared",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "klɪəd"
                            ],
                            "us": [
                                "klɪrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of an area, path, etc.) having had objects, pieces of rubbish, etc. removed from it, especially when these were blocking something or causing a problem: ",
                            "examples": [
                                "No one will be allowed into the city centre until the area is completely cleared.",
                                "The morning after the snowstorm, he drove slowly down a cleared path to the town."
                            ]
                        },
                        {
                            "explanation": "(of objects, rubbish, etc.) having been removed from a place: ",
                            "examples": [
                                "Rinse out all the pipes thoroughly with a hose once the blockage is cleared.",
                                "We hope to have the wreckage completely cleared by Monday.",
                                "There were large piles of cleared debris."
                            ]
                        },
                        {
                            "explanation": "having been found not to be guilty of doing something wrong: ",
                            "examples": [
                                "He considers himself completely cleared of any wrongdoing after the investigation.",
                                "The only thing that mattered to her was a cleared name."
                            ]
                        },
                        {
                            "explanation": "given official approval or permission: ",
                            "examples": [
                                "Once vehicles have been inspected they are cleared to cross the bridge.",
                                "Only applicants who are security cleared will be eligible to take up the post."
                            ]
                        },
                        {
                            "explanation": "(of a cheque or payment) able to be paid to the person who it is owed to, because a bank has approved it: ",
                            "examples": [
                                "If your bid is successful, you must pay 10% of the final price immediately using a cleared cheque or a banker's draft."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}