{
    "word": "clear",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "klɪər"
                            ],
                            "us": [
                                "klɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "easy to understand, hear, read, or see: ",
                            "examples": [
                                "clear instructions/directions",
                                "Can we make the sound any clearer?",
                                "Our new television has a very clear picture."
                            ]
                        },
                        {
                            "explanation": "something you say in order to emphasize what you have just said, or to express your authority: ",
                            "examples": [
                                "I will not tolerate this behaviour any longer. Do I make myself clear?"
                            ]
                        },
                        {
                            "explanation": "certain, having no doubt, or obvious: ",
                            "examples": [
                                "He isn't at all clear about what he wants to do with his life.",
                                "It is rapidly becoming clear (to me) (that) I'm not suited to being a teacher.",
                                "It isn't clear how long the strike will go on for.",
                                "It's a clear case of corruption.",
                                "You've made your position quite clear (= there is no doubt about what you think)."
                            ]
                        },
                        {
                            "explanation": "pure or easy to see through, with no marks or areas that are less transparent: ",
                            "examples": [
                                "clear glass",
                                "The water in the lake is so clear that you can see the bottom.",
                                "She has a beautifully clear skin/complexion (= with no marks or spots)."
                            ]
                        },
                        {
                            "explanation": "without clouds, mist, or fog in the sky, so that you can see for a long way: ",
                            "examples": [
                                "The weather is expected to remain clear for the next few days.",
                                "You can see the mountains from here on a clear day.",
                                "We could see hundreds of stars in the clear desert sky."
                            ]
                        },
                        {
                            "explanation": "used to describe a pleasant, pure sound: ",
                            "examples": [
                                "the clear sound of the flute"
                            ]
                        },
                        {
                            "explanation": "used to describe something that you remember easily: ",
                            "examples": [
                                "I have clear memories of visiting my grandfather's farm as a child."
                            ]
                        },
                        {
                            "explanation": "not covered or blocked by anything: ",
                            "examples": [
                                "We have a clear view of the ocean from our hotel window.",
                                "The journey was quite quick because the road was clear (= there was not much traffic on it).",
                                "I always like to leave my desk clear (= with no work on it) at the end of the day."
                            ]
                        },
                        {
                            "explanation": "not busy or filled by any planned activity: ",
                            "examples": [
                                "The only time I have clear next week is Tuesday afternoon.",
                                "We've got two clear (= whole) weeks in which to finish the decorating."
                            ]
                        },
                        {
                            "explanation": "without being or feeling guilty: ",
                            "examples": [
                                "to have a clear conscience"
                            ]
                        },
                        {
                            "explanation": "free from confusion; able to think quickly and well: ",
                            "examples": [
                                "Marie is good at making decisions because she's a very clear thinker."
                            ]
                        },
                        {
                            "explanation": "without problems or difficulties: ",
                            "examples": [
                                "This is the first time in his life that he's been clear of (= without) debt."
                            ]
                        },
                        {
                            "explanation": "used to describe an amount of money that is left after all necessary payments have been made: ",
                            "examples": [
                                "The school summer fair made a clear profit of £1,500.",
                                "Bill earns a clear $400 a week/earns $400 a week clear."
                            ]
                        },
                        {
                            "explanation": "not touching something, or away from something: ",
                            "examples": [
                                "Only one competitor made a clear jump of the highest fence (= jumped over it without touching it).",
                                "When we're clear of the main road, we'll stop for our picnic."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "klɪər"
                            ],
                            "us": [
                                "klɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to remove or get rid of whatever is blocking or filling something, or to stop being blocked or full: ",
                            "examples": [
                                "It took several hours to clear the road after the accident.",
                                "I'll make the coffee if you'll clear the table.",
                                "If you use this nasal spray, your nose should clear.",
                                "After my aunt died, we arranged for her house to be cleared (= for the furniture to be removed from it).",
                                "If you press this key, the computer screen will clear (= the text and pictures will be removed from it).",
                                "Shops are currently holding sales to clear their summer stock (= get rid of goods by selling them cheaply).",
                                "Paul helped his elderly neighbour by clearing her path of snow/clearing snow from her path.",
                                "Could you clear your things off/from the sofa?",
                                "I never leave work until I've cleared my in-tray (= have finished the work that needs to be done)."
                            ]
                        },
                        {
                            "explanation": "to give a small cough: ",
                            "examples": [
                                "She cleared her throat nervously before she began to speak."
                            ]
                        },
                        {
                            "explanation": "to prove that someone is not guilty of something that they were accused of: ",
                            "examples": [
                                "After many years in prison, the men were finally cleared of the bombings."
                            ]
                        },
                        {
                            "explanation": "to give official permission for something: ",
                            "examples": [
                                "Despite local opposition, the plans for the new supermarket have been cleared by the council.",
                                "Ladies and gentlemen, air-traffic control has now cleared the plane for take-off.",
                                "I don't know if I can get the car tonight - I'll have to clear it with Mum."
                            ]
                        },
                        {
                            "explanation": "to satisfy the official conditions of something: ",
                            "examples": [
                                "Before you can enter the country, you have to clear customs."
                            ]
                        },
                        {
                            "explanation": "to become or make something pure or easy to see through: ",
                            "examples": [
                                "The children enjoyed stirring the mud at the bottom of the pond, then watching the water slowly clear again.",
                                "Your skin would clear (= become free of spots) if you had a healthier diet.",
                                "After the thunderstorm, the sky cleared (= stopped being cloudy).",
                                "The fog is expected to have cleared (away) (= gone) by midday."
                            ]
                        },
                        {
                            "explanation": "to make your mind free from confusion so that you can think quickly and well: ",
                            "examples": [
                                "I need to get some fresh air to clear my head (= to make me able to think well)."
                            ]
                        },
                        {
                            "explanation": "to pay back all the money that you owe: ",
                            "examples": [
                                "They planned to work for a year, clear their debts, then start a new business."
                            ]
                        },
                        {
                            "explanation": "to have an amount of money left from your earnings after any necessary payments, charges, taxes, etc.: ",
                            "examples": [
                                "Bill clears $200 a week."
                            ]
                        },
                        {
                            "explanation": "to (cause a cheque to) go from one bank to another through a central organization, so that money can be paid to the person it is owed to: ",
                            "examples": [
                                "It usually takes four to five working days for a cheque to clear."
                            ]
                        },
                        {
                            "explanation": "to jump or go over something without touching it: ",
                            "examples": [
                                "The horse cleared the fence with inches to spare."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "klɪər"
                            ],
                            "us": [
                                "klɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not touching, or away from: ",
                            "examples": [
                                "Stand clear of the doors, please.",
                                "Make sure you park clear of the kerb.",
                                "The children were saved from the fire only because a neighbour pulled them clear."
                            ]
                        },
                        {
                            "explanation": "to avoid something or someone: ",
                            "examples": [
                                "His parents warned him to steer clear of trouble."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}