{
    "word": "clearance",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈklɪə.rəns"
                            ],
                            "us": [
                                "ˈklɪr.əns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the process of removing waste or things you do not want from a place: ",
                            "examples": [
                                "slum clearance",
                                "They specialize in house clearances after a resident has died."
                            ]
                        },
                        {
                            "explanation": "an occasion when people are forced to move away from the area where they live permanently: ",
                            "examples": [
                                "The great Highland clearances in Scotland did not reach their height until after 1800."
                            ]
                        },
                        {
                            "explanation": "an occasion when goods are offered for sale cheaply so that people will be encouraged to buy them and there will be space for new goods: ",
                            "examples": [
                                "We bought our new carpet at a clearance sale.",
                                "I buy Christmas decorations when they go on clearance in January"
                            ]
                        },
                        {
                            "explanation": "the distance or space that is needed for one thing to avoid touching another thing: ",
                            "examples": [
                                "It was difficult getting the piano through the doorway because we only had a clearance of a few centimetres.",
                                "High vehicles should take an alternative route because of low clearance under the bridge."
                            ]
                        },
                        {
                            "explanation": "official permission for something or the state of having satisfied the official conditions of something: ",
                            "examples": [
                                "The plane will be taking off as soon as it gets clearance.",
                                "To visit the prison, you'll need security clearance."
                            ]
                        },
                        {
                            "explanation": "the process of a cheque going from one bank to another through a central organization, so that money can be paid to the person it is owed to: ",
                            "examples": [
                                "Clearance (of a cheque) can take up to a week."
                            ]
                        },
                        {
                            "explanation": "in football, an occasion when a player kicks the ball away from their goal: ",
                            "examples": [
                                "Robinson's long clearance was controlled by Mido who went on to score."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}