{
    "word": "clicked",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nclick ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "klɪk"
                            ],
                            "us": [
                                "klɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to carry out a computer operation by pressing a button on the mouse or keyboard: ",
                            "examples": [
                                "If you want to open a file, click twice on the icon for it.",
                                "When you have selected the file you want, click the \"Open\" box."
                            ]
                        },
                        {
                            "explanation": "to make a short, sharp sound, or to make something do this: ",
                            "examples": [
                                "The door clicked shut behind her.",
                                "Can you hear that strange clicking noise?",
                                "Paul clicked his fingers (= moved his thumb against his middle finger to make a short sharp sound) to attract the waiter's attention.",
                                "Soldiers click their heels (= bring them sharply together) when they stand to attention."
                            ]
                        },
                        {
                            "explanation": "to like and understand someone, especially the first time you meet: ",
                            "examples": [
                                "He didn't really click with his new boss.",
                                "Liz and I really clicked the first time we met.",
                                "I met her at school and we just clicked."
                            ]
                        },
                        {
                            "explanation": "to be liked by someone: ",
                            "examples": [
                                "The new daytime soap opera has yet to show signs that it's clicking with the television audience."
                            ]
                        },
                        {
                            "explanation": "to be understood, or become clear suddenly: ",
                            "examples": [
                                "Suddenly everything clicked and I realized where I'd met him.",
                                "As he talked about his schooldays, it suddenly clicked where I had met him before.",
                                "So it's finally clicked that you're going to have to get yourself a job, has it?",
                                "In the last act of the play, everything clicks into place."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}