{
    "word": "close",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kləʊz"
                            ],
                            "us": [
                                "kloʊz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change from being open to not being open, or to cause something to do this: ",
                            "examples": [
                                "Could you close the door please?",
                                "I went out and forgot to close the window.",
                                "Close your eyes - I've got a surprise for you."
                            ]
                        },
                        {
                            "explanation": "When a shop, restaurant, or public place closes, people cannot go into it: ",
                            "examples": [
                                "The banks had closed so I couldn't get any money out.",
                                "We close to customers on Tuesday mornings for staff training.",
                                "The museum closes at 5.30.",
                                "We can't get a drink! It's after closing time."
                            ]
                        },
                        {
                            "explanation": "to end, or to cause something to do this: ",
                            "examples": [
                                "The play closed with the tragic death of both hero and heroine.",
                                "She closed the meeting with a short speech.",
                                "The pound closed at (= was worth) $1.47 at the end of the day's trading."
                            ]
                        },
                        {
                            "explanation": "(of a business, organization, or business arrangement) to stop operating; to cause something to stop operating: ",
                            "examples": [
                                "I closed that bank account when I came to London.",
                                "The factory closed over ten years ago."
                            ]
                        },
                        {
                            "explanation": "to make a successful business arrangement with someone: ",
                            "examples": [
                                "We closed a deal with a major supermarket."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the end of something, or the time when you end it: ",
                            "examples": [
                                "At the close of the meeting the contract remained unsigned.",
                                "The season is now nearing its close."
                            ]
                        },
                        {
                            "explanation": "to make something finish: ",
                            "examples": [
                                "I tried to bring the conversation to a close."
                            ]
                        },
                        {
                            "explanation": "to end: ",
                            "examples": [
                                "The singer's tour comes to a close in Tokyo tonight."
                            ]
                        },
                        {
                            "explanation": "a road, usually with private houses, that vehicles can only enter from one end: ",
                            "examples": [
                                "He lives at 83 Barker Close."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kləʊs"
                            ],
                            "us": [
                                "kloʊs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having direct family connections or shared beliefs, support, and sympathy: ",
                            "examples": [
                                "There weren't many people at the funeral - just close family/relatives.",
                                "They're a worrying political party because of their close links/ties with terrorist groups.",
                                "In those early months, there's a very close bond between mother and child.",
                                "a close community"
                            ]
                        },
                        {
                            "explanation": "People who are close know each other very well and like each other a lot, or they see and talk to each other a lot: ",
                            "examples": [
                                "Mira is one of my closest friends.",
                                "Her relationship isn't good with her father, but she's very close to her mother.",
                                "My brother and I have become much closer over the years."
                            ]
                        },
                        {
                            "explanation": "looking at or listening to someone or something very carefully: ",
                            "examples": [
                                "Police are paying close attention to the situation.",
                                "Take a closer look at this photograph."
                            ]
                        },
                        {
                            "explanation": "unwilling to talk about things to other people: ",
                            "examples": [
                                "He's so close about his past - it seems like he's hiding something."
                            ]
                        },
                        {
                            "explanation": "used to describe weather or air conditions in which it is difficult to breathe and it is uncomfortably warm: ",
                            "examples": [
                                "Can I open the window? It's very close in here."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kləʊs"
                            ],
                            "us": [
                                "kloʊs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not far in position or time: ",
                            "examples": [
                                "Don't get too close to that dog, Rosie.",
                                "I hate people standing too close to me.",
                                "As Christmas gets closer, the shops get more and more crowded.",
                                "Emma looked close to tears (= almost going to cry)."
                            ]
                        },
                        {
                            "explanation": "near: ",
                            "examples": [
                                "Shall we call in on Miranda? You know she lives quite close by."
                            ]
                        },
                        {
                            "explanation": "having only a small difference: ",
                            "examples": [
                                "The election results were so close they had to vote again.",
                                "He came second in the race, but it was very close.",
                                "The youngest boys are so close in age they look like twins.",
                                "Both children bear a very close resemblance to their father."
                            ]
                        },
                        {
                            "explanation": "almost: ",
                            "examples": [
                                "I think there are close on three million unemployed at present."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}