{
    "word": "closet",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈklɒz.ɪt"
                            ],
                            "us": [
                                "ˈklɑː.zət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a cupboard or a small room with a door, used for storing things, especially clothes: ",
                            "examples": [
                                "a bedroom/linen/storage closet"
                            ]
                        },
                        {
                            "explanation": "used to describe a person who is not heterosexual (= sexually attracted to men if they are a woman and women if they are a man) or not cisgender (= having a gender that matches the body they were born with), but keeps that fact secret from other people: ",
                            "examples": [
                                "The ban could lead to trans service members staying in the closet even when it is dangerous for their mental health.",
                                "The story revolves around Jason and Peter, who are in love but are both in the closet."
                            ]
                        },
                        {
                            "explanation": "used to describe a person who is not heterosexual (= sexually attracted to men if they are a woman and women if they are a man) or not cisgender (= having a gender that matches the body they were born with), and does not keep that fact secret from other people: ",
                            "examples": [
                                "He is openly gay now, but didn't come out of the closet until a few years ago.",
                                "Gay, lesbian, bisexual and transgender students are feeling empowered to come out of the closet younger than previous generations. ",
                                "For some people, being out of the closet can present a lot of risks, but I've found it very liberating."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈklɒz.ɪt"
                            ],
                            "us": [
                                "ˈklɑː.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put yourself in a place, especially a closed space, and stay there: ",
                            "examples": [
                                "Two weeks before my exams I closeted myself (away) in my room with my books and I didn't speak to anyone.",
                                "The president has been closeted with (= having a private meeting with) his advisers for several hours."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈklɒz.ɪt"
                            ],
                            "us": [
                                "ˈklɑː.zət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a belief, activity, or feeling that is kept secret from the public, usually because you are frightened of the results of it becoming known: ",
                            "examples": [
                                "a closet alcoholic/smoker",
                                "Dole portrayed the president in campaign speeches as a \"closet liberal\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}