{
    "word": "clutch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "klʌtʃ"
                            ],
                            "us": [
                                "klʌtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to take or try to take hold of something or someone tightly, usually in fear, worry, or pain: ",
                            "examples": [
                                "Silent and pale, she clutched onto her mother's hand.",
                                "Clutching the money to his chest, he hurried to the bank.",
                                "He collapsed, clutching his stomach."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "klʌtʃ"
                            ],
                            "us": [
                                "klʌtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device that allows turning movement to be sent from one part of a machine to another: ",
                            "examples": [
                                "I've booked the car into the garage because the clutch is slipping."
                            ]
                        },
                        {
                            "explanation": "the pedal or handle in a vehicle that is used to operate the engine's clutch: ",
                            "examples": [
                                "Push the clutch in, put the car into gear, rev the engine, and then gently let the clutch out.",
                                "Push the clutch in, put the car into gear, rev the engine, and then gently let the clutch out."
                            ]
                        },
                        {
                            "explanation": "a small group of eggs produced by the same bird, especially in a nest",
                            "examples": []
                        },
                        {
                            "explanation": "a small group of people or things: ",
                            "examples": [
                                "a fresh clutch of students"
                            ]
                        },
                        {
                            "explanation": "the control of someone: ",
                            "examples": [
                                "He is in the clutches of that woman."
                            ]
                        },
                        {
                            "explanation": "a difficult and important situation that needs a lot of skill to deal with successfully: ",
                            "examples": [
                                "\"This team was able to perform in the clutch every time,\" he said.",
                                "He remained cool under pressure and made accurate throws in clutch situations."
                            ]
                        },
                        {
                            "explanation": "to be very useful or helpful, especially in a difficult or important situation: ",
                            "examples": [
                                "I hoped that my beginner's luck would come in clutch.",
                                "She learns that even though families might not be perfect, they sometimes come in clutch to save the day.",
                                "These math posters will help your child with their homework, and come in clutch for parents who need a little math refresher too. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "klʌtʃ"
                            ],
                            "us": [
                                "klʌtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "able to do something when it is especially difficult or especially needed: ",
                            "examples": [
                                "Moose, always reliable under pressure, was an amazing clutch hitter.",
                                "He developed the reputation for being the big winner, the clutch performer."
                            ]
                        },
                        {
                            "explanation": "done successfully when this is especially difficult or especially important: ",
                            "examples": [
                                "It was his leadership and clutch play that made him special.",
                                "The team managed only three hits after falling behind, but came up with the clutch hit when it needed it the most."
                            ]
                        },
                        {
                            "explanation": "used to say that something is extremely good or useful, or exactly what is needed in a situation: ",
                            "examples": [
                                "I found five dollars in my pocket. That was so damn clutch."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}