{
    "word": "co-op",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkəʊˌɒp"
                            ],
                            "us": [
                                "ˈkoʊˌɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an organization, business, shop, or farm that is owned and managed by a group of people who also work in it: ",
                            "examples": [
                                "Pete worked in a large food co-op in Boston. ",
                                "Different types of cheeses as well as eggs are sold as part of the farmers' co-op."
                            ]
                        },
                        {
                            "explanation": "an organization that owns and manages houses that its members live in, or the group of houses that it owns: ",
                            "examples": [
                                "Individual members of housing co-ops do not usually own their homes; the properties are owned by the co-operative itself.",
                                "I was looking for somewhere to live and a friend mentioned that there might be space in a co-op."
                            ]
                        },
                        {
                            "explanation": "a house or flat that is owned by a co-op (= an organization that owns and manages houses that its members live in): ",
                            "examples": [
                                "The maintenance fees on our Manhattan co-op went up 20%.",
                                "The houses were renovated, some were turned into condominiums, and others into co ops."
                            ]
                        },
                        {
                            "explanation": "a way of playing a computer game in which a group of people play together to try to achieve the same thing: ",
                            "examples": [
                                "Split-screen is available for those who prefer co-op.",
                                "The game is really best played in four-player co-op, where friends can set out on a quest together."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkəʊˌɒp"
                            ],
                            "us": [
                                "ˈkoʊˌɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a house, a building, etc.) owned by a co-op (= an organization that owns and manages houses that its members live in): ",
                            "examples": [
                                "I'm 26 and planning to buy a co-op apartment.",
                                "These car parks should have social housing or co-op housing built over the top."
                            ]
                        },
                        {
                            "explanation": "involving a group of people doing something, especially playing a game, together to try to achieve the same thing: ",
                            "examples": [
                                "The options include single-player, multiplayer, and co-op play. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈkəʊˌɒp"
                            ],
                            "us": [
                                "ˈkoʊˌɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a way that involves a group of people doing something together, especially playing a game, to try to achieve the same thing: ",
                            "examples": [
                                "You might want to play solo first and then grab some friends and play co-op.",
                                "Have any of you tried this game co-op?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}