{
    "word": "coach",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəʊtʃ"
                            ],
                            "us": [
                                "koʊtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone whose job is to teach people to improve at a sport, skill, or school subject: ",
                            "examples": [
                                "a tennis/maths coach"
                            ]
                        },
                        {
                            "explanation": "someone whose job is to train and organize a sports team: ",
                            "examples": [
                                "Gus Poyet was appointed as head coach."
                            ]
                        },
                        {
                            "explanation": "a long motor vehicle with comfortable seats, used to take groups of people on journeys: ",
                            "examples": [
                                "We're going to the airport by coach.",
                                "a coach trip"
                            ]
                        },
                        {
                            "explanation": "an old-fashioned carriage pulled by horses, now used mainly in official or royal ceremonies",
                            "examples": []
                        },
                        {
                            "explanation": "any of the separate parts of a train in which the passengers sit",
                            "examples": []
                        },
                        {
                            "explanation": "→ \ncoach class ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kəʊtʃ"
                            ],
                            "us": [
                                "koʊtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give special classes in sports or a school subject, especially privately, to one person or a small group: ",
                            "examples": [
                                "She coaches students in French, usually for exams."
                            ]
                        },
                        {
                            "explanation": "to train and organize a sports team: ",
                            "examples": [
                                "He coached the Blue Devils during their last championship season."
                            ]
                        },
                        {
                            "explanation": "to tell someone what they should say in a particular situation and help them to practise saying it: ",
                            "examples": [
                                "A criminal defence lawyer alleged that the officer coached a witness to lie.",
                                "Applicants who have been coached might be able to fool the admissions process.",
                                "Her interview style seemed so effortless I wondered if she had been coached by media experts."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəʊtʃ"
                            ],
                            "us": [
                                "koʊtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the cheapest type of seats on a plane or train: ",
                            "examples": [
                                "Even the company's director flies coach most of the time."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}