{
    "word": "cold",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kəʊld"
                            ],
                            "us": [
                                "koʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at a low temperature, especially when compared to the temperature of the human body, and not hot, or warm: ",
                            "examples": [
                                "a cold day/house",
                                "cold food/water",
                                "cold hands",
                                "cold weather",
                                "My feet are so cold.",
                                "It's freezing cold today.",
                                "You'll feel cold if you don't wear a coat."
                            ]
                        },
                        {
                            "explanation": "not showing kindness, love, or emotion and not friendly: ",
                            "examples": [
                                "His handshake was cold, and his eyes lifeless.",
                                "He stared into her cold, blue eyes.",
                                "She would never feel welcome in this city with its cold, unsmiling inhabitants.",
                                "The school was a cold, unwelcoming place."
                            ]
                        },
                        {
                            "explanation": "If a case (= a crime or series of events) that is being investigated is cold, it has not been solved and is no longer expected to be solved: ",
                            "examples": [
                                "The police spared no effort to keep the case from going cold.",
                                "At the time of his confession, the trail was turning cold, and investigators had given up on ever catching the killer."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəʊld"
                            ],
                            "us": [
                                "koʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a common infection, especially in the nose and throat, that causes you to cough and sneeze and your nose to run (= drip liquid) or feel blocked: ",
                            "examples": [
                                "I've got a cold.",
                                "She caught a cold at school.",
                                "Don't come near me - I've got a stinking/streaming cold (= extremely bad cold)."
                            ]
                        },
                        {
                            "explanation": "cold weather or temperatures: ",
                            "examples": [
                                "Don't stand out there in the cold, come in here and get warm.",
                                "Old people tend to feel the cold (= feel uncomfortable in cold temperatures) more than the young.",
                                "My feet were numb with cold."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}