{
    "word": "collar",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒl.ər"
                            ],
                            "us": [
                                "ˈkɑː.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part around the neck of a piece of clothing, usually sewn on and sometimes made of different material: ",
                            "examples": [
                                "a shirt collar",
                                "a fur collar",
                                "a dress with a big collar"
                            ]
                        },
                        {
                            "explanation": "a strap made of leather or other strong material that is put around the neck of an animal, especially a dog or cat: ",
                            "examples": [
                                "I grabbed the dog by the collar and dragged it out of the room."
                            ]
                        },
                        {
                            "explanation": "a type of necklace (= a piece of jewellery worn around the neck): ",
                            "examples": [
                                "a diamond collar"
                            ]
                        },
                        {
                            "explanation": "an area around the neck of an animal that is coloured differently from the other parts of the body: ",
                            "examples": [
                                "The bird has grey feathers with a lighter collar."
                            ]
                        },
                        {
                            "explanation": "a strip of strong material that is put around a pipe or a piece of machinery to make it stronger or to join two parts together",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkɒl.ər"
                            ],
                            "us": [
                                "ˈkɑː.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a strap or device around an animal's neck, for example as a way of controlling it, or discovering or recording where it goes: ",
                            "examples": [
                                "The family dog is collared, leashed and taken for a walk.",
                                "Researchers began trapping and collaring black bears in order to track their movements."
                            ]
                        },
                        {
                            "explanation": "to find someone and stop them in order to talk to them: ",
                            "examples": [
                                "A reporter collared her on her way to the gym.",
                                "I was collared by Pete as I was coming out of the meeting this morning."
                            ]
                        },
                        {
                            "explanation": "to catch or arrest someone such as a criminal: ",
                            "examples": [
                                "He is known as the detective who collared a serial killer.",
                                "She was collared by the police at the airport."
                            ]
                        },
                        {
                            "explanation": "to get something for yourself: ",
                            "examples": [
                                "He somehow managed to collar all the credit for other people's work.",
                                "The Treasury collars billions in tobacco duty every year."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}