{
    "word": "colour",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkʌl.ər"
                            ],
                            "us": [
                                "ˈkʌl.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "red, blue, green, yellow, etc.: ",
                            "examples": [
                                "What's your favourite colour?",
                                "She wears a lot of bright colours.",
                                "What colour are your eyes?",
                                "Does the shirt come in any other colour?",
                                "I like rich jewel colours, such as purple, blue, and green.",
                                "Are the photos in colour or black and white?"
                            ]
                        },
                        {
                            "explanation": "the pleasant effect of a bright colour or of a lot of colours together: ",
                            "examples": [
                                "I think we need a bit of colour in this room.",
                                "Red and yellow peppers give a little colour to the sauce.",
                                "The whole garden was ablaze with colour (= full of different bright colours).",
                                "The whole garden was a riot of colour (= full of different bright colours)."
                            ]
                        },
                        {
                            "explanation": "a substance, such as a paint or dye, that you add to something to give it a particular colour: ",
                            "examples": [
                                "I put my new green shirt in a hot wash and the colour ran (= the colour came out of the material)."
                            ]
                        },
                        {
                            "explanation": "a pink colour in someone's face, often showing good health or showing feelings such as embarrassment or excitement: ",
                            "examples": [
                                "I watched the colour drain from her face as she heard the news.",
                                "She has a high colour (= the natural colour of her face is red)."
                            ]
                        },
                        {
                            "explanation": "to cause someone who has been ill to look more healthy, especially by doing exercise: ",
                            "examples": [
                                "That walk has put some colour in your cheeks."
                            ]
                        },
                        {
                            "explanation": "interesting or exciting qualities or details: ",
                            "examples": [
                                "We added your story for a bit of local colour.",
                                "Michael was there so that added a bit of colour to the evening's proceedings."
                            ]
                        },
                        {
                            "explanation": "the natural colour of a person's skin which shows which race they belong to: ",
                            "examples": [
                                "She felt she had not been given the job because of her colour.",
                                "There should be no discrimination on the grounds of colour."
                            ]
                        },
                        {
                            "explanation": "used to describe people who do not consider themselves to be white: ",
                            "examples": [
                                "a literary prize to encourage writers of colour",
                                "We value the contributions made by our colleagues of colour."
                            ]
                        },
                        {
                            "explanation": "(at school, college, or university) an honour given to people who have been chosen for a sports team, often represented by a special symbol on a shirt or tie: ",
                            "examples": [
                                "She was awarded her colours for hockey/her hockey colours at the end of term."
                            ]
                        },
                        {
                            "explanation": "the official flag of a country, ship, or military group: ",
                            "examples": [
                                "regimental colours"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkʌl.ər"
                            ],
                            "us": [
                                "ˈkʌl.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "Colour television, photography, or printing shows things in all their colours, not just in black and white.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkʌl.ər"
                            ],
                            "us": [
                                "ˈkʌl.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to become a particular colour, or to make something a particular colour: ",
                            "examples": [
                                "Do you think he colours his hair?",
                                "He drew a heart and coloured it red.",
                                "Fry the onions till they start to colour."
                            ]
                        },
                        {
                            "explanation": "to become red in the face because you are embarrassed",
                            "examples": []
                        },
                        {
                            "explanation": "If something colours your opinion of something, it influences your opinion in a negative way: ",
                            "examples": [
                                "I'm sure my views on marriage are coloured by my parents' divorce.",
                                "I'm trying not to let my judgment be coloured by that one incident."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}