{
    "word": "comfort",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkʌm.fət"
                            ],
                            "us": [
                                "ˈkʌm.fɚt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a pleasant feeling of being relaxed and free from pain: ",
                            "examples": [
                                "She evidently dresses for comfort.",
                                "It's a little too hot for comfort.",
                                "Now you can watch the latest films in the comfort of your own room."
                            ]
                        },
                        {
                            "explanation": "the state of feeling better after feeling sad or worried, or something that makes you feel better in this way: ",
                            "examples": [
                                "The letters that people wrote after his death gave me a lot of comfort.",
                                "It's some comfort to his wife (= it makes her feel less sad) to know that he died instantly and didn't suffer.",
                                "I've got to take an exam too, if it's any comfort (= if it makes you feel better to know that we share the same problem or bad luck).",
                                "I know she goes out a lot at night, but I draw/take comfort from the fact that she's always with friends.",
                                "He's a great comfort to his mother."
                            ]
                        },
                        {
                            "explanation": "the state of having a pleasant life with enough money for everything that you need: ",
                            "examples": [
                                "He could retire now and live in comfort for the rest of his life."
                            ]
                        },
                        {
                            "explanation": "something that makes your life easy and pleasant: ",
                            "examples": [
                                "After the trip, it was nice getting back to a few home comforts.",
                                "She's always liked her creature comforts (= the type of pleasure found in the house, for example warmth, food, etc.)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkʌm.fət"
                            ],
                            "us": [
                                "ˈkʌm.fɚt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make someone feel better when they are sad or worried: ",
                            "examples": [
                                "The girl's mother was at home today, being comforted by relatives."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}