{
    "word": "commentary",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒm.ən.tər.i"
                            ],
                            "us": [
                                "ˈkɑː.mən.ter.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a spoken description of an event on the radio or television that is broadcast as the event happens, or the action of providing this description: ",
                            "examples": [
                                "The commentary on the Olympic Games was much better on the other channel.",
                                "After retiring as a player she did football commentary for the BBC."
                            ]
                        },
                        {
                            "explanation": "a continuous description of events as they are happening: ",
                            "examples": [
                                "He gave a hilarious running commentary of the match."
                            ]
                        },
                        {
                            "explanation": "writing, art, etc. that explains a situation or expresses an opinion on it, or the opinions that it expresses: ",
                            "examples": [
                                "There's good arts coverage in the newspaper, but not much political commentary.",
                                "Is the sculpture meant to be a commentary on religion?",
                                "She says that social commentary has become unfashionable among young playwrights."
                            ]
                        },
                        {
                            "explanation": "something that shows what something is really like: ",
                            "examples": [
                                "Is it possible that our judgment of others is really a commentary on how deserving we feel ourselves?",
                                "It is a sad commentary on our society that we have children locked up in adult jails.",
                                "It's a sad commentary when technology that is supposed to bring people together causes so much division. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}