{
    "word": "common",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkɒm.ən"
                            ],
                            "us": [
                                "ˈkɑː.mən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the same in a lot of places or for a lot of people: ",
                            "examples": [
                                "It's quite common to see couples who dress alike.",
                                "\"Smith\" is a very common name in Britain."
                            ]
                        },
                        {
                            "explanation": "the basic level of politeness that you expect from someone: ",
                            "examples": [
                                "His communications were characterized by a lack of common courtesy."
                            ]
                        },
                        {
                            "explanation": "a fact that everyone knows: ",
                            "examples": [
                                "It's common knowledge that they live together."
                            ]
                        },
                        {
                            "explanation": "belonging to or shared by two or more people, or things: ",
                            "examples": [
                                "a common goal/interest",
                                "English has some features common to many languages."
                            ]
                        },
                        {
                            "explanation": "If something is done for the common good, it is done to help everyone: ",
                            "examples": [
                                "We have to use our freedoms for the common good rather than our own selfish interests."
                            ]
                        },
                        {
                            "explanation": "to act together with someone in order to achieve something: ",
                            "examples": [
                                "Environmental protesters have made common cause with local people to stop the motorway being built."
                            ]
                        },
                        {
                            "explanation": "typical of a low social class: ",
                            "examples": [
                                "My mum thinks dyed blonde hair is a bit common."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒm.ən"
                            ],
                            "us": [
                                "ˈkɑː.mən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area of grass that everyone is allowed to use, usually in or near a village",
                            "examples": []
                        },
                        {
                            "explanation": "to share interests, experiences, or other characteristics with someone or something: ",
                            "examples": [
                                "We don't really have much in common."
                            ]
                        },
                        {
                            "explanation": "in the same way as someone or something: ",
                            "examples": [
                                "In common with many mothers, she feels torn between her family and her work."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}