{
    "word": "commercial",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kəˈmɜː.ʃəl"
                            ],
                            "us": [
                                "kəˈmɝː.ʃəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "related to making money by buying and selling things: ",
                            "examples": [
                                "a commercial organization/venture/success",
                                "commercial law",
                                "The commercial future of the company looks very promising."
                            ]
                        },
                        {
                            "explanation": "A commercial product can be bought by or is intended to be bought by the general public: ",
                            "examples": [
                                "Some robotic research prototypes have generated commercial products. ",
                                "This is a commercial product, not free software."
                            ]
                        },
                        {
                            "explanation": "used for selling goods or providing services for money, rather than for personal use: ",
                            "examples": [
                                "His company deals in both residential and commercial property.",
                                "You need a special licence to operate a commercial vehicle."
                            ]
                        },
                        {
                            "explanation": "used to describe a record, film, book, etc. that has been produced with the aim of making money and as a result has little artistic value: ",
                            "examples": [
                                "The actor tends to alternate between indie art films and more commercial projects."
                            ]
                        },
                        {
                            "explanation": "used to refer to radio or television paid for by advertisements that are broadcast between and during programmes: ",
                            "examples": [
                                "Now it's time for a commercial break."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəˈmɜː.ʃəl"
                            ],
                            "us": [
                                "kəˈmɝː.ʃəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an advertisement that is broadcast on television or radio: ",
                            "examples": [
                                "He went to make a drink during the commercials.",
                                "She was in a commercial for breakfast cereal.",
                                "a car/fast food commercial"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}