{
    "word": "compound",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒm.paʊnd"
                            ],
                            "us": [
                                "ˈkɑːm.paʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a chemical that combines two or more elements: ",
                            "examples": [
                                "Salt is a compound of sodium and chlorine.",
                                "Many fertilizers contain nitrogen compounds."
                            ]
                        },
                        {
                            "explanation": "something consisting of two or more different parts: ",
                            "examples": [
                                "Then there was his manner, a curious compound of humour and severity."
                            ]
                        },
                        {
                            "explanation": "a word that combines two or more different words. Often, the meaning of the compound cannot be discovered by knowing the meaning of the different words that form it. Compounds may be written either as one word or as separate words: ",
                            "examples": [
                                "'Bodyguard' and 'floppy disk' are two examples of compounds."
                            ]
                        },
                        {
                            "explanation": "an area surrounded by fences or walls that contains a group of buildings: ",
                            "examples": [
                                "The gates opened and the troops marched into their compound.",
                                "The embassy compound has been closed to the public because of a bomb threat."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kəmˈpaʊnd"
                            ],
                            "us": [
                                "kəmˈpaʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a problem or difficult situation worse: ",
                            "examples": [
                                "Her terror was compounded by the feeling that she was being watched.",
                                "His financial problems were compounded when he unexpectedly lost his job.",
                                "Severe drought has compounded food shortages in the region."
                            ]
                        },
                        {
                            "explanation": "to mix two things together: ",
                            "examples": [
                                "Most tyres are made of rubber compounded with other chemicals and materials."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkɒm.paʊnd"
                            ],
                            "us": [
                                "ˈkɑːm.paʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "consisting of two or more parts",
                            "examples": []
                        },
                        {
                            "explanation": "used to refer to a system of paying interest in which interest is paid both on the original amount of money invested (= given to companies hoping to get more back) or borrowed and on the interest that has collected over a period of time: ",
                            "examples": [
                                "compound interest",
                                "The investment fund has achieved annual compound returns of 18.2 percent."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}