{
    "word": "compare",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kəmˈpeər"
                            ],
                            "us": [
                                "kəmˈper"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to examine or look for the difference between two or more things: ",
                            "examples": [
                                "If you compare house prices in the two areas, it's quite amazing how different they are.",
                                "That seems expensive - have you compared prices in other shops?",
                                "Compare some recent work with your older stuff and you'll see how much you've improved.",
                                "This road is quite busy compared to/with ours.",
                                "Children seem to learn more interesting things compared to/with when we were at school."
                            ]
                        },
                        {
                            "explanation": "to judge, suggest, or consider that something is similar or of equal quality to something else: ",
                            "examples": [
                                "The poet compares his lover's tongue to a razor blade.",
                                "Still only 25, she has been compared to the greatest dancer of all time.",
                                "People compared her to Elizabeth Taylor.",
                                "You can't compare the two cities - they're totally different."
                            ]
                        },
                        {
                            "explanation": "If something or someone does not compare with something or someone else, the second thing is very much better than the first: ",
                            "examples": [
                                "Instant coffee just doesn't compare with freshly ground coffee."
                            ]
                        },
                        {
                            "explanation": "If something compares favourably with something else, it is better than it: ",
                            "examples": [
                                "The hotel certainly compared favourably with the one we stayed in last year."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəmˈpeər"
                            ],
                            "us": [
                                "kəmˈper"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "so good that everyone or everything else is of worse quality: ",
                            "examples": [
                                "Her beauty is beyond compare."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}