{
    "word": "concern",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kənˈsɜːn"
                            ],
                            "us": [
                                "kənˈsɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause worry to someone: ",
                            "examples": [
                                "The state of my father's health concerns us greatly.",
                                "It concerns me that he hasn't been in contact."
                            ]
                        },
                        {
                            "explanation": "to be important to someone or to involve someone directly: ",
                            "examples": [
                                "Matters of pollution and the environment concern us all.",
                                "What I have to say to Amy doesn't concern you."
                            ]
                        },
                        {
                            "explanation": "If a story, film, or article concerns a particular subject, person, etc., it is about that person or subject: ",
                            "examples": [
                                "The documentary concerns a woman who goes to China as a missionary."
                            ]
                        },
                        {
                            "explanation": "to become involved with something, or worried about something: ",
                            "examples": [
                                "There's no need for you to concern yourself with what happened.",
                                "Don't concern yourself. She'll be home soon.",
                                "I concern myself with general policy rather than operational details.",
                                "At this point there's no need to concern ourselves with the differences between the two theories. ",
                                "She doesn't care about popularity or concern herself with what other artists are doing."
                            ]
                        },
                        {
                            "explanation": "something you write at the start of a formal letter or notice when you do not know exactly who it should be sent to: ",
                            "examples": [
                                "Address your cover letter to the hiring manager. Otherwise, begin it with \"To whom it may concern\". "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kənˈsɜːn"
                            ],
                            "us": [
                                "kənˈsɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a worried or nervous feeling about something, or something that makes you feel worried: ",
                            "examples": [
                                "Concern for the safety of the two missing teenagers is growing.",
                                "There's a lot of public concern about/over dangerous toxins recently found in food.",
                                "My concern is that you're not getting enough work done."
                            ]
                        },
                        {
                            "explanation": "a company: ",
                            "examples": [
                                "a family concern",
                                "It started slowly, but the company is now a going concern (= doing business effectively)."
                            ]
                        },
                        {
                            "explanation": "something that is important to you, or the fact of being important: ",
                            "examples": [
                                "His concern to appear sophisticated amused everyone.",
                                "The company's sole concern is to ensure the safety of its employees.",
                                "There's a matter of some concern that I have to discuss with you."
                            ]
                        },
                        {
                            "explanation": "something that involves or affects you or is important to you: ",
                            "examples": [
                                "What were the major concerns of the writers from this period?",
                                "I don't want to hear about it - it's no concern of mine!",
                                "\"What's happening?\" \"That's none of/not any of your concern.\""
                            ]
                        },
                        {
                            "explanation": "to be important: ",
                            "examples": [
                                "The results of the election are of concern to us all."
                            ]
                        },
                        {
                            "explanation": "to be not important or worth paying attention to : ",
                            "examples": [
                                "It's of little concern to me how she dresses. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}