{
    "word": "concierge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌkɒn.siˈeəʒ"
                            ],
                            "us": [
                                "kɑːn.siˈerʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who is employed to take care of an apartment building, especially in France: ",
                            "examples": [
                                "The concierge knocked on the door of their apartment following complaints about noise.",
                                "The concierge shrugged and said she was out."
                            ]
                        },
                        {
                            "explanation": "someone who is employed in a hotel, private club, or similar place to help guests with anything they need, such as arranging trips or theatre tickets: ",
                            "examples": [
                                "Other hotel staff who expect a tip include a concierge who books tickets for a show and a doorman who hails a taxi.",
                                "She worked as a concierge in the first-class lounge at Dulles International Airport."
                            ]
                        },
                        {
                            "explanation": "someone employed by a large company to do jobs, such as shopping, for other employees who are working: ",
                            "examples": [
                                "Staff perks include a concierge, an ironing service, discounted concert tickets, and an on-site creche. ",
                                "Benefits range from corporate concierge services to masseuses."
                            ]
                        },
                        {
                            "explanation": "someone whose job is to help a writer with the process of publishing a book, especially a writer who is having the book published themselves rather than by a publishing company: ",
                            "examples": [
                                "With a publishing concierge it is like having your very own industry expert there for all of your publishing needs."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}