{
    "word": "conflict",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒn.flɪkt"
                            ],
                            "us": [
                                "ˈkɑːn.flɪkt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an active disagreement between people with opposing opinions or principles: ",
                            "examples": [
                                "There was a lot of conflict between him and his father.",
                                "It was an unpopular policy and caused a number of conflicts within the party.",
                                "His outspoken views would frequently bring him into conflict with the president."
                            ]
                        },
                        {
                            "explanation": "fighting between two or more groups of people or countries: ",
                            "examples": [
                                "We wish to avoid conflict between our countries if at all possible."
                            ]
                        },
                        {
                            "explanation": "a situation in which beliefs, needs, facts, etc. are very different and cannot easily exist together or both be true: ",
                            "examples": [
                                "Is a conflict between protection of the environment and economic growth inevitable?",
                                "He says he sees no conflict in being gentle and caring and being a strong man."
                            ]
                        },
                        {
                            "explanation": "a situation in which someone cannot make a fair decision because they will be affected by the result: ",
                            "examples": [
                                "I need to declare a conflict of interest here - one of the candidates for the job is a friend of mine."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kənˈflɪkt"
                            ],
                            "us": [
                                "kənˈflɪkt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If beliefs, needs, or facts, etc. conflict, they are very different and cannot easily exist together or both be true: ",
                            "examples": [
                                "The results of the new research would seem to conflict with existing theories."
                            ]
                        },
                        {
                            "explanation": "to fight or disagree actively: ",
                            "examples": [
                                "If the two sides conflict with each other again, it will be disastrous for party unity."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}