{
    "word": "connected",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kəˈnek.tɪd"
                            ],
                            "us": [
                                "kəˈnek.tɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of wires, pipes, devices, etc.) joined together: ",
                            "examples": [
                                "The TV won't work if the cable's not connected.",
                                "Imagine you're a puppet being pulled upright by a string connected to the top of your head.",
                                "Remember to switch off your PC and connected peripherals. "
                            ]
                        },
                        {
                            "explanation": "able to communicate or share information because of being joined to a communications system such as the internet: ",
                            "examples": [
                                "Some people always have their phones on because they feel they have to be connected all the time.",
                                "Even my grandparents, who have never used the internet, are getting connected.",
                                "We live in a connected world.",
                                "We can now stay connected to our friends all over the world."
                            ]
                        },
                        {
                            "explanation": "related to someone or something: ",
                            "examples": [
                                "They're not blood relations - they're just connected by marriage.",
                                "The two subjects are not at all connected.",
                                "Evidence is admitted if it is reasonably likely that the object is connected to the crime.",
                                "He was connected in some way with that fraud scandal a couple of years back."
                            ]
                        },
                        {
                            "explanation": "feeling that you understand, like, and are interested in someone or something: ",
                            "examples": [
                                "They are a great couple — they seem very connected.",
                                "We want the fans to feel more connected to the team."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}