{
    "word": "connection",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəˈnek.ʃən"
                            ],
                            "us": [
                                "kəˈnek.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the state of being related to someone or something else: ",
                            "examples": [
                                "The connection between smoking and heart disease is well known.",
                                "They're sisters? I knew their surname was the same, but I never made (= thought of) the connection."
                            ]
                        },
                        {
                            "explanation": "on the subject of something: ",
                            "examples": [
                                "They want to talk to you in connection with an unpaid tax bill."
                            ]
                        },
                        {
                            "explanation": "the people you know and who can help you: ",
                            "examples": [
                                "He only got the job because of his connections!"
                            ]
                        },
                        {
                            "explanation": "the act of joining or being joined to something else, or the part or process that makes this possible: ",
                            "examples": [
                                "You need a fast internet connection.",
                                "Alerts are still sent even when the internal network connection is down.",
                                "a broadband/high-speed/wireless connection",
                                "The electricity company guarantees connection within 24 hours.",
                                "No wonder your charger isn't working. There's a loose connection (= a connecting wire has become loose) in the plug."
                            ]
                        },
                        {
                            "explanation": "a feeling that you understand, like, and are interested in someone or something: ",
                            "examples": [
                                "Generations of readers have felt a connection with the book.",
                                "It became very clear that voters felt a strong connection to the candidate. ",
                                "We want to encourage activities that build connections between people."
                            ]
                        },
                        {
                            "explanation": "the way that two people can speak to each other by phone: ",
                            "examples": [
                                "Sorry, could you repeat that? This is a very bad connection."
                            ]
                        },
                        {
                            "explanation": "a bus, train, plane, etc. that arrives at a time that allows passengers to get on after getting off another one, so that they can continue their journey: ",
                            "examples": [
                                "If the flight is late, we'll miss our connection."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}