{
    "word": "consolidator",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kənˈsɒl.ɪ.deɪ.tər"
                            ],
                            "us": [
                                "kənˈsɑː.lə.deɪ.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a company that buys a supply of particular goods or services from different places and then offers them for sale to the public: ",
                            "examples": [
                                "The website lets you scour the sites of all airlines, hotels, and consolidators for the best price.",
                                "Consolidator tickets are generally non-refundable."
                            ]
                        },
                        {
                            "explanation": "a large, successful company that buys other companies in order to form a larger organization: ",
                            "examples": [
                                "Many regional chains went bankrupt or were bought up by consolidators.",
                                "You want to be with one of the consolidators, not one of the companies that are going to be acquired."
                            ]
                        },
                        {
                            "explanation": "a transport company that arranges for goods sent by different companies to be stored and transported together: ",
                            "examples": [
                                "Intermediaries known as consolidators gather together goods or packages from a variety of customers and load them all into the container.",
                                "A trusted container is one being shipped to an importer or by a consolidator known to customs inspectors. "
                            ]
                        },
                        {
                            "explanation": "a company that takes all of someone's debts and combines them into a single loan (= an amount of money borrowed): ",
                            "examples": [
                                "Many consolidators do not offer fixed interest rates.",
                                "She and her husband sought help from a debt consolidator earlier this year."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}