{
    "word": "consider",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kənˈsɪd.ər"
                            ],
                            "us": [
                                "kənˈsɪd.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to spend time thinking about a possibility or making a decision: ",
                            "examples": [
                                "Don't make any decisions before you've considered the situation.",
                                "Have you considered what you'll do if you don't get the job?",
                                "We're considering selling the house.",
                                "She's being considered for the job.",
                                "I'd like some time to consider before I make a decision."
                            ]
                        },
                        {
                            "explanation": "to give attention to a particular subject or fact when judging something else: ",
                            "examples": [
                                "You've got to consider the time element when planning the whole project.",
                                "If you consider how long he's been learning the piano, he's not very good."
                            ]
                        },
                        {
                            "explanation": "to care about or respect other people or their feelings and wishes: ",
                            "examples": [
                                "Did you consider your mother and how she's going to feel about you leaving?",
                                "She never considers anyone but herself - she's totally selfish!"
                            ]
                        },
                        {
                            "explanation": "to believe someone or something to be, or think of him, her, or it as something: ",
                            "examples": [
                                "He is currently considered (to be) the best British athlete.",
                                "We don't consider her to be right for the job.",
                                "It is considered bad manners in some cultures to speak with your mouth full of food.",
                                "I consider myself lucky that I only hurt my arm in the accident.",
                                "Do you consider him a friend of yours?",
                                "She considers (that) she has done enough to help already."
                            ]
                        },
                        {
                            "explanation": "to be very much admired: ",
                            "examples": [
                                "I don't like her books, but I know she's very highly considered."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}