{
    "word": "contour",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒn.tɔːr"
                            ],
                            "us": [
                                "ˈkɑːn.tʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the shape of a mass of land or other object, especially its curved surface or the curved shape formed by its outer edge: ",
                            "examples": [
                                "the rugged contour of the coast",
                                "He studied the contours of her face.",
                                "Her latest collection of swimwear shows off the contours of the human body to perfection."
                            ]
                        },
                        {
                            "explanation": "a line on a map that joins points of equal height or depth, in a way that shows high and low areas of land: ",
                            "examples": [
                                "a 400 ft contour line",
                                "This map has contours marked at 250-metre intervals."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkɒn.tɔːr"
                            ],
                            "us": [
                                "ˈkɑːn.tʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change the shape of a surface, making some parts higher and some parts lower: ",
                            "examples": [
                                "One option is to contour the bottom of the lake, making it deep in the middle and shallow at the edges. ",
                                "We used the leftover sand and soil from the excavations to contour the picnic grounds."
                            ]
                        },
                        {
                            "explanation": "to closely follow or fit around the curved surface or shape of something, or to make something do this: ",
                            "examples": [
                                "Here the route forks left to contour around the hillside back to the ski village.",
                                "The ice pack does not freeze solid, making it easy to contour it to ankles and knees."
                            ]
                        },
                        {
                            "explanation": "to use make-up to create darker and lighter areas on your face, that give the effect of changing or emphasizing its shape: ",
                            "examples": [
                                "I bought a new foundation stick to try contouring my face.",
                                "This easy makeup tutorial shows you how to contour."
                            ]
                        },
                        {
                            "explanation": "to put lines on a map that join points of equal height or depth: ",
                            "examples": [
                                "Lack of available data for sediment thicknesses has prevented contouring the map."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}