{
    "word": "contact",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒn.tækt"
                            ],
                            "us": [
                                "ˈkɑːn.tækt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "communication with someone, especially by speaking or writing to them regularly: ",
                            "examples": [
                                "\"Have you been in contact with Andrew recently?\" \"Only by phone.\"",
                                "I'm still in contact with her - we write a couple of times a year.",
                                "There isn't enough contact between teachers and parents.",
                                "I've been busy at home and have hardly had any contact with the outside world.",
                                "I'd hate to lose contact with my college friends.",
                                "She finally made contact with him in Italy.",
                                "Air traffic control lost radio contact with the pilot of the plane ten minutes before the accident.",
                                "The school needs a contact number (= phone number, especially for emergencies) for parents during school hours."
                            ]
                        },
                        {
                            "explanation": "the fact of two people or things touching each other: ",
                            "examples": [
                                "Don't let that glue come into contact with your skin.",
                                "Have you been in contact with (= touched or been very near) anyone with the disease?",
                                "He hates physical contact of any kind - he doesn't even like to shake your hand."
                            ]
                        },
                        {
                            "explanation": "a person, especially someone in a high position, who can give you useful information or introductions that will help you at work or socially: ",
                            "examples": [
                                "I don't really know how she got the job, but I think her mother has contacts.",
                                "He gave me the name of one of his contacts in a design firm, who offered me a job.",
                                "We're building up (= increasing the number of) our contacts in the business."
                            ]
                        },
                        {
                            "explanation": "the people whose names, telephone numbers, addresses, etc. you keep, for example stored on your mobile phone: ",
                            "examples": [
                                "How do you add a new contact?"
                            ]
                        },
                        {
                            "explanation": "the place on your mobile phone or computer where you store people's names, telephone numbers, addresses, etc.: ",
                            "examples": [
                                "Click the icon to go to contacts. "
                            ]
                        },
                        {
                            "explanation": "a part in a circuit that makes the circuit complete when it touches another part",
                            "examples": []
                        },
                        {
                            "explanation": "a small round curved piece of transparent plastic, worn on the surface of the eye to improve your sight",
                            "examples": []
                        },
                        {
                            "explanation": "a photograph produced by allowing light to pass through the film onto paper that is pressed tightly to it ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkɒn.tækt"
                            ],
                            "us": [
                                "ˈkɑːn.tækt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to communicate with someone by calling or sending them a letter, email, etc.: ",
                            "examples": [
                                "I tried to contact him at his office, but he wasn't in.",
                                "You can contact me on (US also at) (= speak to me using the phone) 388 9146.",
                                "Unless the money is paid, we will be contacting our legal department."
                            ]
                        },
                        {
                            "explanation": "to touch something: ",
                            "examples": [
                                "If the solution accidentally contacts the skin, rinse the affected area thoroughly with water."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}