{
    "word": "controlled",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kənˈtrəʊld"
                            ],
                            "us": [
                                "kənˈtroʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "involving careful, intentional actions that limit risk or danger: ",
                            "examples": [
                                "Police carried out a controlled explosion on a suspicious vehicle.",
                                "She allows her children to use messaging apps that give a more controlled environment, allowing her to block messages from strangers.",
                                "Access to the information is very controlled."
                            ]
                        },
                        {
                            "explanation": "not allowing your emotions to be strongly expressed or to influence your behaviour: ",
                            "examples": [
                                "He says he is a far more controlled and thoughtful person than he was when he was younger.",
                                "She seems very controlled, but those who know her well say she is impulsive, warm and funny."
                            ]
                        },
                        {
                            "explanation": "A controlled substance has its use or sale tightly controlled by law because it is considered to be dangerous or to cause addiction (= an inability to stop using it). : ",
                            "examples": [
                                "He pleaded guilty to possession of controlled substances.",
                                "It is a controlled drug approved for short-term use to treat insomnia."
                            ]
                        },
                        {
                            "explanation": "A controlled study or test uses a control (= an object or system that is not changed so that you can compare it with similar objects or systems that are intentionally changed): ",
                            "examples": [
                                "Many other factors could account for these results, because these were not randomized controlled trials.",
                                "We conducted a controlled experiment/study to assess the effectiveness of the method. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \ncontrol ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}