{
    "word": "convocation",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌkɒn.vəˈkeɪ.ʃən"
                            ],
                            "us": [
                                "ˌkɑːn.vəˈkeɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a formal meeting, especially of religious leaders or at an educational institution: ",
                            "examples": [
                                "He called for a traditional convocation of elders to choose a new leader.",
                                "She organized alumni gatherings and faculty convocations. ",
                                "Similar forums and meetings have taken place all over the city - convocations of people swapping ideas."
                            ]
                        },
                        {
                            "explanation": "the act of arranging a convocation: ",
                            "examples": [
                                "He proposed the convocation of a national representative assembly."
                            ]
                        },
                        {
                            "explanation": "in Canada and at some universities in the US, a graduation ceremony (= the ceremony at which students officially receive their degrees): ",
                            "examples": [
                                "Our convocation at the University of Toronto is this week.",
                                "The convocation address was delivered by the Illinois senator. "
                            ]
                        },
                        {
                            "explanation": "at some universities in the UK and in some other countries, a group that represents all the members of a university and that meets to officially decide something: ",
                            "examples": [
                                "Through Convocation, graduates can have a say in the way the University is run.",
                                "Nominations must by backed by at least 12 members of the university's convocation, which consists of all 180,000 graduates and its academic staff. "
                            ]
                        },
                        {
                            "explanation": "a meeting of clergy (= church leaders) and church members from one part of a diocese (= an area controlled by a bishop): ",
                            "examples": [
                                "At the church's annual Holy Convocation in November, he received a standing ovation."
                            ]
                        },
                        {
                            "explanation": "in the Church of England in the past, a meeting of clergy (= church leaders) representing part of the Church, either Canterbury or York: ",
                            "examples": [
                                "The Convocations of Canterbury and York were replaced by the Church Assembly in 1920. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}