{
    "word": "convention",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kənˈven.ʃən"
                            ],
                            "us": [
                                "kənˈven.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large formal meeting of people who do a particular job or have a similar interest, or a large meeting for a political party: ",
                            "examples": [
                                "the national Democratic convention",
                                "Where are they holding their party convention?",
                                "She addressed hundreds of attendees at the International Reading Association's annual convention."
                            ]
                        },
                        {
                            "explanation": "a large event where fans of (= people who are very enthusiastic about) a particular TV programme, film, computer game, etc. can meet each other and some of the people involved in making the programme, film, etc.: ",
                            "examples": [
                                "Thousands of people were in town for the country's largest annual comic book convention.",
                                "The venue hosts everything from dog shows to science fiction conventions.",
                                "The actor liked to attend fan conventions in full costume and chat to his audience."
                            ]
                        },
                        {
                            "explanation": "a usual or accepted way of behaving, especially in social situations, often following an old way of thinking or a custom in one particular society: ",
                            "examples": [
                                "They defied/flouted/broke with convention by giving up their jobs and becoming self-sufficient.",
                                "Convention dictates that it is the man who asks the woman to marry him and not the other way round.",
                                "In many countries it is the/a convention to wear black at funerals."
                            ]
                        },
                        {
                            "explanation": "a common way of showing something in art or writing: ",
                            "examples": [
                                "an artistic convention"
                            ]
                        },
                        {
                            "explanation": "a formal agreement between country leaders, politicians, and states on a matter that involves them all: ",
                            "examples": [
                                "the Geneva Convention",
                                "The decision is not compatible with the European Convention on Human Rights."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}