{
    "word": "cooperative",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kəʊˈɒp.ər.ə.tɪv"
                            ],
                            "us": [
                                "koʊˈɑː.pɚ.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "willing to help or do what people ask: ",
                            "examples": [
                                "I asked them to turn down their music, but they're not being very cooperative.",
                                "He was an extremely co-operative witness."
                            ]
                        },
                        {
                            "explanation": "done or owned together with other people: ",
                            "examples": [
                                "Purchase of the ranch was a cooperative effort between many groups and agencies.",
                                "The work is the result of a co-operative venture of approximately 80 physicists from around the world.",
                                "The cooperative business brings together 500 wine producers in the region."
                            ]
                        },
                        {
                            "explanation": "(of a house, a building, etc.) owned by a cooperative (= an organization that owns and manages houses that its members live in): ",
                            "examples": [
                                "We need more co-operative housing.",
                                "a cooperative apartment"
                            ]
                        },
                        {
                            "explanation": "involving a group of people playing a game together to try to achieve the same thing, rather than trying to beat each other: ",
                            "examples": [
                                "These levels can be played solo or with a friend in cooperative play."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kəʊˈɒp.ər.ə.tɪv"
                            ],
                            "us": [
                                "koʊˈɑː.pɚ.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an organization, business, shop, farm, or group of farms that is owned and managed by a group of people who also work in it: ",
                            "examples": [
                                "The magazine is run as a cooperative.",
                                "We are a 100% worker-owned co-operative selling 100% Fair Trade certified coffee, tea, chocolate, and snacks."
                            ]
                        },
                        {
                            "explanation": "an organization that owns and manages houses that its members live in, or the group of houses that it owns: ",
                            "examples": [
                                "Like many apartment buildings in New York City, the building is run by a cooperative. ",
                                "They live in a housing co-operative for senior citizens. "
                            ]
                        },
                        {
                            "explanation": "a house or flat that is owned by a cooperative (= an organization that owns and manages houses that its members live in): ",
                            "examples": [
                                "Many apartments on the Upper East Side were being turned into cooperatives."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}