{
    "word": "copy",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkɒp.i"
                            ],
                            "us": [
                                "ˈkɑː.pi"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to intentionally make or do something that is the same as an original piece of work: ",
                            "examples": [
                                "They've copied the basic design from the Japanese model and added a few of their own refinements.",
                                "The original painting has been copied many times.",
                                "They practised their handwriting by copying.",
                                "He shamelessly copied from American talk radio.",
                                "He was always copying off other students, but never got caught."
                            ]
                        },
                        {
                            "explanation": "to behave, dress, speak, etc. in a way that is intended to be like someone else, for example, because you admire that person: ",
                            "examples": [
                                "He tends to copy his brother in the way he dresses.",
                                "Small children often learn by copying."
                            ]
                        },
                        {
                            "explanation": "to create another version of a document, some software, some text, etc. that is exactly the same as the first version: ",
                            "examples": [
                                "The scanner can copy images or text.",
                                "Highlight the text you want and copy it to the clipboard.",
                                "To copy your messages and contacts into another program, use that program's own import facility.",
                                "Patricia's going to copy her novel onto a flash drive and send it to me."
                            ]
                        },
                        {
                            "explanation": "If you copy and paste text, an image, etc. from a computer or phone document, you create another version of it that is exactly the same and put it in a different place or a different document: ",
                            "examples": [
                                "A significant percentage of students admit to copying and pasting text from websites."
                            ]
                        },
                        {
                            "explanation": "used, especially when communicating by radio, to tell someone that you have heard or understood, or to ask if someone has heard or understood you: ",
                            "examples": [
                                "He pressed the call button on his walkie-talkie: \"We've got them.\" \" Copy that. Stay where you are.\" ",
                                "\"Rodriguez, do you copy?\"— \"Yes, sir.\"— \"What's your position?\" "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkɒp.i"
                            ],
                            "us": [
                                "ˈkɑː.pi"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that has been made to be exactly like something else: ",
                            "examples": [
                                "This painting is only a copy - the original hangs in the Louvre.",
                                "I always keep a copy of any official or important letters that I send off.",
                                "Could you make a copy of (= use a special machine to copy) this for tomorrow's meeting, please?"
                            ]
                        },
                        {
                            "explanation": "a single book, newspaper, record, or other printed or recorded text of which many have been produced: ",
                            "examples": [
                                "The library has copies of all the national and local newspapers."
                            ]
                        },
                        {
                            "explanation": "written text that is to be printed, or text that is intended to help with the sale of a product: ",
                            "examples": [
                                "We need someone who can write good copy for our publicity department."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}