{
    "word": "core",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɔːr"
                            ],
                            "us": [
                                "kɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the basic and most important part of something: ",
                            "examples": [
                                "The lack of government funding is at the core of the problem."
                            ]
                        },
                        {
                            "explanation": "the hard central part of some fruits, such as apples, that contains the seeds: ",
                            "examples": [
                                "Don't throw your apple core on the floor!"
                            ]
                        },
                        {
                            "explanation": "the centre of a planet: ",
                            "examples": [
                                "The earth's core is a hot, molten mix of iron and nickel."
                            ]
                        },
                        {
                            "explanation": "The core of a nuclear reactor (= a device in which atoms are changed to produce energy) is the place where fission (= the dividing of atoms) happens.",
                            "examples": []
                        },
                        {
                            "explanation": "the muscles around your pelvis, hips, and abdomen that you use in most body movements: ",
                            "examples": [
                                "These exercises are designed to strengthen your core."
                            ]
                        },
                        {
                            "explanation": "a long, thin cylinder-shaped mass of material taken out of the earth for study",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kɔːr"
                            ],
                            "us": [
                                "kɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "most important or most basic: ",
                            "examples": [
                                "They are cutting back production of some of their core products."
                            ]
                        },
                        {
                            "explanation": "a value, belief, etc. that is basic and more important than any other: ",
                            "examples": [
                                "The final status negotiations would focus on the core issues of the peace process."
                            ]
                        },
                        {
                            "explanation": "the most important or largest part of a company's business activities: ",
                            "examples": [
                                "The company's core operations include entertainment and aviation."
                            ]
                        },
                        {
                            "explanation": "the most important parts of a course of study, that all students must learn: ",
                            "examples": [
                                "We want to see greater provision of subjects outside the core curriculum."
                            ]
                        },
                        {
                            "explanation": "found in the main part of the body, but not the arms or the legs: ",
                            "examples": [
                                "Pilates is good for strengthening the core muscles."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɔːr"
                            ],
                            "us": [
                                "kɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to remove the core from a piece of fruit: ",
                            "examples": [
                                "Peel and core the pears before cooking them."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                "-kɔːr"
                            ],
                            "us": [
                                "-kɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used in newspapers, magazines, and on social media to form words describing a particular type of style in clothes, music, furniture, etc.: ",
                            "examples": [
                                "Cottagecore is an internet aesthetic that celebrates an idealized rural life.",
                                "The website has a section on classic novels entitled \"Lit-core\".",
                                "When are fashion journalists going to stop putting the word \"-core\" at the end of everything?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}