{
    "word": "cost",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɒst"
                            ],
                            "us": [
                                "kɑːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the amount of money needed to buy, do, or make something: ",
                            "examples": [
                                "When you buy a new computer, you usually get software included at no extra cost (= for no additional money).",
                                "In most families, two salaries are essential to cover the cost of (= pay for) raising a family.",
                                "The supermarket chain announced that it was cutting the cost (= reducing the price) of all its fresh and frozen meat.",
                                "It's difficult for most people to deal with the rising cost of (= increasing price of) healthcare.",
                                "I was able to buy the damaged goods at cost (= for only the amount of money needed to produce or get the goods, without any extra money added for profit)."
                            ]
                        },
                        {
                            "explanation": "the amount of money needed for a business or to do a particular job: ",
                            "examples": [
                                "We need to cut our advertising costs."
                            ]
                        },
                        {
                            "explanation": "something that is given, needed, or lost in order to get a particular thing: ",
                            "examples": [
                                "We were going to paint the house ourselves, but when we considered the cost in time and effort, we decided to get a painter to do it for us.",
                                "The driver managed not to hit the child who ran in front of his car, but only at the cost of injuring himself.",
                                "She has finally got the job she wanted, but at great personal cost (= she has had to give up other things that were important to her).",
                                "It's not worth getting into an argument with Paula, as I learned to my cost (= from my unpleasant experience of having done so)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɒst"
                            ],
                            "us": [
                                "kɑːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If something costs an amount of money, you must pay that amount to buy or do it: ",
                            "examples": [
                                "\"How much does this book cost?\" \"It costs £25.\"",
                                "It costs a lot to buy a house in this part of Sydney.",
                                "The trip will cost you $1,000."
                            ]
                        },
                        {
                            "explanation": "to calculate the future cost of something: ",
                            "examples": [
                                "My boss asked me to cost the materials for the new fence and gate.",
                                "Has your plan been properly costed (out)?"
                            ]
                        },
                        {
                            "explanation": "to cause someone to lose or destroy something valuable: ",
                            "examples": [
                                "Drinking and driving costs lives (= can cause accidents in which people die).",
                                "His affairs cost him his marriage (= his marriage ended because of them)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}