{
    "word": "could",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "modal verb",
                        "ipa": {
                            "uk": [
                                "kʊd",
                                "kəd"
                            ],
                            "us": [
                                "kʊd",
                                "kəd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple of \"can\", used to talk about what someone or something was able or allowed to do: ",
                            "examples": [
                                "When I was younger I could stay up all night and not get tired.",
                                "It was so noisy that we couldn't hear ourselves speak.",
                                "You said we could watch TV when we finished our homework.",
                                "We asked if the computer could access the internet."
                            ]
                        },
                        {
                            "explanation": "used as a more polite form of \"can\" when asking for permission: ",
                            "examples": [
                                "Could I speak to Mr Davis, please?",
                                "Excuse me, could I just say something?"
                            ]
                        },
                        {
                            "explanation": "used as a more polite form of \"can\" when asking someone to provide something or do something: ",
                            "examples": [
                                "Could you lend me £5?",
                                "Could you turn that music down a little, please?"
                            ]
                        },
                        {
                            "explanation": "used to express possibility, especially slight or uncertain possibility: ",
                            "examples": [
                                "A lot of crime could be prevented.",
                                "She could arrive anytime now.",
                                "This new drug could be an important step in the fight against cancer.",
                                "Be careful with that stick - you could have hit your sister!"
                            ]
                        },
                        {
                            "explanation": "used for making a suggestion: ",
                            "examples": [
                                "We could go out for a drink after work tomorrow, if you want.",
                                "You could always call Susie and see if she will babysit."
                            ]
                        },
                        {
                            "explanation": "used for saying, especially angrily, what you think someone else should do: ",
                            "examples": [
                                "Well, you could try to look a little more enthusiastic!",
                                "I waited ages for you - you could have said that you weren't coming!"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}