{
    "word": "countercharge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkaʊn.tə.tʃɑːdʒ"
                            ],
                            "us": [
                                "ˈkaʊn.t̬ɚ.tʃɑːrdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a charge (= a statement accusing someone of doing something wrong or illegal) that someone makes against a person who has made a charge against them: ",
                            "examples": [
                                "In the heat of the election campaign, charges and countercharges are flying.",
                                "Often, when complaints were made, the police brought counter-charges. "
                            ]
                        },
                        {
                            "explanation": "a charge (= an attack in which an army suddenly moves forward) intended to stop or oppose a charge by an enemy: ",
                            "examples": [
                                "When French soldiers charged the enemy line, they met an infantry and cavalry countercharge by Wellington's troops."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkaʊn.tə.tʃɑːdʒ"
                            ],
                            "us": [
                                "ˈkaʊn.t̬ɚ.tʃɑːrdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to publicly accuse someone of doing something bad after they have accused you of doing something bad: ",
                            "examples": [
                                "He was charged with a cover-up but the president's supporters counter-charged that his opponents had manufactured a scandal to smear him."
                            ]
                        },
                        {
                            "explanation": "to formally or officially accuse someone of committing a crime after you have been officially accused of something: ",
                            "examples": [
                                "She has counter-charged Stuart with attempted assault. ",
                                "Should I countercharge in such a situation?"
                            ]
                        },
                        {
                            "explanation": "to charge (= attack by suddenly moving forward) at an enemy in order to stop or oppose a charge by them: ",
                            "examples": [
                                "The cavalry counter-charged."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}