{
    "word": "counterattack",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkaʊn.tər.ə.tæk"
                            ],
                            "us": [
                                "ˈkaʊn.t̬ɚ.ə.tæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an attack intended to stop or oppose an attack by an enemy: ",
                            "examples": [
                                "The military expects insurgents to mount a counterattack on supply lines.",
                                "He ordered a swift counterattack against the invaders."
                            ]
                        },
                        {
                            "explanation": "in politics, etc., criticism or arguments intended to stop or oppose someone who has opposed or criticized you : ",
                            "examples": [
                                "The Republicans have still not been able to launch a strong counterattack against the new healthcare system.",
                                "There were questions about his integrity, but he always had an explanation - and a counterattack."
                            ]
                        },
                        {
                            "explanation": "in sports, a move forward in an attempt to score points, goals, etc., at a time when your opponent is moving in the opposite direction or trying to score: ",
                            "examples": [
                                "Birmingham City were caught out by a counterattack in the last minute of the game. "
                            ]
                        },
                        {
                            "explanation": "an action in business intended to stop or oppose an action against you by a competitor: ",
                            "examples": [
                                "The tech giant launched a counterattack against its rival."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌkaʊn.tər.əˈtæk"
                            ],
                            "us": [
                                "ˌkaʊn.t̬ɚ.əˈtæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to attack an enemy in order to stop or oppose their attack on you: ",
                            "examples": [
                                "The air force counterattacked and repelled the invasion."
                            ]
                        },
                        {
                            "explanation": "to criticize or argue against an opponent who has criticized or opposed you: ",
                            "examples": [
                                "Mr Deforge counterattacked by bringing charges for defamation."
                            ]
                        },
                        {
                            "explanation": "in sports, to move forward in an attempt to score points, goals, etc., at a time when your opponent is moving forward or trying to score: ",
                            "examples": [
                                "We have the ability to catch teams out by counterattacking with speed."
                            ]
                        },
                        {
                            "explanation": "to take action against a competitor in business who has taken action against you: ",
                            "examples": [
                                "Engineers from a rival company counterattacked with a new product."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}