{
    "word": "count",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kaʊnt"
                            ],
                            "us": [
                                "kaʊnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to say numbers one after the other in order, or to calculate the number of people or things in a group: ",
                            "examples": [
                                "Let's count out loud (= speak the words) from one to ten.",
                                "The teachers counted the students as they got on to the bus.",
                                "Count your money carefully to make sure it's all there.",
                                "We need to count who's here, so we can make sure that no one's missing.",
                                "There'll be eight for dinner, counting (= including) ourselves.",
                                "We're still waiting for the votes to be counted (up)."
                            ]
                        },
                        {
                            "explanation": "to count the number of people present somewhere: ",
                            "examples": [
                                "There look to be about 50 people here - I haven't counted heads yet."
                            ]
                        },
                        {
                            "explanation": "to have value or importance: ",
                            "examples": [
                                "I've always believed that happiness counts more than money.",
                                "My opinion doesn't count for anything around here (= no one values my opinion)."
                            ]
                        },
                        {
                            "explanation": "to consider or be considered as: ",
                            "examples": [
                                "I count myself fortunate to have had such a good education.",
                                "I've had three jobs in the last five years, but one of them was unpaid, so it doesn't count (= cannot be considered as a real job).",
                                "I've always counted Sophia among my closest friends.",
                                "I didn't think his grudging remarks really counted as an apology."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kaʊnt"
                            ],
                            "us": [
                                "kaʊnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of counting, or the total number of things counted: ",
                            "examples": [
                                "Having done a quick count, I find I've planted 25 different ferns.",
                                "The current head count (= total number of people) is about 31,500 employees.",
                                "We had 450 members at the last count (= when they were last counted)."
                            ]
                        },
                        {
                            "explanation": "the act of counting the votes in an election, or the event when this happens: ",
                            "examples": [
                                "Early counts show Mr Adams in the lead.",
                                "The candidate's spouse and election agent are also entitled to be present at the count.",
                                "He lost by 3% of the vote, and has challenged the count in court."
                            ]
                        },
                        {
                            "explanation": "to record how many of something there are, or how many times something has happened: ",
                            "examples": [
                                "So many people asked us for help, it was hard to keep count."
                            ]
                        },
                        {
                            "explanation": "to not be able to remember how many times something has happened: ",
                            "examples": [
                                "I've lost count of how many times she's been late for work this month."
                            ]
                        },
                        {
                            "explanation": "a scientifically measured amount of something: ",
                            "examples": [
                                "a high pollen count",
                                "a low blood/sperm count"
                            ]
                        },
                        {
                            "explanation": "when a particular number is reached: ",
                            "examples": [
                                "On the count of three, I'd like you all to stand up."
                            ]
                        },
                        {
                            "explanation": "in boxing, the act of a referee counting slowly in seconds from one to ten when a fighter has been knocked down. If the fighter cannot stand up before the end of the count, they lose the match. : ",
                            "examples": [
                                "He been down for a count of eight at the end of the previous round and looked to have little left. ",
                                "He was floored for the full count in round two.",
                                "He beat the count and stumbled up at eight. "
                            ]
                        },
                        {
                            "explanation": "in baseball, the number of balls thrown to a batter and the number of strikes (= balls they do not hit): ",
                            "examples": [
                                "Travis walked on a 3–2 count. ",
                                "Gil saw the count go to 3-and-0 with two runners on in the second."
                            ]
                        },
                        {
                            "explanation": "a European man of the same social rank as an English earl",
                            "examples": []
                        },
                        {
                            "explanation": "a particular crime that a person is accused of: ",
                            "examples": [
                                "The prisoner was found guilty on two counts of murder."
                            ]
                        },
                        {
                            "explanation": "an opinion in a discussion or argument: ",
                            "examples": [
                                "I'm afraid I disagree with you on all/several counts (= I disagree with all/several of your opinions)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}