{
    "word": "couple",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkʌp.əl"
                            ],
                            "us": [
                                "ˈkʌp.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "two or a few things that are similar or the same, or two or a few people who are in some way connected: ",
                            "examples": [
                                "The doctor said my leg should be better in a couple of days.",
                                "A couple of people objected to the proposal, but the vast majority approved of it.",
                                "We'll have to wait another couple of hours for the paint to dry.",
                                "She'll be retiring in a couple more years.",
                                "The weather's been terrible for the last couple of days.",
                                "Many economists expect unemployment to fall over the next couple of months.",
                                "I'm sorry I didn't call you, but I've been very busy over the past couple of weeks."
                            ]
                        },
                        {
                            "explanation": "two people who are married or in a romantic or sexual relationship, or two people who are together for a particular purpose: ",
                            "examples": [
                                "a married couple",
                                "An elderly couple live (US lives) next door.",
                                "Should the government do more to help young couples buy their own homes?",
                                "The couple skated spectacularly throughout the competition."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkʌp.əl"
                            ],
                            "us": [
                                "ˈkʌp.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to join or combine: ",
                            "examples": [
                                "The sleeping car and restaurant car were coupled together.",
                                "High inflation coupled with low output spells disaster for the government in the election."
                            ]
                        },
                        {
                            "explanation": "When two people or two animals couple, they have sex.",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}