{
    "word": "court",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɔːt"
                            ],
                            "us": [
                                "kɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a place where trials and other legal cases happen, or the people present in such a place, especially the officials and those deciding if someone is guilty: ",
                            "examples": [
                                "Protestors gathered outside the court to await the verdict.",
                                "He's due to appear in court again on Monday.",
                                "Please describe to the court exactly what you saw.",
                                "the European Court of Human Rights",
                                "The lack of evidence means that the case is unlikely to go to court."
                            ]
                        },
                        {
                            "explanation": "to take legal action against someone: ",
                            "examples": [
                                "She's threatening to take me to court for not paying the bill on time."
                            ]
                        },
                        {
                            "explanation": "to solve a legal disagreement without taking legal action: ",
                            "examples": [
                                "The newspaper has agreed to settle out of court."
                            ]
                        },
                        {
                            "explanation": "an area drawn out on the ground that is used for playing sports such as tennis and basketball: ",
                            "examples": [
                                "a tennis/volleyball/basketball/squash court",
                                "They were penalized for having too many players on the court."
                            ]
                        },
                        {
                            "explanation": "an area or a short road that is not covered by a roof and is mostly or completely surrounded by buildings: ",
                            "examples": [
                                "You really should go and see the medieval court in the castle."
                            ]
                        },
                        {
                            "explanation": "used in the names of some roads, and buildings containing apartments",
                            "examples": []
                        },
                        {
                            "explanation": "the official home of a queen or king: ",
                            "examples": [
                                "the courts of Renaissance Europe",
                                "He quickly lost his popularity at court."
                            ]
                        },
                        {
                            "explanation": "the important people who live in the official home of a queen or king or who work for or advise them",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɔːt"
                            ],
                            "us": [
                                "kɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to try to please someone because you want them to join you: ",
                            "examples": [
                                "Adams is being courted by a number of football clubs."
                            ]
                        },
                        {
                            "explanation": "to try to get something, especially attention or support from other people: ",
                            "examples": [
                                "She courts publicity by inviting journalists to extravagant parties."
                            ]
                        },
                        {
                            "explanation": "to risk something unpleasant, especially by behaving stupidly or carelessly: ",
                            "examples": [
                                "Drinking and driving is simply courting disaster."
                            ]
                        },
                        {
                            "explanation": "to have a romantic relationship with someone that you hope to marry: ",
                            "examples": [
                                "They courted for two years before getting married."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}