{
    "word": "course",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɔːs"
                            ],
                            "us": [
                                "kɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a set of classes or a plan of study on a particular subject, usually leading to an exam or qualification: ",
                            "examples": [
                                "They're going away on a training course next week.",
                                "I'd like to do (US take) a writing course when I retire.",
                                "Tim did a three-year course in linguistics at Newcastle."
                            ]
                        },
                        {
                            "explanation": "an area of land or water used for a sports event: ",
                            "examples": [
                                "a golf course/cross-country course"
                            ]
                        },
                        {
                            "explanation": "the often gradual development of something, or the way something happens, or a way of doing something: ",
                            "examples": [
                                "Did the scandal have any effect on the course of the election?",
                                "In the course of (= during) the interview it became clear that he was not the right person for the job.",
                                "What would be an appropriate course (of action) in such a situation?",
                                "If our rivals are spending more on advertising, we'll have to follow the same course.",
                                "The defendants are also accused of attempting to pervert the course of justice."
                            ]
                        },
                        {
                            "explanation": "after a period of time: ",
                            "examples": [
                                "I assume they plan to have children in the course of time."
                            ]
                        },
                        {
                            "explanation": "gradually: ",
                            "examples": [
                                "With the course of time, I've learned to live with my disability."
                            ]
                        },
                        {
                            "explanation": "the direction in which a vehicle, especially an aircraft, spacecraft, or ship, moves, or the path along which a river flows: ",
                            "examples": [
                                "The pilot avoided a collision by changing course.",
                                "Changing the course of the river would cause serious environmental damage to the whole valley.",
                                "The debate completely changed course after Liz made her speech."
                            ]
                        },
                        {
                            "explanation": "likely to happen, or likely to succeed as planned: ",
                            "examples": [
                                "Because of the recession, we're on course for/to have record unemployment levels."
                            ]
                        },
                        {
                            "explanation": "in a position where something or someone is unlikely to achieve what is wanted or needed, or to operate smoothly: ",
                            "examples": [
                                "They need to know why their policies are off course.",
                                "Uncertainty can easily blow the stock market off course.",
                                "She is very determined and will not allow anyone to knock her off course."
                            ]
                        },
                        {
                            "explanation": "a part of a meal that is served separately from the other parts: ",
                            "examples": [
                                "a four-course lunch",
                                "A traditional British main course consists of a meat dish with potatoes and other vegetables."
                            ]
                        },
                        {
                            "explanation": "a fixed number of regular medical treatments: ",
                            "examples": [
                                "My doctor's put me on a course of antibiotics.",
                                "She needed a six-month course of physiotherapy after she broke her leg."
                            ]
                        },
                        {
                            "explanation": "a continuous horizontal layer of bricks or other building material",
                            "examples": []
                        },
                        {
                            "explanation": "the bleeding from a woman's uterus (= the organ in the body in which a baby develops before birth) that happens about once a month when she is not pregnant: ",
                            "examples": [
                                "Her courses ceased and she knew that she was with child."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɔːs"
                            ],
                            "us": [
                                "kɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to flow quickly or in large amounts: ",
                            "examples": [
                                "Tears were coursing down his cheeks.",
                                "You could almost hear the blood coursing through her veins as she passed the finishing line.",
                                "A new wave of idealism is coursing through our schools."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}