{
    "word": "cover",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkʌv.ər"
                            ],
                            "us": [
                                "ˈkʌv.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put or spread something over something, or to lie on the surface of something: ",
                            "examples": [
                                "The light was so bright that I had to cover my eyes.",
                                "Snow covered the hillsides.",
                                "She covered him (up) with a blanket.",
                                "Cover the meat with a layer of cheese.",
                                "The bandages were covered with/in blood.",
                                "How much of the earth's surface is covered by/with water?"
                            ]
                        },
                        {
                            "explanation": "to deal with or direct attention to something: ",
                            "examples": [
                                "This leaflet covers what we've just discussed in more detail.",
                                "Do these parking restrictions cover residents as well as visitors?",
                                "The salesman's territory covers the whole of the southeast."
                            ]
                        },
                        {
                            "explanation": "to report the news about a particular important event: ",
                            "examples": [
                                "She's covering the American election for BBC television."
                            ]
                        },
                        {
                            "explanation": "to protect someone against loss, damage, accident, or having something stolen, by having insurance: ",
                            "examples": [
                                "Does your travel insurance cover you against/for the loss or theft of cash?"
                            ]
                        },
                        {
                            "explanation": "to do something to protect yourself from blame or criticism in the future: ",
                            "examples": [
                                "I kept copies of my expense receipts, just to cover myself.",
                                "Make sure you take notes of the meeting, just to cover yourself.",
                                "He claimed to be following up on information from an informant to cover himself while illegally accessing confidential information.",
                                "We believe that some employees doctored their schedules to cover themselves.",
                                "She covered herself by making sure she always had someone else present in the room when she talked to the defendant."
                            ]
                        },
                        {
                            "explanation": "to travel a particular distance: ",
                            "examples": [
                                "We covered 400 km in three hours."
                            ]
                        },
                        {
                            "explanation": "to be or give enough money to pay for something: ",
                            "examples": [
                                "The selling price barely covered the cost of the raw materials.",
                                "For some writers, having to cover expenses like meals and travel makes it unaffordable to speak at book festivals.",
                                "Their small budget had to cover everything from staff costs to buying furniture. ",
                                "He charged them rent in order to cover his mortgage payments.",
                                "Her godmother offered to cover her tuition fees."
                            ]
                        },
                        {
                            "explanation": "to aim a gun or shoot at someone to try to stop them from shooting or escaping, or to protect someone else: ",
                            "examples": [
                                "The police officer was covered by her colleagues while she ran towards the gunman's hideout."
                            ]
                        },
                        {
                            "explanation": "When soldiers or police officers cover a place such as a road or building, they are in a position from which they can watch and defend it: ",
                            "examples": [
                                "All the exits are covered, so they can't escape."
                            ]
                        },
                        {
                            "explanation": "to prevent a member of the opposing team from taking control of the ball by staying close to them all the time: ",
                            "examples": [
                                "The Bullets kept assigning different players to cover him."
                            ]
                        },
                        {
                            "explanation": "to do someone else's job or duty when they are absent: ",
                            "examples": [
                                "I'm going to the doctor's tomorrow, so do you think you could cover my shift for me?",
                                "Sorry, I'm already covering for someone else."
                            ]
                        },
                        {
                            "explanation": "to make a recording of a song or tune that has already been recorded by someone else: ",
                            "examples": [
                                "I think more singers have covered \"Yesterday\" than any other song."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkʌv.ər"
                            ],
                            "us": [
                                "ˈkʌv.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that is put on or over something else, usually to protect it, to keep something in, etc.: ",
                            "examples": [
                                "I keep my computer printer under a protective plastic cover.",
                                "Remove the packaging and pierce the plastic cover before microwaving."
                            ]
                        },
                        {
                            "explanation": "the stiff outside part of a book or magazine, usually made of thick paper or cardboard: ",
                            "examples": [
                                "Who should we put on the cover of the magazine this month?",
                                "Paperback books have soft covers."
                            ]
                        },
                        {
                            "explanation": "to read a book, magazine, etc. all the way through from the beginning to the end: ",
                            "examples": [
                                "On Sundays, I stay in bed all morning and read the paper from cover to cover."
                            ]
                        },
                        {
                            "explanation": "an envelope",
                            "examples": []
                        },
                        {
                            "explanation": "to send something in a plain envelope: ",
                            "examples": [
                                "These are the type of books that are generally sent under plain cover."
                            ]
                        },
                        {
                            "explanation": "to send something in a separate envelope: ",
                            "examples": [
                                "I'll send my CV along under separate cover."
                            ]
                        },
                        {
                            "explanation": "the blankets, sheets, etc. on a bed: ",
                            "examples": [
                                "Martha threw back the covers and bounced out of bed."
                            ]
                        },
                        {
                            "explanation": "shelter or protection in an unpleasant or dangerous situation: ",
                            "examples": [
                                "We took cover from the storm in a bus shelter.",
                                "The burglar broke into the house under cover of darkness."
                            ]
                        },
                        {
                            "explanation": "plants, especially bushes, that are used as shelter by animals",
                            "examples": []
                        },
                        {
                            "explanation": "protection by someone who has a gun: ",
                            "examples": [
                                "We needed more cover from the enemy aircraft."
                            ]
                        },
                        {
                            "explanation": "financial protection so that you get money if something bad happens: ",
                            "examples": [
                                "I've got £20,000 worth of cover for the contents of my house.",
                                "Do you have cover for accidental damage?"
                            ]
                        },
                        {
                            "explanation": "a performance or recording of a song or tune that has already been recorded by someone else: ",
                            "examples": [
                                "How many cover versions have been made of \"My Way\"?"
                            ]
                        },
                        {
                            "explanation": "in cricket, the position of a fielder (= a player who tries to stop the other team from scoring by stopping or catching the ball) which is in front of the batter (= the player hitting the ball) on the off side (= the side of the field opposite the side where the batter stands): ",
                            "examples": [
                                "The ball was athletically fielded at cover.",
                                "He was caught at cover from a mistimed drive."
                            ]
                        },
                        {
                            "explanation": "in cricket, the large area of the field which is in front of the batter (= a player who tries to hit the ball) on the off side (= the side of the field opposite the side where the batter stands): ",
                            "examples": [
                                "He usually fields in the covers."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}