{
    "word": "crash",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kræʃ"
                            ],
                            "us": [
                                "kræʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a vehicle crashes or someone crashes it, it is involved in an accident, usually a serious one in which the vehicle is damaged and someone is hurt: ",
                            "examples": [
                                "We skidded on the ice and crashed.",
                                "The plane crashed into a mountainside.",
                                "Her brother borrowed her motorbike and crashed it."
                            ]
                        },
                        {
                            "explanation": "to hit something, often making a loud noise or causing damage: ",
                            "examples": [
                                "We could hear waves crashing on/against the shore.",
                                "Suddenly, cymbals crashed and the orchestra began playing.",
                                "A dog came crashing through the bushes.",
                                "Without warning, the tree crashed through the roof."
                            ]
                        },
                        {
                            "explanation": "If something such as a business crashes, it suddenly fails or becomes unsuccessful: ",
                            "examples": [
                                "Investors were seriously worried when the stock market began to crash."
                            ]
                        },
                        {
                            "explanation": "If a computer or system crashes, it suddenly stops operating: ",
                            "examples": [
                                "My laptop's crashed again."
                            ]
                        },
                        {
                            "explanation": "to suddenly fall to a low level: ",
                            "examples": [
                                "Foods with a low glycaemic index, such as oats, won't cause your energy level to spike and crash.",
                                "Demand slumped and prices crashed."
                            ]
                        },
                        {
                            "explanation": "to sleep at someone else's house for the night, especially when you have not planned it: ",
                            "examples": [
                                "They crashed on my floor after the party."
                            ]
                        },
                        {
                            "explanation": "to go to a party or other event without an invitation: ",
                            "examples": [
                                "We tried to crash the party, but the bouncers wouldn't let us in."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kræʃ"
                            ],
                            "us": [
                                "kræʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an accident involving a vehicle, usually a serious one in which the vehicle is damaged or someone is hurt: ",
                            "examples": [
                                "a car crash",
                                "She had a crash on the way to work.",
                                "They were only slightly injured in the crash."
                            ]
                        },
                        {
                            "explanation": "a sudden loud noise made when something breaks or falls: ",
                            "examples": [
                                "I heard a loud crash in the kitchen.",
                                "The vase landed on the floor with a crash."
                            ]
                        },
                        {
                            "explanation": "a sudden large fall in the value of a country's businesses: ",
                            "examples": [
                                "They lost a lot of money in the Stock Market crash."
                            ]
                        },
                        {
                            "explanation": "a situation when a computer or system suddenly stops operating: ",
                            "examples": [
                                "a computer crash"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kræʃ"
                            ],
                            "us": [
                                "kræʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "quick and involving a lot of effort: ",
                            "examples": [
                                "The company undertook a crash programme of machine replacement."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}