{
    "word": "credit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkred.ɪt"
                            ],
                            "us": [
                                "ˈkred.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "praise, approval, or honour: ",
                            "examples": [
                                "She got no credit for solving the problem.",
                                "I do the work, and you get the credit — how is that fair?",
                                "Her boss took credit for it.",
                                "So many people were involved in this, I can't take all of the credit.",
                                "I gave him credit for (= thought that he would have) better judgment than he showed.",
                                "If a member of my team comes up with a great idea, I'm happy to give them the credit."
                            ]
                        },
                        {
                            "explanation": "used to say that someone should be praised for something, although there may be other things about them that are not good: ",
                            "examples": [
                                "To his credit, he is honest about the problems the business faces."
                            ]
                        },
                        {
                            "explanation": "to do something that makes a person, group, or organization feel proud or receive praise: ",
                            "examples": [
                                "She is a credit to her family."
                            ]
                        },
                        {
                            "explanation": "someone has done well or behaved well in a way that means someone connected with them should receive praise: ",
                            "examples": [
                                "She does her teachers credit."
                            ]
                        },
                        {
                            "explanation": "something should cause a person to receive praise: ",
                            "examples": [
                                "Their actions do them credit."
                            ]
                        },
                        {
                            "explanation": "used to show that you think a person deserves a lot of praise for something that they have done: ",
                            "examples": [
                                "All credit to her, she did it all herself."
                            ]
                        },
                        {
                            "explanation": "a method of paying for goods or services at a later time, usually paying interest as well as the original money: ",
                            "examples": [
                                "They decided to buy the car on credit.",
                                "The shop was offering six months' interest-free credit on electronic goods."
                            ]
                        },
                        {
                            "explanation": "money in an account: ",
                            "examples": [
                                "I was relieved to see from my statement that my account was in credit.",
                                "If the cardholder has enough credit in their account to cover the sale, the transaction is authorized."
                            ]
                        },
                        {
                            "explanation": "an amount of money paid into an account: ",
                            "examples": [
                                "The refund appeared will appear as a credit on your bill.",
                                "I phoned the bank when confusing debits and credits appeared on my bank statement."
                            ]
                        },
                        {
                            "explanation": "a unit that represents a successfully finished part of an educational course: ",
                            "examples": [
                                "Each of these classes is worth three credits."
                            ]
                        },
                        {
                            "explanation": "a list of people who helped to make a film or a television or radio programme, that is shown or announced at the beginning or the end of it: ",
                            "examples": [
                                "Everyone in the cinema was in tears by the time the credits rolled."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkred.ɪt"
                            ],
                            "us": [
                                "ˈkred.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to pay money into a bank account: ",
                            "examples": [
                                "They credited my account with $20 after I pointed out the mistake."
                            ]
                        },
                        {
                            "explanation": "to believe something that seems unlikely to be true: ",
                            "examples": [
                                "He even tried to pretend he was my son - can you credit it?",
                                "It was hard to credit some of the stories we heard about her."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}