{
    "word": "cripple",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkrɪp.əl"
                            ],
                            "us": [
                                "ˈkrɪp.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an extremely offensive word for a person whose legs or arms do not work in the usual way",
                            "examples": []
                        },
                        {
                            "explanation": "an offensive phrase for someone who finds it difficult to have or express feelings: ",
                            "examples": [
                                "Her accused his mother of being an emotional cripple who has no idea what her children want or need."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkrɪp.əl"
                            ],
                            "us": [
                                "ˈkrɪp.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to injure or harm someone so that they are unable to walk or move in the usual way: ",
                            "examples": [
                                "Thousands of people crippled by osteoporosis could benefit from a drug that can actually rebuild their bones.",
                                "Her husband had a series of strokes which almost crippled him."
                            ]
                        },
                        {
                            "explanation": "to severely affect or limit someone in a way that is not physical: ",
                            "examples": [
                                "He was a hugely talented man, but crippled by self-doubt.",
                                "She died at the age of just 17 and the loss crippled her family."
                            ]
                        },
                        {
                            "explanation": "to cause severe damage to something so that it cannot operate effectively: ",
                            "examples": [
                                "High interest rates are crippling our business.",
                                "a country crippled by war"
                            ]
                        },
                        {
                            "explanation": "to prevent software or a device from working normally, usually intentionally in order to make the user pay for more software, for another device, etc.: ",
                            "examples": [
                                "The company released software that crippled unlocked phones, preventing them from being used on other carriers' networks.",
                                "I think it's short-sighted of developers to cripple access to software."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}