{
    "word": "crispness",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkrɪsp.nəs"
                            ],
                            "us": [
                                "ˈkrɪsp.nəs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of fruit or vegetables) the quality of being fresh, firm, and pleasant to eat: ",
                            "examples": [
                                "Celery loses its crispness when it is no longer good to eat.",
                                "The broccoli was cooked to the right degree of crispness."
                            ]
                        },
                        {
                            "explanation": "(of cooked foods such as pastry and biscuits) the quality of having been cooked well enough to be dry and hard in a pleasant way: ",
                            "examples": [
                                "The skins can be left on the potatoes for extra crispness.",
                                "For maximum crispness, cook the pizza on a pizza stone."
                            ]
                        },
                        {
                            "explanation": "(of cloth or paper) the quality of being stiff and smooth: ",
                            "examples": [
                                "Damp clothes had dried to a crispness over a string line in the kitchen. ",
                                "The e-book's screen is designed to replicate the crispness of a paper page."
                            ]
                        },
                        {
                            "explanation": "(of an image or sound) the quality of being very clear: ",
                            "examples": [
                                "Two factors determine the crispness of the computer image.",
                                "Her performance was memorable for the purity and crispness of her tone."
                            ]
                        },
                        {
                            "explanation": "(of a way of speaking, writing, or behaving) the quality of being quick, confident, and effective: ",
                            "examples": [
                                "His writing lacks the crispness it once had. ",
                                "The storytelling loses its crispness in the final half-hour."
                            ]
                        },
                        {
                            "explanation": "(of the air) the quality of being cold, dry, and fresh: ",
                            "examples": [
                                "The day darkened to night and they inhaled the slight crispness of the air. ",
                                "the perfect crispness of an October night"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}