{
    "word": "critically",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈkrɪt.ɪ.kəl.i",
                                "ˈkrɪt.ɪ.kli"
                            ],
                            "us": [
                                "ˈkrɪt̬.ɪ.kəl.i",
                                "ˈkrɪt̬.ɪ.kli"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a way that is very serious or dangerous, so that there is a risk of death: ",
                            "examples": [
                                "They were both critically injured in the accident.",
                                "Two of the children were critically ill after ingesting the substance.",
                                "Last year these three species were classified as critically endangered (= there is a risk they will disappear completely)."
                            ]
                        },
                        {
                            "explanation": "in a way that is very important and makes the difference between failure and success: ",
                            "examples": [
                                "It is critically important that we have the best intelligence possible about threats to our national security.",
                                "Getting enough exercise is critically important to our health.",
                                "The product did not boost market share or, critically, make money from online sales."
                            ]
                        },
                        {
                            "explanation": "in a way that shows you have thought seriously about something, considering what is good and what is bad about it: ",
                            "examples": [
                                "He believed it was a filmmaker's duty to view society critically.",
                                "We want all our students to develop into mature citizens who are able to think critically. ",
                                "Before the technique starts to be widely used in hospitals, it needs to be critically examined."
                            ]
                        },
                        {
                            "explanation": "in a way that involves criticizing someone or something: ",
                            "examples": [
                                "She speaks critically of high-profile psychologists without proper qualifications.",
                                "\"It's a bit messy,\" he said critically."
                            ]
                        },
                        {
                            "explanation": "by or according to people whose job is to give their opinions about literature, films, etc.: ",
                            "examples": [
                                "a critically acclaimed TV series",
                                "He has gone from being a 1970s punk icon to a critically lauded artist."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}