{
    "word": "critical",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈkrɪt.ɪ.kəl"
                            ],
                            "us": [
                                "ˈkrɪt̬.ɪ.kəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "saying that someone or something is bad or wrong: ",
                            "examples": [
                                "a critical report",
                                "She did not want to be publicly critical of his decision.",
                                "The report is highly critical of safety standards at the factory."
                            ]
                        },
                        {
                            "explanation": "giving or relating to opinions or judgments on books, plays, films, etc.: ",
                            "examples": [
                                "She has written a major critical appraisal/study of Saul Bellow's novels.",
                                "Critical response to the play was mixed.",
                                "His last film won critical acclaim (= was praised by critics)."
                            ]
                        },
                        {
                            "explanation": "of the greatest importance to the way things might happen: ",
                            "examples": [
                                "The president's support is critical to this project.",
                                "In the end, his contribution proved critical. ",
                                "Phonics is a critical step towards learning to read for many children.",
                                "a critical decision"
                            ]
                        },
                        {
                            "explanation": "(of an illness, injury, etc.) extremely serious or dangerous, so that there is a risk of death: ",
                            "examples": [
                                "She has a critical illness affecting her bone marrow.",
                                "Three of those rescued had critical injuries and two were in serious condition.",
                                "Both drivers are in a critical condition (= so badly hurt that they might die) after the 120 mph crash.",
                                "He is in hospital, where his condition is said to be critical."
                            ]
                        },
                        {
                            "explanation": "(of a person) very seriously injured or ill, so that there is a risk they will die: ",
                            "examples": [
                                "A young man remains critical in hospital after being attacked two days ago.",
                                "Of the 40 people injured, four were critical last night. ",
                                "He needed surgery but was said not to be critical."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}