{
    "word": "cross",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "krɒs"
                            ],
                            "us": [
                                "krɑːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to go across from one side of something to the other: ",
                            "examples": [
                                "It's not a good place to cross the road.",
                                "Look both ways before you cross over (= cross the road).",
                                "Cross the bridge and turn right.",
                                "They crossed from Albania into Greece."
                            ]
                        },
                        {
                            "explanation": "If something crosses your mind, you think of it: ",
                            "examples": [
                                "It crossed my mind yesterday that you must be short of staff."
                            ]
                        },
                        {
                            "explanation": "to put one of your arms, fingers, or legs over the top of the other: ",
                            "examples": [
                                "She sat down and crossed her legs."
                            ]
                        },
                        {
                            "explanation": "to annoy someone by not doing or saying what they want: ",
                            "examples": [
                                "I wouldn't cross him if I were you, not if you value your life."
                            ]
                        },
                        {
                            "explanation": "If you cross a plant or animal with another of a different type, you cause them to breed together in order to produce a new variety (= type of plant or animal).",
                            "examples": []
                        },
                        {
                            "explanation": "in some sports, to hit, kick, or throw the ball across the playing area to another player, not forwards or backwards: ",
                            "examples": [
                                "He crossed (the ball) to Bremer, who somehow failed to score from two metres out."
                            ]
                        },
                        {
                            "explanation": "to draw two lines across the middle of a cheque to show that it needs to be paid into a bank account: ",
                            "examples": [
                                "a crossed cheque"
                            ]
                        },
                        {
                            "explanation": "When Catholics and some other types of Christians cross themselves, they move their hand down and then across their face or chest, making the shape of a cross: ",
                            "examples": [
                                "She fell to her knees, crossed herself, and began to pray fervently.",
                                "He bowed in front of the altar, crossing himself.",
                                "I dipped my fingers in the holy water and crossed myself.",
                                "It is common to see athletes huddling in a circle and crossing themselves before a game."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "krɒs"
                            ],
                            "us": [
                                "krɑːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a written mark (x or +) formed by two lines going across each other. The mark x is usually used to show where something is, or that something has not been written correctly.",
                            "examples": []
                        },
                        {
                            "explanation": "an object made of one long upright piece of wood, with a smaller piece across it near the top. In the past, people were tied or fastened with nails to crosses as a punishment and left hanging on them until they died. ",
                            "examples": []
                        },
                        {
                            "explanation": "an object in the shape of a cross that people were killed on, used as a symbol of Christianity: ",
                            "examples": [
                                "Christ died on the Cross.",
                                "She wears a gold cross around her neck.",
                                "The priest made the sign of the cross (= moved his or her hand down and then across the chest) over the dead bodies."
                            ]
                        },
                        {
                            "explanation": "a medal in the shape of a cross: ",
                            "examples": [
                                "In Britain, the Victoria Cross is awarded for acts of great bravery during wartime."
                            ]
                        },
                        {
                            "explanation": "a mixture of two different things that have been combined to produce something new: ",
                            "examples": [
                                "Police dogs are often a cross between a retriever and a German Shepherd."
                            ]
                        },
                        {
                            "explanation": "in some sports, a kick, hit, or throw of the ball that goes from one side of the playing area to the other, not forwards or backwards: ",
                            "examples": [
                                "He headed the ball into the net, after a great cross from Pele. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "krɒs"
                            ],
                            "us": [
                                "krɑːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "annoyed or angry: ",
                            "examples": [
                                "My Dad gets cross (with me) if I leave the kitchen in a mess."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "krɒs-"
                            ],
                            "us": [
                                "krɑːs-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "across: ",
                            "examples": [
                                "cross-border"
                            ]
                        },
                        {
                            "explanation": "including different groups or subjects: ",
                            "examples": [
                                "cross-party discussions"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}