{
    "word": "crossed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "krɒst"
                            ],
                            "us": [
                                "krɑːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of someone's arms, legs, or fingers) in a position where one arm, etc. is placed over the other one: ",
                            "examples": [
                                "He just sat at the table with crossed arms and refused to eat.",
                                "The children all sit on the floor with legs crossed.",
                                "Her legs were crossed at the ankles."
                            ]
                        },
                        {
                            "explanation": "used when you hope very much that something will happen in the way that you want: ",
                            "examples": [
                                "We're all keeping our fingers crossed for good weather on the day.",
                                "I had my fingers crossed that it would work.",
                                "He's injured at the moment but fingers crossed he'll be able to play. ",
                                "All they could do was wait with their fingers crossed. "
                            ]
                        },
                        {
                            "explanation": "having a line drawn across it: ",
                            "examples": [
                                "The crossed lines inscribed on the object may represent the four points of the compass.",
                                "She will make sure the contract has every t crossed and every i dotted (= that it is very careful and completely correct)."
                            ]
                        },
                        {
                            "explanation": "having a path, river, bridge, etc. going across it: ",
                            "examples": [
                                "The golf course is crossed in three places by streams."
                            ]
                        },
                        {
                            "explanation": "bred with a different animal or plant, or combined with a different type of thing, to produce something new: ",
                            "examples": [
                                "The dogs are often Siberians or Malamutes crossed with greyhounds. ",
                                "The bar looks like a coffee shop crossed with a cocktail lounge.",
                                "They were the epitome of 1960s cool crossed with classic British style."
                            ]
                        },
                        {
                            "explanation": "(of a cheque) having two lines drawn across it to show that it must be paid into a bank account: ",
                            "examples": [
                                "A crossed cheque gives some protection against fraud if it falls into the wrong hands."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}