{
    "word": "crown",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kraʊn"
                            ],
                            "us": [
                                "kraʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a circular decoration for the head, usually made of gold and jewels (= precious stones), and worn by a king or queen at official ceremonies",
                            "examples": []
                        },
                        {
                            "explanation": "the act of winning a sports competition: ",
                            "examples": [
                                "He plans to defend his Olympic crown."
                            ]
                        },
                        {
                            "explanation": "the top part of a head, hat, or hill: ",
                            "examples": [
                                "A pink ribbon had been tied around the crown of the hat."
                            ]
                        },
                        {
                            "explanation": "an artificial piece used to cover a damaged tooth",
                            "examples": []
                        },
                        {
                            "explanation": "a British coin that is no longer used",
                            "examples": []
                        },
                        {
                            "explanation": "part of a turkey or other large bird eaten as food that includes the breast (= chest parts) but not the legs: ",
                            "examples": [
                                "Supermarkets have seen a strong increase in demand for turkey crowns this Christmas.",
                                "I've bought a goose crown this year as an alternative to turkey.",
                                "A crown is perfect if you have fewer people to feed or guests who all like white meat."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kraʊn"
                            ],
                            "us": [
                                "kraʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a crown on someone's head in an official ceremony that makes that person king or queen: ",
                            "examples": [
                                "Queen Elizabeth II was crowned queen in 1953.",
                                "He was crowned king in Westminster Abbey.",
                                "I saw the spot where the Emperors were crowned. "
                            ]
                        },
                        {
                            "explanation": "to give someone or something a particular title, usually because they have won it, or deserved it because of their achievements: ",
                            "examples": [
                                "The race to crown a new champion in US College Basketball continues.",
                                "Sports Illustrated crowned him the greatest team player on the greatest team ever.",
                                "They are more determined than ever to be crowned European champions this season.",
                                "She was the favourite to be crowned winner of the TV talent show."
                            ]
                        },
                        {
                            "explanation": "If an event or achievement crowns something, it is the best or most successful part of it: ",
                            "examples": [
                                "He hopes to crown his career with his first Olympic gold medal this year.",
                                "an acting career crowned by her final Oscar-winning performance"
                            ]
                        },
                        {
                            "explanation": "If something crowns something else, it is on or around the top of it: ",
                            "examples": [
                                "The church was crowned with golden domes."
                            ]
                        },
                        {
                            "explanation": "to fit a crown (= tooth covering): ",
                            "examples": [
                                "She's had her two front teeth crowned."
                            ]
                        },
                        {
                            "explanation": "to hit someone on the head: ",
                            "examples": [
                                "I felt like crowning him."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kraʊn"
                            ],
                            "us": [
                                "kraʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the royal governing power of a country that has a king or queen",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}