{
    "word": "cruise",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kruːz"
                            ],
                            "us": [
                                "kruːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a journey on a large ship for pleasure, during which you visit several places: ",
                            "examples": [
                                "He and his wife went on a cruise to the Bahamas. ",
                                "We took a 12-night river cruise from Vienna to Amsterdam."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kruːz"
                            ],
                            "us": [
                                "kruːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a ship or person) to sail around for pleasure: ",
                            "examples": [
                                "They spent the summer cruising around the Mediterranean.",
                                "The ship has never before cruised in Alaskan waters.",
                                "He pictured himself buying a yacht and cruising the Caribbean. "
                            ]
                        },
                        {
                            "explanation": "(of a vehicle or driver) to travel at a continuous speed that is not too fast or does not use too much fuel: ",
                            "examples": [
                                "The airplane could cruise at 350 mph and carry 10 passengers.",
                                "Most people use their cars mostly for town driving, not for cruising on open roads."
                            ]
                        },
                        {
                            "explanation": "to move or travel slowly around an area, usually looking for something or someone: ",
                            "examples": [
                                "She said the police should spend more time patrolling on foot rather than cruising in vehicles.",
                                "Groups of teenagers cruised down the boulevard with their friends.",
                                "I was cruising around the car park looking for a space.",
                                "Shoppers look for bargains while cruising the supermarket aisles.",
                                "She cruised the room trying to find someone interesting to talk to."
                            ]
                        },
                        {
                            "explanation": "to move in a relaxed way, without effort: ",
                            "examples": [
                                "We saw a school of dolphins cruising along the shore.",
                                "The ad shows an elderly woman with a walking stick cruising past a driver stuck in traffic."
                            ]
                        },
                        {
                            "explanation": "to do something easily or without effort: ",
                            "examples": [
                                "Arsenal cruised to a 4-0 win over Chelsea last Saturday.",
                                "The candidate cruised to victory in her constituency.",
                                "When he works hard, he's brilliant, but when he’s just cruising, the rest of the team cruises too. "
                            ]
                        },
                        {
                            "explanation": "to go around public places looking for someone to have sex with: ",
                            "examples": [
                                "He spends the weekends cruising bars.",
                                "Bobby was cruising for one-night stands."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}