{
    "word": "curl",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɜːl"
                            ],
                            "us": [
                                "kɝːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of hair that grows or has been formed into a curving shape, or something that is the same shape as this: ",
                            "examples": [
                                "tight/loose curls",
                                "Her hair fell in curls over her shoulders.",
                                "Curls of smoke were rising from the chimney."
                            ]
                        },
                        {
                            "explanation": "the curved shape in which a ball moves when it is hit or kicked in a particular way: ",
                            "examples": [
                                "The curl on the shot sent it looping around the keeper into the far corner of the net."
                            ]
                        },
                        {
                            "explanation": "an exercise using weights in which you move your arm or leg from straight to bent and back: ",
                            "examples": [
                                "She uses 5-pound weights for bicep curls.",
                                "Twice a week, do both leg extensions and leg curls on a weight machine. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kɜːl"
                            ],
                            "us": [
                                "kɝːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make something into the shape of a curl, or to grow or change into this shape: ",
                            "examples": [
                                "Does your hair curl naturally, or is it permed?",
                                "A new baby will automatically curl its fingers round any object it touches."
                            ]
                        },
                        {
                            "explanation": "to make a ball move in a curved shape by hitting or kicking it in a particular way or of a ball, to move in this way: ",
                            "examples": [
                                "He curled the ball into the top right hand corner.",
                                "Peterson's free-kick curled just wide."
                            ]
                        },
                        {
                            "explanation": "to show by an upward movement of one side of your mouth that you feel no respect for something or someone: ",
                            "examples": [
                                "Her lip curled at what he said."
                            ]
                        },
                        {
                            "explanation": "to play the sport of curling (= a game played on ice in which stones are slid towards a mark): ",
                            "examples": [
                                "\"Learn to curl\" sessions teach you the basics of curling."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}