{
    "word": "custody",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkʌs.tə.di"
                            ],
                            "us": [
                                "ˈkʌs.tə.di"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the legal right or duty to care for someone or something, especially a child after its parents have separated or died: ",
                            "examples": [
                                "Who has custody of the children?",
                                "Many separated couples fight over custody of the family pet.",
                                "The mother got custody of the child.",
                                "The court awarded custody to the father.",
                                "The court granted custody to the mother, saying she was better able to care for her daughter. ",
                                "The divorce was granted in May and she was given custody of their four children.",
                                "He lived with his parents while he fought to gain custody of his two children.",
                                "She lost custody of her daughters when she was sent to prison.",
                                "They split up two years ago, but still share custody of their dog.",
                                "The parents were given joint custody.",
                                "Parents seeking sole custody would have to prove shared parenting would harm the child.",
                                "She helps people with legal issues relating to housing, domestic violence, divorce, and child custody.",
                                "The baby twins were at the centre of a custody battle."
                            ]
                        },
                        {
                            "explanation": "the state of being kept in prison, especially while waiting to go to court for trial: ",
                            "examples": [
                                "The suspect is now in custody.",
                                "Police raided the house and took a man into custody.",
                                "You will be remanded in custody until your trial.",
                                "He spent two days in police custody being questioned."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}