{
    "word": "cut",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kʌt"
                            ],
                            "us": [
                                "kʌt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to break the surface of something, or to divide or make something smaller, using a sharp tool, especially a knife: ",
                            "examples": [
                                "to cut a slice of bread",
                                "I cut myself on that glass.",
                                "She cut her hand with a knife and had to have stitches.",
                                "Cut the meat up into small pieces.",
                                "This knife doesn't cut very well.",
                                "Where did you have your hair cut?",
                                "Firefighters had to cut the trapped driver free (= cut the metal to allow the driver to get out of the car) using special equipment.",
                                "He fell off the swing and cut his head open (= got a deep cut in his head).",
                                "He cut the cake into six (pieces) and gave each child a slice.",
                                "When the ham is baked, cut it in slices."
                            ]
                        },
                        {
                            "explanation": "to make something shorter, lower, smaller, etc.: ",
                            "examples": [
                                "to cut prices/costs",
                                "to cut overtime/wages"
                            ]
                        },
                        {
                            "explanation": "to remove something from something else: ",
                            "examples": [
                                "The sex scenes had been cut out of the TV version of the film."
                            ]
                        },
                        {
                            "explanation": "to move words or pictures from one place to another in a computer or internet document, app, post, etc.: ",
                            "examples": [
                                "It seems like the error is due to some sloppy cutting and pasting."
                            ]
                        },
                        {
                            "explanation": "to decide not to leave someone any of your money or possessions when you die: ",
                            "examples": [
                                "It seems incredible that he would cut his own children out of his will."
                            ]
                        },
                        {
                            "explanation": "to not go, especially to a place where you should be: ",
                            "examples": [
                                "Your son has been cutting classes."
                            ]
                        },
                        {
                            "explanation": "to stop or interrupt something: ",
                            "examples": [
                                "to cut an engine/a motor",
                                "\"Cut! (= stop filming!)\" shouted the director."
                            ]
                        },
                        {
                            "explanation": "to stop someone from talking before they have finished what they were saying: ",
                            "examples": [
                                "He started to explain, but she cut him short."
                            ]
                        },
                        {
                            "explanation": "used to tell someone to stop talking or stop behaving in an annoying way: ",
                            "examples": [
                                "Just cut it out! I've had enough of your time wasting."
                            ]
                        },
                        {
                            "explanation": "(of a baby) to grow a new tooth: ",
                            "examples": [
                                "The baby's cutting a tooth. That's why she's crying."
                            ]
                        },
                        {
                            "explanation": "to go through or across a place, especially in order to get somewhere quickly: ",
                            "examples": [
                                "to cut through a passage"
                            ]
                        },
                        {
                            "explanation": "to fail to keep to your own side of the road when going round a corner: ",
                            "examples": [
                                "Is it possible to fail a driving test by cutting a corner?"
                            ]
                        },
                        {
                            "explanation": "to change direction quickly while in motion and head towards a different place: ",
                            "examples": [
                                "The player cut back to the inside and picked up a few extra yards for the first down. ",
                                "I had to slam on my brakes when another car cut in front of me from two lanes away. "
                            ]
                        },
                        {
                            "explanation": "to choose a playing card by dividing a pile of cards into two parts: ",
                            "examples": [
                                "Who's going to cut the cards?"
                            ]
                        },
                        {
                            "explanation": "to record music or speech on a record: ",
                            "examples": [
                                "When did the Stones cut their first record?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kʌt"
                            ],
                            "us": [
                                "kʌt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an injury made when the skin is cut with something sharp: ",
                            "examples": [
                                "a deep cut"
                            ]
                        },
                        {
                            "explanation": "a piece of meat cut from a particular part of an animal: ",
                            "examples": [
                                "Sirloin is the most expensive cut of beef."
                            ]
                        },
                        {
                            "explanation": "the shape into which something is cut: ",
                            "examples": [
                                "I don't like the cut of these jeans."
                            ]
                        },
                        {
                            "explanation": "a share of something, usually money: ",
                            "examples": [
                                "When am I going to get my cut?"
                            ]
                        },
                        {
                            "explanation": "a reduction in the number, amount, or rate of something: ",
                            "examples": [
                                "a cut in expenditure/interest rates/hospital waiting lists"
                            ]
                        },
                        {
                            "explanation": "reductions in public spending: ",
                            "examples": [
                                "Students and workers were out on the streets protesting against the cuts."
                            ]
                        },
                        {
                            "explanation": "the act of removing a part from a book, film, etc., or a part that is removed: ",
                            "examples": [
                                "The film contains some very violent scenes, so some cuts were made when it was shown on TV."
                            ]
                        },
                        {
                            "explanation": "a deep, narrow passage made through a hill for a road, railway, or canal",
                            "examples": []
                        },
                        {
                            "explanation": "in cricket, an attacking shot hit through an area level with or just behind or just in front of the batter (= the player who tries to hit the ball), on the right-hand side for a right-handed batter: ",
                            "examples": [
                                "He's a back-foot player and scores most of his runs from cuts and pulls.",
                                "She couldn't keep the cut down and was caught at point."
                            ]
                        },
                        {
                            "explanation": "in sports such as golf and baseball, an act of trying to hit a ball with a stick: ",
                            "examples": [
                                "She took a good cut at it with a five wood.",
                                "He was taking some powerful cuts during batting practice."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}