{
    "word": "cutter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkʌt.ər"
                            ],
                            "us": [
                                "ˈkʌt̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a tool or device for cutting something: ",
                            "examples": [
                                "Slide the frittata out of the pan and slice it with a pizza cutter.",
                                "a hedge/wire/pastry cutter",
                                "This cutter has a six-inch blade.",
                                "His woodworking shop is full of power tools, blades, bits, and cutters."
                            ]
                        },
                        {
                            "explanation": "a person, especially a worker, who cuts something: ",
                            "examples": [
                                "The exploitation of sugar cane cutters in Haiti is well known.",
                                "He worked at the meat plant for 35 years as a cutter."
                            ]
                        },
                        {
                            "explanation": "a person whose job is to cut cloth for making clothes: ",
                            "examples": [
                                "To succeed in this business, you need a good dress designer and a good cutter.",
                                "All of the stylists in this salon are expert cutters."
                            ]
                        },
                        {
                            "explanation": "someone or something that reduces a tax, a cost, etc.: ",
                            "examples": [
                                "The candidate highlighted his record as a tax cutter.",
                                "Many of these changes are potential cost cutters."
                            ]
                        },
                        {
                            "explanation": "a fast, light boat, used for example as a patrol boat (= checking an area for crime or danger) or for carrying small loads: ",
                            "examples": [
                                "When the ship reached the American coast it was greeted by a US coastguard cutter. "
                            ]
                        },
                        {
                            "explanation": "a small, fast sailing ship: ",
                            "examples": [
                                "A little white cutter with red sails was coming in towards them."
                            ]
                        },
                        {
                            "explanation": "in cricket, a throw in which the ball suddenly changes direction after it hits the ground: ",
                            "examples": [
                                "He was a great slow wicket bowler, famous for bowling cutters."
                            ]
                        },
                        {
                            "explanation": "in baseball, a hard throw in which the ball moves slightly as it reaches the batter (= the player who tries to hit the ball): ",
                            "examples": [
                                "His cutter has become a devastating weapon.",
                                "The hitter swung and missed at a cutter."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}