{
    "word": "cycle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsaɪ.kəl"
                            ],
                            "us": [
                                "ˈsaɪ.kəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a bicycle: ",
                            "examples": [
                                "Cycles cannot be taken on this train.",
                                "A thousand people took part in the region's biggest-ever cycle race."
                            ]
                        },
                        {
                            "explanation": "a series of events that happen in a particular order, one following the other, and are often repeated: ",
                            "examples": [
                                "They are trapped in a cycle of violence.",
                                "The charity works with low-income families to give children a good start in life and help break the cycle of inter-generational poverty.",
                                "Humans generally take about 90 minutes to complete a full cycle of REM and non-REM sleep.",
                                "The same cycle repeated itself time and time again."
                            ]
                        },
                        {
                            "explanation": "one in a series of movements that a machine performs: ",
                            "examples": [
                                "the washing machine's spin cycle"
                            ]
                        },
                        {
                            "explanation": "a group of plays, poems, songs, etc. written by one person and connected with each other by dealing with the same characters or ideas: ",
                            "examples": [
                                "It's one in a cycle of plays that are being performed on successive evenings."
                            ]
                        },
                        {
                            "explanation": "In baseball, if a player hits for the cycle, they hit a single (= a hit that allows them to reach first base), a double (= a hit that allows them to reach second base), a triple (= a hit that allows them to reach third base), and a home run (= a hit that allows them to run around all four bases) in the same game: ",
                            "examples": [
                                "He was the first player in the team's history to hit for the cycle."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsaɪ.kəl"
                            ],
                            "us": [
                                "ˈsaɪ.kəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to ride a bicycle: ",
                            "examples": [
                                "Most of the kids cycle or walk to school.",
                                "We have cycled all the way from Scotland.",
                                "She was so determined to get fit she often cycled eight miles to the nearest swimming pool."
                            ]
                        },
                        {
                            "explanation": "to go through or repeat a cycle (= a series of events that happen in the same order one after the other, and are often repeated): ",
                            "examples": [
                                "The earth cycles through natural heating and cooling trends.",
                                "People with bipolar disorder can cycle between depression and mania.",
                                "He spent his adult life cycling in and out of prison."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}