{
    "word": "damper",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdæm.pər"
                            ],
                            "us": [
                                "ˈdæm.pɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device that reduces vibration (= fast shaking), for example in an engine: ",
                            "examples": [
                                "The system includes a motor with appropriate gear transmission and a damper.",
                                "The new model has new springs and dampers and a sports exhaust."
                            ]
                        },
                        {
                            "explanation": "a device that stops a piano string from making a sound, that can be stopped from working by pressing a key or pedal: ",
                            "examples": [
                                "A damper, made of soft felt, presses against each string and prevents it from vibrating until it is wanted. ",
                                "The melody resounds as if the damper pedal were being pressed on a piano."
                            ]
                        },
                        {
                            "explanation": "a metal plate in a chimney that can be moved to control the flow of air and make the fire burn faster or more slowly: ",
                            "examples": [
                                "Vent-free fireplaces have no need for a damper.",
                                "The worker in the boiler room said he was just about to close the damper when the explosion took place."
                            ]
                        },
                        {
                            "explanation": "to make something less active or less enjoyable: ",
                            "examples": [
                                "Both the kids were sick while we were in Boston, so that put a damper on things."
                            ]
                        },
                        {
                            "explanation": "a simple type of bread made with flour and water and without yeast, traditionally cooked on a fire: ",
                            "examples": [
                                "I wanted to try making damper, a bread that you cook in coals on the ground."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}