{
    "word": "decolonize",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌdiːˈkɒl.ə.naɪz"
                            ],
                            "us": [
                                "ˌdiːˈkɑː.lə.naɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a country that was previously a colony (= a country controlled by another country) politically independent; to get rid of colonies: ",
                            "examples": [
                                "France is decolonising the Ivory Coast, where some 450 French scientists, technicians, and their families are working.",
                                "He said that had it not been for Western colonialism and the unwillingness of the Great Powers to decolonize wisely, the oppressed of Asia would never have turned to communism."
                            ]
                        },
                        {
                            "explanation": "(of a colony) to become politically independent: ",
                            "examples": [
                                "Many decolonizing territories in Africa, the Americas, and Southeast Asia had two or more ethnoterritorial groups competing for control."
                            ]
                        },
                        {
                            "explanation": "to change something such as a curriculum (= a list of books, ideas, etc. to be studied) in a way that considers the cultural beliefs behind it, for example the belief that European writers, artists, or ideas are better and more important than ones from countries that were colonized (= controlled) by Europe, and that gives more importance to these non-European writers, artists, etc.: ",
                            "examples": [
                                "Decolonizing the curriculum asks us to look at our shared assumptions about how the world is, particularly assumptions regarding racial and civilizational hierarchy."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}