{
    "word": "deep",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "diːp"
                            ],
                            "us": [
                                "diːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "going or being a long way down from the top or surface, or being of a particular distance from the top to the bottom: ",
                            "examples": [
                                "a deep well/mine",
                                "a deep river/sea",
                                "a deep cut",
                                "The hole is so deep you can't see the bottom.",
                                "The water's not deep here - look, I can touch the bottom.",
                                "Drill 20 holes, each 2 inches deep.",
                                "The water's only ankle/knee/waist-deep, so we'll be able to get across the river easily.",
                                "Take a few deep breaths (= breaths that fill the lungs with air) and calm down."
                            ]
                        },
                        {
                            "explanation": "very strongly felt or experienced and usually lasting a long time: ",
                            "examples": [
                                "Their son has been a deep disappointment to them.",
                                "We're in deep trouble.",
                                "She fell into a deep sleep."
                            ]
                        },
                        {
                            "explanation": "(of a sound) low: ",
                            "examples": [
                                "a wonderfully deep voice"
                            ]
                        },
                        {
                            "explanation": "showing or needing serious thought, or not easy to understand: ",
                            "examples": [
                                "His films are generally too deep for me."
                            ]
                        },
                        {
                            "explanation": "If something is deep, it has a large distance between its edges, especially between its front and back edges: ",
                            "examples": [
                                "Is the alcove deep enough for bookshelves?",
                                "The wardrobe is 2 m high, 1 m wide and 60 cm deep.",
                                "By midnight, there were customers standing six deep (= in six rows) at the bar."
                            ]
                        },
                        {
                            "explanation": "near the middle of something, and a long distance from its edges: ",
                            "examples": [
                                "Little Red Riding Hood's grandmother lived in a house deep in the forest."
                            ]
                        },
                        {
                            "explanation": "In cricket, deep positions are far from the wicket (= the area where the batters stand and run): ",
                            "examples": [
                                "The ball sailed towards the boundary in the direction of deep square leg.",
                                "The South African captain positioned deep fielders on each side of the ground."
                            ]
                        },
                        {
                            "explanation": "(of a colour) strong and dark: ",
                            "examples": [
                                "The sky was deep blue."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "diːp"
                            ],
                            "us": [
                                "diːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long way from the top or surface : ",
                            "examples": [
                                "The submarine sailed deep under the ice cap.",
                                "He thrust his hands deep in(to) his pockets."
                            ]
                        },
                        {
                            "explanation": "In sports such as football, rugby, orice hockey , if a player or team plays or defends deep, they stay a long way inside their own half of the field: ",
                            "examples": [
                                "Some midfielders play deep, having a more defensive role, while others go forward.",
                                "The manager was yelling at the team that they were defending too deep.",
                                "Capper played deep, relishing the competition in midfield areas.",
                                "She gave the ball away deep inside her own half.",
                                "At 2-0 up, Cambridge played deep, inviting the opposition to attack."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "diːp"
                            ],
                            "us": [
                                "diːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the sea or the ocean: ",
                            "examples": [
                                "The sailors were lost to the deep."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}