{
    "word": "defence",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dɪˈfens"
                            ],
                            "us": [
                                "dɪˈfens"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of protecting someone or something against attack or criticism : ",
                            "examples": [
                                "He published an essay in defence of the freedom of the press.",
                                "These people have died in the defence of liberty.",
                                "She angrily came to her friend's defence.",
                                "to leap/rush/jump/spring to sb's defence (= defend them quickly)"
                            ]
                        },
                        {
                            "explanation": "something that provides protection against attack from enemies, or against something dangerous such as weather or an infection: ",
                            "examples": [
                                "The rebels' only form of defence against the soldiers' guns was sticks and stones.",
                                "The towers were once an important part of the city's defences.",
                                "She called for new flood defences to be built.",
                                "A good diet helps build the body's natural defences."
                            ]
                        },
                        {
                            "explanation": "the systems, organizations, parts of a country's government, etc. that are involved in a country protecting itself against attack: ",
                            "examples": [
                                "The war has ended but government spending on defence is still increasing.",
                                "the Ministry of Defence",
                                "a defence secretary/minister/spokesperson",
                                "the defence budget"
                            ]
                        },
                        {
                            "explanation": "a piece of writing or speech that supports something or someone that has been criticized: ",
                            "examples": [
                                "The book is a closely argued defence of the economic theory of Keynes."
                            ]
                        },
                        {
                            "explanation": "an argument or explanation that you use to prove that you are not guilty of something: ",
                            "examples": [
                                "The judge remarked that ignorance was not a valid defence.",
                                "All I can say, in defence of my actions, is that I had little choice."
                            ]
                        },
                        {
                            "explanation": "the things said in court to prove that a person did not commit a crime: ",
                            "examples": [
                                "She said that she didn't want a lawyer and was going to conduct her own defence."
                            ]
                        },
                        {
                            "explanation": "the person or people in a law case who have been accused of doing something illegal, and their lawyer(s): ",
                            "examples": [
                                "a witness for the defence",
                                "a defence lawyer"
                            ]
                        },
                        {
                            "explanation": "in some sports, the part of a team that tries to prevent the other team from scoring goals or points: ",
                            "examples": [
                                "a strong defence",
                                "I play in defence."
                            ]
                        },
                        {
                            "explanation": "in the game of chess, a particular set of moves used by the person playing with the black pieces: ",
                            "examples": [
                                "What defence did you use in that last game?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}