{
    "word": "deflecting",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \ndeflect ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dɪˈflekt"
                            ],
                            "us": [
                                "dɪˈflekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change direction after hitting something, or to cause something to do this : ",
                            "examples": [
                                "The ball deflected off my shoulder, straight into the goal.",
                                "The crowd cheered as the goalkeeper deflected the shot.",
                                "If a huge meteor was heading towards us, our best hope could be to deflect it away from the Earth using a nuclear explosion."
                            ]
                        },
                        {
                            "explanation": "to cause someone to change from or stop what they were intending to do: ",
                            "examples": [
                                "His initial defeats did not deflect him from his ambitions.",
                                "She listens to him, but doesn't allow herself to be deflected from her purpose.",
                                "We will continue with our plans and not be deflected by the attacks."
                            ]
                        },
                        {
                            "explanation": "to avoid something such as criticism, blame, or a question being directed at you: ",
                            "examples": [
                                "The president deflected criticism of his economic record by focusing on crime. ",
                                "He successfully deflected blame for his mismanagement of the crisis.",
                                "I just tried to deflect questions the best way I could."
                            ]
                        },
                        {
                            "explanation": "to attack or blame another person rather than accepting criticism or blame for your own actions: ",
                            "examples": [
                                "When someone deflects, they are trying to feel less guilty, avoid negative consequences, and put the blame on others. ",
                                "The guilty person deflects their guilt onto the person who is accusing them or onto another person."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}