{
    "word": "delivery",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dɪˈlɪv.ər.i"
                            ],
                            "us": [
                                "dɪˈlɪv.ɚ.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of taking goods, letters, parcels, etc. to people's houses or places of work: ",
                            "examples": [
                                "We get two deliveries of mail (= it is delivered twice) a day.",
                                "You can pay for the carpet on delivery (= when it is delivered).",
                                "We expect to take delivery of (= receive) our new car next week.",
                                "Your order is out for delivery (= it has been given to the person who will deliver it) and will be with you soon.",
                                "Delivery is free on orders over £30.",
                                "The price includes next-day delivery anywhere in the UK.",
                                "After school he got a job driving a delivery van."
                            ]
                        },
                        {
                            "explanation": "the supply of something, for example power to an engine, or the way that it is supplied: ",
                            "examples": [
                                "The power delivery is extremely smooth, but the car is let down by the steering.",
                                "The drug increases the delivery of oxygen to muscles in the body.",
                                "The procedure promises great benefits in accurate delivery of radiation to treat tumours.",
                                "New media includes new methods of content delivery such as internet streaming."
                            ]
                        },
                        {
                            "explanation": "the way in which someone speaks in public: ",
                            "examples": [
                                "She did a perfect imitation of his breathless delivery.",
                                "Her delivery is deadpan, but hilarious."
                            ]
                        },
                        {
                            "explanation": "in some sports, such as cricket or baseball, the act of throwing the ball towards the person with the bat, in order for that person to try to hit the ball: ",
                            "examples": [
                                "That was a good delivery from Thompson.",
                                "The pitcher is famous for the speed of his delivery."
                            ]
                        },
                        {
                            "explanation": "the fact of achieving or producing something that has been promised: ",
                            "examples": [
                                "Delivery of the hoped-for improvements hit a snag when they failed to recruit enough staff for the expansion. ",
                                "There were plenty of promises, but no delivery."
                            ]
                        },
                        {
                            "explanation": "a birth: ",
                            "examples": [
                                "Her husband was with her for the delivery.",
                                "We want as many mothers as possible to have safe and normal deliveries.",
                                "Women who have the infection are at risk of pre-term delivery of their baby."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}