{
    "word": "deliver",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dɪˈlɪv.ər"
                            ],
                            "us": [
                                "dɪˈlɪv.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to take goods, letters, parcels, etc. to people's houses or places of work: ",
                            "examples": [
                                "Mail is delivered to our office twice a day.",
                                "The furniture store is delivering our new bed on Thursday."
                            ]
                        },
                        {
                            "explanation": "to give, direct, or aim something: ",
                            "examples": [
                                "In May, she delivered a speech at a conference in Bangkok.",
                                "The priest delivered a passionate sermon against war.",
                                "The jury delivered a verdict of not guilty.",
                                "The police said that it was the blow delivered (= given) to her head that killed her.",
                                "The pitcher tripped as he delivered the ball (= threw it towards the person with the bat).",
                                "She spotted the winger's forward run and delivered a perfect pass."
                            ]
                        },
                        {
                            "explanation": "to achieve or produce something that has been promised: ",
                            "examples": [
                                "The government has failed to deliver what it promised.",
                                "The prime minister has quickly delivered on his campaign pledge.",
                                "If we back you, we expect you to deliver.",
                                "The Republicans are relying on their agricultural policies to deliver the farmers' vote (= to persuade farmers to vote for them)."
                            ]
                        },
                        {
                            "explanation": "to give birth to a baby, or to help someone do this: ",
                            "examples": [
                                "She delivered her third child at home.",
                                "The baby was delivered by a midwife.",
                                "The princess has been delivered of (= has given birth to) a healthy baby boy."
                            ]
                        },
                        {
                            "explanation": "to save someone from a painful or bad experience: ",
                            "examples": [
                                "Is there nothing that can be done to deliver these starving people from their suffering?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}