{
    "word": "demotic",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "dɪˈmɒt.ɪk"
                            ],
                            "us": [
                                "dɪˈmɑː.t̬ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or relating to a form of language used by ordinary people, that includes informal expressions and slang: ",
                            "examples": [
                                "He has made poetry out of demotic speech.",
                                "She addressed us in demotic French.",
                                "We are writing for a very diverse population, so our language must be more demotic."
                            ]
                        },
                        {
                            "explanation": "relating to or used, made, enjoyed, etc. by ordinary people: ",
                            "examples": [
                                "The demotic pieces of art enjoyed by the majority were dismissed as formally simplistic or sentimental.",
                                "Travelling by train in India is still a genuinely demotic experience.",
                                "His athletically hybrid style of dance was demotic but classy."
                            ]
                        },
                        {
                            "explanation": "describing or relating to a simple form of ancient Egyptian writing used from about 650 BCE to the 5th century CE, when it was replaced by Coptic, which uses a form of the Greek alphabet: ",
                            "examples": [
                                "Copies of the text of the decree have survived written in ancient Egyptian, in both hieroglyphic and demotic scripts.",
                                "Fragments of papyrus were found containing Demotic Egyptian text."
                            ]
                        },
                        {
                            "explanation": "describing or relating to the modern form of Greek that is used in ordinary speech and writing: ",
                            "examples": [
                                "As Education Minister, he formally established demotic Greek as the language of the land.",
                                "His work moves from the Hellenistic golden age through to today's Demotic Greek, the language of the people."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dɪˈmɒt.ɪk"
                            ],
                            "us": [
                                "dɪˈmɑː.t̬ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a form of a language used by ordinary people, that includes informal expressions and slang: ",
                            "examples": [
                                "Unlike many politicians, he is not afraid of the colloquial and the demotic.",
                                "She is more qualified than most English directors to tackle the subtleties of the Scots demotic.",
                                "The language is an odd mixture of Victorian English and early 21st-century demotic."
                            ]
                        },
                        {
                            "explanation": "a simple form of ancient Egyptian writing used from about 650 BCE to the 5th century CE, when it was replaced by Coptic, which uses the Greek alphabet: ",
                            "examples": [
                                "Some of these letter forms derive from Demotic and others from Coptic.",
                                "Names written in demotic may be those of the workmen, and markings they left show us how they cut the obelisks."
                            ]
                        },
                        {
                            "explanation": "the modern form of Greek that is used in ordinary speech and writing: ",
                            "examples": [
                                "I wrote a blogpost on Demotic in the Soviet Union, about the two major groups of ethnic Greeks that lived in the USSR."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}