{
    "word": "deposit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dɪˈpɒz.ɪt"
                            ],
                            "us": [
                                "dɪˈpɑː.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to leave something somewhere: ",
                            "examples": [
                                "The flood waters fell, depositing mud over the whole area.",
                                "The bus deposited me miles from anywhere.",
                                "The cuckoo deposits her eggs in other birds' nests.",
                                "I deposited my luggage in a locker at the station."
                            ]
                        },
                        {
                            "explanation": "to put something valuable, especially money, in a bank or safe (= strong box or cupboard with locks): ",
                            "examples": [
                                "There's a night safe outside the bank, so you can deposit money whenever you wish.",
                                "I deposited £500 in my account this morning."
                            ]
                        },
                        {
                            "explanation": "to pay someone an amount of money when you make an agreement with that person to pay for or buy something, that either will be returned to you later, if the agreed arrangement is kept, or that forms part of the total payment: ",
                            "examples": [
                                "When we moved in, we had to deposit $1,000 with the landlord in case we broke any of his things.",
                                "You deposit 20 percent now and pay the rest when the car is delivered."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dɪˈpɒz.ɪt"
                            ],
                            "us": [
                                "dɪˈpɑː.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a substance or layer that is left, usually after a liquid is removed: ",
                            "examples": [
                                "Decant the wine carefully, so that you leave the deposit in the bottom of the bottle.",
                                "In hard-water areas, a chalky deposit often forms in pipes and kettles.",
                                "The flood left a thick deposit of mud over the entire ground floor of the house."
                            ]
                        },
                        {
                            "explanation": "a layer that has formed under the ground, especially over a long period: ",
                            "examples": [
                                "mineral/oil/coal deposits"
                            ]
                        },
                        {
                            "explanation": "a payment, especially into a bank account: ",
                            "examples": [
                                "To open an account, you need to make a minimum deposit of $500."
                            ]
                        },
                        {
                            "explanation": "an amount of money that you pay as the first part of the total payment for something: ",
                            "examples": [
                                "The shop assistant says if I leave £10 as a deposit, they'll keep the dress for me.",
                                "We paid/put a deposit of £5,000 on the house, and paid the balance four weeks later.",
                                "They asked us to put down a deposit."
                            ]
                        },
                        {
                            "explanation": "an amount of money that you pay when you rent something, and is returned to you when you return the thing you have rented: ",
                            "examples": [
                                "It costs $2,000 a week to rent the yacht, with a $200 refundable/returnable deposit.",
                                "You pay a 10p deposit/deposit of 10p on the bottle, which you get back when you return the empty bottle."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}