{
    "word": "depth",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "depθ"
                            ],
                            "us": [
                                "depθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the distance down either from the top of something to the bottom, or to a distance below the top surface of something: ",
                            "examples": [
                                "the depth of a lake/pond",
                                "There are very few fish at depths (= distances below the surface) below 3,000 metres.",
                                "The river froze to a depth of over a metre."
                            ]
                        },
                        {
                            "explanation": "the lowest part of the sea: ",
                            "examples": [
                                "The ship sank slowly to the depths of the ocean."
                            ]
                        },
                        {
                            "explanation": "the state of having serious qualities or the ability to think seriously about something: ",
                            "examples": [
                                "Terry lacks depth - he's a very superficial person.",
                                "Her writing shows astonishing depth.",
                                "Jo has hidden depths (= serious qualities that you do not see immediately)."
                            ]
                        },
                        {
                            "explanation": "in a serious and detailed way: ",
                            "examples": [
                                "I'd like to look at this question in some depth."
                            ]
                        },
                        {
                            "explanation": "the distance from the front to the back of something: ",
                            "examples": [
                                "Measure the depth of the cupboard/shelf."
                            ]
                        },
                        {
                            "explanation": "the fact of a feeling, state, or characteristic being strong, extreme, or detailed: ",
                            "examples": [
                                "He spoke with great depth of feeling.",
                                "I was amazed at the depth of her knowledge."
                            ]
                        },
                        {
                            "explanation": "experiencing an extreme and negative emotion: ",
                            "examples": [
                                "He was in the depths of despair/depression about losing his job."
                            ]
                        },
                        {
                            "explanation": "during the worst period of a bad situation: ",
                            "examples": [
                                "The company was started in the depth of the recession of the 1930s."
                            ]
                        },
                        {
                            "explanation": "the quality of having a low sound: ",
                            "examples": [
                                "The depth of his voice makes him sound older than he is."
                            ]
                        },
                        {
                            "explanation": "the fact of something, especially a colour, having the quality of being dark and strong: ",
                            "examples": [
                                "I love the depth of colour in her early paintings."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}