{
    "word": "detail",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdiː.teɪl"
                            ],
                            "us": [
                                "ˈdiː.teɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a single piece of information or fact about something: ",
                            "examples": [
                                "She insisted on telling me every single detail of what they did to her in hospital.",
                                "We don't know the full/precise details of the story yet.",
                                "She refused to disclose/divulge any details about/of the plan."
                            ]
                        },
                        {
                            "explanation": "information about someone or something: ",
                            "examples": [
                                "A police officer took down the details of what happened."
                            ]
                        },
                        {
                            "explanation": "the small features of something that you only notice when you look carefully: ",
                            "examples": [
                                "I was just admiring the detail in the doll's house - even the tins of food have labels on them.",
                                "It's his eye for (= ability to notice) detail that distinguishes him as a painter."
                            ]
                        },
                        {
                            "explanation": "including or considering all the information about something or every part of something: ",
                            "examples": [
                                "We haven't discussed the matter in detail yet."
                            ]
                        },
                        {
                            "explanation": "to tell or include all the facts about something: ",
                            "examples": [
                                "I won't go into detail over the phone, but I've been having a few health problems recently."
                            ]
                        },
                        {
                            "explanation": "a part of something that does not seem important: ",
                            "examples": [
                                "Tony says, he's going to get the car, and finding the money to pay for it is just a minor detail."
                            ]
                        },
                        {
                            "explanation": "a group of people who have been given a particular task",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈdiː.teɪl"
                            ],
                            "us": [
                                "ˈdiː.teɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to describe something completely, giving all the facts: ",
                            "examples": [
                                "Can you produce a report detailing what we've spent on the project so far?"
                            ]
                        },
                        {
                            "explanation": "to order someone, often a small group of soldiers or workers, to perform a particular task: ",
                            "examples": [
                                "Four soldiers were detailed to check the road for troops."
                            ]
                        },
                        {
                            "explanation": "to clean the inside and outside of a vehicle very carefully: ",
                            "examples": [
                                "You can skip the car wash; Rogers has all the equipment to wash and detail your car in your own driveway.",
                                "a car detailing company"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}