{
    "word": "detour",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdiː.tɔːr"
                            ],
                            "us": [
                                "ˈdiː.tʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a different or less direct route to a place that is used to avoid a problem or to visit somewhere or do something on the way: ",
                            "examples": [
                                "You'd be wise to make a detour to avoid the roadworks."
                            ]
                        },
                        {
                            "explanation": "a different route that is used because a road is closed: ",
                            "examples": [
                                "Traffic detours will be kept to a minimum throughout the festival."
                            ]
                        },
                        {
                            "explanation": "an occasion when someone does something that is different from what is usual or expected, or says something that is not part of the main subject that is being talked or written about: ",
                            "examples": [
                                "His anti-alcohol campaign was a rare detour into the field of public health.",
                                "Barring any surprise detours, the governor is expected to sign both proposals.",
                                "While discussing education, she took a sharp detour into trade policy. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈdiː.tɔːr"
                            ],
                            "us": [
                                "ˈdiː.tʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to go or make someone go a different or less direct route to a place, in order to avoid a problem or to visit somewhere or do something on the way: ",
                            "examples": [
                                "We had to detour around downtown, so it took us longer than usual."
                            ]
                        },
                        {
                            "explanation": "to prevent someone from doing something or making progress for a period of time: ",
                            "examples": [
                                "Detoured by family and children, she didn't focus on performing until the early 1990s."
                            ]
                        },
                        {
                            "explanation": "to do something that is different from what is usual or expected, or to say something that is not part of the main subject that is being talked or written about: ",
                            "examples": [
                                "He came to the area to be a country doctor and detoured into state politics.",
                                "The book tries to speak to the layman but often detours into territory most interesting to medical technologists and statisticians."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}