{
    "word": "diet",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdaɪ.ət"
                            ],
                            "us": [
                                "ˈdaɪ.ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the food and drink usually eaten or drunk by a person or group: ",
                            "examples": [
                                "Diet varies between different countries in the world.",
                                "The benefits of a healthy diet are obvious.",
                                "Choose a varied diet rich in whole grains, vegetables, and fruits, and low in saturated fats.",
                                "It is important for children to have a balanced diet.",
                                "Rice is the staple diet (= most important food) of many people in China.",
                                "The children seem to exist on a diet of fried food."
                            ]
                        },
                        {
                            "explanation": "an eating plan in which someone eats less food, or only particular types of food, because they want to become thinner or for medical reasons: ",
                            "examples": [
                                "I'm going on a diet next week and hope to lose ten pounds before Christmas.",
                                "Following his recent health scare, my boss is now on a diet.",
                                "The doctor put me on a low-salt diet to reduce my blood pressure.",
                                "Low calorie crash diets do not work.",
                                "She runs at least three times a week and eats a very strict organic diet.",
                                "By May I had lost four stone by following a calorie-controlled diet."
                            ]
                        },
                        {
                            "explanation": "a particular type of thing that you experience or do regularly, or a limited range of activities: ",
                            "examples": [
                                "He was brought up on a diet of political propaganda from birth.",
                                "Network TV only offers a diet of bad reality shows every night."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈdaɪ.ət"
                            ],
                            "us": [
                                "ˈdaɪ.ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "Diet food or drink contains less sugar or fat than the usual type, and often contains an artificial sweetener: ",
                            "examples": [
                                "diet cola"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈdaɪ.ət"
                            ],
                            "us": [
                                "ˈdaɪ.ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to limit the food and/or drink that you have, especially in order to lose weight: ",
                            "examples": [
                                "You should be able to reduce your weight by careful dieting."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}