{
    "word": "differentiation",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌdɪf.ər.en.ʃiˈeɪ.ʃən"
                            ],
                            "us": [
                                "ˌdɪf.ə.ren.ʃiˈeɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of showing or finding difference between things that are compared: ",
                            "examples": [
                                "We make no differentiation between so called high and low culture.",
                                "He suggests a differentiation between the brain and the mind.",
                                "The condition may resemble multiple sclerosis and differentiation is sometimes difficult."
                            ]
                        },
                        {
                            "explanation": "the process or fact of being different or making something different from other similar things: ",
                            "examples": [
                                "Product differentiation is essential to the future of the company.",
                                "His art training helps him look for differentiations that indicate the telltale signs of a fossil."
                            ]
                        },
                        {
                            "explanation": "(of cells or tissue) the process of developing specialized structures or functions: ",
                            "examples": [
                                "Studies showed that an adult stem cell was capable of differentiation.",
                                "They observed an increased differentiation of these stem cells into neurons."
                            ]
                        },
                        {
                            "explanation": "the process of calculating the derivative of a function: ",
                            "examples": [
                                "He begins with the differentiation of y = ax."
                            ]
                        },
                        {
                            "explanation": "the part of calculus in which rates of change and connected quantities are calculated: ",
                            "examples": [
                                "This module is an introduction to differentiation."
                            ]
                        },
                        {
                            "explanation": "the use of different teaching materials and methods within the same lesson to suit the abilities and needs of different students: ",
                            "examples": [
                                "Teachers see differentiation as a vital tool in countering under-achievement."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}