{
    "word": "dingbat",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdɪŋ.bæt"
                            ],
                            "us": [
                                "ˈdɪŋ.bæt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a stupid or easily confused person: ",
                            "examples": [
                                "Edith may seem like a dingbat, but she's actually pretty clever.",
                                "It made him look like a total dingbat."
                            ]
                        },
                        {
                            "explanation": "a printed character or symbol used for decoration: ",
                            "examples": [
                                "People will appreciate a plain and simple letter just as much as one full of fancy fonts and dingbats."
                            ]
                        },
                        {
                            "explanation": "a font (= a set of letters and symbols in a particular design and size) that consists of dingbats: ",
                            "examples": [
                                "If your symbol and dingbat fonts don't have quite what you're looking for, you can make your own."
                            ]
                        },
                        {
                            "explanation": "a puzzle (= a game in which you have to find an answer) in which words and their position on a page have a meaning. For example, the word \"miss\" written under the word \"standing\" means \"misunderstanding\": ",
                            "examples": [
                                "I've been trying to solve this dingbat for hours.",
                                "At the end of the lesson, the teacher sometimes lets them play dingbats."
                            ]
                        },
                        {
                            "explanation": "a puzzle (= a game in which you have to find an answer) consisting of one or more pictures and sometimes one or more letters or symbols that can be read together to make a word or phrase. For example, a picture of two eyes with the number \"4\" between them represents the phrase \"an eye for an eye\".",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}