{
    "word": "disconnection",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌdɪs.kəˈnek.ʃən"
                            ],
                            "us": [
                                "ˌdɪs.kəˈnek.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the action of unfastening something, especially breaking the connection between a device or piece of equipment and an electricity, gas or water supply, or the internet, etc. : ",
                            "examples": [
                                "This key lock prevents inadvertent disconnection of the computer.",
                                "On several occasions there were accidental disconnections of the intravenous line."
                            ]
                        },
                        {
                            "explanation": "the action of stopping the supply of a service such as electricity, gas, water, or phone to a place, especially because money has not been paid: ",
                            "examples": [
                                "Customers who don't pay the deposit within 10 days would face disconnection.",
                                "The city temporarily stopped disconnections so that people would not lose service during the severe heat. "
                            ]
                        },
                        {
                            "explanation": "an occasion when a phone connection is broken and the conversation cannot continue: ",
                            "examples": [
                                "They can identify the location of the phone at the time of disconnection."
                            ]
                        },
                        {
                            "explanation": "the feeling or fact of being separate from someone or something else, and not fitting well together or understanding each other: ",
                            "examples": [
                                "In the book, she describes her sense of disconnection from her bourgeois suburban family. ",
                                "One of the biggest problems was the disconnection between head office and the workforce.",
                                "Many are suffering a vague disconnection, fueled by economic worries."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}