{
    "word": "discourse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdɪs.kɔːs"
                            ],
                            "us": [
                                "ˈdɪs.kɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the use of language to communicate in speech or writing, or an example of this: ",
                            "examples": [
                                "Ellipsis is a characteristic feature of spoken discourse.",
                                "They may have difficulty in retrieving words and organizing a complex discourse."
                            ]
                        },
                        {
                            "explanation": "discussion or debate (= formal or political argument), or an example of this: ",
                            "examples": [
                                "On social media, angry and aggressive voices seem to dominate the discourse.",
                                "These ideas have been part of the public discourse for years.",
                                "He accused the media of \"dumbing down\" the political discourse.",
                                "I am worried these events could poison discourse between our nations for years to come.",
                                "We need to have a discourse with the public about our work and how it is funded."
                            ]
                        },
                        {
                            "explanation": "a speech or piece of writing about a particular, usually serious, subject: ",
                            "examples": [
                                "She gave a discourse on the nature of life after death.",
                                "The essay was a discourse on the country's future energy needs.",
                                "He then began a long discourse explaining why I was wrong."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈdɪs.kɔːs"
                            ],
                            "us": [
                                "ˈdɪs.kɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to talk or write about a subject, especially for a long time and in a way that suggests you know a lot about it: ",
                            "examples": [
                                "We see him discoursing on family life while neglecting his own children."
                            ]
                        },
                        {
                            "explanation": "to have a conversation or discussion: ",
                            "examples": [
                                "Scientists must be prepared to discourse with non-scientists."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}