{
    "word": "discretionary",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "dɪˈskreʃ.ən.ər.i"
                            ],
                            "us": [
                                "dɪˈskreʃ.ən.er.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "able to be decided by a particular person or group, rather than being controlled by rules, or relating to the power to make these decisions: ",
                            "examples": [
                                "Judges have great discretionary powers.",
                                "Discretionary sentencing is intended to take into account the range of possible aggravating and mitigating factors in any serious crime.",
                                "These pay rises are purely discretionary.",
                                "All contributors will receive a discretionary grant/bonus/award. "
                            ]
                        },
                        {
                            "explanation": "relating to things that you pay for that are not considered completely necessary, or to money spent on these things: ",
                            "examples": [
                                "Households have already cut back on discretionary spending amid worries about the economic outlook.",
                                "Consumer spending has shrunk, with most people cutting back on discretionary purchases, such as hotel stays.",
                                "He suggests that any discretionary income should be used to pay off loans before using it to make investments."
                            ]
                        },
                        {
                            "explanation": "A discretionary fund (= an amount of money saved or invested for someone) allows the person who manages the fund to make decisions about how the money in it is managed and used, without asking the person who the money belongs to: ",
                            "examples": [
                                "Trustees of a discretionary trust may be able to decide which beneficiary to make payments to and how often payments are made.",
                                "With a discretionary account, a broker makes trades for you."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}