{
    "word": "dive",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "daɪv"
                            ],
                            "us": [
                                "daɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "past tense"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to jump into water, especially with your head and arms going in first, or to move down under the water: ",
                            "examples": [
                                "Look at those children diving for oysters over there!",
                                "They ran to the pool, dived in, and swam to the other side.",
                                "Mark dove off the bridge into the river.",
                                "The submarine dived just in time to avoid the enemy attack."
                            ]
                        },
                        {
                            "explanation": "to swim underwater, usually with breathing equipment",
                            "examples": []
                        },
                        {
                            "explanation": "to fall in value suddenly and by a large amount: ",
                            "examples": [
                                "The company's shares dived by 90p to 65p on the stock market yesterday."
                            ]
                        },
                        {
                            "explanation": "to go down very quickly: ",
                            "examples": [
                                "The plane dived towards the ground and exploded in a ball of flame.",
                                "The goalkeeper dived for the ball (= tried to catch the ball by jumping towards it and falling on the ground)."
                            ]
                        },
                        {
                            "explanation": "to move quickly, often in order to avoid something: ",
                            "examples": [
                                "They dived for cover when they heard the shooting start."
                            ]
                        },
                        {
                            "explanation": "in football, to fall down deliberately without another player causing you to fall, in order to try to win a penalty or a free kick unfairly: ",
                            "examples": [
                                "Referees should be booking players when they dive."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "daɪv"
                            ],
                            "us": [
                                "daɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a jump into water with your head going in first: ",
                            "examples": [
                                "He did a dive off a cliff.",
                                "the best dive of the competition"
                            ]
                        },
                        {
                            "explanation": "an act of swimming underwater, usually with breathing equipment: ",
                            "examples": [
                                "We saw a huge shark when we were out on a dive."
                            ]
                        },
                        {
                            "explanation": "a sudden loss in value: ",
                            "examples": [
                                "The company's profits took a dive last month."
                            ]
                        },
                        {
                            "explanation": "a movement down onto the ground: ",
                            "examples": [
                                "The goalkeeper made a valiant dive for the ball, but he couldn't quite get his hands on it.",
                                "The plane went into a dive."
                            ]
                        },
                        {
                            "explanation": "in football, the action of falling down deliberately without another player causing you to do so, in order to try to win a penalty or free kick unfairly",
                            "examples": []
                        },
                        {
                            "explanation": "a sudden quick movement: ",
                            "examples": [
                                "He made a dive for the door."
                            ]
                        },
                        {
                            "explanation": "a restaurant, hotel, bar, or place for entertainment or social activities that is unpleasant because of the condition of the building or the type of people that go there: ",
                            "examples": [
                                "The place is a real dive, but the drinks are cheap and the food's great."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}