{
    "word": "divide",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dɪˈvaɪd"
                            ],
                            "us": [
                                "dɪˈvaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) separate into parts or groups: ",
                            "examples": [
                                "At the end of the lecture, I'd like all the students to divide into small discussion groups.",
                                "After the Second World War Germany was divided into two separate countries."
                            ]
                        },
                        {
                            "explanation": "to share: ",
                            "examples": [
                                "I think we should divide (up) the costs equally among/between us."
                            ]
                        },
                        {
                            "explanation": "If something divides two areas, it marks the edge or limit of them: ",
                            "examples": [
                                "There's a narrow alley that divides our house from the one next door.",
                                "This path marks the dividing line between my land and my neighbour's."
                            ]
                        },
                        {
                            "explanation": "to use different amounts of something for different purposes or activities: ",
                            "examples": [
                                "She divides her time between her apartment in New York and her house in the Berkshires."
                            ]
                        },
                        {
                            "explanation": "If Members of Parliament divide, they vote by separating into two groups, one group who want the law that is being voted on to be accepted and one group who are against it: ",
                            "examples": [
                                "After a lengthy debate, MPs/the House of Commons divided."
                            ]
                        },
                        {
                            "explanation": "to cause a group of people to disagree about something: ",
                            "examples": [
                                "The party is divided on/over the issue of capital punishment."
                            ]
                        },
                        {
                            "explanation": "a way of keeping yourself in a position of power by causing disagreements among other people so that they are unable to oppose you: ",
                            "examples": [
                                "It's just a fact that the principle that underpins any empire is divide and rule."
                            ]
                        },
                        {
                            "explanation": "to calculate the number of times that one number fits (exactly) into another: ",
                            "examples": [
                                "10 divided by 5 is/equals 2."
                            ]
                        },
                        {
                            "explanation": "If a number divides into another number, it fits (exactly) into it when multiplied a particular number of times: ",
                            "examples": [
                                "What do you get if you divide 6 into 18?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dɪˈvaɪd"
                            ],
                            "us": [
                                "dɪˈvaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a difference or separation: ",
                            "examples": [
                                "The divide between the rich and the poor in this country is continuing to grow."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}