{
    "word": "dock",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dɒk"
                            ],
                            "us": [
                                "dɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area of water in a port that can be closed off and that is used for putting goods onto and taking them off ships or repairing ships",
                            "examples": []
                        },
                        {
                            "explanation": "a group of these areas of water in a port and the buildings around them: ",
                            "examples": [
                                "The strike has led to the cancellation of some ferry services and left hundreds of passengers stranded at the docks."
                            ]
                        },
                        {
                            "explanation": "a long structure built over water where passengers can get on or off a boat or where goods can be put on and taken off",
                            "examples": []
                        },
                        {
                            "explanation": "the place in a criminal law court where the accused person sits or stands during the trial: ",
                            "examples": [
                                "The defendant seemed nervous as he left the dock and stepped up to the witness box.",
                                "The company will find itself in the dock (= in court) if it continues to ignore the pollution regulations."
                            ]
                        },
                        {
                            "explanation": "a common wild plant with large wide leaves that grows in some northern countries such as Britain: ",
                            "examples": [
                                "Rubbing dock leaves on nettle stings helps to relieve the pain."
                            ]
                        },
                        {
                            "explanation": "a \ndocking station ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dɒk"
                            ],
                            "us": [
                                "dɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to remove part of something: ",
                            "examples": [
                                "As a punishment, the Army docked the soldiers' pay/wages by 20% and took away their leave.",
                                "The lambs' tails are docked (= cut short) for hygiene reasons."
                            ]
                        },
                        {
                            "explanation": "If a ship docks, it arrives at a dock and if someone docks a ship, they bring it into a dock: ",
                            "examples": [
                                "Hundreds of people turned up to see the ship dock at the pier.",
                                "The Russians and Americans docked (= joined together in space) (their spacecraft) just after one o'clock this morning."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}