{
    "word": "dolly",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdɒl.i"
                            ],
                            "us": [
                                "ˈdɑː.li"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a doll (= a toy in the shape of a small person or baby): ",
                            "examples": [
                                "She'll sit and play with her dollies for hours.",
                                "Toys get very straightforward names round here, like “Purple Teddy”, “Big Dolly”, “Little Dolly”, “Bunny” and “Dog”."
                            ]
                        },
                        {
                            "explanation": "a board or frame on wheels, usually with a handle at waist height, used for moving heavy objects such as furniture or machines: ",
                            "examples": [
                                "Using a dolly, they rolled the safe to a loading dock.",
                                "The machine weighed nearly 650 pounds and had to be delivered on a tilting dolly so that it could be angled through doors."
                            ]
                        },
                        {
                            "explanation": "a structure on wheels for moving a large film camera: ",
                            "examples": [
                                "The image shows the director on a dolly filming her documentary.",
                                "You might want to do a crane shot or a dolly shot."
                            ]
                        },
                        {
                            "explanation": "a board on wheels for lying on so that you can roll yourself under vehicles when examining or repairing them: ",
                            "examples": [
                                "He lay flat on a dolly under his 18-wheeler, adjusting the brakes with a wrench and a screwdriver.",
                                "The underground pits allow inspectors to walk underneath trucks to inspect their undercarriages instead of using a dolly to slide underneath vehicles. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}