{
    "word": "drainer",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdreɪ.nər"
                            ],
                            "us": [
                                "ˈdreɪ.nɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a frame made of plastic, metal, or wood, placed on the surface next to a sink to hold things while they dry: ",
                            "examples": [
                                "Jim washed up his cup carefully and placed it in the plastic drainer."
                            ]
                        },
                        {
                            "explanation": "a surface next to a sink where plates, knives, forks, etc. are left to dry after they have been washed: ",
                            "examples": [
                                "The sink is stainless steel with an integral stainless steel drainer."
                            ]
                        },
                        {
                            "explanation": "a container with holes for letting liquid run out of something: ",
                            "examples": [
                                "This is a very clever vegetable drainer which clips on to pans so you do not need a colander."
                            ]
                        },
                        {
                            "explanation": "a person whose job is to drain water (= allow it to flow away) from an area: ",
                            "examples": [
                                "He was working as a drainer on a building site. "
                            ]
                        },
                        {
                            "explanation": "something that takes a lot of power from a battery (= a device that produces electricity to provide power for phones, cars, etc.), so that in the end it uses it all up: ",
                            "examples": [
                                "Just be aware that having some apps permanently connected on your phone can be a battery drainer."
                            ]
                        },
                        {
                            "explanation": "something or someone that uses a person's energy so that they feel very tired or less powerful: ",
                            "examples": [
                                "Constantly having to prove yourself is an emotional drainer. ",
                                "In her book she advises you how to deal with \"drainers\" at work, people who suck your energy and slow you down."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}