{
    "word": "drain",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dreɪn"
                            ],
                            "us": [
                                "dreɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you drain something, you remove the liquid from it, usually by pouring it away or allowing it to flow away, and if something drains, liquid flows away or out of it: ",
                            "examples": [
                                "Drain the pasta thoroughly.",
                                "We drained the pond and filled it with fresh water.",
                                "Drain (off) any liquid that is left in the rice.",
                                "Don't bother drying the pans - just leave them to drain."
                            ]
                        },
                        {
                            "explanation": "If you drain a glass or cup, you drink all the liquid in it.",
                            "examples": []
                        },
                        {
                            "explanation": "to make someone very tired: ",
                            "examples": [
                                "The long journey completely drained me."
                            ]
                        },
                        {
                            "explanation": "to reduce or cause something to reduce: ",
                            "examples": [
                                "The long war had drained the resources of both countries.",
                                "War drains a nation of its youth and its wealth (= uses them until they are gone)."
                            ]
                        },
                        {
                            "explanation": "If the blood/colour drains from your face, or if your face drains (of blood/colour), you turn very pale, often because you are shocked or ill: ",
                            "examples": [
                                "The colour drained from his face/cheeks when they told him the results."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dreɪn"
                            ],
                            "us": [
                                "dreɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a pipe or channel that is used to carry away waste matter and water from a building, or an opening in the road that rain water can flow down: ",
                            "examples": [
                                "I think the kitchen drain is blocked.",
                                "She accidentally dropped her ring down a drain in the road."
                            ]
                        },
                        {
                            "explanation": "the system of pipes, openings in the ground, or other devices that are used for carrying away waste matter and water: ",
                            "examples": [
                                "There was an unpleasant smell coming from the drains."
                            ]
                        },
                        {
                            "explanation": "a hole in a bath, sink, etc. through which water flows away and into which you can put a plug",
                            "examples": []
                        },
                        {
                            "explanation": "something that makes you feel very tired: ",
                            "examples": [
                                "I think taking care of her elderly mother is a big drain on her energy."
                            ]
                        },
                        {
                            "explanation": "something that uses more of your energy, money, or time than you want to give: ",
                            "examples": [
                                "Having a big mortgage is a real drain on your earnings."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}