{
    "word": "drift",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "drɪft"
                            ],
                            "us": [
                                "drɪft"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move slowly, especially as a result of outside forces, with no control over direction: ",
                            "examples": [
                                "No one noticed that the boat had begun to drift out to sea.",
                                "Many vehicle fatalities are caused by drunken, distracted, or tired drivers drifting out of their lanes. ",
                                "A mist drifted in from the marshes.",
                                "After the band stopped playing, people drifted away in twos and threes.",
                                "The talk drifted aimlessly from one subject to another."
                            ]
                        },
                        {
                            "explanation": "in car racing, to use a driving technique (= a method needing skill) that means the car's tyres lose their traction (= their firm hold on the ground) but the driver still has control of the car's direction, used for example when going around a corner fast: ",
                            "examples": [
                                "She has always been interested in cars and at the age of 21 she learned how to drift. ",
                                "The image shows him drifting his car around a race track bend. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "drɪft"
                            ],
                            "us": [
                                "drɪft"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the general meaning without the details: ",
                            "examples": [
                                "The general drift of the article was that society doesn't value older people."
                            ]
                        },
                        {
                            "explanation": "to understand the general meaning of what someone is saying: ",
                            "examples": [
                                "She could see from his expression that he caught her drift immediately."
                            ]
                        },
                        {
                            "explanation": "used to say that you have left out information or your opinion from what you have just said, but that you expect the person listening still to understand it: ",
                            "examples": [
                                "She's married, but she doesn't act as if she is, if you get my drift."
                            ]
                        },
                        {
                            "explanation": "a pile of snow or something similar, formed by the wind: ",
                            "examples": [
                                "The snow lay in deep drifts."
                            ]
                        },
                        {
                            "explanation": "a general development or change in a situation: ",
                            "examples": [
                                "The downward drift in copper prices looks like it will continue."
                            ]
                        },
                        {
                            "explanation": "in car racing, a driving technique in which the car's tyres are made to lose their traction (= their firm hold on the ground) but the driver still has control of the car's direction, used for example when going around a corner fast: ",
                            "examples": [
                                "To start a drift, you have to make the rear wheels lose traction, which is most commonly done through oversteering.",
                                "A car with a rear-wheel drive system is much easier to control during a drift. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}