{
    "word": "drill",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "drɪl"
                            ],
                            "us": [
                                "drɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a tool or machine that makes holes: ",
                            "examples": [
                                "an electric/pneumatic drill",
                                "a dentist's drill",
                                "a drill bit (= the sharp part of the drill that cuts the hole)"
                            ]
                        },
                        {
                            "explanation": "an activity that practises a particular skill and often involves repeating the same thing several times, especially a military exercise intended to train soldiers: ",
                            "examples": [
                                "In some of these schools, army-style drills are used to instil a sense of discipline.",
                                "a spelling/pronunciation drill"
                            ]
                        },
                        {
                            "explanation": "a style of trap music (= a kind of popular music with complicated electronic beats and words spoken rather than sung) that started in Chicago and also became popular in London, and that is known for its lyrics (= words) describing a difficult and violent life in an urban (= city)environment: ",
                            "examples": [
                                "The gritty lyrics of drill strongly contrast with the subject matter of mainstream hip hop, which tends to glorify wealth.",
                                "Chicago’s South Side produced the raw, unapologetic drill music scene."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "drɪl"
                            ],
                            "us": [
                                "drɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a hole in something using a special tool: ",
                            "examples": [
                                "Drill three holes in the wall for the screws.",
                                "They are going to drill for oil nearby."
                            ]
                        },
                        {
                            "explanation": "to practise something, especially military exercises, or to make someone do this: ",
                            "examples": [
                                "We watched the soldiers drilling on the parade ground."
                            ]
                        },
                        {
                            "explanation": "to tell someone something repeatedly to make them remember it: ",
                            "examples": [
                                "It was drilled into us at an early age that we should always say \"please\" and \"thank you\".",
                                "He drilled the children in what they should say."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}