{
    "word": "dryness",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdraɪ.nəs"
                            ],
                            "us": [
                                "ˈdraɪ.nəs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the state of having little water or other liquid : ",
                            "examples": [
                                "The amount you sweat can be affected by the dryness of the atmosphere.",
                                "The meat was juicy with no hint of dryness."
                            ]
                        },
                        {
                            "explanation": "the fact or result of not having much rain: ",
                            "examples": [
                                "Southern Florida experienced unusual April dryness this year.",
                                "Healthy plants can better withstand stress from pests, heat and dryness."
                            ]
                        },
                        {
                            "explanation": "(of a part of the body) the state of not having enough of the natural oils or liquid that make it soft, smooth, and healthy: ",
                            "examples": [
                                "Regular application of the lotion will help prevent dryness of the skin."
                            ]
                        },
                        {
                            "explanation": "the fact of not being interesting : ",
                            "examples": [
                                "I myself enjoy the dryness of statistics.",
                                "The dryness of the speech had caused Joseph's attention to wander."
                            ]
                        },
                        {
                            "explanation": "the fact of humour being funny in a way that is clever and not obvious: ",
                            "examples": [
                                "He is a politician who is noted for the dryness of his wit.",
                                "Once I understood the dryness of her humour, we had many laughs together."
                            ]
                        },
                        {
                            "explanation": "the fact of wine or other alcoholic drinks not tasting sweet: ",
                            "examples": [
                                "The wine has just enough dryness to balance its fruitiness.",
                                "This chart shows the scale of sweetness (or dryness) of red and white wines."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}