{
    "word": "dull",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "dʌl"
                            ],
                            "us": [
                                "dʌl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not interesting or exciting in any way: ",
                            "examples": [
                                "She wrote dull, respectable articles for the local newspaper.",
                                "He's pleasant enough, but deadly dull."
                            ]
                        },
                        {
                            "explanation": "not clear, bright, or shiny: ",
                            "examples": [
                                "We could just see a dull glow given off by the fire's last embers.",
                                "The first day of our holiday was dull (= cloudy)."
                            ]
                        },
                        {
                            "explanation": "A dull knife or blade is not sharp: ",
                            "examples": [
                                "To remove the wax, let it harden, then scrape it off with a dull knife.",
                                "The blade was too dull to cut through the meat.",
                                "He fought so fiercely that his sword became dull."
                            ]
                        },
                        {
                            "explanation": "A dull sound or pain is not sharp or clear: ",
                            "examples": [
                                "I heard a dull thud from the kitchen and realized she must have fainted.",
                                "The dull rumble of traffic woke her.",
                                "She felt a dull ache at the back of her head."
                            ]
                        },
                        {
                            "explanation": "not intelligent",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dʌl"
                            ],
                            "us": [
                                "dʌl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make something such as a feeling less sharp and strong, or to become less sharp and strong: ",
                            "examples": [
                                "Many people use alcohol to dull their pain.",
                                "The medication dulled her senses.",
                                "There was no way to dull the noise of the bombardment.",
                                "My sight may have dulled, but my other senses are sharper."
                            ]
                        },
                        {
                            "explanation": "to become or make something become less clear, bright, or shiny: ",
                            "examples": [
                                "Layers of resin applied to the painting had dulled its colour.",
                                "Often a diamond ring has been dulled by skin oils, soap, and cosmetics.",
                                "The light in his eyes dulled. "
                            ]
                        },
                        {
                            "explanation": "to make a knife or blade less sharp, or to become less sharp: ",
                            "examples": [
                                "All he had with him was a notebook and a dulled pocket knife.",
                                "He produced a rusty old blade that had dulled long ago."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}