{
    "word": "early bird",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɜː.li ˌbɜːd"
                            ],
                            "us": [
                                "ˈɝː.li ˌbɝːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who gets up or arrives early, or who does something before other people do : ",
                            "examples": [
                                "She isn't an early bird by nature, but she's been up before dawn every day for the past month.",
                                "Attracted by early season discounts and bargains, 500 early birds lined up at 7 a.m. yesterday to get into the store.",
                                "The early bird usually gets the best deal."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈɜː.liˌbɜːd"
                            ],
                            "us": [
                                "ˈɝː.liˌbɝːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "available early in the day: ",
                            "examples": [
                                "This is one of my favourite places to get an early-bird breakfast.",
                                "They rose at 4 a.m. to catch an early-bird flight to San Francisco.",
                                "Many retailers offered early-bird specials to boost sales. "
                            ]
                        },
                        {
                            "explanation": "available at the beginning of a period of time or process: ",
                            "examples": [
                                "Early-bird tickets available now are $165 for a three-day pass, which will rise to $195. ",
                                "Registration to the convention is currently available at an early-bird rate of £135 (until September 1)."
                            ]
                        },
                        {
                            "explanation": "used to describe someone who does something early in the day: ",
                            "examples": [
                                "Fliers advertised a high-end washer-dryer for $600 to early-bird shoppers on Black Friday. ",
                                "Early-bird voters stand in line outside the polls.",
                                "Pick a site away from the trail, so early-bird hikers don't interrupt your morning sleep. "
                            ]
                        },
                        {
                            "explanation": "used to describe someone who does something before most other people: ",
                            "examples": [
                                "Emerging-growth companies can offer spectacular returns to early-bird investors who catch them before the crowds arrive.",
                                "You may have heard complaints that the game is too easy, and I have to say those early-bird critics have a point. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}