{
    "word": "east",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "iːst"
                            ],
                            "us": [
                                "iːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the direction from which the sun rises in the morning, opposite to the west, or the part of an area or country that is in this direction: ",
                            "examples": [
                                "The points of the compass are north, south, east, and west.",
                                "Which way is east?",
                                "Most of the country, except the east, is rural.",
                                "Her home is in the east of France.",
                                "According to the map, the village lies about ten kilometres to the east of here."
                            ]
                        },
                        {
                            "explanation": "Asia, especially its eastern and southern parts: ",
                            "examples": [
                                "She spent her childhood in the East - mostly in China.",
                                "In this class, we will be studying how medieval trade routes westernized the East."
                            ]
                        },
                        {
                            "explanation": "those countries in Europe that had communist governments before the 1990s: ",
                            "examples": [
                                "The collapse of Communism changed East-West relations for ever.",
                                "If you were from the US or the UK, it was nearly impossible to get a tourist visa to visit any countries in the communist East. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "iːst"
                            ],
                            "us": [
                                "iːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or forming the east part of something: ",
                            "examples": [
                                "Cambridge is in East Anglia.",
                                "The east wall of the mosque is covered with a beautiful mosaic."
                            ]
                        },
                        {
                            "explanation": "a wind coming from the east: ",
                            "examples": [
                                "Officials are worried that the east wind will continue to spread wildfires."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "iːst"
                            ],
                            "us": [
                                "iːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "towards the east: ",
                            "examples": [
                                "We'll drive east for a few more miles, then turn south.",
                                "They were the first people to travel east of the mountains (= into the area beyond and to the east of the mountains).",
                                "We walked due (= directly) east for two kilometres.",
                                "The garden faces east, so we'll get the morning sun."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}