{
    "word": "edge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "edʒ"
                            ],
                            "us": [
                                "edʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the outer or furthest point of something: ",
                            "examples": [
                                "He put pink icing around the edge of the cake.",
                                "They built the church on the edge of the village.",
                                "A man was standing at the water's edge with a small boy.",
                                "I caught (= hit) my leg on the edge of the table as I walked past."
                            ]
                        },
                        {
                            "explanation": "the side of a blade that cuts, or any sharp part of an object that could cut: ",
                            "examples": [
                                "Careful with that open can - it's got a very sharp edge."
                            ]
                        },
                        {
                            "explanation": "the point just before something very different and noticeable happens: ",
                            "examples": [
                                "The company is on the edge of collapse.",
                                "The government had brought the country to the edge of a catastrophe."
                            ]
                        },
                        {
                            "explanation": "If an unpleasant event pushes someone over the edge, it makes them start to behave in a crazy way: ",
                            "examples": [
                                "She had been driven over the edge by the separation from her husband."
                            ]
                        },
                        {
                            "explanation": "an advantage over other people: ",
                            "examples": [
                                "In terms of experience, she definitely had the edge over the other people that we interviewed."
                            ]
                        },
                        {
                            "explanation": "a small but noticeable amount of anger in someone's voice: ",
                            "examples": [
                                "There's a definite edge to/in her voice when she talks to her husband."
                            ]
                        },
                        {
                            "explanation": "nervous and not relaxed: ",
                            "examples": [
                                "Is something wrong? You seem a bit on edge this morning."
                            ]
                        },
                        {
                            "explanation": "in cricket, a hit of the ball with the edge of the bat: ",
                            "examples": [
                                "There were a couple of early inside edges.",
                                "He got an outside edge and was caught at second slip."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "edʒ"
                            ],
                            "us": [
                                "edʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move slowly with gradual movements or in gradual stages, or to make someone or something move in this way: ",
                            "examples": [
                                "A long line of traffic edged its way forward.",
                                "Inflation has edged up to five percent over the last two years."
                            ]
                        },
                        {
                            "explanation": "to win by a very small amount; to beat or move ahead of another person or team by a very small amount: ",
                            "examples": [
                                "Opinion polls showed him edging into a slight lead.",
                                "Germany edged Australia 5-4.",
                                "Both players gave a good performance but I think Nick just edged it."
                            ]
                        },
                        {
                            "explanation": "in cricket, to hit the ball with the edge of the bat: ",
                            "examples": [
                                "She edged the ball between the two slip fielders.",
                                "He edged a catch behind off the final ball of the day. "
                            ]
                        },
                        {
                            "explanation": "to turn a ski sideways so that one edge goes into the snow: ",
                            "examples": [
                                "Shaped skis have made it easier to turn and edge the skis with less effort. ",
                                "He's not getting low enough to use his centre of gravity to edge the ski. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}