{
    "word": "efficiency",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪˈfɪʃ.ən.si"
                            ],
                            "us": [
                                "ɪˈfɪʃ.ən.si"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the quality of achieving the largest amount of useful work using as little energy, fuel, effort, etc. as possible: ",
                            "examples": [
                                "Families and business need to take steps to maximize energy efficiency.",
                                "Streamlining cars increases their fuel efficiency.",
                                "The design of the solar panels is inspired by the efficiency with which plants convert sunlight into sugar.",
                                "The company says it wants to improve working conditions, increase efficiency, and generally make the more profitable."
                            ]
                        },
                        {
                            "explanation": "the quality of working well in an organized way, without wasting time or energy: ",
                            "examples": [
                                "She gets through her work with speed and efficiency.",
                                "What is so impressive about their society is the efficiency of the public services."
                            ]
                        },
                        {
                            "explanation": "something that is done to avoid wasting time, energy, or money: ",
                            "examples": [
                                "The report has come up with more potential savings from government efficiencies.",
                                "The difficult economic climate has forced us to look for efficiencies."
                            ]
                        },
                        {
                            "explanation": "the relationship between the amount of energy put into a machine or process, and the amount of useful work that it produces: ",
                            "examples": [
                                "The efficiency of cardiac muscle (the ratio of useful work done to fuel energy burned) is 10% to 15%."
                            ]
                        },
                        {
                            "explanation": "an \nefficiency apartment ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}