{
    "word": "elbow",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈel.bəʊ"
                            ],
                            "us": [
                                "ˈel.boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part in the middle of the arm where it bends, or the part of a piece of clothing that covers this area: ",
                            "examples": [
                                "Her arm was bandaged from the elbow to the fingers.",
                                "The sleeve of his shirt was torn at the elbow."
                            ]
                        },
                        {
                            "explanation": "a shape or object that is approximately in the form of a letter L, similar to the shape of a bent arm: ",
                            "examples": [
                                "They followed the river up to the point where it formed an elbow towards the southwest.",
                                "Use wholegrain pasta of your choice (try elbows or orecchiette)."
                            ]
                        },
                        {
                            "explanation": "in basketball, one of two points on the court (= playing area) where the free throw line meets with another line at a right angle: ",
                            "examples": [
                                "He set up at the elbow and hit a beautiful shot in the final seconds. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈel.bəʊ"
                            ],
                            "us": [
                                "ˈel.boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to push someone rudely with your elbows so that you can move or have more space: ",
                            "examples": [
                                "He elbowed his way to the front of the crowd.",
                                "They elbowed the onlookers aside."
                            ]
                        },
                        {
                            "explanation": "to hit someone with your elbow, sometimes as a sign to make them notice or remember something: ",
                            "examples": [
                                "She elbowed me in the ribs before I could say anything.",
                                "The basketball player got elbowed in the face, which was a foul for the other team. ",
                                "He was sent to the penalty box for elbowing another player."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}