{
    "word": "end",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "end"
                            ],
                            "us": [
                                "end"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part of a place or thing that is furthest away from the centre: ",
                            "examples": [
                                "This cable should have a plug at one end and a socket at the other.",
                                "We damaged the end of the piano when we moved it.",
                                "Get to the end of the queue and wait your turn like everyone else.",
                                "Our house is the third from the end on the left.",
                                "Is it safe to stand the computer on (its) end?"
                            ]
                        },
                        {
                            "explanation": "arranged with one end of next to the end of something else: ",
                            "examples": [
                                "Tables were arranged end to end across the basketball court."
                            ]
                        },
                        {
                            "explanation": "the final part of something such as a period of time, activity, or story: ",
                            "examples": [
                                "I always like to leave my desk clear at the end of the day.",
                                "The end of the play was much more exciting than I'd expected.",
                                "This latest injury must surely mean that her tennis career is now at an end (= finished).",
                                "The statement said there would be no end to the violence until the terrorists' demands were met."
                            ]
                        },
                        {
                            "explanation": "polite word for death: ",
                            "examples": [
                                "We were all by her bedside when the end finally came.",
                                "He met his end (= died) in a shoot-out with the police."
                            ]
                        },
                        {
                            "explanation": "either of the two halves of the field in some sports: ",
                            "examples": [
                                "The teams change ends at half-time so that neither side has an unfair advantage."
                            ]
                        },
                        {
                            "explanation": "to make something finish: ",
                            "examples": [
                                "He ran out of time and brought the interview to an end."
                            ]
                        },
                        {
                            "explanation": "finally, after something has been thought about or discussed a lot: ",
                            "examples": [
                                "We were thinking about going to Switzerland, but in the end we went to Austria."
                            ]
                        },
                        {
                            "explanation": "for hours, days, etc. without stopping: ",
                            "examples": [
                                "He used to lock himself in his bedroom for hours on end and refuse to talk to anyone."
                            ]
                        },
                        {
                            "explanation": "to finish: ",
                            "examples": [
                                "Everyone wishes the war would come to an end soon."
                            ]
                        },
                        {
                            "explanation": "in sports including curling, bowls, and archery, a part of a game, especially one in which each team or player throws or shoots towards one end of the playing area: ",
                            "examples": [
                                "It was a close contest that came down to the last stone in the last end. ",
                                "The Canadians took singles on each of the next three ends."
                            ]
                        },
                        {
                            "explanation": "a small part of something that is left after most of it has been used: ",
                            "examples": [
                                "She makes quilts out of fabric bolt ends.",
                                "The floor was covered in cigarette ends."
                            ]
                        },
                        {
                            "explanation": "an aim, intention, or purpose: ",
                            "examples": [
                                "Do you have a particular end in mind?"
                            ]
                        },
                        {
                            "explanation": "in order to achieve this aim: ",
                            "examples": [
                                "He wanted science students to take an interest in the arts, and to this end he ran literature classes at his home on Sunday afternoons."
                            ]
                        },
                        {
                            "explanation": "the parts of a task or process connected with one particular type of activity or person: ",
                            "examples": [
                                "Rick's more involved with the financial end of things."
                            ]
                        },
                        {
                            "explanation": "the area of activity for which someone is responsible: ",
                            "examples": [
                                "We've kept our end of the deal - let's see if they keep theirs."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "end"
                            ],
                            "us": [
                                "end"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to finish or stop, or to make something finish or stop: ",
                            "examples": [
                                "When is your meeting due to end?",
                                "Her resignation ends months of speculation about her future.",
                                "Their marriage ended in 1991.",
                                "The game ended in a draw.",
                                "I'd like to end with a song from my first album.",
                                "She ended her speech on an optimistic note."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}