{
    "word": "enough",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "ɪˈnʌf"
                            ],
                            "us": [
                                "əˈnʌf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "as much as is necessary; in the amount or to the degree needed: ",
                            "examples": [
                                "Is there enough dessert/Are there enough desserts for everyone?",
                                "There are 25 textbooks per class. That should be enough.",
                                "Have you had enough (to eat)?",
                                "I know enough about art to recognize a masterpiece when I see one.",
                                "He's tall enough to change the bulb without getting on a chair."
                            ]
                        },
                        {
                            "explanation": "as much as or more than is wanted: ",
                            "examples": [
                                "I've got enough work to do at the moment, without being given any more.",
                                "Half an hour in his company is quite enough!",
                                "Stop. You've made enough of a (= a lot of) mess already.",
                                "You've drunk more than enough (= too much) already.",
                                "I've seen/heard enough now (= I do not want to see/hear any more).",
                                "I've had enough of your excuses (= I want them to stop).",
                                "Enough of this! I don't want to discuss it any more.",
                                "Enough already! (= No more!)"
                            ]
                        },
                        {
                            "explanation": "something you say when you want something to stop: ",
                            "examples": [
                                "Enough is enough - I don't want to argue with you any more."
                            ]
                        },
                        {
                            "explanation": "something you say to tell someone that you understand what they have said and that there is no need to say any more: ",
                            "examples": [
                                "\"Someone has to explain the situation to her.\" \"Enough said.\""
                            ]
                        },
                        {
                            "explanation": "to want something to stop because it is annoying you: ",
                            "examples": [
                                "I've had enough - I'm going home."
                            ]
                        },
                        {
                            "explanation": "used to tell someone to stop behaving badly: ",
                            "examples": [
                                "That's enough, Peter. Give those toys back, please.",
                                "\"Hush,\" said grandma. \"That's enough now.\"",
                                "Lola, Rachel, that's enough! I'm fed up with your arguing.",
                                "That's enough! We'll never resolve this if you can't be civil.",
                                "That's enough! I won't tolerate any more of this behaviour!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɪˈnʌf"
                            ],
                            "us": [
                                "əˈnʌf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used after an adjective, adverb, or verb to mean to the necessary degree: ",
                            "examples": [
                                "Is the water hot enough yet?",
                                "I don't think he's really experienced enough for this sort of job.",
                                "She told me it was brand new and I was stupid enough to believe her.",
                                "Would you be good enough to take my suitcase upstairs for me?"
                            ]
                        },
                        {
                            "explanation": "used after an adjective or adverb to mean quite: ",
                            "examples": [
                                "He's bad enough, but his brother is far worse.",
                                "She's gone away for six months, but strangely/oddly/funnily enough (= surprisingly), her boyfriend doesn't seem too unhappy about it."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}