{
    "word": "espalier",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪˈspæl.i.eɪ"
                            ],
                            "us": [
                                "ɪˈspɑːl.jeɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a tree, usually a fruit tree, that has been made to grow in a flat shape against something such as a wall or fence: ",
                            "examples": [
                                "Her gardens always include espaliers. ",
                                "Grow the shrubs as espaliers, in the same way as you might an apple or pear tree."
                            ]
                        },
                        {
                            "explanation": "a frame or wire for a tree to grow along in a flat shape against something such as a wall or fence: ",
                            "examples": [
                                "Pear is my favourite blossom, either in a big tree with the blossom piled up like clouds, or stretched out along espaliers."
                            ]
                        },
                        {
                            "explanation": "a method of making trees, usually fruit trees, grow in a flat shape against something such as a wall or fence: ",
                            "examples": [
                                "He became fascinated by the ancient pruning and grafting technique known as espalier.",
                                "In 17th-century England and France, espalier was very fashionable."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɪˈspæl.i.eɪ"
                            ],
                            "us": [
                                "ɪˈspɑːl.jeɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make trees, usually fruit trees, grow in a flat shape against something such as a wall or fence: ",
                            "examples": [
                                "On the walls of the courtyard and buildings, I'll espalier some fruit trees.",
                                "If you have a walled garden, the fruit trees can be espaliered against the wall.",
                                "Ancient Egyptian tombs have been found with paintings of espaliered fig trees."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ɪˈspæl.i.eɪ"
                            ],
                            "us": [
                                "ɪˈspɑːl.jeɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a tree) made to grow in a flat shape against something such as a wall or fence: ",
                            "examples": [
                                "He is responsible for pruning the long lines of trained espalier pears.",
                                "We admired the well-trained espalier apples and plums."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɪˈspæl.i.eɪ"
                            ],
                            "us": [
                                "ɪˈspɑːl.jeɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a tree grows espalier, it grows in a flat shape against something such as a wall or fence: ",
                            "examples": [
                                "Peonies and small shrubs grew in a long border backed by apple trees, grown espalier."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}