{
    "word": "establish",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɪˈstæb.lɪʃ"
                            ],
                            "us": [
                                "ɪˈstæb.lɪʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to start a company or organization that will continue for a long time: ",
                            "examples": [
                                "The brewery was established in 1822.",
                                "These methods of working were established in the last century."
                            ]
                        },
                        {
                            "explanation": "to start having a relationship with, or communicating with another person, company, country, or organization: ",
                            "examples": [
                                "There is a strong need to establish effective communication links between staff, parents, pupils, and external bodies."
                            ]
                        },
                        {
                            "explanation": "to cause something or someone to be accepted in or familiar with a place, position, etc.: ",
                            "examples": [
                                "His reputation for carelessness was established long before the latest problems arose.",
                                "He's established himself as a dependable source of information.",
                                "After three months we were well established in/at our new house/new jobs."
                            ]
                        },
                        {
                            "explanation": "to be in a successful position over a long period of time: ",
                            "examples": [
                                "He has established himself as the leading candidate in the election.",
                                "When you have established yourself and made some money, you will be in a position to marry.",
                                "I spent several years trying to establish myself as a painter.",
                                "He has established himself as one of the most successful sportsmen of the century.",
                                "It can't have been easy to establish yourselves in such a competitive market."
                            ]
                        },
                        {
                            "explanation": "to discover or get proof of something: ",
                            "examples": [
                                "Before we take any action we must establish the facts/truth.",
                                "Can you establish what time she left home/whether she has left home.",
                                "We have established (that) she was born in 1900."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}