{
    "word": "even",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈiː.vən"
                            ],
                            "us": [
                                "ˈiː.vən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show that something is surprising, unusual, unexpected, or extreme: ",
                            "examples": [
                                "I don't even know where it is.",
                                "Everyone I know likes the smell of bacon - even Mike does and he's a vegetarian.",
                                "We were all on time - even Chris and he's usually late for everything.",
                                "It's a very difficult job - it might even take a year to finish it.",
                                "\"I never cry.\" \"Not even when you hurt yourself really badly?\"",
                                "Even with a load of electronic gadgetry, you still need some musical ability to write a successful song."
                            ]
                        },
                        {
                            "explanation": "at the same time as: ",
                            "examples": [
                                "I tried to reason with him, but even as I started to explain what had happened he stood up to leave."
                            ]
                        },
                        {
                            "explanation": "used to say that if something is the case or not, the result is the same: ",
                            "examples": [
                                "Even if you take a taxi, you'll still miss your train."
                            ]
                        },
                        {
                            "explanation": "despite something: ",
                            "examples": [
                                "I've thought about it so much, but even now I can't believe how lucky I was to survive the accident."
                            ]
                        },
                        {
                            "explanation": "despite what has just been said: ",
                            "examples": [
                                "I had a terrible headache, but even so I went to the concert."
                            ]
                        },
                        {
                            "explanation": "although: ",
                            "examples": [
                                "Even though he left school at 16, he still managed to become prime minister."
                            ]
                        },
                        {
                            "explanation": "used to emphasize a comparison: ",
                            "examples": [
                                "The next 36 hours will be even colder with snow showers becoming more widespread.",
                                "Any devaluation of the pound would make it even more difficult to keep inflation low."
                            ]
                        },
                        {
                            "explanation": "used when you want to be more exact or detailed about something you have just said: ",
                            "examples": [
                                "I find some of his habits somewhat unpleasant, disgusting even.",
                                "She has always been very kind to me, even generous on occasion."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈiː.vən"
                            ],
                            "us": [
                                "ˈiː.vən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "flat and smooth, or on the same level: ",
                            "examples": [
                                "We resurfaced the floor because it wasn't even."
                            ]
                        },
                        {
                            "explanation": "continuous or regular: ",
                            "examples": [
                                "You should try to work at an even rate instead of taking it easy one day and working flat out the next."
                            ]
                        },
                        {
                            "explanation": "equal or equally balanced: ",
                            "examples": [
                                "Both sides played well - it was a very even contest.",
                                "The weather forecast said that there's an even chance of thunderstorms tonight (= that it is equally likely that there will or will not be storms)."
                            ]
                        },
                        {
                            "explanation": "equally likely to happen as to not happen: ",
                            "examples": [
                                "The chances of her getting the job are about evens."
                            ]
                        },
                        {
                            "explanation": "used to refer to a situation in which you risk money on something where the risk is equally balanced, and will pay back twice the amount of money that is paid if it is successful: ",
                            "examples": [
                                "an even bet",
                                "If I were betting I'd take even money on United."
                            ]
                        },
                        {
                            "explanation": "forming a whole number that can be divided exactly by two: ",
                            "examples": [
                                "6 is an even number and 7 is an odd number."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈiː.vən"
                            ],
                            "us": [
                                "ˈiː.vən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make two things equal: ",
                            "examples": [
                                "Sheila was awarded a scholarship in chemistry, and now her brother has evened the score with a scholarship in economics.",
                                "The whisky industry is campaigning for the taxes on different alcoholic drinks to be evened up."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}