{
    "word": "every",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "ˈev.ri"
                            ],
                            "us": [
                                "ˈev.ri"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used when referring to all the members of a group of three or more: ",
                            "examples": [
                                "The police want to interview every employee about the theft.",
                                "The show will be broadcast every weekday morning between 9.00 and 10.00.",
                                "We're open every day except Sunday.",
                                "I've been out every night this week.",
                                "Every time I go to London I get caught in a traffic jam.",
                                "Ten pence is donated to charity for every bottle sold.",
                                "These paintings may look like the real thing, but (each and) every one of them is a fake.",
                                "That salmon was very expensive so make sure you eat up every (single) bit."
                            ]
                        },
                        {
                            "explanation": "equally as: ",
                            "examples": [
                                "Opponents of the war are considered every bit as patriotic as supporters."
                            ]
                        },
                        {
                            "explanation": "every: ",
                            "examples": [
                                "We catch the majority of people, but hunting down every last tax evader is impossible."
                            ]
                        },
                        {
                            "explanation": "in all directions: ",
                            "examples": [
                                "The game was hindered by a fierce wind that swept the ball every which way."
                            ]
                        },
                        {
                            "explanation": "in all ways: ",
                            "examples": [
                                "This movie is in every way a masterpiece of cinematography."
                            ]
                        },
                        {
                            "explanation": "all the things that you need or want: ",
                            "examples": [
                                "There'll be an assistant there to see to your every need."
                            ]
                        },
                        {
                            "explanation": "used to show that something is repeated regularly: ",
                            "examples": [
                                "Computers can perform millions of calculations every second.",
                                "Every four minutes a car is stolen in this city.",
                                "Every day in the US 25 people are murdered with handguns.",
                                "Every few kilometres we passed a burned out jeep or truck at the side of the road.",
                                "The conference takes place every other/second year."
                            ]
                        },
                        {
                            "explanation": "sometimes but not often: ",
                            "examples": [
                                "Every now and then they'll have a beer together."
                            ]
                        },
                        {
                            "explanation": "sometimes but not often: ",
                            "examples": [
                                "Every so often I treat myself to a meal in an expensive restaurant."
                            ]
                        },
                        {
                            "explanation": "the greatest possible or that can be imagined: ",
                            "examples": [
                                "I'd like to wish you every success in your new job/happiness in your new home.",
                                "She has every reason to be unhappy after losing her job and her home.",
                                "You had every opportunity to make a complaint.",
                                "Every effort is being made to minimize civilian casualties.",
                                "She has every right to be proud of her tremendous achievements."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}