{
    "word": "evidence",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈev.ɪ.dəns"
                            ],
                            "us": [
                                "ˈev.ə.dəns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "facts, information, documents, etc. that give reason to believe that something is true: ",
                            "examples": [
                                "The police have found no evidence of a terrorist link with the murder.",
                                "There is no scientific evidence to suggest that underwater births are dangerous.",
                                "Is there any scientific evidence that a person's character is reflected in their handwriting?",
                                "Several experts are to give evidence on the subject.",
                                "There is only circumstantial evidence against her, so she is unlikely to be convicted.",
                                "Campaigners now have compelling documentary evidence of the human rights abuses that they had been alleging for several years.",
                                "Fresh evidence suggests that the statement had been fabricated.",
                                "The traces of petrol found on his clothing provided the forensic evidence proving that he had started the fire deliberately.",
                                "All the evidence points to a substantial rise in traffic over the next few years.",
                                "There is growing evidence that people whose diets are rich in vitamins are less likely to develop some types of cancer."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈev.ɪ.dəns"
                            ],
                            "us": [
                                "ˈev.ə.dəns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to provide evidence (= facts, information, etc. that give reasons for believing) that something is true or present: ",
                            "examples": [
                                "They are required to have recognized qualifications and to evidence membership of a relevant professional body.",
                                "The huge improvement in our service is evidenced by recent customer surveys. ",
                                "These emails are still circulating, as evidenced by my receiving one just this morning."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}