{
    "word": "excuse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɪkˈskjuːz"
                            ],
                            "us": [
                                "ɪkˈskjuːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to forgive someone or something: ",
                            "examples": [
                                "Please excuse me for arriving late - the bus was delayed.",
                                "Nothing can excuse that sort of behaviour.",
                                "No amount of financial recompense can excuse the way in which the company carried out its policy.",
                                "We cannot excuse him for these crimes."
                            ]
                        },
                        {
                            "explanation": "to allow someone not to do or attend something when they normally would have to: ",
                            "examples": [
                                "I asked the teacher if I could be excused from hockey practice as my knee still hurt.",
                                "Please excuse me from the rest of the meeting - I've just received a phone call that requires my immediate attention.",
                                "You are excused—you may go."
                            ]
                        },
                        {
                            "explanation": "a polite way of attracting someone's attention, especially someone you do not know: ",
                            "examples": [
                                "Excuse me, does this bus go to Oxford Street?"
                            ]
                        },
                        {
                            "explanation": "used to politely ask someone to move so that you can walk past them: ",
                            "examples": [
                                "Excuse me, can I just get past?"
                            ]
                        },
                        {
                            "explanation": "used to tell someone politely that you are leaving: ",
                            "examples": [
                                "Excuse me a moment, I'll be with you shortly."
                            ]
                        },
                        {
                            "explanation": "used to say sorry for something you have done by accident: ",
                            "examples": [
                                "Did I take your seat? Do excuse me."
                            ]
                        },
                        {
                            "explanation": "said before disagreeing with someone: ",
                            "examples": [
                                "Excuse me, but aren't you forgetting something?"
                            ]
                        },
                        {
                            "explanation": "used to politely ask someone to repeat something they have said because you have not heard it: ",
                            "examples": [
                                "Excuse me, I didn't quite hear what you said."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪkˈskjuːs"
                            ],
                            "us": [
                                "ɪkˈskjuːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a reason that you give to explain why you did something wrong: ",
                            "examples": [
                                "He'd better have a good excuse for being late.",
                                "I've never known him to miss a meeting - I'm sure he'll have an excuse.",
                                "There's no excuse for that sort of behaviour."
                            ]
                        },
                        {
                            "explanation": "a false reason that you give to explain why you do something: ",
                            "examples": [
                                "She was just looking for an excuse to call him.",
                                "Any excuse for a holiday!"
                            ]
                        },
                        {
                            "explanation": "to explain why you cannot be present somewhere: ",
                            "examples": [
                                "Please make my excuses at the meeting on Friday."
                            ]
                        },
                        {
                            "explanation": "to give false reasons why you cannot do something: ",
                            "examples": [
                                "You're always making excuses for not helping me."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}