{
    "word": "exercise",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈek.sə.saɪz"
                            ],
                            "us": [
                                "ˈek.sɚ.saɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "physical activity that you do to make your body strong and healthy: ",
                            "examples": [
                                "Swimming is my favourite form of exercise.",
                                "You really should take more exercise.",
                                "I do stomach exercises most days."
                            ]
                        },
                        {
                            "explanation": "an action or actions intended to improve something or make something happen: ",
                            "examples": [
                                "Ships from eight navies will be taking part in an exercise in the Pacific to improve their efficiency in combat.",
                                "It would be a useful exercise for you to say the speech aloud several times.",
                                "an exercise in public relations"
                            ]
                        },
                        {
                            "explanation": "a short piece of written work that you do to practise something you are learning: ",
                            "examples": [
                                "The book has exercises at the end of every chapter."
                            ]
                        },
                        {
                            "explanation": "the use of something: ",
                            "examples": [
                                "The exercise of restraint may well be difficult."
                            ]
                        },
                        {
                            "explanation": "a ceremony that includes speeches and usually traditional music or activities: ",
                            "examples": [
                                "graduation exercises"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈek.sə.saɪz"
                            ],
                            "us": [
                                "ˈek.sɚ.saɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to do physical activities to make your body strong and healthy: ",
                            "examples": [
                                "She exercises most evenings usually by running.",
                                "A work-out in the gym will exercise all the major muscle groups."
                            ]
                        },
                        {
                            "explanation": "If you exercise an animal, you make it walk or run so that it stays strong and healthy: ",
                            "examples": [
                                "Now he's retired he spends most afternoons exercising his dogs."
                            ]
                        },
                        {
                            "explanation": "to use something: ",
                            "examples": [
                                "I exercised my democratic right by not voting in the election.",
                                "Always exercise caution when handling radioactive substances.",
                                "We've decided to exercise the option (= use the part of a legal agreement) to buy the house we now lease."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}