{
    "word": "exit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈek.sɪt",
                                "ˈeɡ.zɪt"
                            ],
                            "us": [
                                "ˈek.sɪt",
                                "ˈeɡ.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the door through which you might leave a building or large vehicle: ",
                            "examples": [
                                "We headed for the nearest exit.",
                                "The fire exit (= the door you can escape through if there is a fire) is located at the back of the building.",
                                "Please ensure that emergency exits are kept clear at all times."
                            ]
                        },
                        {
                            "explanation": "the act of leaving a place, especially a theatre stage: ",
                            "examples": [
                                "He saw Emma arrive and made a quick exit.",
                                "She made her exit from the stage to rapturous applause."
                            ]
                        },
                        {
                            "explanation": "the act of leaving something such as a job, an organization, a competition, or a television show: ",
                            "examples": [
                                "They believed his exit from the Department of Education was likely.",
                                "Scriptwriters have promised the character a dramatic exit."
                            ]
                        },
                        {
                            "explanation": "a smaller road used to leave a main road: ",
                            "examples": [
                                "Turn off the motorway at the next exit."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈek.sɪt",
                                "ˈeɡ.zɪt"
                            ],
                            "us": [
                                "ˈek.sɪt",
                                "ˈeɡ.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to leave a place such as a building, room, or large vehicle: ",
                            "examples": [
                                "I exited quickly before anyone could see me.",
                                "Please exit the theatre by the side doors."
                            ]
                        },
                        {
                            "explanation": "to leave a theatre stage: ",
                            "examples": [
                                "The character exits stage right.",
                                "The singer took a bow before exiting the stage."
                            ]
                        },
                        {
                            "explanation": "to leave a large road and turn onto a smaller road: ",
                            "examples": [
                                "Detectives were following the car as it exited Route 3.",
                                "Exit at junction 29."
                            ]
                        },
                        {
                            "explanation": "to leave something such as a job, an organization, a competition, or a television show: ",
                            "examples": [
                                "The former CEO exited the company amid growing criticism.",
                                "They would be the ones exiting early from the tournament."
                            ]
                        },
                        {
                            "explanation": "to end a computer program that you are using: ",
                            "examples": [
                                "You have to exit the program before starting another.",
                                "Click here to save and exit."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "interjection",
                        "ipa": {
                            "uk": [
                                "ˈek.sɪt",
                                "ˈeɡ.zɪt"
                            ],
                            "us": [
                                "ˈek.sɪt",
                                "ˈeɡ.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an instruction written in a play meaning that a character leaves the stage: ",
                            "examples": [
                                "The most famous and intriguing of all Shakespeare's stage directions is \"Exit pursued by a bear,\" in The Winter's Tale.",
                                "Exit stage left."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}