{
    "word": "experience",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪkˈspɪə.ri.əns"
                            ],
                            "us": [
                                "ɪkˈspɪr.i.əns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(the process of getting) knowledge or skill from doing, seeing, or feeling things: ",
                            "examples": [
                                "Do you have any experience of working with kids? (= Have you ever worked with them?)",
                                "The best way to learn is by experience (= by doing things).",
                                "I know from experience that Tony never keeps his promises.",
                                "I don't think she has the experience for the job (= enough knowledge and skill for it).",
                                "In my experience, people generally smile back if you smile at them.",
                                "The experience of pain (= what pain feels like) varies from one person to another."
                            ]
                        },
                        {
                            "explanation": "something that happens to you that affects how you feel: ",
                            "examples": [
                                "I had a pretty unpleasant experience at the dentist's.",
                                "It was interesting hearing about his experiences as a policeman.",
                                "I did meet him once and it was an experience I shall never forget."
                            ]
                        },
                        {
                            "explanation": "the way that something happens and how it makes you feel: ",
                            "examples": [
                                "They go out of their way to make sure you have a great dining experience.",
                                "A spokesman for the company said that it was committed to improving the customer experience."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɪkˈspɪə.ri.əns"
                            ],
                            "us": [
                                "ɪkˈspɪr.i.əns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you experience something, it happens to you, or you feel it: ",
                            "examples": [
                                "We experienced a lot of difficulty in selling our house.",
                                "New companies often experience a loss in their first few years.",
                                "It was the worst pain I'd ever experienced."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}