{
    "word": "expectation",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌek.spekˈteɪ.ʃən"
                            ],
                            "us": [
                                "ˌek.spekˈteɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the feeling that good things are going to happen in the future: ",
                            "examples": [
                                "The holiday lived up to all our expectations (= was as good as we were expecting).",
                                "I've heard she's a stellar manager so I have high expectations (= I believe she will do a good job).",
                                "What are your expectations for this job?",
                                "I think she had unrealistic expectations of motherhood.",
                                "We did so well - beyond all (= better than) our expectations."
                            ]
                        },
                        {
                            "explanation": "the feeling of expecting something to happen: ",
                            "examples": [
                                "Our expectations are that the UK will cut its interest rate.",
                                "Is there any expectation of change at this point?",
                                "They planned a protest with the expectation of being arrested.",
                                "Considering the injuries he's had there can be little expectation of him winning the race."
                            ]
                        },
                        {
                            "explanation": "different from what is expected: ",
                            "examples": [
                                "Contrary to all expectations, she was accepted by the academy."
                            ]
                        },
                        {
                            "explanation": "to try to encourage people to expect a bad result, so they will not be disappointed and may be pleasantly surprised: ",
                            "examples": [
                                "Anticipating heavy losses, his campaign has already started managing expectations. ",
                                "As they await the panel's decision, advocates on each side try to manage expectations. ",
                                "Hoping to manage expectations, the company is saying publicly that its only goal is to equal the last quarter's performance."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}