{
    "word": "extend",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɪkˈstend"
                            ],
                            "us": [
                                "ɪkˈstend"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to add to something in order to make it bigger or longer: ",
                            "examples": [
                                "We have plans to extend our house (= to make it bigger).",
                                "The government has produced a series of leaflets designed to extend (= increase) public awareness of the dangers of AIDS.",
                                "We're planning to extend our publishing of children's books (= increase it)."
                            ]
                        },
                        {
                            "explanation": "to make something last longer: ",
                            "examples": [
                                "The bar has recently extended its opening hours (= made them longer).",
                                "I need to extend my visa (= make it last longer)."
                            ]
                        },
                        {
                            "explanation": "to stretch something out: ",
                            "examples": [
                                "We've extended a clothesline (= made it reach) between two trees in the garden.",
                                "He extended his hand as a greeting (= held out his hand for someone to shake it)."
                            ]
                        },
                        {
                            "explanation": "to reach, stretch, or continue: ",
                            "examples": [
                                "The Sahara Desert extends for miles.",
                                "The path extends beyond the end of the road.",
                                "Rain is expected to extend to (= arrive in) all parts of the country by this evening.",
                                "The effects of this legislation will extend (= reach) further than the government intends."
                            ]
                        },
                        {
                            "explanation": "to offer or give something to someone: ",
                            "examples": [
                                "I should like to extend my thanks to you for your kindness.",
                                "The chairperson extended a warm welcome to the guest speaker.",
                                "The government is extending aid to people who have been affected by the earthquake.",
                                "The bank has agreed to extend us money/extend money to us (= lend us money) to buy our house."
                            ]
                        },
                        {
                            "explanation": "to include or affect someone or something: ",
                            "examples": [
                                "Parking restrictions do not extend to disabled people.",
                                "Her new-found tolerance does not extend to single mothers.",
                                "The invitation did not extend to family members."
                            ]
                        },
                        {
                            "explanation": "to cause someone to use all their ability: ",
                            "examples": [
                                "She feels that her job doesn't extend her enough."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}