{
    "word": "extension",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪkˈsten.ʃən"
                            ],
                            "us": [
                                "ɪkˈsten.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the fact of reaching, stretching, or continuing; the act of adding to something in order to make it bigger or longer: ",
                            "examples": [
                                "Martin Luther King, Jr, campaigned for the extension of civil rights to (= for them to include) black people.",
                                "The extension (= increasing) of police powers in the province has been heavily criticized.",
                                "His report contained serious criticisms of the finance director, and, by extension (= therefore), of the entire board of management.",
                                "The article is an extension of (= takes further) the ideas Professor Fox developed in an earlier book.",
                                "I've applied for an extension to my visa (= asked for it to last longer).",
                                "They are hoping to get an extension of their loan (= to be given a longer period of time in which to pay it back)."
                            ]
                        },
                        {
                            "explanation": "any of two or more phones in the same house that share the same number, or any of a number of phones connected to a switchboard in a large building such as an office: ",
                            "examples": [
                                "We have an extension in our bedroom.",
                                "When you call, ask for extension 3276."
                            ]
                        },
                        {
                            "explanation": "the last part of the name of a computer file, which comes after a (.) and shows what type of file it is",
                            "examples": []
                        },
                        {
                            "explanation": "a long piece of hair that is added to a person's own hair in order to make the hair longer",
                            "examples": []
                        },
                        {
                            "explanation": "a new part added to a house or other building: ",
                            "examples": [
                                "We're building an extension to our house.",
                                "We've paid off the amount we owed for building a two-storey extension on our home."
                            ]
                        },
                        {
                            "explanation": "an exercise in which you extend (= stretch out) your arm or leg, or the act of extending your arm or leg: ",
                            "examples": [
                                "Extensions are good for strengthening pelvic floor muscles. ",
                                "Ask the instructor to show you how to do leg extensions.",
                                "The shoulder starts to lock up, preventing him from getting full arm extension."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ɪkˈsten.ʃən"
                            ],
                            "us": [
                                "ɪkˈsten.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "intended to support students' learning by making them try different or more difficult things in addition to their basic work: ",
                            "examples": [
                                "The book includes lesson plans and extension activities."
                            ]
                        },
                        {
                            "explanation": "offered by a university to people who are not studying for a degree there : ",
                            "examples": [
                                "She teaches an extension class on computer technology.",
                                "He took extension courses at the University of Minnesota for two years."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}