{
    "word": "face",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "feɪs"
                            ],
                            "us": [
                                "feɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the front of the head, where the eyes, nose, and mouth are: ",
                            "examples": [
                                "She has a long, thin face.",
                                "She had a puzzled expression on her face."
                            ]
                        },
                        {
                            "explanation": "an expression on someone's face: ",
                            "examples": [
                                "I was greeted by smiling faces.",
                                "I could see from his face he was unhappy."
                            ]
                        },
                        {
                            "explanation": "to make a strange expression with your face, for example to show that you do not like someone or something: ",
                            "examples": [
                                "I was making silly faces to get the baby to laugh."
                            ]
                        },
                        {
                            "explanation": "the front or surface of an object: ",
                            "examples": [
                                "the north face of a mountain",
                                "the west face of the building"
                            ]
                        },
                        {
                            "explanation": "the front of a clock or watch that has the numbers or marks that show what time it is: ",
                            "examples": [
                                "a watch face with Roman numerals"
                            ]
                        },
                        {
                            "explanation": "the respect and honour of others: ",
                            "examples": [
                                "He thinks he would lose face if he admitted the mistake.",
                                "She tried to save face by inventing a story about being overseas at the time."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "feɪs"
                            ],
                            "us": [
                                "feɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you face a problem, or a problem faces you, you have to deal with it: ",
                            "examples": [
                                "This is one of the many problems faced by working mothers.",
                                "Passengers could face long delays.",
                                "You're faced with a very difficult choice there."
                            ]
                        },
                        {
                            "explanation": "to accept that something unpleasant is true and start to deal with the situation: ",
                            "examples": [
                                "I think Phil has to face the fact that she no longer loves him.",
                                "We have to face facts here - we simply don't have enough money.",
                                "He's dying but he refuses to face the truth."
                            ]
                        },
                        {
                            "explanation": "to not want to do or deal with something unpleasant: ",
                            "examples": [
                                "I can't face walking up all those steps again."
                            ]
                        },
                        {
                            "explanation": "to deal with someone when the situation between you is difficult: ",
                            "examples": [
                                "She half hoped he would not find her, though she knew she would have to face him sooner or later."
                            ]
                        },
                        {
                            "explanation": "to turn or be turned towards something physically; to be opposite something: ",
                            "examples": [
                                "The balcony faced towards the sea.",
                                "Our apartment faces south.",
                                "Their houses face each other across the street."
                            ]
                        },
                        {
                            "explanation": "If you face a building, you put an extra layer in front of what is already there: ",
                            "examples": [
                                "The house was built of wood but faced in/with brick."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}