{
    "word": "face-to-face",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˌfeɪs.təˈfeɪs"
                            ],
                            "us": [
                                "ˌfeɪs.təˈfeɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "directly, meeting someone in the same place: ",
                            "examples": [
                                "We've spoken on the phone but never face-to-face.",
                                "If discussing your problem face-to-face with someone seems too difficult, try writing a letter about it.",
                                "She came face-to-face with her attacker in the courtroom."
                            ]
                        },
                        {
                            "explanation": "directly experiencing or having to deal with a situation, usually a difficult one: ",
                            "examples": [
                                "Eventually, he'll come face-to-face with the same question that hits every star when fame starts to dwindle: what now?",
                                "He is standing face-to-face with an issue similar to the one that ended his predecessor's prime ministership. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌfeɪs.təˈfeɪs"
                            ],
                            "us": [
                                "ˌfeɪs.təˈfeɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a meeting, conversation, etc.) with someone who you meet in the same place: ",
                            "examples": [
                                "They never offered us a face-to-face meeting to discuss our questions.",
                                "Face-to-face contact can be important for good working relationships.",
                                "Now I was face to face with him at last."
                            ]
                        },
                        {
                            "explanation": "experiencing or having to deal with a situation directly: ",
                            "examples": [
                                "This country is face-to-face with one of the greatest tragedies in its history."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌfeɪs.təˈfeɪs"
                            ],
                            "us": [
                                "ˌfeɪs.təˈfeɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a meeting or conversation between people who are physically in the same place: ",
                            "examples": [
                                "Will it be a phone interview or a face-to-face?",
                                "I think it's time we met for a face to face.",
                                "She had managed to talk her way out of meeting with a client who wanted a face-to-face with her."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}