{
    "word": "fade",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "feɪd"
                            ],
                            "us": [
                                "feɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) lose colour, brightness, or strength gradually: ",
                            "examples": [
                                "If you hang your clothes out in the bright sun, they will fade.",
                                "My suntan is already fading.",
                                "They arrived home just as the light was fading (= as it was getting dark).",
                                "The sun had faded the blue walls."
                            ]
                        },
                        {
                            "explanation": "In golf, if you fade the ball, you hit it so it moves slightly to one side rather than straight in front. If a golf ball fades, it moves slightly to one side: ",
                            "examples": [
                                "Trying to fade the ball off the tee, he hooked into deep rough.",
                                "By aiming down the left-hand side, the ball will fade back into the middle of the fairway. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "feɪd"
                            ],
                            "us": [
                                "feɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a gradual loss of colour or brightness, often until an image disappears: ",
                            "examples": [
                                "A fade to black would be a good way to end the sequence.",
                                "At that point there is a fade out so what happens next is left to our imaginations."
                            ]
                        },
                        {
                            "explanation": "a way of ending a piece of music by making it gradually quieter and quieter: ",
                            "examples": [
                                "At the end of the song we just repeat the chorus until the fade.",
                                "The software allows you to make fades and segue the songs together."
                            ]
                        },
                        {
                            "explanation": "a gradual increase in colour, brightness, or loudness so that a picture or sound appears gradually: ",
                            "examples": [
                                "You could begin your web page with a fade in, allowing the visitor to concentrate on one important point before seeing the rest of the page content."
                            ]
                        },
                        {
                            "explanation": "a gradual loss of strength or importance: ",
                            "examples": [
                                "That was when his career began its slow fade into obscurity."
                            ]
                        },
                        {
                            "explanation": "a hairstyle in which the hair is left fairly long on top of the head, cut gradually shorter at the sides, and cut very short or completely removed lower down: ",
                            "examples": [
                                "At the barber shop you can get a fade for £20.",
                                "The boys all had fades."
                            ]
                        },
                        {
                            "explanation": "in golf, the action of hitting the ball slightly to one side rather than straight in front, or the movement of the ball slightly to one side: ",
                            "examples": [
                                "He said he was trying to draw the ball rather than hit a fade. ",
                                "All you need is about two yards of fade on your ball and it's gone."
                            ]
                        },
                        {
                            "explanation": "in American football, a passing move where the player receiving the ball runs straight at first but then moves towards the side of the playing area to catch the ball: ",
                            "examples": [
                                "Wideout Marvin Davis was supposed to run a fade towards the right-hand corner.",
                                "The touchdown on a fade to Miller turned out to be the winning score."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}