{
    "word": "fail",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "feɪl"
                            ],
                            "us": [
                                "feɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to not succeed in what you are trying to achieve or are expected to do: ",
                            "examples": [
                                "She moved to London in the hope of finding work as a model, but failed.",
                                "This method of growing tomatoes never fails.",
                                "He failed in his attempt to break the record.",
                                "She failed to reach the Wimbledon Final this year.",
                                "The reluctance of either side to compromise means that the talks are doomed to (= will certainly) fail."
                            ]
                        },
                        {
                            "explanation": "if none of our plans succeed: ",
                            "examples": [
                                "If all else fails, we can always stay in and watch TV."
                            ]
                        },
                        {
                            "explanation": "to be unsuccessful, or to judge that someone has been unsuccessful, in a test or exam: ",
                            "examples": [
                                "I passed in history but failed in chemistry.",
                                "I passed history but failed chemistry.",
                                "A lot of people fail their driving test the first time.",
                                "She was sure she was going to fail.",
                                "The examiners failed him because he hadn't answered enough questions."
                            ]
                        },
                        {
                            "explanation": "to not do something that you should do: ",
                            "examples": [
                                "He failed to arrive on time.",
                                "The staff had been promised a rise, but the money failed to (= did not) materialize.",
                                "You couldn't fail to be (= it is impossible that you would not be) affected by the movie.",
                                "I'd be failing in my duty if I didn't tell you about the risks involved in the project."
                            ]
                        },
                        {
                            "explanation": "used when you do not accept something: ",
                            "examples": [
                                "I fail to see why you can't work on a Saturday."
                            ]
                        },
                        {
                            "explanation": "to become weaker or stop working completely: ",
                            "examples": [
                                "If my eyesight fails, I'll have to stop doing this job.",
                                "The brakes failed and the car crashed into a tree.",
                                "After talking non-stop for two hours, her voice started to fail.",
                                "The old man was failing fast (= he was dying)."
                            ]
                        },
                        {
                            "explanation": "If a business fails, it is unable to continue because of money problems.",
                            "examples": []
                        },
                        {
                            "explanation": "to not help someone when you are expected to do so: ",
                            "examples": [
                                "He failed her in her moment of need.",
                                "When I looked down and saw how far I had to jump, my courage failed me (= I felt very frightened)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "feɪl"
                            ],
                            "us": [
                                "feɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an unsuccessful result in a course, test, or exam: ",
                            "examples": [
                                "John got three passes and four fails in his exams."
                            ]
                        },
                        {
                            "explanation": "something that has been done very badly or gone completely wrong; a failure: ",
                            "examples": [
                                "My pancakes were an epic fail (= completely unsuccessful).",
                                "The software crashes every time I open an email. What a fail."
                            ]
                        },
                        {
                            "explanation": "If you do something without fail, you always do it: ",
                            "examples": [
                                "I go to the gym every Monday and Wednesday, without fail."
                            ]
                        },
                        {
                            "explanation": "used to tell someone that they must do something: ",
                            "examples": [
                                "Be there at nine o'clock, without fail."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}