{
    "word": "fair",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "feər"
                            ],
                            "us": [
                                "fer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "treating someone in a way that is right or reasonable, or treating a group of people equally and not allowing personal opinions to influence your judgment: ",
                            "examples": [
                                "a fair trial",
                                "Why should I have to do all the cleaning? It's not fair!",
                                "It's not fair on Joe (= it is not right) to make him do all the work!",
                                "It's not fair that she's allowed to go and I'm not!",
                                "It's not fair to blame me for everything!",
                                "She's scrupulously fair with all her employees (= she treats them all equally).",
                                "She claims her article was a fair comment on (= a reasonable thing to say about) a matter of public interest.",
                                "He offered to do all the cleaning if I did all the cooking, which seemed like a fair (= reasonable) deal."
                            ]
                        },
                        {
                            "explanation": "If something is fair, it is reasonable and is what you expect or deserve: ",
                            "examples": [
                                "I thought it was a fair price that she was offering.",
                                "I'm willing to do my fair (= equal) share of the work.",
                                "All the workers want is a fair wage for the work that they do."
                            ]
                        },
                        {
                            "explanation": "If a game or competition is fair, it is done according to the rules: ",
                            "examples": [
                                "It was a fair fight."
                            ]
                        },
                        {
                            "explanation": "it is the right way to treat someone and what they deserve: ",
                            "examples": [
                                "I think it's only fair to tell you that we have had over 300 applications for this job."
                            ]
                        },
                        {
                            "explanation": "it is true to say: ",
                            "examples": [
                                "I think it's fair to say (that) you've done less of the work than I have."
                            ]
                        },
                        {
                            "explanation": "considering everything that has an effect on a situation, so that a fair judgment can be made: ",
                            "examples": [
                                "He's done the job badly but, to be fair, I gave him very little time to do it."
                            ]
                        },
                        {
                            "explanation": "something you say to show that you understand why someone has done or said something: ",
                            "examples": [
                                "\"I'm just annoyed with him because he's behaved so badly.\" \"Fair enough.\""
                            ]
                        },
                        {
                            "explanation": "something that you say when you want someone to behave reasonably or treat you the same as other people: ",
                            "examples": [
                                "Come on, it's my turn. Fair's fair!"
                            ]
                        },
                        {
                            "explanation": "an opportunity to explain something or give your opinions, without other people trying to influence the situation: ",
                            "examples": [
                                "He didn't think that he got a fair hearing in court."
                            ]
                        },
                        {
                            "explanation": "in an honest way and without any doubt: ",
                            "examples": [
                                "We won the match fair and square."
                            ]
                        },
                        {
                            "explanation": "If you hit someone fair and square on a particular part of their body, you hit that person hard, exactly on that part: ",
                            "examples": [
                                "He hit me fair and square on the nose."
                            ]
                        },
                        {
                            "explanation": "(of skin) pale, or (of hair) pale yellow or gold: ",
                            "examples": [
                                "She's got fair hair and blue eyes.",
                                "a fair complexion",
                                "My sister has dark hair but my brother's fair (= he has fair hair).",
                                "He's fair-haired.",
                                "All my family are fair-skinned."
                            ]
                        },
                        {
                            "explanation": "quite large: ",
                            "examples": [
                                "We've had a fair amount of rain this week.",
                                "We've had a fair number of applicants.",
                                "It's a fair-sized garden.",
                                "We've come a long way, but there's still a fair way (= quite a long distance) to go."
                            ]
                        },
                        {
                            "explanation": "neither very good nor very bad: ",
                            "examples": [
                                "Films are rated on a scale of poor, fair, good and excellent.",
                                "I was fair at science but it was never my thing."
                            ]
                        },
                        {
                            "explanation": "(of an idea, guess, or chance) good, but not excellent: ",
                            "examples": [
                                "I think I've got a fair idea of (= I understand reasonably well) what you want.",
                                "She's got a fair chance of winning (= there is a reasonable chance that she will win)."
                            ]
                        },
                        {
                            "explanation": "(of weather) pleasant and dry: ",
                            "examples": [
                                "Fair weather was forecast for the following day."
                            ]
                        },
                        {
                            "explanation": "(of a woman) beautiful: ",
                            "examples": [
                                "a fair maiden"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "feər"
                            ],
                            "us": [
                                "fer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large public event where goods are bought and sold, usually from tables that have been specially arranged for the event, and where there is often entertainment: ",
                            "examples": [
                                "I bought a wooden salad bowl at the local craft fair."
                            ]
                        },
                        {
                            "explanation": "an outside event where you can ride on large machines for pleasure and play games to win prizes",
                            "examples": []
                        },
                        {
                            "explanation": "a large show at which people who work in a particular industry meet, and sell and advertise their products: ",
                            "examples": [
                                "a book/antiques/toy fair",
                                "a trade fair"
                            ]
                        },
                        {
                            "explanation": "a public event in the countryside where farm animals and farm products are sold: ",
                            "examples": [
                                "a county/state fair",
                                "a cattle/agricultural fair"
                            ]
                        },
                        {
                            "explanation": "a public event, often held outside, where you can take part in competitions and buy small things and food, often organized to collect money for a particular purpose: ",
                            "examples": [
                                "the school fair"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}