{
    "word": "faithful",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈfeɪθ.fəl"
                            ],
                            "us": [
                                "ˈfeɪθ.fəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "firm and not changing in your friendship with or support for a person or an organization, or in your belief in your principles: ",
                            "examples": [
                                "She became one of my dearest and most faithful friends.",
                                "They are faithful supporters of the Labour Party.",
                                "His faithful old dog accompanied him everywhere he went."
                            ]
                        },
                        {
                            "explanation": "If your husband, wife, or partner is faithful, he or she does not have a sexual relationship with anyone else: ",
                            "examples": [
                                "Was your wife faithful during your marriage?",
                                "He was faithful to his wife throughout their 30-year marriage."
                            ]
                        },
                        {
                            "explanation": "to continue to support or follow something: ",
                            "examples": [
                                "He remained faithful to the regime when so many others spoke out against it."
                            ]
                        },
                        {
                            "explanation": "true or not changing any of the details, facts, style, etc. of the original: ",
                            "examples": [
                                "She gave a faithful account of what had happened on that night.",
                                "I have tried to keep my translation as faithful as possible to the original book."
                            ]
                        },
                        {
                            "explanation": "following a particular religion: ",
                            "examples": [
                                "faithful Christians",
                                "We extend a message of goodwill to all the faithful followers of Islam on this first day of Ramadhan. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfeɪθ.fəl"
                            ],
                            "us": [
                                "ˈfeɪθ.fəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who continues to support someone or something: ",
                            "examples": [
                                "He gave a rousing speech to a room full of party faithfuls (= faithful supporters of a political party)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfeɪθ.fəl"
                            ],
                            "us": [
                                "ˈfeɪθ.fəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "people who are always loyal to a particular group or organization, especially a political party: ",
                            "examples": [
                                "They asked for donations from the party faithful."
                            ]
                        },
                        {
                            "explanation": "the people who believe in a particular religion: ",
                            "examples": [
                                "We heard bells calling the faithful to prayer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}