{
    "word": "fake",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "feɪk"
                            ],
                            "us": [
                                "feɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an object that is made to look real or valuable in order to deceive people: ",
                            "examples": [
                                "Experts revealed that the painting was a fake.",
                                "The gun in his hand was a fake."
                            ]
                        },
                        {
                            "explanation": "someone who is not what or who they claim to be: ",
                            "examples": [
                                "After working for ten years as a doctor, he was exposed as a fake."
                            ]
                        },
                        {
                            "explanation": "a movement that is made in order to deceive an opponent : ",
                            "examples": [
                                "He picked up some new moves, such as jukes and fakes, by watching film while injured. ",
                                "His lightning-fast fakes and pinpoint shots leave bewildered goalies sprawled on the ice."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "feɪk"
                            ],
                            "us": [
                                "feɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not real, but made to look or seem real: ",
                            "examples": [
                                "He was charged with possessing a fake passport.",
                                "fake fur/blood"
                            ]
                        },
                        {
                            "explanation": "showing or pretending to feel emotions that are not sincere: ",
                            "examples": [
                                "a fake smile/laugh",
                                "She's so fake, pretending to be everybody's friend."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "feɪk"
                            ],
                            "us": [
                                "feɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to pretend that you have a feeling or illness: ",
                            "examples": [
                                "to fake surprise",
                                "She didn't want to go out, so she faked a headache.",
                                "He faked a heart attack and persuaded prison staff to take him to hospital.",
                                "He isn't really crying; he's just faking."
                            ]
                        },
                        {
                            "explanation": "to make an object look real or valuable in order to deceive people: ",
                            "examples": [
                                "to fake a document/signature"
                            ]
                        },
                        {
                            "explanation": "to make a movement whose purpose is to deceive an opponent : ",
                            "examples": [
                                "He faked a handoff, then jumped up and lofted the ball toward his teammate. ",
                                "He faked an inbound pass while his brother sneaked between two opposing players toward the basket."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}