{
    "word": "family",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfæm.əl.i"
                            ],
                            "us": [
                                "ˈfæm.əl.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of people who are related to each other, such as a mother, a father, and their children: ",
                            "examples": [
                                "A new family has/have moved in next door.",
                                "I come from a large family - I have three brothers and two sisters.",
                                "He doesn't have any family.",
                                "He's American but his family (= relatives in the past) come/comes from Ireland.",
                                "This movie is good family entertainment (= something that can be enjoyed by parents and children together).",
                                "How do you like family life (= being married, having children, etc.)?"
                            ]
                        },
                        {
                            "explanation": "the children of a family: ",
                            "examples": [
                                "Women shouldn't have to choose between career and family (= having children).",
                                "Paul and Ana are hoping to start a family (= have children) soon.",
                                "My dad died when we were small so my mum raised the family on her own."
                            ]
                        },
                        {
                            "explanation": "a group of people who care about each other because they have a close relationship or shared interests: ",
                            "examples": [
                                "Since our time at school we have come to regard each other as family.",
                                "His new employers welcomed him into their corporate family. ",
                                "We must work together to combat the issues affecting our African family. "
                            ]
                        },
                        {
                            "explanation": "a pair of adult animals and their babies: ",
                            "examples": [
                                "We've got a family of squirrels living in our garden."
                            ]
                        },
                        {
                            "explanation": "a large group of related types of animal or plant: ",
                            "examples": [
                                "The lion is a member of the cat family.",
                                "Plant crops from the same family close together."
                            ]
                        },
                        {
                            "explanation": "a group of things that are related or have similar qualities: ",
                            "examples": [
                                "Phthalates are a family of chemicals used in making plastics.",
                                "Dishes and spoons are not usually classified as art works, and yet seem to belong to the same family.",
                                "The business plan is grouped by product family."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}