{
    "word": "fault",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fɒlt"
                            ],
                            "us": [
                                "fɑːlt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a mistake, especially something for which you are to blame: ",
                            "examples": [
                                "It's not my fault she didn't come!",
                                "She believes it was the doctor's fault that Peter died.",
                                "The fault was with the organizers, who failed to make the necessary arrangements for dealing with so many people.",
                                "The fault clearly lies with an administration that has cut staff and failed to ensure adequate training.",
                                "Through no fault of his own, he spent a week locked up in jail."
                            ]
                        },
                        {
                            "explanation": "a weakness in a person's character: ",
                            "examples": [
                                "He has many faults, but dishonesty isn't one of them."
                            ]
                        },
                        {
                            "explanation": "a broken part or weakness in a machine or system: ",
                            "examples": [
                                "The car has a serious design fault.",
                                "An electrical fault caused the fire.",
                                "For all the faults in our education system, it is still better than that in many other countries."
                            ]
                        },
                        {
                            "explanation": "(in tennis and some other games) a mistake made by a player who is beginning a game by hitting the ball",
                            "examples": []
                        },
                        {
                            "explanation": "to have done something wrong: ",
                            "examples": [
                                "Her doctor was at fault for not sending her straight to a specialist."
                            ]
                        },
                        {
                            "explanation": "to criticize someone or something, especially without good reasons: ",
                            "examples": [
                                "He's always finding fault with my work."
                            ]
                        },
                        {
                            "explanation": "a crack in the earth's surface where the rock has divided into two parts that move against each other: ",
                            "examples": [
                                "Surveyors say the fault line is capable of generating a major earthquake once in a hundred years."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɒlt"
                            ],
                            "us": [
                                "fɑːlt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to find a reason to criticize someone or something: ",
                            "examples": [
                                "I can't fault the way they dealt with the complaint.",
                                "I can't fault you on your logic."
                            ]
                        },
                        {
                            "explanation": "to hit a fault in tennis and other similar games: ",
                            "examples": [
                                "That's the fourth serve he's faulted on today."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}