{
    "word": "fear",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fɪər"
                            ],
                            "us": [
                                "fɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an unpleasant emotion or thought that you have when you are frightened or worried by something dangerous, painful, or bad that is happening or might happen: ",
                            "examples": [
                                "Trembling with fear, she handed over the money to the gunman.",
                                "Even when the waves grew big, the boy showed no (signs of) fear.",
                                "I have a fear of heights.",
                                "The low profit figures simply confirmed my worst fears.",
                                "There are fears that the disease will spread to other countries."
                            ]
                        },
                        {
                            "explanation": "to be frightened that you might be killed: ",
                            "examples": [
                                "Lakisha sat inside, in fear of her life, until the police came."
                            ]
                        },
                        {
                            "explanation": "to be no possibility that a particular thing will happen: ",
                            "examples": [
                                "Greta knows the city well, so there's no fear of us getting lost (= we will not get lost)."
                            ]
                        },
                        {
                            "explanation": "because you are worried that a particular thing might happen: ",
                            "examples": [
                                "They wouldn't let their cat outside for fear that it would get run over."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɪər"
                            ],
                            "us": [
                                "fɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be frightened of something or someone unpleasant: ",
                            "examples": [
                                "Most older employees fear unemployment.",
                                "What do you fear most?"
                            ]
                        },
                        {
                            "explanation": "to be worried or frightened that something bad might happen or might have happened: ",
                            "examples": [
                                "Police fear (that) the couple may have drowned.",
                                "It is feared that as many as two hundred passengers may have died in the crash.",
                                "He is, it is feared, at risk of torture if he is sent back to his homeland.",
                                "We huddled together, fearing we might be killed.",
                                "Fearing to go herself, she sent her son to find out the news."
                            ]
                        },
                        {
                            "explanation": "used to give someone news of something bad that has happened or might happen: ",
                            "examples": [
                                "I fear (that) she's already left."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}