{
    "word": "feature",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfiː.tʃər"
                            ],
                            "us": [
                                "ˈfiː.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a typical quality or an important part of something: ",
                            "examples": [
                                "The town's main features are its beautiful mosque and ancient marketplace.",
                                "Our latest model of phone has several new features.",
                                "A unique feature of these rock shelters was that they were dry."
                            ]
                        },
                        {
                            "explanation": "a part of a building or of an area of land: ",
                            "examples": [
                                "a geographical feature",
                                "This tour includes the area's best-known natural features, including the Gullfoss waterfall.",
                                "The most striking feature of the house was a huge two-storey room running the entire width and height of the building."
                            ]
                        },
                        {
                            "explanation": "one of the parts of someone's face that you notice when you look at them: ",
                            "examples": [
                                "He has wonderful strong features.",
                                "She admired his good-looking face with its regular (= even and attractive) features and bright blue eyes.",
                                "Her eyes are her best feature."
                            ]
                        },
                        {
                            "explanation": "a special article in a newspaper or magazine, or a part of a television or radio broadcast, that deals with a particular subject: ",
                            "examples": [
                                "a double-page feature on global warming"
                            ]
                        },
                        {
                            "explanation": "a film that is usually 90 or more minutes long",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfiː.tʃər"
                            ],
                            "us": [
                                "ˈfiː.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to include someone or something as an important part: ",
                            "examples": [
                                "The movie features James Dean as a disaffected teenager.",
                                "This week's broadcast features a report on victims of domestic violence.",
                                "It's an Australian company whose logo features a red kangaroo."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}