{
    "word": "feed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fiːd"
                            ],
                            "us": [
                                "fiːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "past tense"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give food to a person, group, or animal: ",
                            "examples": [
                                "I usually feed the neighbour's cat while she's away.",
                                "Let's feed the kids first and have our dinner after.",
                                "Do you feed your chickens corn?",
                                "If you feed your dog on biscuits, it's not surprising he's so fat.",
                                "The kids love feeding bread to the ducks."
                            ]
                        },
                        {
                            "explanation": "If a baby or animal feeds, it eats or drinks milk: ",
                            "examples": [
                                "The baby only feeds once a night at the moment, thank goodness.",
                                "Most babies can feed themselves by the time they're a year old."
                            ]
                        },
                        {
                            "explanation": "to be enough food for a group of people or animals: ",
                            "examples": [
                                "This amount of pasta won't feed ten people."
                            ]
                        },
                        {
                            "explanation": "to produce or supply enough food for someone or something: ",
                            "examples": [
                                "If agriculture was more of a priority, the country would easily be able to feed itself.",
                                "Feed the world/starving."
                            ]
                        },
                        {
                            "explanation": "to give a plant substances that will help it grow: ",
                            "examples": [
                                "Don't forget to feed the tomatoes."
                            ]
                        },
                        {
                            "explanation": "to supply something to a person or thing, or put something into a machine or system, especially in a regular or continuous way: ",
                            "examples": [
                                "The vegetables are fed into the machine at this end.",
                                "The images are fed over satellite networks to broadcasters throughout the world.",
                                "A member of staff had been feeding the newspaper information/feeding information to the newspaper.",
                                "Several small streams feed into (= join) the river near here."
                            ]
                        },
                        {
                            "explanation": "to put fuel on or inside something that burns, to keep it burning: ",
                            "examples": [
                                "Remember to feed the fire while I'm out."
                            ]
                        },
                        {
                            "explanation": "in team sports, to pass the ball or the puck to another player in your team, especially so that they can score: ",
                            "examples": [
                                "He fed the ball to Kanoute on the edge of the area.",
                                "He fed a perfect pass to Bennett, who scored. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fiːd"
                            ],
                            "us": [
                                "fiːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when a baby has something to eat or drink: ",
                            "examples": [
                                "The baby had a feed an hour ago, so she can't be hungry."
                            ]
                        },
                        {
                            "explanation": "food eaten by animals that are not kept as pets: ",
                            "examples": [
                                "cattle/animal feed"
                            ]
                        },
                        {
                            "explanation": "a large meal",
                            "examples": []
                        },
                        {
                            "explanation": "the part of a machine through which it is supplied with fuel or with something else that it needs: ",
                            "examples": [
                                "the car's oil feed",
                                "the printer's paper feed"
                            ]
                        },
                        {
                            "explanation": "a web page, screen, etc. that updates (= changes) often to show the latest information: ",
                            "examples": [
                                "Your Twitter feed refreshes automatically to show new tweets.",
                                "A live video feed enables the \"driver\" to operate the vehicle remotely."
                            ]
                        },
                        {
                            "explanation": "in team sports, an action of passing the ball or the puck from one player to another in the same team, especially so that they can score: ",
                            "examples": [
                                "They dominated possession in the first half and Ellis scored off a beautiful feed from Hall.",
                                "He scored the first basket on a fast-break feed from Collins."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}