{
    "word": "few",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "fjuː"
                            ],
                            "us": [
                                "fjuː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "some, or a small number of something: ",
                            "examples": [
                                "I need to get a few things in town."
                            ]
                        },
                        {
                            "explanation": "used in expressions such as \"quite a few\" to mean \"quite a large number\": ",
                            "examples": [
                                "I know quite a few people who have had the same problem.",
                                "Lots of people at the club are under 20, but there are quite a few who aren't.",
                                "I've been to Paris quite a few times.",
                                "She was quite few years older than her husband.",
                                "I spent a good few minutes just staring at the scene, unable to speak."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "fjuː"
                            ],
                            "us": [
                                "fjuː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small number or not many: ",
                            "examples": [
                                "It was embarrassing how few people attended the party.",
                                "He is among the few people I can trust.",
                                "Very few people can afford to pay those prices.",
                                "Few of the children can read or write yet.",
                                "Few things in this world give me more pleasure than a long bath.",
                                "We get few complaints.",
                                "According to the survey, as few as ten percent of us are happy with our jobs.",
                                "The benefits of the planned changes are few.",
                                "Fewer people smoke these days than used to.",
                                "We received far fewer complaints than expected.",
                                "Fewer than 3,500 tigers are left in the wild today.",
                                "They set a new record for the fewest points scored in a season.",
                                "Which picture got the fewest votes?"
                            ]
                        },
                        {
                            "explanation": "not happening or existing very often: ",
                            "examples": [
                                "Apartments that are both comfortable and reasonably priced are few and far between."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}