{
    "word": "fidget",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfɪdʒ.ɪt"
                            ],
                            "us": [
                                "ˈfɪdʒ.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make continuous, small movements, especially if they do not have a particular purpose and you make them without meaning to, for example because you are nervous or bored: ",
                            "examples": [
                                "Children can't sit still for long without fidgeting.",
                                "He cleared his throat and nervously fidgeted with a pencil.",
                                "He fidgets with a string of worry beads."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfɪdʒ.ɪt"
                            ],
                            "us": [
                                "ˈfɪdʒ.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small movement that somebody makes repeatedly, often without meaning to, for example because they are nervous or bored: ",
                            "examples": [
                                "Maddie is a sweet four-year-old with a constant fidget.",
                                "Up close, you could see his every nervous fidget."
                            ]
                        },
                        {
                            "explanation": "a toy or other small object that is used to give people something to do with their hands when they are bored or nervous: ",
                            "examples": [
                                "Fidgets come in all different shapes and sizes: little toys you can roll around in your hand, cubes with different functions on each side, or a little ball of putty you can squeeze and shape."
                            ]
                        },
                        {
                            "explanation": "a person who finds it difficult to stay still, and who often makes continuous, small movements, especially without meaning to: ",
                            "examples": [
                                "Tim's a terrible fidget."
                            ]
                        },
                        {
                            "explanation": "a state in which you keep making small movements, especially without meaning to, for example because you are nervous or bored: ",
                            "examples": [
                                "I got the fidgets halfway through the lecture."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}