{
    "word": "field",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fiːld"
                            ],
                            "us": [
                                "fiːld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area of land, used for growing crops or keeping animals, usually surrounded by a fence: ",
                            "examples": [
                                "We drove past fields of ripening wheat.",
                                "The cows were all standing in one corner of the field."
                            ]
                        },
                        {
                            "explanation": "a place where you are working or studying in real situations, rather than from an office, laboratory, etc. : ",
                            "examples": [
                                "I spoke to an aid worker who had recently returned from the field.",
                                "You'll find that things aren't as straightforward out in the field as they are in the classroom.",
                                "I had thought that most of my time as an archaeologist would be in the field, not behind a desk at a museum."
                            ]
                        },
                        {
                            "explanation": "an area, usually covered with grass, used for playing sports: ",
                            "examples": [
                                "Many school sports fields are being sold off for housing.",
                                "a football/hockey/rugby field"
                            ]
                        },
                        {
                            "explanation": "to go onto the field at the start of a game: ",
                            "examples": [
                                "There were loud cheers as the Irish team took the field."
                            ]
                        },
                        {
                            "explanation": "an area of activity or interest: ",
                            "examples": [
                                "He became very successful in the the field of history/science/medicine.",
                                "Are you still in the same field (= are you doing the same type of work)?"
                            ]
                        },
                        {
                            "explanation": "to be something you do not know much about: ",
                            "examples": [
                                "Programming really isn't my field - you'd better ask Phil."
                            ]
                        },
                        {
                            "explanation": "all the competitors taking part in a race or activity: ",
                            "examples": [
                                "The race started with a field of eleven, but two horses fell.",
                                "We have a strong field this afternoon.",
                                "Jones finished ahead of the field."
                            ]
                        },
                        {
                            "explanation": "a division of a database (= a collection of similar information on a computer) that contains a particular type of information, such as names or numbers",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fiːld"
                            ],
                            "us": [
                                "fiːld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to catch or pick up the ball after it has been hit in a game such as cricket or baseball, and to try to prevent the other team from scoring: ",
                            "examples": [
                                "He fielded the ball well.",
                                "Our team is fielding first."
                            ]
                        },
                        {
                            "explanation": "to deal with a question, often by not answering it directly: ",
                            "examples": [
                                "He fielded some awkward questions very skilfully."
                            ]
                        },
                        {
                            "explanation": "to have or produce a team of people to take part in an activity or event: ",
                            "examples": [
                                "The company fielded a group of experts to take part in the conference."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -fiːld"
                            ],
                            "us": [
                                " -fiːld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area of land containing a particular natural substance: ",
                            "examples": [
                                "an oilfield",
                                "a coalfield"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}