{
    "word": "fifth wheel",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌfɪfθ ˈwiːl"
                            ],
                            "us": [
                                "ˌfɪfθ ˈwiːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a circular object like a wheel with which a trailer (= a vehicle that is pulled) can be connected to the vehicle that is pulling it: ",
                            "examples": [
                                "If you only tow occasionally, you can remove and install the fifth wheel as needed.",
                                "A large pin underneath the front of the trailer interlocks with the fifth wheel. "
                            ]
                        },
                        {
                            "explanation": "a caravan that has a front part that covers the flat back part of the vehicle that is pulling it : ",
                            "examples": [
                                "My mom and dad would like to get a fifth wheel and travel across the country spending a month here or a couple of weeks there.",
                                "They sold their home and now live in a fifth-wheel.",
                                "He lives in a fifth-wheel trailer on property his family owns.",
                                "He and his wife crisscross the country in a pickup, towing their one-bedroom, fifth-wheel camper. "
                            ]
                        },
                        {
                            "explanation": "someone or something that is not needed or wanted in a particular situation: ",
                            "examples": [
                                "Sometimes I look down the line of guitar players and think that I am just the fifth wheel here, that these guys don't need me in this band.",
                                "They asked me to join them but I replied that I would only be a fifth wheel.",
                                "The report called the coordinating agency for the state's two higher education systems, an \"unnecessary fifth wheel\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}