{
    "word": "filler",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfɪl.ər"
                            ],
                            "us": [
                                "ˈfɪl.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a substance that is used to fill small holes and cracks, especially in wood and walls",
                            "examples": []
                        },
                        {
                            "explanation": "a short text or drawings used to fill extra space in a magazine or newspaper, or talk, music, etc. used to fill extra time in a radio or television broadcast: ",
                            "examples": [
                                "We used the clip as a filler after one of our guests dropped out of the show."
                            ]
                        },
                        {
                            "explanation": "something of lower quality included in a film, broadcast, speech, record, etc. in order to fill all the time or space: ",
                            "examples": [
                                "There are only three good tracks on the album - the rest is just filler."
                            ]
                        },
                        {
                            "explanation": "a substance that is injected (= put with a needle) into the skin as a beauty treatment, to hide wrinkles (= lines or folds in the skin caused by age)",
                            "examples": []
                        },
                        {
                            "explanation": "a substance that is added to processed food (= food that has had a chemical or industrial treatment) to increase its size or add fibre, often a cheaper vegetable substance that is added to a meat product: ",
                            "examples": [
                                "Most pet treats are full of grains and fillers with only a fraction of the ingredients being real meat.",
                                "The crab cake was filled with lumps of crab meat and had relatively little filler."
                            ]
                        },
                        {
                            "explanation": "a word or short phrase such as \"er\" or \"well\", used when a person pauses to think about what to say next: ",
                            "examples": [
                                "When she transcribed the conversation she edited out all the fillers. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}