{
    "word": "fire",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "faɪər"
                            ],
                            "us": [
                                "faɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(material that is in) the state of burning that produces flames that send out heat and light, and might produce smoke: ",
                            "examples": [
                                "Animals are usually afraid of fire.",
                                "The fire was started by children playing with matches.",
                                "40 people helped to put out (= stop) the fire.",
                                "The library was badly damaged in the fire.",
                                "How many historic buildings are damaged by fire each year?",
                                "She had to be rescued when her house caught fire (= started to burn).",
                                "She had to be rescued when her house caught on fire (= started to burn)."
                            ]
                        },
                        {
                            "explanation": "a small controlled fire that is used for heating or cooking: ",
                            "examples": [
                                "It's very cold in here - should I light a fire?",
                                "We built a fire on the beach.",
                                "We put up our tents and made a small fire."
                            ]
                        },
                        {
                            "explanation": "a gas or electric heater that is used to warm up a room: ",
                            "examples": [
                                "a gas/electric fire",
                                "If you're cold just put the fire on."
                            ]
                        },
                        {
                            "explanation": "the shooting of guns or other weapons: ",
                            "examples": [
                                "The police opened fire on (= started shooting at) the protesters.",
                                "The gunman opened fire (= started shooting) as the police officers were getting out of their patrol car.",
                                "The command was given to cease fire (= stop shooting)."
                            ]
                        },
                        {
                            "explanation": "strong emotion: ",
                            "examples": [
                                "The fire in her speech inspired everyone."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "faɪər"
                            ],
                            "us": [
                                "faɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause a weapon to shoot bullets, arrows, or missiles: ",
                            "examples": [
                                "He fired his gun into the air.",
                                "Someone started firing at us.",
                                "Without warning he started firing into the crowd.",
                                "I just prayed that he would stop firing.",
                                "The ambassador denied that any missiles had been fired across the border."
                            ]
                        },
                        {
                            "explanation": "to direct a series of questions or criticisms at someone: ",
                            "examples": [
                                "The journalists were firing questions at me for two whole hours.",
                                "\"I'd like to ask you some questions about your childhood.\" \"Fire away!\" (= You can start asking them now.)"
                            ]
                        },
                        {
                            "explanation": "to remove someone from their job, either because they have done something wrong or badly, or as a way of saving the cost of employing them: ",
                            "examples": [
                                "She was fired after she was caught stealing from her employer.",
                                "He was fired from his $165,000 job for poor performance.",
                                "She has just been fired as editor of the newspaper.",
                                "The company is reducing its workforce by firing 500 employees."
                            ]
                        },
                        {
                            "explanation": "to cause a strong emotion in someone: ",
                            "examples": [
                                "I had a brilliant English teacher who fired me with enthusiasm for literature at an early age.",
                                "Talk of treasure and lost cities had fired their imaginations."
                            ]
                        },
                        {
                            "explanation": "to heat objects made of clay in a kiln (= a special oven) so that they become hard",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}