{
    "word": "firm",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "fɜːm"
                            ],
                            "us": [
                                "fɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not soft but not completely hard: ",
                            "examples": [
                                "I'd rather sleep on a firm mattress than a soft one.",
                                "These pears are still too firm to eat."
                            ]
                        },
                        {
                            "explanation": "well fixed in place or position: ",
                            "examples": [
                                "The bridge provided a firm platform for the bungee jumpers."
                            ]
                        },
                        {
                            "explanation": "fixed at the same level or opinion and not changing: ",
                            "examples": [
                                "The government remains firm in its opposition to tax reform."
                            ]
                        },
                        {
                            "explanation": "strong and tight: ",
                            "examples": [
                                "a firm handshake",
                                "Keep a firm hold of the handrail as you go down."
                            ]
                        },
                        {
                            "explanation": "certain or of a good standard, and not likely to change: ",
                            "examples": [
                                "He is a firm believer in traditional family values.",
                                "Some people still claim that there is no firm evidence linking smoking with lung cancer.",
                                "You need a firm grasp of mathematics to become an astronaut."
                            ]
                        },
                        {
                            "explanation": "forceful and making people do what you want: ",
                            "examples": [
                                "I was always very firm with my children - they knew the rules and I made sure they followed them.",
                                "No one seems to have a firm grip on the company at the moment."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fɜːm"
                            ],
                            "us": [
                                "fɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a company offering a professional service, for example a company of lawyers: ",
                            "examples": [
                                "He works for a law firm called Neil and Vigliano.",
                                "She's just started working for an accounting firm.",
                                "a firm of solicitors/accountants/architects "
                            ]
                        },
                        {
                            "explanation": "a company or business, especially a small one: ",
                            "examples": [
                                "She works for a local firm that makes medical equipment.",
                                "This new tax will put a lot of small firms out of business."
                            ]
                        },
                        {
                            "explanation": "a way of referring to the UK Royal Family as an organization: ",
                            "examples": [
                                "The Firm is an unofficial nickname that dates back to the time of Queen Elizabeth II’s father, King George VI.",
                                "The Firm refers to the business side of the Royal Family and is generally used to describe the institution of Buckingham Palace, which includes senior courtiers and advisers."
                            ]
                        },
                        {
                            "explanation": "a group of violent supporters of a football team who organize or try to start fights with supporters of other teams: ",
                            "examples": [
                                "Millwall and West Ham had had firms for 30 years, so it's hardly surprising there was violence."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɜːm"
                            ],
                            "us": [
                                "fɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make soil harder by pressing on it: ",
                            "examples": [
                                "Firm the soil around the cuttings and water them in."
                            ]
                        },
                        {
                            "explanation": "to stop changing or to remain at the same level, amount, etc.: ",
                            "examples": [
                                "After a turbulent week on the markets, share prices firmed today."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}