{
    "word": "first degree",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌfɜːst dɪˈɡriː"
                            ],
                            "us": [
                                "ˈfɝːst.dɪˌɡriː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an undergradute degree (= one that a student does when they first go to university or college, rather than a higher degree that some students do afterwards): ",
                            "examples": [
                                "I found the law conversion course more difficult than my first degree.",
                                "In the US, graduates usually go straight to business school after completing their first degree."
                            ]
                        },
                        {
                            "explanation": "used to describe a crime that is the most serious of its type, especially because of being planned and intended: ",
                            "examples": [
                                "The defendant pleaded not guilty to the charge of murder in the first degree.",
                                "Rape may be designated as sexual abuse in the first degree.",
                                "The prosecutor reduced the charge from murder to manslaughter in the first degree."
                            ]
                        },
                        {
                            "explanation": "of the biggest, worst, best, etc. kind: ",
                            "examples": [
                                "That is ignorance of the first degree.",
                                "Aidan is a computer games expert of the first degree."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌfɜːst.dɪˈɡriː"
                            ],
                            "us": [
                                "ˌfɝːst.dɪˈɡriː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe the least serious kind of burn that affects only the outer layer of skin: ",
                            "examples": [
                                "She suffered first-degree burns to her legs while sunbathing in the recent hot spell.",
                                "Redness without blistering is referred to as first degree burns."
                            ]
                        },
                        {
                            "explanation": "used to describe a crime that is the most serious of its type, especially because of being planned and intended: ",
                            "examples": [
                                "They were both convicted on a first-degree murder charge.",
                                "The assault charge is a first-degree felony carrying a maximum penalty of life in prison.",
                                "A jury found him guilty of first-degree assault."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}