{
    "word": "first",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "ordinal number",
                        "ipa": {
                            "uk": [
                                "ˈfɜːst"
                            ],
                            "us": [
                                "ˈfɝːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(a person or thing) coming before all others in order, time, amount, quality, or importance: ",
                            "examples": [
                                "This is my first visit to New York.",
                                "I fell in love with him the first time I saw him.",
                                "I'm always nervous for the first few minutes of an exam.",
                                "Today is the first of August."
                            ]
                        },
                        {
                            "explanation": "in or at the beginning (of a series of events): ",
                            "examples": [
                                "The trousers shrank when I washed them, but they weren't really big enough in the first place."
                            ]
                        },
                        {
                            "explanation": "as the first attempt or effort: ",
                            "examples": [
                                "Enquiries about the post should be addressed in the first instance to the personnel manager."
                            ]
                        },
                        {
                            "explanation": "to a very great degree or of an extremely good kind: ",
                            "examples": [
                                "It is a diplomatic scandal of the first order."
                            ]
                        },
                        {
                            "explanation": "at the earliest time in the day: ",
                            "examples": [
                                "He said he'd call back first thing tomorrow."
                            ]
                        },
                        {
                            "explanation": "in a group of musicians or singers, relating to the highest or higher instrument, voice, or part: ",
                            "examples": [
                                "She sings first soprano in the school choir.",
                                "He is the best first trumpet player in the business.",
                                "Unusually, the first altos have the tune."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈfɜːst"
                            ],
                            "us": [
                                "ˈfɝːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "before all others in order, time, amount, quality, or importance: ",
                            "examples": [
                                "Tom came first in the race.",
                                "Who finished first?",
                                "If you get home first, can you feed the cat?"
                            ]
                        },
                        {
                            "explanation": "for the first time: ",
                            "examples": [
                                "When did you first meet each other?",
                                "The company was still very small when I first joined."
                            ]
                        },
                        {
                            "explanation": "used at the beginning of a list of things you want to say or write: ",
                            "examples": [
                                "First, I want to thank my parents.",
                                "First of all (= before anything else), I'd like to ask you a few questions.",
                                "First off (= before anything else), let me introduce myself."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfɜːst"
                            ],
                            "us": [
                                "ˈfɝːst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the first person or thing to do or be something, or the first person or thing mentioned: ",
                            "examples": [
                                "We've fostered several children. Tina was the first.",
                                "My passport was the first to arrive.",
                                "She was one of the first to try the new treatment.",
                                "Tonight sees the first of three documentaries about cancer."
                            ]
                        },
                        {
                            "explanation": "to be willing to admit something: ",
                            "examples": [
                                "I'm the first to admit we sometimes make mistakes.",
                                "He's the first to say he is paid too much money."
                            ]
                        },
                        {
                            "explanation": "from the beginning: ",
                            "examples": [
                                "I've opposed the proposal from the very first."
                            ]
                        },
                        {
                            "explanation": "In a group of musicians or singers, a first is a person who plays or sings the highest or a higher part: ",
                            "examples": [
                                "The second violins were seated on the right side of the stage, opposite the firsts.",
                                "She's usually a first but today she's singing second."
                            ]
                        },
                        {
                            "explanation": "something that has never happened or been done before: ",
                            "examples": [
                                "She said sorry? That's a first!",
                                "This new surgical technique is a first for (= has never been done before in) the hospital."
                            ]
                        },
                        {
                            "explanation": "the best possible undergraduate university degree you can get in the UK and some other countries: ",
                            "examples": [
                                "She has a first in English from Newcastle University."
                            ]
                        },
                        {
                            "explanation": "(in a vehicle) the gear used when starting to drive forward or when driving up a steep hill",
                            "examples": []
                        },
                        {
                            "explanation": "another word for \nfirst base : ",
                            "examples": [
                                "I caught the ball and calmly stepped on first.",
                                "There were runners on first and third with nobody out."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}