{
    "word": "fix",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɪks"
                            ],
                            "us": [
                                "fɪks"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to repair something: ",
                            "examples": [
                                "They couldn't fix my old computer, so I bought a new one."
                            ]
                        },
                        {
                            "explanation": "to arrange or agree a time, place, price, etc.: ",
                            "examples": [
                                "Shall we fix a time for our next meeting?",
                                "I understand the rent is fixed at £750 a month."
                            ]
                        },
                        {
                            "explanation": "to fasten something in position so that it cannot move: ",
                            "examples": [
                                "We fixed the bookcase to the wall."
                            ]
                        },
                        {
                            "explanation": "to keep something or someone in sight: ",
                            "examples": [
                                "His eyes were fixed on the distant yacht.",
                                "She fixed the child with a stare of such disapproval he did not dare move."
                            ]
                        },
                        {
                            "explanation": "to continue to think about or remember something: ",
                            "examples": [
                                "It is somehow fixed in my mind that my fate and that woman's are intertwined.",
                                "She was so frightened that she could not fix her thoughts on anything."
                            ]
                        },
                        {
                            "explanation": "to do something dishonest to make certain that a competition, race, or election is won by a particular person: ",
                            "examples": [
                                "Several jockeys were arrested on suspicion of fixing the race.",
                                "It sounds like the election was fixed."
                            ]
                        },
                        {
                            "explanation": "to make your hair, make-up, clothes, etc. look tidy: ",
                            "examples": [
                                "Give me a couple of minutes while I fix my hair."
                            ]
                        },
                        {
                            "explanation": "to cook or prepare food or drink: ",
                            "examples": [
                                "Whose turn is it to fix dinner?",
                                "Can I fix you a drink?",
                                "Can I fix a drink for you?"
                            ]
                        },
                        {
                            "explanation": "to be planning to do something: ",
                            "examples": [
                                "I'm fixing to leave pretty soon."
                            ]
                        },
                        {
                            "explanation": "to punish especially someone who has been unfair: ",
                            "examples": [
                                "I'm gonna fix her if she doesn't stop telling lies about me!"
                            ]
                        },
                        {
                            "explanation": "to treat something, especially photographic material, with chemicals to prevent its colours becoming pale",
                            "examples": []
                        },
                        {
                            "explanation": "If a plant or bacterium (= a very small organism) fixes a gas, especially nitrogen, it changes it into another form that can be used by the plant: ",
                            "examples": [
                                "Clover fixes nitrogen and helps to create rich soils."
                            ]
                        },
                        {
                            "explanation": "to remove the reproductive organs of an animal so that it is unable to produce young animals",
                            "examples": []
                        },
                        {
                            "explanation": "to inject (= put into the body through a needle) an illegal drug: ",
                            "examples": [
                                "We saw kids as young as twelve fixing in doorways."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fɪks"
                            ],
                            "us": [
                                "fɪks"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a situation in which someone does something dishonest to make certain that a competition, race, or election is won by a particular person: ",
                            "examples": [
                                "The result was a fix!"
                            ]
                        },
                        {
                            "explanation": "an awkward or difficult situation: ",
                            "examples": [
                                "I'm in a bit of a fix with the arrangements."
                            ]
                        },
                        {
                            "explanation": "a solution to a problem: ",
                            "examples": [
                                "She says the problem is not a new one, and the fix would be easy enough for a government to achieve, if it were willing.",
                                "There is no quick fix to the organization's problems. "
                            ]
                        },
                        {
                            "explanation": "an amount of an illegal drug, or of another substance that has an effect on someone: ",
                            "examples": [
                                "He was shaking badly and needed a fix.",
                                "Ginny needs her daily fix of chocolate."
                            ]
                        },
                        {
                            "explanation": "(the calculation of) the position of a vehicle, usually in relation to the earth: ",
                            "examples": [
                                "Do we still have a fix on that jet?"
                            ]
                        },
                        {
                            "explanation": "to discover the exact size, amount, position, etc. of something: ",
                            "examples": [
                                "It was hard to get a fix on the exact number of arrivals.",
                                "We're trying to get a fix on your position.",
                                "Investigators are no closer to getting a fix on the extent of the hacking."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}