{
    "word": "fixed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "fɪkst"
                            ],
                            "us": [
                                "fɪkst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "arranged or decided already and not able to be changed: ",
                            "examples": [
                                "a fixed price",
                                "fixed interest rates",
                                "Is the date of the wedding fixed yet?"
                            ]
                        },
                        {
                            "explanation": "A fixed idea is one that someone is not willing to change: ",
                            "examples": [
                                "She said, \"There is nothing worse than a man who has fixed ideas about what a woman can and cannot do.\"",
                                "Our image of what a leader looks like can sometimes be very fixed."
                            ]
                        },
                        {
                            "explanation": "not moving or able to be moved from its position: ",
                            "examples": [
                                "Guide stars are fixed points in space used to keep a telescope in position.",
                                "It can help your balance if you keep your eyes on a fixed object."
                            ]
                        },
                        {
                            "explanation": "(of a look or someone's eyes) not moving from a particular point: ",
                            "examples": [
                                "She frightened her younger siblings with a fixed stare.",
                                "His eyes were completely fixed on the food."
                            ]
                        },
                        {
                            "explanation": "(of a game, result, etc.) dishonestly arranged so that someone gets the result that they want: ",
                            "examples": [
                                "He complained that the system was fixed in favour of a certain group of people.",
                                "Several players were caught up in a scandal relating to fixed games."
                            ]
                        },
                        {
                            "explanation": "repaired or solved: ",
                            "examples": [
                                "We don't have the problem completely fixed yet."
                            ]
                        },
                        {
                            "explanation": "(of an animal) having had part of its sexual organs removed, so that it cannot produce young animals: ",
                            "examples": [
                                "Many people find that dogs behave better when they're fixed.",
                                "Owners could be fined if they do not get their animals fixed. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}