{
    "word": "flare",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fleər"
                            ],
                            "us": [
                                "fler"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to burn brightly either for a short time or not regularly: ",
                            "examples": [
                                "The flame above the oil well flared up into the dark sky.",
                                "New fires flared and people were told to leave their homes."
                            ]
                        },
                        {
                            "explanation": "When something bad such as violence, pain, or anger flares (up), it suddenly starts or gets much worse: ",
                            "examples": [
                                "Violence flared up again last night.",
                                "Tempers flared after a three-hour delay at the Airport yesterday."
                            ]
                        },
                        {
                            "explanation": "to (cause to) become wider: ",
                            "examples": [
                                "The horse's nostrils flared.",
                                "He flared his nostrils in rage.",
                                "The skirt fits tightly over the hips and flares just below the knees."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fleər"
                            ],
                            "us": [
                                "fler"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a sudden increase in the brightness of a fire: ",
                            "examples": [
                                "There was a sudden flare when she threw the petrol onto the fire."
                            ]
                        },
                        {
                            "explanation": "a very bright light or coloured smoke that can be used as a signal, or a device that produces this: ",
                            "examples": [
                                "We set off a flare to help guide our rescuers.",
                                "Every agent is given a pack with rations, signal flares, and a first-aid kit."
                            ]
                        },
                        {
                            "explanation": "trousers that get wider below the knee: ",
                            "examples": [
                                "He grew his hair long and started to wear flares."
                            ]
                        },
                        {
                            "explanation": "the fact of something, especially clothing, becoming wider at one end: ",
                            "examples": [
                                "This skirt has a definite flare."
                            ]
                        },
                        {
                            "explanation": "in American football, a short throw to a back who is running towards the sideline: ",
                            "examples": [
                                "Under pressure, he threw a flare to Wilson that lost three yards.",
                                "He caught a flare pass from Merino and managed to make seven yards."
                            ]
                        },
                        {
                            "explanation": "in baseball, a ball that is hit a short distance through the air into the outfield: ",
                            "examples": [
                                "Pitch him away and he gets his little flares and infield hits.",
                                "Jones hit a flare to right that fell just inside the line."
                            ]
                        },
                        {
                            "explanation": "in gymnastics, a movement in which the gymnast balances on their hands and moves their legs wide apart in a circular movement: ",
                            "examples": [
                                "It was an immaculate performance, full of crowd-pleasing flares and eye-catching manoeuvres.",
                                "The American lost his rhythm on a flare sequence and finished sixth."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}