{
    "word": "fleece",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fliːs"
                            ],
                            "us": [
                                "fliːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the thick covering of wool on an animal, especially a sheep, or this covering used to make a piece of clothing: ",
                            "examples": [
                                "Many farmers identify their sheep by painting their fleeces.",
                                "The Leicester Longwool was bred to provide long fleece for the wool trade.",
                                "We were kitted out for the Arctic climate with fleece-lined bonnets and lightweight boots made from boiled sheep’s wool."
                            ]
                        },
                        {
                            "explanation": "a type of cloth, usually made of polyester (= artificial material), that is thick and soft on one or both sides, and that is often used for making warm clothes: ",
                            "examples": [
                                "Fleece is warm and durable, and dries faster than natural fibres."
                            ]
                        },
                        {
                            "explanation": "a jacket made from artificial fleece material: ",
                            "examples": [
                                "He was wearing a green fleece and hiking boots."
                            ]
                        },
                        {
                            "explanation": "a very thin artificial material that allows some light to pass through, and that is used by gardeners to protect plants during cold weather: ",
                            "examples": [
                                "Place some fleece over the bulbs to help them get established more quickly.",
                                "In severe weather, cover the plants with a sheet of horticultural fleece."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fliːs"
                            ],
                            "us": [
                                "fliːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to take someone's money dishonestly, by charging too much money or by cheating them: ",
                            "examples": [
                                "That restaurant really fleeced us!"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}