{
    "word": "flight",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "flaɪt"
                            ],
                            "us": [
                                "flaɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a journey in an aircraft: ",
                            "examples": [
                                "I'll never forget my first flight.",
                                "How was your flight?",
                                "All flights to New York today are delayed because of bad weather.",
                                "My flight was cancelled."
                            ]
                        },
                        {
                            "explanation": "an aircraft that is making a particular journey: ",
                            "examples": [
                                "Flight 474 to Buenos Aires is now boarding at Gate 9."
                            ]
                        },
                        {
                            "explanation": "an occasion when something flies or moves through the air: ",
                            "examples": [
                                "an eagle in flight",
                                "Suddenly the whole flock of geese took flight (= started flying).",
                                "Modern missiles are so accurate because their flight is controlled by computer."
                            ]
                        },
                        {
                            "explanation": "a group of birds, aircraft, etc. flying together: ",
                            "examples": [
                                "a flight of geese/swans"
                            ]
                        },
                        {
                            "explanation": "in cricket, the movement of the ball through the air when bowled (= thrown to the batter) by a slow bowler: ",
                            "examples": [
                                "He deceived the batsman with flight and dip and had him stumped."
                            ]
                        },
                        {
                            "explanation": "(an act or example of) escape, running away, or avoiding something: ",
                            "examples": [
                                "They lost all their possessions during their flight from the invading army."
                            ]
                        },
                        {
                            "explanation": "to defeat someone and force them to run away: ",
                            "examples": [
                                "The rebels were put to flight by the small regiment. "
                            ]
                        },
                        {
                            "explanation": "(of a bird or an aircraft) to leave the ground and begin to fly: ",
                            "examples": [
                                "He was flapping his arms like a bird taking flight."
                            ]
                        },
                        {
                            "explanation": "to run away or leave a place: ",
                            "examples": [
                                "The burglars took flight when the alarm sounded."
                            ]
                        },
                        {
                            "explanation": "a set of steps or stairs, usually between two floors of a building: ",
                            "examples": [
                                "We live up three flights of stairs."
                            ]
                        },
                        {
                            "explanation": "a number of different types of wine, beer, etc. for tasting: ",
                            "examples": [
                                "Wine bar patrons can sample flights of wine.",
                                "A wine flight is available to accompany the tasting menu at £ 35 per person."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}