{
    "word": "flood",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "flʌd"
                            ],
                            "us": [
                                "flʌd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause to fill or become covered with water, especially in a way that causes problems: ",
                            "examples": [
                                "Our washing machine broke down yesterday and flooded the kitchen.",
                                "The whole town flooded when the river burst its banks.",
                                "Several families living by the river were flooded out (= forced to leave their houses because they became covered with water)."
                            ]
                        },
                        {
                            "explanation": "to fill or enter a place in large numbers or amounts: ",
                            "examples": [
                                "Donations are flooding into the homeless shelter.",
                                "She drew back the curtains and the sunlight came flooding in.",
                                "He was flooded with (= suddenly felt a lot of) joy when his first child was born.",
                                "For Proust, the taste of a madeleine brought childhood memories flooding back (= made him suddenly remember a lot of things)."
                            ]
                        },
                        {
                            "explanation": "to make goods available in such large numbers that the price falls, or other goods cannot compete: ",
                            "examples": [
                                "Japanese cars have flooded the market (= a lot of them are on sale).",
                                "They have flooded the market with low-cost imports."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "flʌd"
                            ],
                            "us": [
                                "flʌd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large amount of water covering an area that is usually dry: ",
                            "examples": [
                                "After the flood it took weeks for the water level to go down.",
                                "The river is in flood (= water has flowed over its banks) again."
                            ]
                        },
                        {
                            "explanation": "crying a lot: ",
                            "examples": [
                                "I found her in floods of tears in the toilets."
                            ]
                        },
                        {
                            "explanation": "(in the Bible) a flood sent by God that covered the whole earth as a punishment",
                            "examples": []
                        },
                        {
                            "explanation": "a large amount or number of something: ",
                            "examples": [
                                "A flood of cheap imports has come into the country."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}