{
    "word": "flow",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fləʊ"
                            ],
                            "us": [
                                "floʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(especially of liquids, gases, or electricity) to move in one direction, especially continuously and easily: ",
                            "examples": [
                                "Lava from the volcano was flowing down the hillside.",
                                "Many short rivers flow into the Pacific Ocean.",
                                "The river flows through three counties before flowing into the sea just south of here.",
                                "With fewer cars on the roads, traffic is flowing (= moving forward) more smoothly than usual."
                            ]
                        },
                        {
                            "explanation": "to continue to arrive or be produced: ",
                            "examples": [
                                "Please keep the money flowing in!",
                                "Offers of help are flowing into the disaster area from all over the country.",
                                "My thoughts flow more easily if I work on a computer.",
                                "By eleven o'clock, the wine was starting to flow.",
                                "After they'd all had a drink or two, the conversation began to flow."
                            ]
                        },
                        {
                            "explanation": "to hang down loosely and often attractively: ",
                            "examples": [
                                "Her long red hair flowed down over her shoulders."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fləʊ"
                            ],
                            "us": [
                                "floʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the movement of something in one direction: ",
                            "examples": [
                                "the flow of a river",
                                "the flow of traffic",
                                "the flow of blood"
                            ]
                        },
                        {
                            "explanation": "a regular and quite large number of something: ",
                            "examples": [
                                "There's been a steady flow of visitors."
                            ]
                        },
                        {
                            "explanation": "a situation in which something is produced or moved continuously: ",
                            "examples": [
                                "the flow of ideas/information"
                            ]
                        },
                        {
                            "explanation": "a man's long hair, especially that of an athlete : ",
                            "examples": [
                                "His blond locks give him some incredible flow, making him one of the most recognizable players in the league. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}