{
    "word": "flush",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "flʌʃ"
                            ],
                            "us": [
                                "flʌʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "When you flush, you become red in the face, especially as a result of strong emotions, heat, or alcohol: ",
                            "examples": [
                                "She flushed with pleasure as she accepted the prize.",
                                "The champagne had caused his face to flush."
                            ]
                        },
                        {
                            "explanation": "If you flush a toilet, or if a toilet flushes, its contents empty and it fills with water again: ",
                            "examples": [
                                "My children never flush the toilet after them.",
                                "I can't get the toilet to flush."
                            ]
                        },
                        {
                            "explanation": "to get rid of something by putting it in the toilet and operating the toilet: ",
                            "examples": [
                                "I tend to flush old medicines down the toilet."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "flʌʃ"
                            ],
                            "us": [
                                "flʌʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at the same level as another surface: ",
                            "examples": [
                                "I want the light fittings to be flush with the ceiling."
                            ]
                        },
                        {
                            "explanation": "having a lot of money: ",
                            "examples": [
                                "I've just been paid so I'm feeling flush."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "flʌʃ"
                            ],
                            "us": [
                                "flʌʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a red colour that appears on your face or body because you are embarrassed, hot, etc.: ",
                            "examples": [
                                "A faint pink flush coloured her cheeks."
                            ]
                        },
                        {
                            "explanation": "a sudden strong feeling of anger, excitement, pleasure, etc.: ",
                            "examples": [
                                "Lena felt a flush of shame at the memory."
                            ]
                        },
                        {
                            "explanation": "an occasion when the contents of a toilet empty and it fills with water",
                            "examples": []
                        },
                        {
                            "explanation": "the handle or button that you push to make a toilet empty and fill with water: ",
                            "examples": [
                                "He pressed the flush with his hand."
                            ]
                        },
                        {
                            "explanation": "a number of playing cards held by one player that are all from the same suit (= colour and type)",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}