{
    "word": "fold",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fəʊld"
                            ],
                            "us": [
                                "foʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to bend something, especially paper or cloth, so that one part of it lies on the other part, or to be able to be bent in this way: ",
                            "examples": [
                                "I folded the letter (in half) and put it in an envelope.",
                                "He had a neatly folded handkerchief in his jacket pocket.",
                                "Will you help me to fold (up) the sheets?",
                                "The table folds up when not in use."
                            ]
                        },
                        {
                            "explanation": "to wrap: ",
                            "examples": [
                                "She folded her baby in a blanket.",
                                "He folded his arms around her."
                            ]
                        },
                        {
                            "explanation": "to bring your arms close to your chest and hold them together: ",
                            "examples": [
                                "He folded his arms and shook his head disapprovingly."
                            ]
                        },
                        {
                            "explanation": "to move a part of your body into a position where it is close to your body: ",
                            "examples": [
                                "She sat with her legs folded under her."
                            ]
                        },
                        {
                            "explanation": "(of a business) to close because of failure: ",
                            "examples": [
                                "Many small businesses fold within the first year."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fəʊld"
                            ],
                            "us": [
                                "foʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a line or mark where paper, cloth, etc. was or is folded: ",
                            "examples": [
                                "Make a fold across the centre of the card."
                            ]
                        },
                        {
                            "explanation": "a bend in a layer of rock under the earth's surface caused by movement there",
                            "examples": []
                        },
                        {
                            "explanation": "a small area of a field surrounded by a fence where sheep can be put for shelter for the night",
                            "examples": []
                        },
                        {
                            "explanation": "your home or an organization where you feel you belong: ",
                            "examples": [
                                "Her children are all away at college now, but they always return to the fold during the holidays.",
                                "After the last election, the Republican Party tried to bring former conservatives back into the fold.",
                                "The team offered the star forward everything they could to bring her into the fold.",
                                "She was afraid that he'd become upset with the church and leave the fold.",
                                "They welcomed the newest family member into the fold."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -fəʊld"
                            ],
                            "us": [
                                " -foʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having the stated number of parts, or multiplied by the stated number: ",
                            "examples": [
                                "threefold",
                                "fourfold",
                                "The problems are twofold - firstly, economic, and secondly, political.",
                                "In the last 50 years, there has been a 33-fold increase in the amount of pesticide used in farming."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}