{
    "word": "followed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nfollow ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfɒl.əʊ"
                            ],
                            "us": [
                                "ˈfɑː.loʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move behind someone or something and go where he, she, or it goes: ",
                            "examples": [
                                "A dog followed us home.",
                                "She followed me into the kitchen.",
                                "He had the feeling he was being followed (= someone was going after him to catch him or see where he was going).",
                                "I could feel them following me with their eyes (= watching my movements closely).",
                                "Do your own thing, don't just follow the crowd (= do what everyone else does)."
                            ]
                        },
                        {
                            "explanation": "to go in the same direction as a road, path, etc.: ",
                            "examples": [
                                "Follow the road for two miles, then turn left."
                            ]
                        },
                        {
                            "explanation": "to do the same thing as someone else: ",
                            "examples": [
                                "When one airline reduces its prices, the rest soon follow suit."
                            ]
                        },
                        {
                            "explanation": "to happen or come after something: ",
                            "examples": [
                                "We were not prepared for the events that followed (= happened next).",
                                "The book was delivered yesterday with a note saying the bill for it would follow in a day or two.",
                                "The meal consisted of spinach salad, followed by roast chicken (= with this as the next part).",
                                "She published a book of poems and followed it (up) with (= next produced) a novel."
                            ]
                        },
                        {
                            "explanation": "said to introduce a list of things: ",
                            "examples": [
                                "The winners are as follows - Woods, Smith, and Cassidy."
                            ]
                        },
                        {
                            "explanation": "to obey or to act as ordered by someone: ",
                            "examples": [
                                "Follow the instructions on the back of the packet carefully.",
                                "I decided to follow her advice and go to bed early.",
                                "Muslims follow the teachings of the Koran."
                            ]
                        },
                        {
                            "explanation": "to have a great interest in something or watch something closely: ",
                            "examples": [
                                "He follows most sports avidly.",
                                "They followed her academic progress closely."
                            ]
                        },
                        {
                            "explanation": "to happen as a result, or to be a likely result: ",
                            "examples": [
                                "Just because I agreed last time, it doesn't necessarily follow that I will again."
                            ]
                        },
                        {
                            "explanation": "to understand something as it is being said or done: ",
                            "examples": [
                                "I'm sorry, I don't quite follow (you).",
                                "His lecture was complicated and difficult to follow."
                            ]
                        },
                        {
                            "explanation": "to read the notes or words of a piece of music or writing at the same time as they are being played or said",
                            "examples": []
                        },
                        {
                            "explanation": "If you follow a particular person on a social media website (= a website where people can publish their thoughts, photographs, information about themselves etc.), you choose to see everything that person posts (= publishes) on the website.",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}