{
    "word": "fool",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fuːl"
                            ],
                            "us": [
                                "fuːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who behaves in a silly way without thinking: ",
                            "examples": [
                                "You fool, you missed your chance!",
                                "He's a fool if he thinks she still loves him.",
                                "He said he would pay me back and like a fool, I believed him.",
                                "I felt like a fool when I dropped my phone in the toilet.",
                                "He's a fool to think she still loves him."
                            ]
                        },
                        {
                            "explanation": "to trick someone or make someone appear stupid in some way: ",
                            "examples": [
                                "You made a fool of me in front of all those people!"
                            ]
                        },
                        {
                            "explanation": "to do something that makes other people think you are silly or not to be respected: ",
                            "examples": [
                                "I got a little drunk and made a fool of myself."
                            ]
                        },
                        {
                            "explanation": "anyone: ",
                            "examples": [
                                "Any fool could tell that she was joking."
                            ]
                        },
                        {
                            "explanation": "to not be stupid or easily deceived: ",
                            "examples": [
                                "I notice Ed didn't offer to pay for her - he's no fool."
                            ]
                        },
                        {
                            "explanation": "said to mean that you think someone is being unwise: ",
                            "examples": [
                                "\"I lent Rhoda £100 and she hasn't paid me back.\" \"More fool you - you know what she's like!\""
                            ]
                        },
                        {
                            "explanation": "in the past, a person who was employed in the court of a king or queen to make the court laugh by telling jokes and doing funny things",
                            "examples": []
                        },
                        {
                            "explanation": "to behave in a silly way, often intentionally to make people laugh: ",
                            "examples": [
                                "Stop acting the fool, I'm trying to talk to you."
                            ]
                        },
                        {
                            "explanation": "a sweet, soft food made of crushed fruit, cream, and sugar: ",
                            "examples": [
                                "If you are serving gooseberry fool on its own, add a little extra sugar."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fuːl"
                            ],
                            "us": [
                                "fuːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to trick someone: ",
                            "examples": [
                                "Don't be fooled by his appearance.",
                                "She said she was doing it to help me, but I wasn't fooled.",
                                "Tim was fooled into believing that he'd won a lot of money."
                            ]
                        },
                        {
                            "explanation": "used to tell someone that you do not believe what they have just said: ",
                            "examples": [
                                "\"Really, I'm very happy.\" \"You could have fooled me.\""
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "fuːl"
                            ],
                            "us": [
                                "fuːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "silly: ",
                            "examples": [
                                "You've done some fool things in your time, but this beats everything."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}