{
    "word": "for",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "fɔːr",
                                "fər"
                            ],
                            "us": [
                                "fɔːr",
                                "fɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "intended to be given to: ",
                            "examples": [
                                "There's a phone message for you.",
                                "I'd better buy something for the new baby.",
                                "There's a prize for the fastest three runners in each category."
                            ]
                        },
                        {
                            "explanation": "having the purpose of: ",
                            "examples": [
                                "There's a sign there saying \"boats for hire\".",
                                "This pool is for the use of hotel guests only.",
                                "I'm sorry, the books are not for sale.",
                                "They've invited us for dinner on Saturday.",
                                "Everyone in the office is contributing money for his leaving present.",
                                "I need some money for tonight.",
                                "Which vitamins should you take for (= in order to cure) skin problems?",
                                "Put those clothes in a pile for washing (= so that they can be washed)."
                            ]
                        },
                        {
                            "explanation": "because of or as a result of something: ",
                            "examples": [
                                "I'm feeling all the better for my holiday.",
                                "\"How are you?\" \"Fine, and all the better for seeing you!\"",
                                "She did 15 years in prison for murder.",
                                "I don't eat meat for various reasons.",
                                "I couldn't see for the tears in my eyes.",
                                "The things you do for love!",
                                "He's widely disliked in the company for his arrogance.",
                                "She couldn't talk for coughing (= she was coughing too much to talk).",
                                "Scotland is famous for its spectacular countryside.",
                                "He's best remembered for his novels.",
                                "I didn't say anything for fear of (= because I was frightened of) offending him."
                            ]
                        },
                        {
                            "explanation": "without: ",
                            "examples": [
                                "If it wasn't for the life jacket, I would have drowned."
                            ]
                        },
                        {
                            "explanation": "used to show an amount of time or distance: ",
                            "examples": [
                                "We walked for miles.",
                                "She's out of the office for a few days next week.",
                                "I'm just going to lie down for an hour or so.",
                                "I haven't played tennis for years."
                            ]
                        },
                        {
                            "explanation": "on the occasion of or at the time of: ",
                            "examples": [
                                "What did you buy him for Christmas?",
                                "I'd like an appointment with the doctor for some time this week.",
                                "We're having a party for Jim's 60th birthday.",
                                "I've booked a table at the restaurant for nine o'clock."
                            ]
                        },
                        {
                            "explanation": "used for comparing one thing with others of the same type: ",
                            "examples": [
                                "She's very mature for her age.",
                                "For every two people in favour of the law there are three against.",
                                "The winter has been unusually cold for Florida.",
                                "It was a difficult decision, especially for a child.",
                                "For a man of his wealth he's not exactly generous."
                            ]
                        },
                        {
                            "explanation": "used to say whose responsibility something is: ",
                            "examples": [
                                "She knew the driver of the other car was not responsible for her son's death."
                            ]
                        },
                        {
                            "explanation": "in support of or in agreement with: ",
                            "examples": [
                                "I voted for the Greens at the last election.",
                                "Those voting for the motion, 96, and those voting against, 54.",
                                "Most of the Republicans voted for the measure.",
                                "So let's hear some applause for these talented young performers.",
                                "Who's for (= who wants to play) tennis?"
                            ]
                        },
                        {
                            "explanation": "to approve of or support something very much: ",
                            "examples": [
                                "I've got nothing against change - I'm all for it."
                            ]
                        },
                        {
                            "explanation": "in order to help someone: ",
                            "examples": [
                                "Let me carry those bags for you.",
                                "Hello, what can I do for you?",
                                "My sister will take care of the dog for us while we're away."
                            ]
                        },
                        {
                            "explanation": "in relation to someone or something: ",
                            "examples": [
                                "Her feelings for him had changed.",
                                "He felt nothing but contempt for her.",
                                "I've got a lot of admiration for people who do that sort of work.",
                                "He's quite good-looking but he's too short for me.",
                                "The ice-cream was a little bit sweet for me.",
                                "That jacket looks a little big for you.",
                                "Jackie's already left and, as for me, I'm going at the end of the month.",
                                "Luckily for me (= I was lucky), I already had another job.",
                                "How are you doing for money/time (= do you have enough money/time)?"
                            ]
                        },
                        {
                            "explanation": "despite: ",
                            "examples": [
                                "For all her qualifications, she's still useless at the job."
                            ]
                        },
                        {
                            "explanation": "(getting) in exchange: ",
                            "examples": [
                                "How much did you pay for your glasses?",
                                "I've sponsored her £1 for every mile that she runs.",
                                "She sold the house for a lot of money.",
                                "The mechanic said he'd repair my car for £300."
                            ]
                        },
                        {
                            "explanation": "being employed by or representing a company, country, etc.: ",
                            "examples": [
                                "She works for a charity.",
                                "He swam for the United States in the 2000 Olympics."
                            ]
                        },
                        {
                            "explanation": "towards; in the direction of: ",
                            "examples": [
                                "They looked as if they were heading for the train station.",
                                "Just follow signs for the museum.",
                                "This time tomorrow we'll be setting off for the States.",
                                "It says this train is for (= going to stop at) Birmingham and Coventry only."
                            ]
                        },
                        {
                            "explanation": "showing meaning: ",
                            "examples": [
                                "What's the Spanish word for \"vegetarian\"?",
                                "What does the \"M.J.\" stand for? Maria José?"
                            ]
                        },
                        {
                            "explanation": "in order to get or achieve: ",
                            "examples": [
                                "I hate waiting for public transport.",
                                "I had to run for the bus.",
                                "Did you send off for details of the competition?",
                                "I've applied for a job with another computer company."
                            ]
                        },
                        {
                            "explanation": "the duty or responsibility of: ",
                            "examples": [
                                "As to whether you should marry him - that's for you to decide.",
                                "It's not for me to tell her what she should do with her life.",
                                "\"How many people should I invite to the party?\" \"It's not really for me to say.\""
                            ]
                        },
                        {
                            "explanation": "in trouble: ",
                            "examples": [
                                "You'll be for it when she finds out!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "conjunction",
                        "ipa": {
                            "uk": [
                                "fɔːr",
                                "fər"
                            ],
                            "us": [
                                "fɔːr",
                                "fɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "because; as: ",
                            "examples": [
                                "She remained silent, for her heart was heavy and her spirits low."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}