{
    "word": "force",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fɔːs"
                            ],
                            "us": [
                                "fɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "physical, especially violent, strength, or power: ",
                            "examples": [
                                "The force of the wind had brought down a great many trees in the area.",
                                "She slapped his face with unexpected force.",
                                "Teachers aren't allowed to use force in the classroom.",
                                "The police were able to control the crowd by sheer force of numbers (= because there were more police than there were people in the crowd)."
                            ]
                        },
                        {
                            "explanation": "in large numbers: ",
                            "examples": [
                                "Photographers were out in force at the White House today."
                            ]
                        },
                        {
                            "explanation": "in scientific use, (a measure of) the influence that changes movement: ",
                            "examples": [
                                "the force of gravity"
                            ]
                        },
                        {
                            "explanation": "to work with someone else in order to achieve something that you both want: ",
                            "examples": [
                                "Britain and France were both working on developing a supersonic aircraft when they decided to join forces in 1962."
                            ]
                        },
                        {
                            "explanation": "(a person or thing with a lot of) influence and energy: ",
                            "examples": [
                                "He was a powerful force in politics.",
                                "Fishermen are always at the mercy of the forces of nature (= bad weather conditions)."
                            ]
                        },
                        {
                            "explanation": "If an organization or a person is described as a force to be reckoned with, it means that they are powerful and have a lot of influence: ",
                            "examples": [
                                "The United Nations is now a force to be reckoned with."
                            ]
                        },
                        {
                            "explanation": "a thing that has a strong natural power that cannot be controlled by humans, or the power itself: ",
                            "examples": [
                                "We are still learning how rivers cut through rock and about the forces of nature involved.",
                                "Earthquakes, floods, and volcanic eruptions serve to remind us of the awful force of nature."
                            ]
                        },
                        {
                            "explanation": "someone who has a very strong personality, with a lot of energy: ",
                            "examples": [
                                "At the age of 87, she is still a force of nature. ",
                                "With 12 goals in 4 games, it seems that nothing can stop this elemental force of nature. "
                            ]
                        },
                        {
                            "explanation": "If you do something out of force of habit, you do it without thinking because you have done it so many times before: ",
                            "examples": [
                                "I just locked the door through force of habit, not thinking that Julia wouldn't be able to get in."
                            ]
                        },
                        {
                            "explanation": "a group of people organized and trained, especially for a particular purpose: ",
                            "examples": [
                                "the security forces",
                                "the work force",
                                "He joined the police force right after graduating."
                            ]
                        },
                        {
                            "explanation": "the military organizations for air, land, and sea: ",
                            "examples": [
                                "The forces are moving towards the country's capital."
                            ]
                        },
                        {
                            "explanation": "(of laws, rules, or systems) existing and being used: ",
                            "examples": [
                                "New driving regulations are going to come into force this year."
                            ]
                        },
                        {
                            "explanation": "in baseball, an occasion when a player is put out when they have to run to the next base (= one of the four positions on a square that a player must reach to score a point) because another player on their team is running to the base where they are standing: ",
                            "examples": [
                                "There was a chance to get a force at second base."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɔːs"
                            ],
                            "us": [
                                "fɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make something happen or make someone do something difficult, unpleasant, or unusual, especially by threatening or not offering the possibility of choice: ",
                            "examples": [
                                "I really have to force myself to be nice to him.",
                                "You can't force her to make a decision.",
                                "Hospitals are being forced to close departments because of lack of money.",
                                "You could tell he was having to force back the tears (= stop himself from crying).",
                                "I didn't actually want any more dessert, but Julia forced it on me (= made me accept it).",
                                "I couldn't stay at their flat - I'd feel as if I was forcing myself on them (= making them allow me to stay).",
                                "You never tell me how you're feeling - I have to force it out of you (= make you tell me)!"
                            ]
                        },
                        {
                            "explanation": "If plants or vegetables are forced, they are made to grow faster by artificially controlling growing conditions such as the amount of heat and light: ",
                            "examples": [
                                "forced strawberries"
                            ]
                        },
                        {
                            "explanation": "to manage, with difficulty, to laugh or smile: ",
                            "examples": [
                                "I managed to force a smile as they were leaving."
                            ]
                        },
                        {
                            "explanation": "to take action to make certain that an urgent problem or matter is dealt with now: ",
                            "examples": [
                                "If the management wouldn't listen to their demands, they would have to force the issue by striking."
                            ]
                        },
                        {
                            "explanation": "to use physical strength or effort to make something move or open: ",
                            "examples": [
                                "Move your leg up gently when you're doing this exercise, but don't force it.",
                                "If you force the zip, it'll break.",
                                "She forced her way through the crowd."
                            ]
                        },
                        {
                            "explanation": "to break a lock, door, window, etc. in order to allow someone to get in: ",
                            "examples": [
                                "I forgot my key, so I had to force a window.",
                                "The police had forced open the door because nobody had answered.",
                                "The burglar forced an entry (= broke a window, door, etc. to get into the house)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}