{
    "word": "forcing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nforce ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɔːs"
                            ],
                            "us": [
                                "fɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make something happen or make someone do something difficult, unpleasant, or unusual, especially by threatening or not offering the possibility of choice: ",
                            "examples": [
                                "I really have to force myself to be nice to him.",
                                "You can't force her to make a decision.",
                                "Hospitals are being forced to close departments because of lack of money.",
                                "You could tell he was having to force back the tears (= stop himself from crying).",
                                "I didn't actually want any more dessert, but Julia forced it on me (= made me accept it).",
                                "I couldn't stay at their flat - I'd feel as if I was forcing myself on them (= making them allow me to stay).",
                                "You never tell me how you're feeling - I have to force it out of you (= make you tell me)!"
                            ]
                        },
                        {
                            "explanation": "If plants or vegetables are forced, they are made to grow faster by artificially controlling growing conditions such as the amount of heat and light: ",
                            "examples": [
                                "forced strawberries"
                            ]
                        },
                        {
                            "explanation": "to manage, with difficulty, to laugh or smile: ",
                            "examples": [
                                "I managed to force a smile as they were leaving."
                            ]
                        },
                        {
                            "explanation": "to take action to make certain that an urgent problem or matter is dealt with now: ",
                            "examples": [
                                "If the management wouldn't listen to their demands, they would have to force the issue by striking."
                            ]
                        },
                        {
                            "explanation": "to use physical strength or effort to make something move or open: ",
                            "examples": [
                                "Move your leg up gently when you're doing this exercise, but don't force it.",
                                "If you force the zip, it'll break.",
                                "She forced her way through the crowd."
                            ]
                        },
                        {
                            "explanation": "to break a lock, door, window, etc. in order to allow someone to get in: ",
                            "examples": [
                                "I forgot my key, so I had to force a window.",
                                "The police had forced open the door because nobody had answered.",
                                "The burglar forced an entry (= broke a window, door, etc. to get into the house)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}