{
    "word": "form",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fɔːm"
                            ],
                            "us": [
                                "fɔːrm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to begin to exist or to make something begin to exist: ",
                            "examples": [
                                "A crowd formed around the accident.",
                                "A solution began to form in her mind.",
                                "I formed the impression (= the way she behaved suggested to me) that she didn't really want to come."
                            ]
                        },
                        {
                            "explanation": "to make something into a particular shape: ",
                            "examples": [
                                "She formed the clay into a small bowl."
                            ]
                        },
                        {
                            "explanation": "to make or be something: ",
                            "examples": [
                                "The lorries formed a barricade across the road.",
                                "Together they would form the next government.",
                                "This information formed the basis of the report."
                            ]
                        },
                        {
                            "explanation": "If separate things form, they come together to make a whole: ",
                            "examples": [
                                "The children formed into lines."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fɔːm"
                            ],
                            "us": [
                                "fɔːrm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a paper or set of papers printed with spaces in which answers to questions can be written or information can be recorded in an organized way: ",
                            "examples": [
                                "Children are being asked to send in their entry forms (= documents used to enter a competition) by next week. ",
                                "You can get an application form for the dog licence on the website.",
                                "Please fill in the form with black ink.",
                                "They gave him a long form to fill out.",
                                "When you have completed the form, hand it in at the desk."
                            ]
                        },
                        {
                            "explanation": "a type of something: ",
                            "examples": [
                                "Swimming is the best form of exercise."
                            ]
                        },
                        {
                            "explanation": "the shape or appearance of something: ",
                            "examples": [
                                "I could just about make out his sleeping form on the bed.",
                                "The moon highlighted the shadowy forms of the hills.",
                                "The lawn was laid out in the form of the figure eight."
                            ]
                        },
                        {
                            "explanation": "to gradually be seen or gradually develop: ",
                            "examples": [
                                "Trees and hedges started to take form as the fog cleared."
                            ]
                        },
                        {
                            "explanation": "A competitor's form is their ability to be successful over a period of time: ",
                            "examples": [
                                "Both horses have shown good form over the last season.",
                                "After a bad year, she has regained her form."
                            ]
                        },
                        {
                            "explanation": "to be feeling or performing well: ",
                            "examples": [
                                "Paul was on good form at the wedding and kept everyone entertained."
                            ]
                        },
                        {
                            "explanation": "one part of a verb or other word that has a special use or meaning: ",
                            "examples": [
                                "The continuous form of \"stand\" is \"standing\".",
                                "\"Stood\" is the irregular past tense form of \"stand\".",
                                "\"Hers\" is the possessive form of \"her\".",
                                "\"Isn't\" is the short form of \"is not\"."
                            ]
                        },
                        {
                            "explanation": "in the UK, a class of school children or a group of classes of children of a similar age",
                            "examples": []
                        },
                        {
                            "explanation": "rude behaviour: ",
                            "examples": [
                                "Was that bad form then, leaving so early?"
                            ]
                        },
                        {
                            "explanation": "a long, thin seat, usually without a back",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}