{
    "word": "frame",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "freɪm"
                            ],
                            "us": [
                                "freɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a border that surrounds and supports a picture, door, or window: ",
                            "examples": [
                                "a picture frame"
                            ]
                        },
                        {
                            "explanation": "the plastic or metal structure that holds together a pair of glasses: ",
                            "examples": [
                                "I think I need glasses with bigger frames."
                            ]
                        },
                        {
                            "explanation": "the basic structure of a building, vehicle, or piece of furniture that other parts are added onto: ",
                            "examples": [
                                "a bicycle frame"
                            ]
                        },
                        {
                            "explanation": "a wooden or plastic triangle used to put the balls into position at the start of a game such as snooker ",
                            "examples": []
                        },
                        {
                            "explanation": "the size and shape of someone's body: ",
                            "examples": [
                                "My sister has a much bigger frame than me."
                            ]
                        },
                        {
                            "explanation": "the way someone thinks or feels about something at a particular time: ",
                            "examples": [
                                "The most important thing is to go into the exam in a positive frame of mind."
                            ]
                        },
                        {
                            "explanation": "a set of ideas or facts accepted by a person that explains their behaviour, opinions, or decisions: ",
                            "examples": [
                                "How can Christians and atheists ever come to understand each other when their frames of reference are so different?"
                            ]
                        },
                        {
                            "explanation": "a period of play in some games, such as snooker andbowling: ",
                            "examples": [
                                "She lost the next two frames."
                            ]
                        },
                        {
                            "explanation": "a playing period in a game of baseball during which one team bats (= hits the ball): ",
                            "examples": [
                                "They scored four runs in the top frame (= the first half of the inning).",
                                "East Carolina responded in the bottom frame (= the second half of the inning) with a run to tie the game, 3-3."
                            ]
                        },
                        {
                            "explanation": "one of the pictures on a strip of photographic film, or one of the single pictures that together form a television or cinema film",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "freɪm"
                            ],
                            "us": [
                                "freɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to express something choosing your words carefully: ",
                            "examples": [
                                "The interview would have been more productive if the questions had been framed more precisely."
                            ]
                        },
                        {
                            "explanation": "to make a person seem to be guilty of a crime when they are not, by producing facts or information that are not true: ",
                            "examples": [
                                "He claimed he'd been framed by the police."
                            ]
                        },
                        {
                            "explanation": "to fix a border around a picture, etc. and often glass in front of it: ",
                            "examples": [
                                "I keep meaning to get that photo framed."
                            ]
                        },
                        {
                            "explanation": "to form an edge to something in an attractive way: ",
                            "examples": [
                                "Her new hairstyle frames her face in a much more flattering way."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}