{
    "word": "framing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfreɪ.mɪŋ"
                            ],
                            "us": [
                                "ˈfreɪ.mɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the basic structure that surrounds and supports something such as a building, vehicle, or piece of furniture: ",
                            "examples": [
                                "The framing around the church entrance was still standing, but everything else was reduced to rubble.",
                                "A decorative lattice conceals the framing underneath."
                            ]
                        },
                        {
                            "explanation": "the process of putting a wood, metal, etc. border around a picture, etc., or the border itself: ",
                            "examples": [
                                "A selection of photographs from the wedding have gone to the shop for framing.",
                                "Having decided on the type and style of framing for your picture, you must make sure that you buy the right materials."
                            ]
                        },
                        {
                            "explanation": "the way that the parts of something such as a photograph or scene in a film are arranged so that the objects, colours, etc. around the edges draw attention to the main feature of the image: ",
                            "examples": [
                                "He uses framing, composition, and lighting to create unforgettable images.",
                                "The camerawork is good, and the framing shows real imagination.",
                                "I like to film what is in front of me, rather than go into elaborate framings or effects."
                            ]
                        },
                        {
                            "explanation": "the process of putting something such as a story, scene, or explanation at the beginning and end of a book, film, etc., as a way of explaining something about the main story: ",
                            "examples": [
                                "The modern framing of the story creates a shift in perspective.",
                                "Hannah is the voice of the film's framing narrative."
                            ]
                        },
                        {
                            "explanation": "the way that something is expressed, and the words that are chosen to do this: ",
                            "examples": [
                                "In any opinion poll, the framing of the questions is an important consideration.",
                                "The results of the research could be used in the framing of policy."
                            ]
                        },
                        {
                            "explanation": "the ideas and meanings that are connected with something when it is described or discussed, so that people understand it in a particular way: ",
                            "examples": [
                                "I disagree with the framing of these problems as inevitable.",
                                "These negative framings aimed to represent the employees as people who had already been excessively rewarded."
                            ]
                        },
                        {
                            "explanation": "the action of making a person seem to be guilty of a crime when they are not, by giving information that is not true: ",
                            "examples": [
                                "At the heart of the show is his framing for the murder of his brother.",
                                "They say their goal is to represent the victims of police framings."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}