{
    "word": "freefall",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌfriːˈfɔːl"
                            ],
                            "us": [
                                "ˌfriːˈfɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when something or someone falls quickly under the influence of gravity (= the force that attracts objects towards one another, especially the force that makes things fall to the ground): ",
                            "examples": [
                                "Skydivers are propelled into a 70-second freefall at 120mph before their parachutes open.",
                                "Finishing its climb, the plane abruptly goes into free fall straight down."
                            ]
                        },
                        {
                            "explanation": "the process of failing or losing value or strength quickly and continuously: ",
                            "examples": [
                                "Only massive changes in government policies will prevent the peso going into free fall (= falling quickly in value by a large amount).",
                                "The economy began to stabilize after months of near freefall."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfriː.fɔːl"
                            ],
                            "us": [
                                "ˈfriː.fɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fall quickly under the influence of gravity (= the force that attracts objects towards one another, especially the force that makes things fall to the ground): ",
                            "examples": [
                                "The plane dropped very suddenly and seemed to freefall for more than 15 seconds.",
                                "I felt as though I was fainting, as if I was freefalling."
                            ]
                        },
                        {
                            "explanation": "to fail or lose value or strength quickly and continuously: ",
                            "examples": [
                                "The company faced an uncertain future when the share price of its stock began to freefall.",
                                "freefalling profits"
                            ]
                        },
                        {
                            "explanation": "to progress very quickly and in an uncontrolled way to reach a particular result: ",
                            "examples": [
                                "The clumsy scene comes as the movie is freefalling toward a conclusion."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}