{
    "word": "free",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "friː"
                            ],
                            "us": [
                                "friː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not limited or controlled: ",
                            "examples": [
                                "Am I free (= do I have permission) to leave now?",
                                "I'll give you a key, so you'll be free to come and go as you like.",
                                "Please feel free to interrupt me if you don't understand anything.",
                                "The agreement gives companies free access to the markets of member countries.",
                                "A great deal has been achieved, most notably free elections (= elections in which people can vote as they wish)."
                            ]
                        },
                        {
                            "explanation": "relaxed and informal: ",
                            "examples": [
                                "The atmosphere in the office is fairly free and easy."
                            ]
                        },
                        {
                            "explanation": "costing nothing, or not needing to be paid for: ",
                            "examples": [
                                "I got some free cinema tickets.",
                                "Members all receive a free copy of the monthly newsletter.",
                                "The elderly travel free on public transport.",
                                "We will install your washing machine free of charge (= without charge).",
                                "You can download the app for free."
                            ]
                        },
                        {
                            "explanation": "not a prisoner any longer, or having unlimited movement: ",
                            "examples": [
                                "She left the court a free woman after the case against her collapsed because of a legal technicality.",
                                "The new government has decided to set all political prisoners free.",
                                "She went free after the charges against her were dropped.",
                                "I could not believe that the court would allow someone who was obviously guilty to walk free.",
                                "I let the dogs run free in the park."
                            ]
                        },
                        {
                            "explanation": "not in a fixed position or not joined to anything: ",
                            "examples": [
                                "Both bookcases stand free of the wall.",
                                "The bolts have worked themselves free because of the vibrations.",
                                "Rescuers took several hours to cut the survivors free from the wreckage."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "friː"
                            ],
                            "us": [
                                "friː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not doing anything planned or important, or available to be used: ",
                            "examples": [
                                "I do a lot of reading in my free time.",
                                "She's in a meeting at the moment, but she should be free to see you in ten minutes.",
                                "I'm working in the café all this week, but I've got a free evening next Monday.",
                                "Excuse me, is this seat free (= is anyone intending to sit in this seat)?",
                                "We queued for half an hour waiting for a free space in the car park.",
                                "If you take these bags, that will give me a free hand to open the door."
                            ]
                        },
                        {
                            "explanation": "not having something that is unwanted or unpleasant: ",
                            "examples": [
                                "The organization is a charitable enterprise, so it is free from tax worldwide.",
                                "She'll never be completely free of the disease.",
                                "Ensure the wound is free from/of dirt before applying the bandage."
                            ]
                        },
                        {
                            "explanation": "giving or using often or in large amounts: ",
                            "examples": [
                                "He's rather free with his wife's money."
                            ]
                        },
                        {
                            "explanation": "to use something that belongs to someone else a lot: ",
                            "examples": [
                                "Don't her parents mind her making free with their house while they're on holiday?"
                            ]
                        },
                        {
                            "explanation": "If an element is free, it is not combined with anything else or attached to anything else: ",
                            "examples": [
                                "free oxygen/nitrogen"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "friː"
                            ],
                            "us": [
                                "friː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to allow someone to leave a prison or place where they have been kept: ",
                            "examples": [
                                "After a ten-hour siege the gunman agreed to free the hostages.",
                                "Anti-vivisectionists last night freed a number of animals from a laboratory."
                            ]
                        },
                        {
                            "explanation": "to move or make loose someone or something that is caught or held somewhere: ",
                            "examples": [
                                "Both men were freed from the wreckage after a four-hour operation.",
                                "In vain he tried to free the rope around his hands."
                            ]
                        },
                        {
                            "explanation": "to remove the limits or controls on someone or something: ",
                            "examples": [
                                "Her retirement from politics will free her (= provide her with enough time) to write her memoirs."
                            ]
                        },
                        {
                            "explanation": "to make something available for someone to use: ",
                            "examples": [
                                "They planned to extend the car park, freeing existing parking spaces for visitors.",
                                "Can you cancel my meetings – I need to free up the afternoon to write this report."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -friː"
                            ],
                            "us": [
                                " -friː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used at the end of words to mean \"without having to pay\": ",
                            "examples": [
                                "They agreed to let us live there rent-free.",
                                "Many banks are now offering interest-free overdrafts to students."
                            ]
                        },
                        {
                            "explanation": "used at the end of words to mean \"without\": ",
                            "examples": [
                                "lead-free fuel",
                                "No working environment is entirely stress-free.",
                                "The journey was surprisingly hassle-free."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}