{
    "word": "fresh",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "freʃ"
                            ],
                            "us": [
                                "freʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "new or different: ",
                            "examples": [
                                "The original orders were cancelled and I was given fresh instructions.",
                                "Fresh evidence has emerged that casts doubts on the men's conviction.",
                                "We need to take a fresh look at the problem.",
                                "Your coffee is cold - let me make you a fresh cup.",
                                "There has been fresh fighting between police and demonstrators.",
                                "They decided to move abroad and make a fresh start."
                            ]
                        },
                        {
                            "explanation": "new and therefore interesting or exciting: ",
                            "examples": [
                                "His book offers some fresh insights into the events leading up to the war.",
                                "We have tried to come up with a fresh new approach."
                            ]
                        },
                        {
                            "explanation": "recently made, done, arrived, etc., and especially not yet changed by time: ",
                            "examples": [
                                "There was a fresh fall of snow during the night.",
                                "There's nothing better than fresh bread, straight from the oven.",
                                "The house, with its fresh coat of paint, looked beautiful in the sunshine.",
                                "She's fresh out of college and very bright.",
                                "The events of last year are still fresh in people's minds (= people can remember them easily)."
                            ]
                        },
                        {
                            "explanation": "If you are fresh out of something, you have just finished or sold all of it, so that there is no more left: ",
                            "examples": [
                                "She asked the waiter for mango juice but they were fresh out."
                            ]
                        },
                        {
                            "explanation": "(of food or flowers) in a natural condition rather than artificially preserved by a process such as freezing: ",
                            "examples": [
                                "fresh fruit and vegetables",
                                "fresh fish/meat",
                                "fresh coffee"
                            ]
                        },
                        {
                            "explanation": "(of air) clean and cool; found outside rather than in a room: ",
                            "examples": [
                                "I opened the window to let some fresh air in.",
                                "fresh mountain air",
                                "I'm just going out for a breath of fresh air."
                            ]
                        },
                        {
                            "explanation": "Fresh weather is cool, sometimes with wind: ",
                            "examples": [
                                "It was a lovely, fresh spring morning.",
                                "There's a fresh breeze today."
                            ]
                        },
                        {
                            "explanation": "clean and pleasant: ",
                            "examples": [
                                "I felt wonderfully clean and fresh after my shower.",
                                "I use a mouthwash to keep my breath fresh.",
                                "This wine has a light, fresh taste."
                            ]
                        },
                        {
                            "explanation": "energetic, enthusiastic, and not tired: ",
                            "examples": [
                                "I'll deal with this problem in the morning when I'm fresh.",
                                "Try and get some sleep on the plane, then you'll arrive feeling fresh."
                            ]
                        },
                        {
                            "explanation": "(of a face) natural, healthy, and young looking: ",
                            "examples": [
                                "She has a lovely fresh (= clear and smooth) complexion."
                            ]
                        },
                        {
                            "explanation": "(of water) not salty: ",
                            "examples": [
                                "Trout are fresh water fish (= live in water that is not salty).",
                                "These plants are found in fresh water lakes and rivers (= those containing water that is not salty)."
                            ]
                        },
                        {
                            "explanation": "being too confident and showing no respect, or showing by your actions or words that you want to have sex with someone: ",
                            "examples": [
                                "Don't you get fresh with me, young woman!",
                                "He started getting fresh (= behaving in a sexual way) in the cinema, so she slapped his face."
                            ]
                        },
                        {
                            "explanation": "good and attractive or stylish: ",
                            "examples": [
                                "You're looking fresh!",
                                "fresh shoes"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "freʃ-"
                            ],
                            "us": [
                                "freʃ-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "recently done: ",
                            "examples": [
                                "fresh-baked bread",
                                "fresh-cut flowers"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}