{
    "word": "from",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "frɒm",
                                "frəm"
                            ],
                            "us": [
                                "frɑːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show the place where someone or something starts: ",
                            "examples": [
                                "What time does the flight from Amsterdam arrive?",
                                "The wind is coming from the north.",
                                "She sent me a postcard from Bermuda.",
                                "He took a handkerchief from his pocket.",
                                "She took her hairbrush from her handbag and began to brush her hair.",
                                "So did you really walk all the way from Smith Street?"
                            ]
                        },
                        {
                            "explanation": "used to show the time when something starts or the time when it was made or first existed: ",
                            "examples": [
                                "Drinks will be served from seven o'clock.",
                                "The price of petrol will rise by 5p a gallon from tomorrow.",
                                "Most of the tapestries in this room date from the 17th century.",
                                "The museum is open from 9.30am to 6.00pm Tuesday to Sunday."
                            ]
                        },
                        {
                            "explanation": "starting at that time and then continuing: ",
                            "examples": [
                                "From that day on, she vowed never to trust him again."
                            ]
                        },
                        {
                            "explanation": "used to show the distance between two places: ",
                            "examples": [
                                "It's about two kilometres from the airport to your hotel.",
                                "We're about a mile from home."
                            ]
                        },
                        {
                            "explanation": "used to show the origin of something or someone: ",
                            "examples": [
                                "\"Where are you from?\" \"I'm from Italy.\"",
                                "I wonder who this card is from.",
                                "Could I speak to someone from the sales department?",
                                "She keeps in touch with her friends from college.",
                                "What sort of reaction did you get from him?"
                            ]
                        },
                        {
                            "explanation": "used to show the material of which something is made: ",
                            "examples": [
                                "The desk is made from pine.",
                                "Meringues are made from sugar and egg whites."
                            ]
                        },
                        {
                            "explanation": "used to show the level at which a range of things begins, such as numbers or prices: ",
                            "examples": [
                                "Prices start from £2.99.",
                                "Tickets will cost from $10 to $45.",
                                "The number of people employed by the company has risen from 25 to 200 in three years."
                            ]
                        },
                        {
                            "explanation": "used to show a change in the state of someone or something: ",
                            "examples": [
                                "Things went from bad to worse.",
                                "The story was translated from Turish to English.",
                                "Since the success of her first play, she has gone from strength to strength (= her success has continued to increase)."
                            ]
                        },
                        {
                            "explanation": "used to show the cause of something or the reason why something happens: ",
                            "examples": [
                                "He was rushed to hospital but died from his injuries.",
                                "She made her money from investing in property.",
                                "You could tell she wasn't lying from the fear in her voice.",
                                "Wearing the correct type of clothing will reduce the risk from radiation."
                            ]
                        },
                        {
                            "explanation": "used to show the facts or opinions you consider before making a judgment or decision: ",
                            "examples": [
                                "Just from looking at the clouds, I would say it's going to rain.",
                                "It's difficult to guess what they will conclude from the evidence."
                            ]
                        },
                        {
                            "explanation": "used to show that someone has left a place, or that something has been removed or taken away: ",
                            "examples": [
                                "They were exiled from their homes during the war.",
                                "Her handbag was snatched from her in the street.",
                                "A refining process is used to extract usable fuel from crude oil."
                            ]
                        },
                        {
                            "explanation": "If you take a smaller amount from a larger amount, you reduce the larger amount by the smaller one: ",
                            "examples": [
                                "When you subtract 3 from 16 you get 13."
                            ]
                        },
                        {
                            "explanation": "used to show a difference between two people or things: ",
                            "examples": [
                                "His opinion could hardly be more different from mine.",
                                "The two sisters are so similar that it's almost impossible to tell one from the other."
                            ]
                        },
                        {
                            "explanation": "used to show the position of something in comparison with other things, or the point of view of someone when considering a matter or problem: ",
                            "examples": [
                                "From the restaurant there is a beautiful view of the ocean.",
                                "She was talking from her own experience of the problem.",
                                "From our point of view, we do not see how these changes will be beneficial to the company."
                            ]
                        },
                        {
                            "explanation": "used to show what someone is being protected against: ",
                            "examples": [
                                "They found shelter from the storm under a large oak tree."
                            ]
                        },
                        {
                            "explanation": "used to show what someone is not allowed to do or know, or what has been stopped happening: ",
                            "examples": [
                                "He's been banned from driving for six months.",
                                "For many years, the truth was kept from the public.",
                                "The bank loan saved her company from bankruptcy."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}