{
    "word": "front",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "frʌnt"
                            ],
                            "us": [
                                "frʌnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part of a building, object, or person's body that faces forward or is most often seen or used: ",
                            "examples": [
                                "The front of the museum is very impressive.",
                                "He spilled soup all down the front of his shirt.",
                                "He was lying on his front.",
                                "The actor walked out to the front of the stage.",
                                "The shop front occupies a very prominent position on the main street."
                            ]
                        },
                        {
                            "explanation": "the part of a vehicle that is nearest to its direction of movement: ",
                            "examples": [
                                "Do you want to sit in the front (= next to the driver)?",
                                "If we sit near the front of the bus, we'll have a better view."
                            ]
                        },
                        {
                            "explanation": "the outside part or cover of a book, newspaper, or magazine: ",
                            "examples": [
                                "There was a picture of the Trevi fountain on the front of the book."
                            ]
                        },
                        {
                            "explanation": "one of the first pages in a book: ",
                            "examples": [
                                "There's an inscription in the front of the book."
                            ]
                        },
                        {
                            "explanation": "further forward than someone or something else: ",
                            "examples": [
                                "The car in front suddenly stopped and I slammed on the brakes."
                            ]
                        },
                        {
                            "explanation": "winning a game or competition: ",
                            "examples": [
                                "By half time the Italians were well in front."
                            ]
                        },
                        {
                            "explanation": "close to the front part of something: ",
                            "examples": [
                                "There's parking space in front of the hotel."
                            ]
                        },
                        {
                            "explanation": "where someone can see or hear you: ",
                            "examples": [
                                "Please don't swear in front of the children."
                            ]
                        },
                        {
                            "explanation": "If you give someone an amount of money up front, you pay that person before they do something for you: ",
                            "examples": [
                                "He wants all the money up front or he won't do the job."
                            ]
                        },
                        {
                            "explanation": "a particular area of activity: ",
                            "examples": [
                                "How are things on the work front? (= Is the situation at work satisfactory?)",
                                "She's very creative on the design front (= she is very good at design)."
                            ]
                        },
                        {
                            "explanation": "the character or qualities that a person or organization appears to have in public that are different from their real character or qualities, and whose purpose is often to deceive people or hide an illegal activity: ",
                            "examples": [
                                "Don't be fooled by his kindness and sensitivity - it's just a front.",
                                "She presents such a cheerful front that you'd never guess she's ill.",
                                "The machinery company was a front operation for arms smuggling.",
                                "Several trading companies were set up in the early 1960s to act as fronts for money-laundering operations."
                            ]
                        },
                        {
                            "explanation": "land near the sea or a lake, or the part of a town near the beach that often has a wide road or path along it: ",
                            "examples": [
                                "Let's go for a stroll along the front.",
                                "The company specializes in building lake-front property."
                            ]
                        },
                        {
                            "explanation": "the place where two masses of air that have different temperatures meet: ",
                            "examples": [
                                "A cold front is expected to bring showers and thunderstorms this weekend.",
                                "A warm front is approaching from the west."
                            ]
                        },
                        {
                            "explanation": "the place where fighting takes place in a war: ",
                            "examples": [
                                "He was a soldier on the Western front in World War I."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "frʌnt"
                            ],
                            "us": [
                                "frʌnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or at the front of something: ",
                            "examples": [
                                "One of his front teeth is missing.",
                                "I'd like seats on the front row.",
                                "a dog's front paws"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "frʌnt"
                            ],
                            "us": [
                                "frʌnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a building or area fronts (onto) a particular place, it is near it and faces it: ",
                            "examples": [
                                "All the apartments front onto the sea."
                            ]
                        },
                        {
                            "explanation": "to lead an organization or group of musicians: ",
                            "examples": [
                                "She fronts a large IT company."
                            ]
                        },
                        {
                            "explanation": "If a building is fronted with something, its surface is covered with it: ",
                            "examples": [
                                "The kitchen has oak cabinets fronted with glass."
                            ]
                        },
                        {
                            "explanation": "In basketball, if a player fronts an opposing player, they stand in front of them, between the opposing player and another opposing player who has the ball, rather than between the player and the basket: ",
                            "examples": [
                                "The forwards played man-to-man, fronting the post players.",
                                "The Wildcats often defend the low post by fronting players."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "frʌnt"
                            ],
                            "us": [
                                "frʌnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of people sharing a political belief who perform actions in public to achieve their aims: ",
                            "examples": [
                                "The National Front is an extremely right-wing political party in Britain.",
                                "The Animal Liberation Front has claimed responsibility for releasing the monkeys from the laboratory."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}