{
    "word": "full",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "fʊl"
                            ],
                            "us": [
                                "fʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a container or a space) holding or containing as much as possible or a lot: ",
                            "examples": [
                                "This cup is very full so be careful with it.",
                                "My plate was already full.",
                                "I tried to get in the cinema last night but it was full.",
                                "Don't talk with your mouth full!",
                                "The shelves were full of books.",
                                "When she looked at him her eyes were full of tears.",
                                "I tried to get on the 8.45 train but it was full.",
                                "Don't fill your glass too full or you'll spill it.",
                                "The stadium was only half full."
                            ]
                        },
                        {
                            "explanation": "containing a lot of things or people or a lot of something: ",
                            "examples": [
                                "This sweater is full of holes.",
                                "His essay was full of spelling errors.",
                                "I'm full of admiration for you.",
                                "You're always so full of energy."
                            ]
                        },
                        {
                            "explanation": "involving a lot of activities: ",
                            "examples": [
                                "I've got a full week next week - could we postpone our meeting?",
                                "She has a very full life."
                            ]
                        },
                        {
                            "explanation": "to be talking or thinking a lot about something that you have enjoyed or found exciting: ",
                            "examples": [
                                "\"Did the kids enjoy their trip to the zoo?\" \"Oh, yes, they were full of it when they got back this afternoon.\""
                            ]
                        },
                        {
                            "explanation": "to think and act as if you are very important: ",
                            "examples": [
                                "Since he got his new job, he's been very full of his own importance."
                            ]
                        },
                        {
                            "explanation": "to think that you are very important in a way that annoys other people: ",
                            "examples": [
                                "I can't stand her - she's so full of herself."
                            ]
                        },
                        {
                            "explanation": "complete, whole, or containing a lot of detail: ",
                            "examples": [
                                "Please give your full name and address.",
                                "We do not yet have full details of the story.",
                                "Few journalists have managed to convey the full horror of the situation.",
                                "Scientists have not yet determined the full impact of the oil spill.",
                                "Today's my last full day in Paris.",
                                "He unwound the rope to its full extent.",
                                "Are you a full member (= do you have all the membership rights) of the club?",
                                "Some plants need to be in full sun (= to have the sun shining on them) all the time."
                            ]
                        },
                        {
                            "explanation": "In baseball, if the count is full, the pitcher (= the player who throws the ball) has thrown two strikes (= balls inside the hitting area) and three balls (= balls outside the hitting area): ",
                            "examples": [
                                "Martinez worked the count full."
                            ]
                        },
                        {
                            "explanation": "completely: ",
                            "examples": [
                                "The bill must be paid in full by the end of the month."
                            ]
                        },
                        {
                            "explanation": "If an activity is in full flow, it is happening fast and with energy: ",
                            "examples": [
                                "Preparations for the event are now in full flow."
                            ]
                        },
                        {
                            "explanation": "If an event is in full swing, it has already been happening for a period of time and there is a lot of activity: ",
                            "examples": [
                                "The party was in full swing by the time we arrived."
                            ]
                        },
                        {
                            "explanation": "able to be seen by other people: ",
                            "examples": [
                                "Andy kissed Vicki full on the lips in full view of her friends."
                            ]
                        },
                        {
                            "explanation": "the greatest possible: ",
                            "examples": [
                                "James is very bright, but he doesn't make full use of his abilities.",
                                "Nobody got full marks (= all the answers right) in the spelling test.",
                                "It doesn't seem likely that we will see a return to full employment (= that all the people in the country will have a job) in the near future."
                            ]
                        },
                        {
                            "explanation": "having eaten so much food that you cannot eat any more: ",
                            "examples": [
                                "No more cake for me, thanks, I'm full."
                            ]
                        },
                        {
                            "explanation": "having recently eaten: ",
                            "examples": [
                                "Never go swimming on a full stomach."
                            ]
                        },
                        {
                            "explanation": "(of clothing) loose or containing a lot of material, or (of parts of the body) quite large and rounded: ",
                            "examples": [
                                "a full skirt",
                                "Women often have full faces/become full in the face when they're pregnant.",
                                "Her full lips curved into a smile."
                            ]
                        },
                        {
                            "explanation": "used to avoid saying \"fat\": ",
                            "examples": [
                                "They advertise clothes \"for the fuller figure\"."
                            ]
                        },
                        {
                            "explanation": "(of a flavour, sound, smell, etc.) strong or deep: ",
                            "examples": [
                                "This wine has a full fruity flavour.",
                                "A cello has a fuller sound than a violin."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "fʊl"
                            ],
                            "us": [
                                "fʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to understand a situation completely: ",
                            "examples": [
                                "You know full well that you're not supposed to go there without asking me!"
                            ]
                        },
                        {
                            "explanation": "straight; directly: ",
                            "examples": [
                                "He was kicked full in the stomach.",
                                "The intruders turned and ran as the police shone their torches full on them."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fʊl"
                            ],
                            "us": [
                                "fʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "as much or as well as possible: ",
                            "examples": [
                                "She certainly lives life to the full."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}