{
    "word": "fun",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fʌn"
                            ],
                            "us": [
                                "fʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "pleasure, enjoyment, or entertainment: ",
                            "examples": [
                                "Invite a friend to the party, and have fun (= enjoy yourself)!",
                                "Having fun (= are you enjoying yourself)?",
                                "We had great fun at the beach.",
                                "I really enjoyed your party - it was such good fun.",
                                "She's a lot of fun to be with.",
                                "Mark was ill for most of the holiday so that took all the fun out of it.",
                                "It's no fun/not much fun (= not enjoyable) having to work on Saturdays.",
                                "I will always remember her as a fun-loving girl.",
                                "\"We're going on a picnic this weekend.\" \"What fun (= how enjoyable)!\"",
                                "The relationship was never going to work, but it was fun while it lasted."
                            ]
                        },
                        {
                            "explanation": "for pleasure: ",
                            "examples": [
                                "I ran but just for fun."
                            ]
                        },
                        {
                            "explanation": "to make a joke about someone or something in a way that is not kind: ",
                            "examples": [
                                "The other children were always making fun of him because he was fat and wore glasses."
                            ]
                        },
                        {
                            "explanation": "behaviour or activities that are not serious; games or jokes: ",
                            "examples": [
                                "The children are always full of fun.",
                                "I didn't mean to upset her - it was just a bit of fun.",
                                "I didn't mean what I said, it was only in fun (= a joke)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "fʌn"
                            ],
                            "us": [
                                "fʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "giving pleasure, especially because of being not at all serious: ",
                            "examples": [
                                "There are lots of fun things to do here.",
                                "Did you have a fun evening?",
                                "These feather accessories are so fun and unusual.",
                                "This is not a very fun topic of discussion."
                            ]
                        },
                        {
                            "explanation": "(of a person) enjoyable to be with, especially because of not being serious: ",
                            "examples": [
                                "He's a really fun person.",
                                "I love my friends as they are so fun and creative."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}