{
    "word": "functional",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈfʌŋk.ʃən.əl"
                            ],
                            "us": [
                                "ˈfʌŋk.ʃən.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "designed to be practical and useful rather than attractive: ",
                            "examples": [
                                "functional clothing"
                            ]
                        },
                        {
                            "explanation": "(of a machine, system, etc.) working in the usual way: ",
                            "examples": [
                                "Is the central heating functional yet?"
                            ]
                        },
                        {
                            "explanation": "someone who can behave, work, and live in a way that seems normal although they are addicted to (= unable to stop using too much) alcohol, drugs, etc.: ",
                            "examples": [
                                "While functional alcoholics drink excessively, most do not display the obvious physical or psychological damage associated with alcoholism."
                            ]
                        },
                        {
                            "explanation": "relating to the performance of basic tasks: ",
                            "examples": [
                                "Numerous surgical operations had left the patient with little functional ability.",
                                "Acupuncture has proved useful in treating functional disorders.",
                                "They performed functional assessments of twelve patients with Parkinson's disease."
                            ]
                        },
                        {
                            "explanation": "relating to the way in which something works or operates: ",
                            "examples": [
                                "Such a document would be the functional equivalent of a national identity card.",
                                "She performed an extensive evaluation of the museum's functional requirements."
                            ]
                        },
                        {
                            "explanation": "relating to language functions, for example saying sorry, asking for something, or refusing something: ",
                            "examples": [
                                "The course will teach participants functional language.",
                                "Spanish functional phrases being taught to the police include \"Calm down\", \"Speak Slower\" and \"You're under arrest\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}