{
    "word": "function",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfʌŋk.ʃən"
                            ],
                            "us": [
                                "ˈfʌŋk.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the natural purpose (of something) or the duty (of a person): ",
                            "examples": [
                                "The function of the veins is to carry blood to the heart.",
                                "I'm not quite sure what my function is within the company.",
                                "A thermostat performs the function of controlling temperature."
                            ]
                        },
                        {
                            "explanation": "an official ceremony or a formal social event, such as a party or a special meal, at which a lot of people are usually present: ",
                            "examples": [
                                "As a mayor, he has a lot of official functions to attend.",
                                "I see her two or three times a year, usually at social functions."
                            ]
                        },
                        {
                            "explanation": "the way in which something works or operates: ",
                            "examples": [
                                "It's a disease that affects the function of the nervous system.",
                                "Studies suggest that regular intake of the vitamin significantly improves brain function."
                            ]
                        },
                        {
                            "explanation": "a process that a computer or a computer program uses to complete a task: ",
                            "examples": [
                                "a search/save/sort function"
                            ]
                        },
                        {
                            "explanation": "something that results from something else, or is the way it is because of something else: ",
                            "examples": [
                                "His success is a function of his having worked so hard."
                            ]
                        },
                        {
                            "explanation": "(in mathematics) a quantity whose value depends on another value and changes with that value: ",
                            "examples": [
                                "x is a function of y."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfʌŋk.ʃən"
                            ],
                            "us": [
                                "ˈfʌŋk.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to work or operate: ",
                            "examples": [
                                "You'll soon learn how the office functions.",
                                "The television was functioning normally until yesterday.",
                                "I'm so tired today, I can barely function."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}