{
    "word": "fundamental",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌfʌn.dəˈmen.təl"
                            ],
                            "us": [
                                "ˌfʌn.dəˈmen.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "forming the base, from which everything else develops: ",
                            "examples": [
                                "We need to make fundamental changes to the way in which we treat our environment.",
                                "It's one of the fundamental differences between men and women.",
                                "The school is based on the fundamental principle that all children should reach their full potential.",
                                "Diversity is of fundamental importance to all ecosystems and all economies."
                            ]
                        },
                        {
                            "explanation": "more important than anything else: ",
                            "examples": [
                                "Some understanding of grammar is fundamental to learning a language."
                            ]
                        },
                        {
                            "explanation": "In a fundamental chord (= a group of notes played together), the basic note that identifies the chord (= tells you which one it is) is its lowest note: ",
                            "examples": [
                                "The value of each chord is determined by its relationship to one, unchangeable fundamental chord.",
                                "The fall of a semitone is accompanied by the fundamental chord, held for two bars."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌfʌn.dəˈmen.təl"
                            ],
                            "us": [
                                "ˌfʌn.dəˈmen.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the basic note of a chord (= a group of notes played together), which identifies it (= tells you which chord it is): ",
                            "examples": [
                                "There is a feeling that chords are built up from, or reach down towards, a fundamental. ",
                                "The harmonic series derived from a given note is a set tone consisting of its fundamental tone and upper harmonic tones.",
                                "Harmonics may be sounded independently of the fundamental note."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}