{
    "word": "funnel",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfʌn.əl"
                            ],
                            "us": [
                                "ˈfʌn.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an object that has a wide round opening at the top, sloping sides, and a narrow tube at the bottom, used for pouring liquids or powders into containers with narrow necks: ",
                            "examples": [
                                "After you grind the coffee, use a funnel to pour it into the jar."
                            ]
                        },
                        {
                            "explanation": "a vertical metal pipe on the top of a ship or steam train through which smoke comes out",
                            "examples": []
                        },
                        {
                            "explanation": "especially in e-commerce (= the business of selling things on the internet), the process that a customer goes through from first hearing about a product, for example through an internet search or advertisement, to buying the product, with a smaller number of customers at each stage of the process: ",
                            "examples": [
                                "At the top of the funnel the user is just starting to do research about a product and might spend time investigating different brands.",
                                "The funnel helps marketing teams plan and measure efforts to attract, engage, and convert prospects.",
                                "The conversion funnel is the cornerstone of all e-commerce business models.",
                                "A marketing funnel describes your customer’s journey with you, from first becoming aware of your brand to buying goods and services.",
                                "There are several steps to a sales funnel, usually known as the top, middle, and bottom of the funnel."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfʌn.əl"
                            ],
                            "us": [
                                "ˈfʌn.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US usually"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something or to travel through a funnel or something that acts like a funnel: ",
                            "examples": [
                                "The wind funnels down these narrow streets.",
                                "The children funelled along the corridor into the school hall.",
                                "The team were content to play defensively, with midfielders and forwards funnelling back to support the defence.",
                                "If you funnel the oil into the engine, you're less likely to spill it."
                            ]
                        },
                        {
                            "explanation": "to send something directly and intentionally: ",
                            "examples": [
                                "No one knows who has been funnelling weapons to the terrorists.",
                                "These laws ensure that local revenue for education is funelled into schemes overseen by the local education authority."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}