{
    "word": "furlough",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfɜː.ləʊ"
                            ],
                            "us": [
                                "ˈfɝː.loʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a period of time that a soldier, worker, or prisoner is allowed to be absent, especially to return temporarily to their own home: ",
                            "examples": [
                                "He was an Army Sergeant home on furlough.",
                                "It is a crime for a person who has been given a furlough to fail to return to the jail or prison at the required time."
                            ]
                        },
                        {
                            "explanation": "a period of time when a company stops employing someone, usually temporarily, because the company does not have enough money or enough work: ",
                            "examples": [
                                "Employees of the company were told to prepare themselves for a round of furloughs.",
                                "The union represents about 9,000 active pilots, with nearly 2,000 more pilots currently on furlough."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈfɜː.ləʊ"
                            ],
                            "us": [
                                "ˈfɝː.loʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give someone permission to be absent from the armed services, work, or prison for a period of time, especially to return temporarily to their own home: ",
                            "examples": [
                                "Furloughed servicemen must be given preference over civilian travel."
                            ]
                        },
                        {
                            "explanation": "not going to your job, usually temporarily, because your employer does not have work for you or money to pay you: ",
                            "examples": [
                                "After safety concerns, the company furloughed all 4,000 of its employees."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}