{
    "word": "fuse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "fjuːz"
                            ],
                            "us": [
                                "fjuːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small safety part in an electrical device or piece of machinery that causes it to stop working if the electric current is too high, and so prevents fires or other dangers: ",
                            "examples": [
                                "My hairdryer's stopped working - I think the fuse has blown (= broken).",
                                "Have you tried changing the fuse?"
                            ]
                        },
                        {
                            "explanation": "a string or piece of paper connected to a firework or other explosive product by which it is lit, or a device inside a bomb that causes it to explode after a fixed length of time or when it hits or is near something: ",
                            "examples": [
                                "He lit the fuse and ran."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "fjuːz"
                            ],
                            "us": [
                                "fjuːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to join together physically, or to join things together physically: ",
                            "examples": [
                                "Genes determine how we develop from the moment the sperm fuses with the egg.",
                                "The bones of the skull are not properly fused at birth.",
                                "Fusing the vertebrae together seemed to be her only option."
                            ]
                        },
                        {
                            "explanation": "(of ideas, cultures, musical styles, etc.) to combine or be combined together : ",
                            "examples": [
                                "In Istanbul, East and West fuse together in a way that is fascinating to observe.",
                                "He developed a sound that fuses jazz, funk, disco, and soul."
                            ]
                        },
                        {
                            "explanation": "to melt or make two things melt together, especially at a high temperature: ",
                            "examples": [
                                "The heat of the fire fused many of the machine's parts together."
                            ]
                        },
                        {
                            "explanation": "When an electrical device or piece of machinery fuses, or when someone or something fuses it, it stops working because the electric current is too high: ",
                            "examples": [
                                "Either my headlights have fused or the bulbs have gone.",
                                "The kids were messing around with the switches and they fused the lights."
                            ]
                        },
                        {
                            "explanation": "to put a device inside a bomb that causes it to explode after a fixed length of time or when it hits or is near something: ",
                            "examples": [
                                "The submarine carries an explosive charge fused to detonate on impact with its target.",
                                "They discovered a World War II 250-pound fused bomb. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}