{
    "word": "future",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈfjuː.tʃər"
                            ],
                            "us": [
                                "ˈfjuː.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a period of time that is to come: ",
                            "examples": [
                                "Sometimes I worry about the future.",
                                "I wonder what the future holds for (= what will happen to) you and me.",
                                "I'm sure at some point in the future I'll want a baby.",
                                "We need to plan for the future.",
                                "Do you plan to leave New York in the distant future or the near future?",
                                "I can see those two getting married in the not too distant future (= quite soon)."
                            ]
                        },
                        {
                            "explanation": "the form of a verb that you use when talking about something that will happen or exist: ",
                            "examples": [
                                "In the sentence \"He will study\" the verb phrase \"will study\" is in the future."
                            ]
                        },
                        {
                            "explanation": "what will happen to someone or something in the time that is to come: ",
                            "examples": [
                                "Torn apart by war, its economy virtually destroyed, this country now faces a very uncertain future.",
                                "She's a very talented young singer, Mike, and I personally think she's got a great future ahead of her!",
                                "The future isn't looking too rosy for these companies."
                            ]
                        },
                        {
                            "explanation": "the chance of continuing success or existence for something: ",
                            "examples": [
                                "With falling audiences, the future of this theatre is in doubt."
                            ]
                        },
                        {
                            "explanation": "used at the beginning or end of a sentence in which there is a decision about a plan of action or a warning: ",
                            "examples": [
                                "Could you be more careful in future?"
                            ]
                        },
                        {
                            "explanation": "agreements for the buying and selling of goods, in which the price is agreed before a particular future time at which the goods will be provided: ",
                            "examples": [
                                "the futures market"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈfjuː.tʃər"
                            ],
                            "us": [
                                "ˈfjuː.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "happening or existing in the future: ",
                            "examples": [
                                "Of course we'll keep you up to date about any future developments.",
                                "There's an old superstition that young girls going to bed on this night dream of their future husbands."
                            ]
                        },
                        {
                            "explanation": "The future form of a verb is used when talking about something that will happen or exist: ",
                            "examples": [
                                "How do you say that in the future tense?"
                            ]
                        },
                        {
                            "explanation": "used when you tell someone something so that it will be known about and can be used in the future: ",
                            "examples": [
                                "For future reference, could you use the headed paper for any correspondence that leaves this office?"
                            ]
                        },
                        {
                            "explanation": "in order to be used or looked at some time in the future: ",
                            "examples": [
                                "I filed the documents away for future reference."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}