{
    "word": "gaelic",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a Celtic language spoken in some parts of western Scotland and an official language of Scotland : ",
                            "examples": [
                                "About 60 primary schools in Scotland now teach lessons in Gaelic.",
                                "The decline of Scots Gaelic will inevitably continue for a while."
                            ]
                        },
                        {
                            "explanation": "a Celtic language spoken by some people in Ireland and an official language of the Republic of Ireland, where it is taught in all schools: ",
                            "examples": [
                                "They all spoke Gaelic down in the west.",
                                "The three Irish tenors sang more in Italian than they did in Gaelic. "
                            ]
                        },
                        {
                            "explanation": "a Celtic language spoken by some people in the Isle of Man, especially in the past: ",
                            "examples": [
                                "In 1901 the Isle of Man had 5,000 Gaelic speakers.",
                                "Manx Gaelic is an official language in the parliament of the Isle of Man. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to the Celtic language spoken in some parts of western Scotland, or to its speakers or their traditional culture: ",
                            "examples": [
                                "The word whisky comes from the Gaelic word usquebaugh, meaning \"water of life\".",
                                "Gaelic songs",
                                "The TV channel serves Scotland's Gaelic community.",
                                "The project is the brainchild of the Gaelic actor and writer Domhnall Ruadh.",
                                "Scotland's Gaelic culture was crushed after the battle of Culloden."
                            ]
                        },
                        {
                            "explanation": "used as another word for Scottish, to describe a person or group or their characteristics: ",
                            "examples": [
                                "If the figures for the past three years had followed the same pattern, we could have overtaken our Gaelic counterparts."
                            ]
                        },
                        {
                            "explanation": "relating to the Celtic language of Ireland, or to its speakers or their traditional culture: ",
                            "examples": [
                                "The centre also hosts Gaelic language classes and readings from Irish poets.",
                                "It's difficult for Americans to pronounce some Gaelic words, but O'Riordan's example inspires students to try. ",
                                "The children of Gaelic families were often heard speaking a mixture of Gaelic and English in the playground.",
                                "Gaelic sports, such as hurling and Gaelic football",
                                "the Gaelic Athletic Association"
                            ]
                        },
                        {
                            "explanation": "used as another word for Irish, to describe a person or group or their characteristics: ",
                            "examples": [
                                "The Gaelic bookmaker unveiled a strong set of figures.",
                                "One of the instructors was an gentleman by the name of Fagan who had all the Gaelic charm of the Irish."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}