{
    "word": "gaining",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \ngain ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡeɪn"
                            ],
                            "us": [
                                "ɡeɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to get something that is useful, that gives you an advantage, or that is in some way positive, especially over a period of time: ",
                            "examples": [
                                "The mayor has gained a lot of support from the teacher's union.",
                                "What do you hope to gain from the course?",
                                "Alternative medicine has only just started to gain respectability in our society.",
                                "It was her performances in Aida that gained her an international reputation as a soprano.",
                                "After you've gained some experience teaching abroad, you can come home and get a job.",
                                "From the late 19th century, European powers began to gain control of parts of the Ottoman Empire.",
                                "She's certainly gained (in) confidence over the last couple of years.",
                                "The data exists all right - the difficulty is in gaining access to it.",
                                "The thieves gained entrance through an upstairs window that was left open."
                            ]
                        },
                        {
                            "explanation": "If a political party or an idea or belief gains ground, it becomes more popular or accepted: ",
                            "examples": [
                                "The Republicans are gaining ground in the southern states."
                            ]
                        },
                        {
                            "explanation": "to increase in weight, speed, height, or amount: ",
                            "examples": [
                                "I gained a lot of weight while I was on holiday.",
                                "The car gained speed going down the hill.",
                                "Good economic indicators caused the share index to gain (by) ten points.",
                                "The campaign has been gaining momentum over the past few weeks."
                            ]
                        },
                        {
                            "explanation": "If a clock or watch gains, it works too quickly and shows a time that is later than the real time: ",
                            "examples": [
                                "My watch has gained (by) ten minutes over the last 24 hours."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}