{
    "word": "gather",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈɡæð.ər"
                            ],
                            "us": [
                                "ˈɡæð.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to collect several things, often from different places or people: ",
                            "examples": [
                                "I went to several libraries to gather information about the plans.",
                                "We gathered blueberries from the bushes.",
                                "She gathered up the newspapers that were scattered around the floor.",
                                "We gathered our things together and left quickly."
                            ]
                        },
                        {
                            "explanation": "to put your arms around someone and hold or carry them in a careful or loving way: ",
                            "examples": [
                                "He gathered her in his arms and kissed her.",
                                "She gathered the children up and hurried into the house."
                            ]
                        },
                        {
                            "explanation": "to become faster, stronger, etc.: ",
                            "examples": [
                                "The bicycle gathered speed as it went down the hill."
                            ]
                        },
                        {
                            "explanation": "to prepare to make a great effort to be strong or brave: ",
                            "examples": [
                                "I spent a week gathering the courage to say no."
                            ]
                        },
                        {
                            "explanation": "to make yourself feel calm again, or ready to do something, especially after a shock or before something difficult that you have to do: ",
                            "examples": [
                                "After the loud pop and the pain and the scream, he gathered himself enough to look down at his injured foot.",
                                "She gathered herself and stood up, ready to face the audience."
                            ]
                        },
                        {
                            "explanation": "When people or animals gather, they come together in a group: ",
                            "examples": [
                                "A crowd had gathered to hear her speak.",
                                "Gather round, children, and I'll tell you a story."
                            ]
                        },
                        {
                            "explanation": "to get thicker and closer: ",
                            "examples": [
                                "Storm clouds were gathering."
                            ]
                        },
                        {
                            "explanation": "to understand or believe something as a result of something that has been said or done: ",
                            "examples": [
                                "Harry loves his new job, I gather.",
                                "From what I can gather, they're old school friends."
                            ]
                        },
                        {
                            "explanation": "to pull cloth into small folds by sewing a thread through it and then pulling the thread tight: ",
                            "examples": [
                                "a gathered skirt"
                            ]
                        },
                        {
                            "explanation": "If you gather a piece of clothing or loose cloth around yourself, you pull it close to your body: ",
                            "examples": [
                                "She shivered, and gathered the blanket around her."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɡæð.ər"
                            ],
                            "us": [
                                "ˈɡæð.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small fold that has been sewn into cloth: ",
                            "examples": [
                                "a skirt with gathers at the back"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}