{
    "word": "gender",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdʒen.dər"
                            ],
                            "us": [
                                "ˈdʒen.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of people in a society who share particular qualities or ways of behaving which that society associates with being male, female, or another identity: ",
                            "examples": [
                                "I think all genders are able to care for children equally.",
                                "Those old films are full of racial and gender stereotypes.",
                                "Their goal is to eliminate gender bias in access to sports for children.",
                                "Germany's top court has ruled that parliament must legally recognize a third gender.",
                                "Our lab is committed to gender equality in the sciences and promotes men and women to senior positions in equal numbers.",
                                "\"The gender that you identify with isn't always the same as your biological sex,\" he explained.",
                                "There can be a lot of physical variation within one gender as well as between genders."
                            ]
                        },
                        {
                            "explanation": "the condition of being a member of a group of people in a society who share particular qualities or ways of behaving which that society associates with being male, female, or another identity: ",
                            "examples": [
                                "Discrimination on the basis of race, gender, age or disability is not allowed.",
                                "She felt that her destiny had been shaped by her gender.",
                                "The sample of people questioned was drawn from the university's student register and grouped by age and gender.",
                                "I could not fill out the form as I am non-binary and my gender was not listed among the options given."
                            ]
                        },
                        {
                            "explanation": "used to refer to the condition of being physically male, female, or intersex (= having a body that has both male and female characteristics): ",
                            "examples": [
                                "Does this test show the gender of the baby?",
                                "Forensic scientists can tell the gender of the victim from the skeleton."
                            ]
                        },
                        {
                            "explanation": "the grammatical arrangement of nouns, pronouns and adjectives into masculine, feminine, and neuter types in some languages",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈdʒen.dər"
                            ],
                            "us": [
                                "ˈdʒen.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give someone or something a particular gender, or to think of something as belonging to a particular gender: ",
                            "examples": [
                                "Children don't usually gender their toys until they see adults doing it.",
                                "Increasing numbers of young people are choosing to gender themselves, and playing with gender can be fun.",
                                "I do not see why we need to gender babies' clothes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}