{
    "word": "general",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈdʒen.ər.əl"
                            ],
                            "us": [
                                "ˈdʒen.ər.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "involving or relating to most or all people, things, or places, especially when these are considered as a unit: ",
                            "examples": [
                                "The general feeling is that justice was not served.",
                                "There is general concern about rising crime rates.",
                                "My general impression of the place was good.",
                                "The talk is intended to be of general interest (= of interest to most people).",
                                "Rain will become more general in the southeast during the afternoon."
                            ]
                        },
                        {
                            "explanation": "usually, or in most situations: ",
                            "examples": [
                                "In general, men are taller than women."
                            ]
                        },
                        {
                            "explanation": "considering the whole of someone or something, and not just a particular part of him, her, or it: ",
                            "examples": [
                                "So, apart from the bad ankle, how are you in general?"
                            ]
                        },
                        {
                            "explanation": "to be a good thing for the public: ",
                            "examples": [
                                "The government will only say it is not in the general interest to reveal any more information."
                            ]
                        },
                        {
                            "explanation": "not detailed, but including the most basic or necessary information: ",
                            "examples": [
                                "What he said was very general.",
                                "The school aims to give children a general background in a variety of subjects.",
                                "I'm not an expert, so I can only speak in general terms on this matter."
                            ]
                        },
                        {
                            "explanation": "things considered as a unit and without giving attention to details: ",
                            "examples": [
                                "His book moves from the general to the particular."
                            ]
                        },
                        {
                            "explanation": "including a lot of things or subjects and not limited to only one or a few: ",
                            "examples": [
                                "general knowledge"
                            ]
                        },
                        {
                            "explanation": "used as part of the title of a job of someone who is in charge of a whole organization or company: ",
                            "examples": [
                                "He hoped to become a general manager in a hotel.",
                                "the General Secretary of the UN"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈdʒen.ər.əl"
                            ],
                            "us": [
                                "ˈdʒen.ər.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an officer of very high rank, especially in the army: ",
                            "examples": [
                                "He was promoted to the rank of general.",
                                "General Brown/Roger Brown",
                                "Thank you, General."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}