{
    "word": "glide",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡlaɪd"
                            ],
                            "us": [
                                "ɡlaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move easily without stopping and without effort or noise: ",
                            "examples": [
                                "She came gliding gracefully into the ballroom in a long, flowing gown.",
                                "I love my new pen - it just glides across/over the paper."
                            ]
                        },
                        {
                            "explanation": "to move or progress without difficulty or effort: ",
                            "examples": [
                                "Some people glide effortlessly through life with no real worries."
                            ]
                        },
                        {
                            "explanation": "to fly by floating on air currents instead of using power from wings or an engine: ",
                            "examples": [
                                "We saw a condor gliding high above the mountains.",
                                "Unlike other spacecraft, the shuttle can glide back through the atmosphere, land safely, and be reused."
                            ]
                        },
                        {
                            "explanation": "In cricket, if a batter glides the ball, they hit it quickly and lightly at an angle so that it goes behind them with only a small change of direction: ",
                            "examples": [
                                "He glided the delivery for four.",
                                "She glided a short-pitched delivery down to fine leg for a single."
                            ]
                        },
                        {
                            "explanation": "to move from one musical note to another in a smooth and connected manner: ",
                            "examples": [
                                "The pianos glided up and down the scale effortlessly.",
                                "They practised gliding from their lowest note to their highest note."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡlaɪd"
                            ],
                            "us": [
                                "ɡlaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, easy, smooth movement across a surface that makes no noise: ",
                            "examples": [
                                "Every dancer wants the glorious glide of a Fred Astaire or a Ginger Rogers."
                            ]
                        },
                        {
                            "explanation": "the action of floating on air currents, rather than using power from wings or an engine: ",
                            "examples": [
                                "He reached the canyon's edge and went into his glide."
                            ]
                        },
                        {
                            "explanation": "a sound that is similar to a vowel but marks the start of a syllable: ",
                            "examples": [
                                "In English, the sound /j/ in \"yes\" or \"due\" is a glide."
                            ]
                        },
                        {
                            "explanation": "a movement from one musical note to another in a smooth and connected manner, or a curved line written over or under musical notes to show that they must be played in this way: ",
                            "examples": [
                                "The children were asked to distinguish between upward and downward glides.",
                                "Glissando is a glide from one pitch to another."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}