{
    "word": "go",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡəʊ"
                            ],
                            "us": [
                                "ɡoʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to travel or move to another place: ",
                            "examples": [
                                "We went into the house.",
                                "I went to Paris last summer. Have you ever been there?",
                                "We don't go to the cinema very often these days.",
                                "Wouldn't it be quicker to go by train?",
                                "Does this train go to Newcastle?",
                                "Where do you think you're going? Shouldn't you be at school?"
                            ]
                        },
                        {
                            "explanation": "to be in the process of moving: ",
                            "examples": [
                                "Can't we go any faster?",
                                "We were going along at about 50 miles an hour.",
                                "Go down the road for about a mile, and then turn right at the junction.",
                                "He went upstairs/downstairs to his office.",
                                "Go over the bridge and take the first right.",
                                "When you go through a tunnel, your phone will lose signal.",
                                "I've got a tune going around/round in my head (= I am continually hearing it) and I just can't remember the name of it."
                            ]
                        },
                        {
                            "explanation": "to move or travel somewhere in order to do something: ",
                            "examples": [
                                "We go shopping every Friday night.",
                                "I've never gone skiing.",
                                "They've gone for a walk, but they should be back soon.",
                                "She went to meet Blake at the station.",
                                "There's a good film on at the Odeon. Shall we go?"
                            ]
                        },
                        {
                            "explanation": "said when you cannot find something: ",
                            "examples": [
                                "Where have my keys gone?"
                            ]
                        },
                        {
                            "explanation": "to leave a place, especially in order to travel to somewhere else: ",
                            "examples": [
                                "Is it midnight already? I really must go/must be going.",
                                "She wasn't feeling well, so she went home early.",
                                "What time does the last train to Bath go?",
                                "I'm afraid he'll have to go (= be dismissed from his job) - he's far too inefficient to continue working for us.",
                                "This carpet's terribly old and worn out - it really will have to go (= be got rid of)."
                            ]
                        },
                        {
                            "explanation": "If you ask for some food to go at a restaurant, you want it wrapped up so that you can take it away with you instead of eating it in the restaurant: ",
                            "examples": [
                                "I'd like a cheeseburger and strawberry milkshake to go, please."
                            ]
                        },
                        {
                            "explanation": "polite word for to die: ",
                            "examples": [
                                "She went peacefully in her sleep."
                            ]
                        },
                        {
                            "explanation": "If a road, path, etc. goes in a particular direction, it leads there: ",
                            "examples": [
                                "This road goes to Birmingham.",
                                "A huge crack went from the top to the bottom of the wall."
                            ]
                        },
                        {
                            "explanation": "to continue for a particular length: ",
                            "examples": [
                                "The tree's roots go down three metres."
                            ]
                        },
                        {
                            "explanation": "to intend to do or be something in the future: ",
                            "examples": [
                                "Are you going to go to Claire's party?"
                            ]
                        },
                        {
                            "explanation": "to be certain or expected to happen in the future: ",
                            "examples": [
                                "They're going to have a baby in the spring."
                            ]
                        },
                        {
                            "explanation": "to become: ",
                            "examples": [
                                "The idea of going grey doesn't bother me, but I'd hate to go bald.",
                                "Her father's going senile/blind/deaf.",
                                "If anything goes wrong, you can call our emergency hotline free of charge.",
                                "After twelve years of Republican presidents, the US went Democratic in 1992."
                            ]
                        },
                        {
                            "explanation": "to move a part of the body in a particular way or the way that is shown: ",
                            "examples": [
                                "Go like this with your hand to show that you're turning left."
                            ]
                        },
                        {
                            "explanation": "to operate (in the right way): ",
                            "examples": [
                                "Have you any idea why this watch won't go?",
                                "Can you help me get my car going?",
                                "Our company has been going (= has been in business) for 20 years."
                            ]
                        },
                        {
                            "explanation": "If a period of time goes, it passes: ",
                            "examples": [
                                "I had a wonderful weekend but it went very quickly.",
                                "Time seems to go faster as you get older.",
                                "There's only a week to go before (= until) I get my exam results."
                            ]
                        },
                        {
                            "explanation": "to be or stay in a particular condition, especially an unpleasant one : ",
                            "examples": [
                                "In spite of the relief effort, thousands of people continue to go hungry.",
                                "Why do so many rapes go unreported?"
                            ]
                        },
                        {
                            "explanation": "in comparison with most other things of a particular type, especially when you do not think that type of thing is very good: ",
                            "examples": [
                                "It was quite a good film, as horror films go."
                            ]
                        },
                        {
                            "explanation": "to prove that something is true: ",
                            "examples": [
                                "Your daughter's attitude only goes to prove how much society has changed over the last 30 years."
                            ]
                        },
                        {
                            "explanation": "to start doing or using something: ",
                            "examples": [
                                "I'll just connect the printer to the computer and then we'll be ready to go."
                            ]
                        },
                        {
                            "explanation": "to use your opportunity to play in a game: ",
                            "examples": [
                                "It's your turn to go now."
                            ]
                        },
                        {
                            "explanation": "(of a number) to fit into another number especially resulting in a whole number: ",
                            "examples": [
                                "5 into 11 won't go.",
                                "3 goes into 15 fives times."
                            ]
                        },
                        {
                            "explanation": "to say, especially when a story is being told: ",
                            "examples": [
                                "\"I never want to see you ever again,\" he goes, and storms out the house."
                            ]
                        },
                        {
                            "explanation": "to become weak or damaged, especially from being used (too much), or to stop working: ",
                            "examples": [
                                "After a gruelling six months singing on a world tour, it is hardly surprising that her voice is starting to go.",
                                "I really must get a new jacket - this one's starting to go at the elbows.",
                                "Her hearing is going, but otherwise she's remarkably fit for a 95-year-old."
                            ]
                        },
                        {
                            "explanation": "to produce a noise: ",
                            "examples": [
                                "I think I heard the doorbell go (= ring) just now.",
                                "I wish my computer would stop going \"beep\" whenever I do something wrong."
                            ]
                        },
                        {
                            "explanation": "to be expressed, sung, or played: ",
                            "examples": [
                                "I can never remember how that song goes.",
                                "\"Doesn't it go something like this?\" said Joan, and played the first couple of bars on her guitar.",
                                "The story goes (= people say) (that) he was fireds after he was caught stealing company property.",
                                "A headless ghost walks the castle at night - or so the story goes (= so people say)."
                            ]
                        },
                        {
                            "explanation": "to happen or be found regularly or typically with each other or another: ",
                            "examples": [
                                "Wisdom and maturity don't necessarily go together.",
                                "She knows all about the health problems that go with smoking.",
                                "Great wealth often goes hand in hand with meanness."
                            ]
                        },
                        {
                            "explanation": "to be put in a particular place, especially as the usual place: ",
                            "examples": [
                                "The sofa went against that wall before we had the radiator put in.",
                                "I'll put it all away if you tell me where everything goes."
                            ]
                        },
                        {
                            "explanation": "to be sold or be available: ",
                            "examples": [
                                "The shop is having a closing-down sale - everything must go.",
                                "The painting will go to the highest bidder.",
                                "I bought some flowers that were going cheap.",
                                "\"Going... going... gone! (= Sold!)\" said the auctioneer, banging down the hammer."
                            ]
                        },
                        {
                            "explanation": "to look or be acceptable or suitable: ",
                            "examples": [
                                "That picture would go well on the wall in the living room.",
                                "The TV would go nicely in that corner, wouldn't it?",
                                "If I wear the orange hat with the blue dress, do you think it will go?",
                                "Just remember that I'm the boss and what I say goes (= you have to accept what I say).",
                                "My parents don't worry too much about what I am up to, and most of the time anything goes (= I can do what I want)."
                            ]
                        },
                        {
                            "explanation": "to be known (by a particular name): ",
                            "examples": [
                                "He had a scruffy old teddy bear that went by the name of Augustus.",
                                "In Britain, this flour usually goes under the name of maize meal."
                            ]
                        },
                        {
                            "explanation": "to develop or happen: ",
                            "examples": [
                                "\"How did the interview go?\" \"It went very well, thanks.\"",
                                "Things have gone badly for him since his business collapsed."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡəʊ"
                            ],
                            "us": [
                                "ɡoʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an attempt to do something: ",
                            "examples": [
                                "I've never done this before but I'll give it a go.",
                                "\"This jar is impossible to open.\" \"Here, let me have a go.\"",
                                "I want to have a go at finishing my essay tonight.",
                                "We can't do the work all in one go (= all at the same time)."
                            ]
                        },
                        {
                            "explanation": "to try to make something succeed, usually by working hard: ",
                            "examples": [
                                "She's really making a go of her new antique shop."
                            ]
                        },
                        {
                            "explanation": "an opportunity to play in a game, or to do or use something: ",
                            "examples": [
                                "Hey, it's Ken's go now! You've just had your go.",
                                "Please can I have a go (= can I ride) on your bike?",
                                "I'll have a go at driving for a while if you're tired."
                            ]
                        },
                        {
                            "explanation": "to criticize someone: ",
                            "examples": [
                                "My Dad's always having a go at me about getting a proper job."
                            ]
                        },
                        {
                            "explanation": "the condition of being energetic and active: ",
                            "examples": [
                                "You're full of go this morning.",
                                "He doesn't have much go about him, does he?"
                            ]
                        },
                        {
                            "explanation": "a Chinese game played on a square board in which two players try to surround each others' stones (= pieces): ",
                            "examples": [
                                "Around 50m people in east Asia play go.",
                                "Go was all the rage in Japanese courtly circles by the 11th century."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}