{
    "word": "golden triangle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌɡəʊl.dən ˈtraɪ.æŋ.ɡəl"
                            ],
                            "us": [
                                "ˌɡoʊl.dən ˈtraɪ.æŋ.ɡəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an isosceles triangle (= one with two sides of equal length) in which the two sides of equal length are in the golden ratio (= a mathematical relationship of approximately 1 to 1.6 that is often found in nature and art) to the other side: ",
                            "examples": [
                                "An example layout is shown in Figure 12 that consists of two golden triangles. ",
                                "What is the size of the smallest angle of the golden triangle?"
                            ]
                        },
                        {
                            "explanation": "a rule of artistic composition (= the way that things or people are arranged in a painting or photograph) according to which an image can be divided using diagonal lines into four triangles of different sizes: ",
                            "examples": [
                                "One way to use the golden triangle is to place your subject directly along the diagonals. ",
                                "You can use a road that cuts through your frame at a diagonal to produce a golden triangle composition."
                            ]
                        },
                        {
                            "explanation": "an area of southeast Asia that is known for producing opium (= a drug made from the seeds of a poppy that is used to control pain, help sleep, or illegally for pleasure): ",
                            "examples": [
                                "He travels the border region between Thailand, Laos, and Myanmar known as the Golden Triangle."
                            ]
                        },
                        {
                            "explanation": "an area, usually approximately triangular in shape, that is known as being an especially good place to live, have a business, produce a particular thing, etc.: ",
                            "examples": [
                                "Good village schools make this area, known locally as the Golden Triangle, popular with young families.",
                                "This is an outstanding wine from the \"golden triangle\" of Spanish wine production."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}