{
    "word": "grooming",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɡruː.mɪŋ",
                                "ˈɡrʊm.ɪŋ"
                            ],
                            "us": [
                                "ˈɡruː.mɪŋ",
                                "ˈɡrʊm.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the things that you do to make your appearance clean and neat, for example brushing your hair, or the things that you do to keep an animal's hair or fur clean and neat: ",
                            "examples": [
                                "She pays great attention to make-up, grooming and clothes.",
                                "In general, women spend much longer on personal grooming than men."
                            ]
                        },
                        {
                            "explanation": "the act of cleaning an animal, often by brushing its fur: ",
                            "examples": [
                                "Students can learn skills such as dog grooming or how to become veterinary technicians.",
                                "There will be demonstrations of horseshoeing and horse grooming. "
                            ]
                        },
                        {
                            "explanation": "(of an animal) the act of using its tongue or paws (= feet) to clean itself or another animal: ",
                            "examples": [
                                "The constant grooming cats do is likely to make them swallow a lot of hair.",
                                "One of the things that binds groups of monkeys together is grooming."
                            ]
                        },
                        {
                            "explanation": "the act of making the surface of snow smoother, flatter, or harder so that it is easier to ski on: ",
                            "examples": [
                                "Immaculate piste grooming maintains the snow in good condition.",
                                "The bunkers are used to store equipment like trail grooming machines. "
                            ]
                        },
                        {
                            "explanation": "the criminal activity of becoming friends with a child in order to try to persuade the child to have a sexual relationship",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}