{
    "word": "group",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡruːp"
                            ],
                            "us": [
                                "ɡruːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a number of people or things that are put together or considered as a unit: ",
                            "examples": [
                                "I'm meeting a group of friends for dinner tonight.",
                                "The car was parked near a small group of trees.",
                                "She showed me another group of pictures, this time of children playing."
                            ]
                        },
                        {
                            "explanation": "a number of people who play music together, especially pop music: ",
                            "examples": [
                                "What's your favourite group?",
                                "a pop/rock group"
                            ]
                        },
                        {
                            "explanation": "a business that contains several different companies: ",
                            "examples": [
                                "United News Media, the national newspaper and television group"
                            ]
                        },
                        {
                            "explanation": "a number of football teams who play each other in a competition. The winners of the group move onto the next stage of the competion : ",
                            "examples": [
                                "The Danes were the surprise winners of their group."
                            ]
                        },
                        {
                            "explanation": "the first part of a football competition in which teams are divided into groups and play only the other teams in their group. The winners of each group move onto the next stage of the competition: ",
                            "examples": [
                                "The team failed to progress beyond the group stages of Euro 2012."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡruːp"
                            ],
                            "us": [
                                "ɡruːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to form a group or put people or things into a group: ",
                            "examples": [
                                "We all grouped together around the bride for a family photograph.",
                                "I grouped the children according to age.",
                                "The books were grouped by size."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}