{
    "word": "guarantee",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌɡær.ənˈtiː"
                            ],
                            "us": [
                                "ˌɡer.ənˈtiː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a promise that something will be done or will happen, especially a written promise by a company to repair or change a product that develops a fault within a particular period of time: ",
                            "examples": [
                                "The system costs £99.95 including shipping and handling and a twelve-month guarantee.",
                                "The TV comes with/has a two-year guarantee.",
                                "a money-back guarantee",
                                "The United Nations has demanded a guarantee from the army that food convoys will not be attacked.",
                                "There is no guarantee (that) the discussions will lead to a deal.",
                                "A product as good as that is a guarantee of commercial success (= it is certain to be successful).",
                                "The shop said they would replace the television since it was still under guarantee."
                            ]
                        },
                        {
                            "explanation": "a formal agreement to take responsibility for something, such as the payment of someone else's debt",
                            "examples": []
                        },
                        {
                            "explanation": "something valuable that you give to someone temporarily while you do what you promised to do for them, and that they will keep if you fail to do it",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌɡær.ənˈtiː"
                            ],
                            "us": [
                                "ˌɡer.ənˈtiː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a product is guaranteed, the company that made it promises to repair or change it if a fault develops within a particular period of time: ",
                            "examples": [
                                "The fridge is guaranteed for three years."
                            ]
                        },
                        {
                            "explanation": "to promise that something will happen or exist: ",
                            "examples": [
                                "European Airlines guarantees its customers top-quality service.",
                                "The label on this bread says it is guaranteed free of/from preservatives (= it contains no preservatives)."
                            ]
                        },
                        {
                            "explanation": "If you guarantee someone's debt, you formally promise to accept the responsibility for that debt if the person fails to pay it.",
                            "examples": []
                        },
                        {
                            "explanation": "If something guarantees something else, it makes certain that it will happen: ",
                            "examples": [
                                "The £50 deposit guarantees (that) people return the boats after their hour has finished."
                            ]
                        },
                        {
                            "explanation": "If something is guaranteed to happen or have a particular result, it is certain that it will happen or have that result: ",
                            "examples": [
                                "Just looking at a picture of the sea is guaranteed to make me feel sick."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}