{
    "word": "guard",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡɑːd"
                            ],
                            "us": [
                                "ɡɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person or group of people whose job is to protect a person, place, or thing from danger or attack, or to prevent a person such as a criminal from escaping: ",
                            "examples": [
                                "prison guards",
                                "security guards",
                                "There are guards posted (= standing and watching) at every entrance.",
                                "Armed guards are posted around the site.",
                                "The frontier is patrolled by border guards."
                            ]
                        },
                        {
                            "explanation": "to be kept in a place by a group of people who have weapons: ",
                            "examples": [
                                "The ex-president was under armed guard in the palace."
                            ]
                        },
                        {
                            "explanation": "to be responsible for protecting someone or something, or for preventing someone from escaping: ",
                            "examples": [
                                "Two of the soldiers kept guard over the captured guns."
                            ]
                        },
                        {
                            "explanation": "a ceremony in which a group of soldiers replaces the soldiers who have finished their time on duty standing outside an important public building, such as a palace (= a building where a king or queen lives): ",
                            "examples": [
                                "The band played the national anthem during the changing of the guard."
                            ]
                        },
                        {
                            "explanation": "a time when a new person or group starts to be in control of a society, organization, etc. with the result that there are a lot of changes: ",
                            "examples": [
                                "His resignation as Secretary of State marks the beginning of a changing of the guard in Washington."
                            ]
                        },
                        {
                            "explanation": "a railway official who travels on and is responsible for a train",
                            "examples": []
                        },
                        {
                            "explanation": "a device that protects a dangerous part of something or that protects something from getting damaged: ",
                            "examples": [
                                "a fire guard",
                                "a trigger guard",
                                "The helmet has a face guard attached."
                            ]
                        },
                        {
                            "explanation": "in basketball, one of the two positions taken by players who are especially skilful and good at shooting: ",
                            "examples": [
                                "The 5'8\" guard became the first Japanese player in the NBA."
                            ]
                        },
                        {
                            "explanation": "in American football, a player who plays next to the centre and tries to stop players from the opposing team reaching his quarterback (= the player who directs play): ",
                            "examples": [
                                "Williams started nine games at left/right guard.",
                                "He played offensive guard for the university team."
                            ]
                        },
                        {
                            "explanation": "in boxing and other fighting sports, a position in which you hold your arms up to protect yourself from hits from the opposing fighter: ",
                            "examples": [
                                "A more skilled boxer can evade him, pound his ribs to slow him down and make him drop his guard.",
                                "In the seventh round, Moore let his guard down and was floored."
                            ]
                        },
                        {
                            "explanation": "in curling (= a sport played on ice in which stones are slid towards a target), a stone that is slid into a position where it can protect the team's other stones from being hit: ",
                            "examples": [
                                "The GB team puts a guard stone up, but Norway bashes it away."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡɑːd"
                            ],
                            "us": [
                                "ɡɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to protect someone or something from being attacked or stolen: ",
                            "examples": [
                                "Soldiers guard the main doors of the embassy."
                            ]
                        },
                        {
                            "explanation": "to watch someone and make certain they do not escape from a place: ",
                            "examples": [
                                "Five prison officers guarded the prisoners."
                            ]
                        },
                        {
                            "explanation": "to keep information secret: ",
                            "examples": [
                                "Journalists jealously (= carefully) guard their sources of information."
                            ]
                        },
                        {
                            "explanation": "in sports such as American football and basketball, to prevent a member of the opposing team from taking control of the ball by staying close to them all the time: ",
                            "examples": [
                                "Who is your most challenging player to guard? "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡɑːd"
                            ],
                            "us": [
                                "ɡɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "informal for \nthe National Guard ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}