{
    "word": "guest",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡest"
                            ],
                            "us": [
                                "ɡest"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who is staying with you, or a person you have invited to a social occasion, such as a party or a meal: ",
                            "examples": [
                                "150 guests were invited to the wedding.",
                                "We have guests staying this weekend.",
                                "Is he on the guest list?",
                                "He is a paying guest (= he pays for the use of a room in someone's home)."
                            ]
                        },
                        {
                            "explanation": "a person who is staying in a hotel: ",
                            "examples": [
                                "We would like to remind all our guests to leave their keys at reception before they depart."
                            ]
                        },
                        {
                            "explanation": "a person who is not a member of something such as a club or website, but is allowed to use it: ",
                            "examples": [
                                "Non-members may use club facilities as a guest for a small fee.",
                                "Please log in using your password, or click here to continue as a guest."
                            ]
                        },
                        {
                            "explanation": "a person, such as an entertainer, who has been invited to appear on a television or radio programme, or to help perform or produce something: ",
                            "examples": [
                                "Our special guest on the programme tonight is Robert de Niro.",
                                "Madonna made a guest appearance at the concert.",
                                "Simon Rattle will be the guest conductor with the London Symphony Orchestra."
                            ]
                        },
                        {
                            "explanation": "something such as an animal that is living in a place, especially where it is not wanted: ",
                            "examples": [
                                "Warm weather is the ideal breeding ground for bacteria — an unwanted guest at any cookout or picnic.",
                                "Foreclosed houses around the country have been colonized by stray dogs, rats and other uninvited guests. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡest"
                            ],
                            "us": [
                                "ɡest"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a person, especially an entertainer, guests on a programme or show, they are invited to appear or perform on it: ",
                            "examples": [
                                "He guests on their latest video."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}