{
    "word": "guide",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡaɪd"
                            ],
                            "us": [
                                "ɡaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a book that gives you the most important information about a particular subject: ",
                            "examples": [
                                "a hotel/wine guide",
                                "We've compiled a guide to all the fun events taking place around the French capital."
                            ]
                        },
                        {
                            "explanation": "a guidebook: ",
                            "examples": [
                                "We recommend you buy a reputable guide to Spain before travelling there.",
                                "All major travel guides agree on a five-star rating system."
                            ]
                        },
                        {
                            "explanation": "something that helps you form an opinion or make a decision about something else: ",
                            "examples": [
                                "I never follow recipes exactly when I cook - I just use them as rough guides."
                            ]
                        },
                        {
                            "explanation": "a person whose job is showing a place or a particular route to visitors: ",
                            "examples": [
                                "We hired a guide to take us up into the mountains.",
                                "Our tour guide recommended some good places to eat in the area. "
                            ]
                        },
                        {
                            "explanation": "a person or thing that influences what you do or think: ",
                            "examples": [
                                "Let your conscience be your guide."
                            ]
                        },
                        {
                            "explanation": "the screen on a television that shows you a list of all the programmes that are available and where and when they are broadcast: ",
                            "examples": [
                                "The guide allows you to browse scheduled programmes across time, date, and channel.",
                                "Select \"Guide\" from the main menu.",
                                "The remote control has a Guide button."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɡaɪd"
                            ],
                            "us": [
                                "ɡaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to show someone how to do something difficult: ",
                            "examples": [
                                "Our lawyer guided us through the more complicated questions on the form."
                            ]
                        },
                        {
                            "explanation": "to show people around a place: ",
                            "examples": [
                                "The curator guided us through the gallery, pointing out the most famous paintings in the collection.",
                                "Samira gave us a guided tour of the city."
                            ]
                        },
                        {
                            "explanation": "to take someone somewhere or to show someone how to get somewhere: ",
                            "examples": [
                                "The shop assistant guided me to the shelf where the gardening books were displayed.",
                                "The runway lights guide the plane in to land."
                            ]
                        },
                        {
                            "explanation": "to take hold of part of someone's body, especially their arm, and take that person somewhere: ",
                            "examples": [
                                "He took my arm and guided me to the bar."
                            ]
                        },
                        {
                            "explanation": "to make something move in the direction in that you want it to go: ",
                            "examples": [
                                "The pilot guided the plane onto the runway.",
                                "She guided the child's head and arms into the T-shirt."
                            ]
                        },
                        {
                            "explanation": "to influence someone's behaviour: ",
                            "examples": [
                                "Trust your own judgment and don't be guided by what anyone else thinks."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɡaɪd"
                            ],
                            "us": [
                                "ɡaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a girl between ten and 14 years old who is a member of the Guides organization",
                            "examples": []
                        },
                        {
                            "explanation": "an international organization for young women that encourages them to take part in different activities and to become responsible and independent: ",
                            "examples": [
                                "In the Guides, you can work towards various Interest Badges."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}