{
    "word": "hack",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "hæk"
                            ],
                            "us": [
                                "hæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut into pieces in a rough and violent way, often without aiming exactly: ",
                            "examples": [
                                "Three villagers were hacked to death in a savage attack.",
                                "The butcher hacked off a large chunk of meat.",
                                "The article had been hacked about (= carelessly changed) so much that it was scarcely recognizable."
                            ]
                        },
                        {
                            "explanation": "in football, to foul (= act against the rules) by kicking another player in the leg in a violent way: ",
                            "examples": [
                                "He was twice hacked down in the second half by the other team's sweeper."
                            ]
                        },
                        {
                            "explanation": "in rugby, to kick the ball when it is loose on the ground: ",
                            "examples": [
                                "The scrum-half hacked the ball through for the winger to run on to."
                            ]
                        },
                        {
                            "explanation": "to hit at a golf ball in a rough and violent way, often without aiming exactly: ",
                            "examples": [
                                "Most of us who hack our way around the golf course hope one day to be skilled golfers.",
                                "He was hacking desperately in the deep rough.",
                                "They had to hack their next shots out of the rough.",
                                "They have invited me to hack around with them sometime on the course."
                            ]
                        },
                        {
                            "explanation": "to get into someone else's computer system without permission in order to find out information or do something illegal: ",
                            "examples": [
                                "Computer hacking has become widespread over the last decade.",
                                "A programmer had managed to hack into some top-secret government data.",
                                "He claimed they had spied on him and tried to hack his computer."
                            ]
                        },
                        {
                            "explanation": "to use someone else's phone system without permission, especially to listen to their spoken messages: ",
                            "examples": [
                                "Police told the actor that his phone had been hacked."
                            ]
                        },
                        {
                            "explanation": "to manage to deal successfully with something: ",
                            "examples": [
                                "I tried working on the night shift for a while, but I just couldn't hack it."
                            ]
                        },
                        {
                            "explanation": "to ride a horse for pleasure",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hæk"
                            ],
                            "us": [
                                "hæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a journalist (= writer for newspapers or magazines) whose work is low in quality or does not have much imagination: ",
                            "examples": [
                                "Fleet Street hacks"
                            ]
                        },
                        {
                            "explanation": "a politician, especially one who is not important: ",
                            "examples": [
                                "tired old party hacks"
                            ]
                        },
                        {
                            "explanation": "a ride on a horse in the countryside",
                            "examples": []
                        },
                        {
                            "explanation": "(the driver of) a car that is available for rent, especially a taxi",
                            "examples": []
                        },
                        {
                            "explanation": "a good solution or piece of advice: ",
                            "examples": [
                                "Here are 50 life hacks that will change your life for the better."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}