{
    "word": "hacked",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nhack ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "hæk"
                            ],
                            "us": [
                                "hæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut into pieces in a rough and violent way, often without aiming exactly: ",
                            "examples": [
                                "Three villagers were hacked to death in a savage attack.",
                                "The butcher hacked off a large chunk of meat.",
                                "The article had been hacked about (= carelessly changed) so much that it was scarcely recognizable."
                            ]
                        },
                        {
                            "explanation": "in football and rugby, to kick the ball away or to foul (= act against the rules) by kicking another player in the leg: ",
                            "examples": [
                                "He was twice hacked down in the second half by the other team's sweeper."
                            ]
                        },
                        {
                            "explanation": "to get into someone else's computer system without permission in order to find out information or do something illegal: ",
                            "examples": [
                                "Computer hacking has become widespread over the last decade.",
                                "A programmer had managed to hack into some top-secret government data.",
                                "He claimed they had spied on him and tried to hack his computer."
                            ]
                        },
                        {
                            "explanation": "to use someone else's phone system without permission, especially to listen to their spoken messages: ",
                            "examples": [
                                "Police told the actor that his phone had been hacked."
                            ]
                        },
                        {
                            "explanation": "to manage to deal successfully with something: ",
                            "examples": [
                                "I tried working on the night shift for a while, but I just couldn't hack it."
                            ]
                        },
                        {
                            "explanation": "to ride a horse for pleasure",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}