{
    "word": "half",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hɑːf"
                            ],
                            "us": [
                                "hæf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "either of the two equal or nearly equal parts that together make up a whole: ",
                            "examples": [
                                "\"What's half of 96?\" \"48.\"",
                                "Roughly half (of) the class are Spanish and the others are a mixture of nationalities.",
                                "Cut the apple in half/into halves (= into two equal parts).",
                                "My little brother is half as tall as me/half my height.",
                                "Can you get me half a dozen (= six) eggs, please?",
                                "Half of me would just like to give it all up and travel around the world (= partly I would like to, but partly I would not).",
                                "She was born in the latter half of the 18th century.",
                                "The recipe tells you to use a pound and a half of butter."
                            ]
                        },
                        {
                            "explanation": "a lot: ",
                            "examples": [
                                "She invited a lot of people to the party but half of them didn't turn up.",
                                "I don't even know where she is half (of) the time."
                            ]
                        },
                        {
                            "explanation": "Half past a particular hour is 30 minutes later than that hour: ",
                            "examples": [
                                "I'll meet you at half past nine (= 09.30 or 21.30)."
                            ]
                        },
                        {
                            "explanation": "only partly: ",
                            "examples": [
                                "He answered the door half naked.",
                                "I was half expecting to see her at the party.",
                                "I'm half inclined to take the job just because it's in Argentina.",
                                "He was being funny but I think he was half serious.",
                                "The bottle's half empty."
                            ]
                        },
                        {
                            "explanation": "to divide the cost of something with someone: ",
                            "examples": [
                                "Shall we go halves on a bottle of champagne?"
                            ]
                        },
                        {
                            "explanation": "equal amounts of two different things: ",
                            "examples": [
                                "The waste is mixed half and half with reclaimed wood and turned into decking."
                            ]
                        },
                        {
                            "explanation": "50 percent more of the existing number or amount: ",
                            "examples": [
                                "Last year, we raised almost £15,000. This year we raised about half as much again."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hɑːf"
                            ],
                            "us": [
                                "hæf"
                            ],
                            "uk_other_tense": [
                                "hɑːvz"
                            ],
                            "us_other_tense": [
                                "hævz"
                            ],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "either of two periods of time into which a game is divided: ",
                            "examples": [
                                "He has only made one NFL start and was pulled out after an ineffective first half."
                            ]
                        },
                        {
                            "explanation": "in team sports, either of the two halves into which the playing area is divided: ",
                            "examples": [
                                "His attacking instincts often find him playing in the opposition's half.",
                                "A long kick allowed Bath to break into the Bristol half. ",
                                "We're giving away too many silly fouls, especially in our own half."
                            ]
                        },
                        {
                            "explanation": "in team sports such as football, rugby, and hockey, a player who plays mostly in the middle of the playing area: ",
                            "examples": [
                                "They have two young halves, who will only get better.",
                                "The halves played close in front of the defending centre-half."
                            ]
                        },
                        {
                            "explanation": "in golf, a score for a hole that is the same as your opponent's score: ",
                            "examples": [
                                "She holed from six feet for a half at the seventeenth.",
                                "It was only with an 18-inch putt for a half at the 15th that he claimed the match, and his team's victory. "
                            ]
                        },
                        {
                            "explanation": "half a pint of a drink, especially beer: ",
                            "examples": [
                                "A pint of lager and two halves, please."
                            ]
                        },
                        {
                            "explanation": "a ticket that is cheaper because it is for a child: ",
                            "examples": [
                                "Two (adults) and three halves to Manchester, please."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}