{
    "word": "handle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhæn.dəl"
                            ],
                            "us": [
                                "ˈhæn.dəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a part of an object designed for holding, moving, or carrying the object easily: ",
                            "examples": [
                                "a door handle",
                                "the handle on a suitcase",
                                "I can't pick the kettle up - the handle's too hot.",
                                "She turned the handle and slowly opened the door."
                            ]
                        },
                        {
                            "explanation": "a name of a person or place, especially a strange one: ",
                            "examples": [
                                "That's some handle to go through life with!"
                            ]
                        },
                        {
                            "explanation": "a name that someone is known by on the social media website Twitter™ : ",
                            "examples": [
                                "Twitter handles start with an @ sign.",
                                "You can follow the team on Twitter under the handle @ManUtd."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈhæn.dəl"
                            ],
                            "us": [
                                "ˈhæn.dəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to deal with, have responsibility for, or be in charge of: ",
                            "examples": [
                                "I thought he handled the situation very well.",
                                "Some people are brilliant with computers, but have no idea how to handle (= behave with) other people.",
                                "If you can't handle the job I'll get someone else to do it.",
                                "Who handles the marketing in your company?"
                            ]
                        },
                        {
                            "explanation": "to pick something up and touch, hold, or move it with your hands: ",
                            "examples": [
                                "Always wash your hands before handling food.",
                                "Please don't handle the vases - they're very fragile."
                            ]
                        },
                        {
                            "explanation": "to operate or control something that could be difficult or dangerous: ",
                            "examples": [
                                "Have you ever handled a gun before?"
                            ]
                        },
                        {
                            "explanation": "If a car handles well, it is easy and pleasant to drive.",
                            "examples": []
                        },
                        {
                            "explanation": "to buy and sell goods: ",
                            "examples": [
                                "We only handle cosmetics that have not been tested on animals.",
                                "He's been arrested for handling stolen goods."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}