{
    "word": "hand",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hænd"
                            ],
                            "us": [
                                "hænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part of the body at the end of the arm that is used for holding, moving, touching, and feeling things: ",
                            "examples": [
                                "All their toys are made by hand.",
                                "I delivered her invitation by hand (= not using the postal service).",
                                "Get your hands off (= stop touching) my bike!",
                                "He can fix anything - he's so good with his hands.",
                                "You have to hold my hand when we cross the road.",
                                "They walked by, holding hands.",
                                "Hold your fork in your left hand and your knife in your right hand.",
                                "She sat, pen in hand (= with a pen in her hand), searching for the right words.",
                                "They can't keep their hands off each other - they never stop kissing and cuddling.",
                                "\"Congratulations!\" she said and shook my hand.",
                                "The politican shook every single rally attendee by the hand.",
                                "The players from each side lined up and shook hands (with each other).",
                                "She took me by the hand and led me into the cave.",
                                "Wash hand towels once a week. "
                            ]
                        },
                        {
                            "explanation": "one of the long, thin pieces that point to the numbers on a clock or watch: ",
                            "examples": [
                                "Does anyone have a watch with a second hand?"
                            ]
                        },
                        {
                            "explanation": "a (single part of a) game of cards, or the set of cards that a player has in a game: ",
                            "examples": [
                                "Who wants to play a hand of poker?",
                                "You dealt me an appalling hand in that game."
                            ]
                        },
                        {
                            "explanation": "If you have good hands, you have the ability to use your hands to do something well: ",
                            "examples": [
                                "You want a fielder with good hands at shortstop. ",
                                "You can trust a goalie who has sure hands to keep her team in the game. "
                            ]
                        },
                        {
                            "explanation": "help with doing something that needs a lot of effort: ",
                            "examples": [
                                "Would you like a hand carrying those bags?",
                                "Could you give/lend me a hand (with the table), please?",
                                "I think Matthew might need a hand with his maths homework.",
                                "I could really use a hand with these accounts if you could spare a moment."
                            ]
                        },
                        {
                            "explanation": "a person who does physical work or is skilled or experienced in something: ",
                            "examples": [
                                "How many extra hands will we need to help with the harvest?",
                                "I joined the firm as a factory hand and gradually worked my way up to the top."
                            ]
                        },
                        {
                            "explanation": "a sailor: ",
                            "examples": [
                                "All hands on deck!"
                            ]
                        },
                        {
                            "explanation": "involvement in or influence over an event: ",
                            "examples": [
                                "It is not thought that terrorists had a hand in the explosion."
                            ]
                        },
                        {
                            "explanation": "clapping for a performer: ",
                            "examples": [
                                "So please give a big hand to (= welcome with clapping) your host for the evening, Bill Cronshaw!"
                            ]
                        },
                        {
                            "explanation": "a person's writing: ",
                            "examples": [
                                "an uneven hand"
                            ]
                        },
                        {
                            "explanation": "a unit for measuring the height of a horse up to its shoulder: ",
                            "examples": [
                                "One hand equals four inches (= 10.16 centimetres)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "hænd"
                            ],
                            "us": [
                                "hænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something into someone's hand from your own hand: ",
                            "examples": [
                                "The waiter smiled politely as he handed me my bill/handed my bill to me.",
                                "Please read this memo carefully and hand it on (to your colleagues)."
                            ]
                        },
                        {
                            "explanation": "in sports such as football or ice hockey, to catch or hit the ball or puck with the hand, in a way that is against the rules: ",
                            "examples": [
                                "The player was penalized for handing the ball. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}