{
    "word": "hang",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "hæŋ"
                            ],
                            "us": [
                                "hæŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fasten or support something at the top leaving the other parts free to move, or to be held in this way: ",
                            "examples": [
                                "A heavy gold necklace hung around her neck.",
                                "Party decorations hung (down) from the ceiling.",
                                "The curtains hung in thick folds.",
                                "Hang your coat and hat (up) on the rack over there.",
                                "Many of his finest pictures hang/are hung (= are attached to the wall so that they can be seen) in the National Gallery."
                            ]
                        },
                        {
                            "explanation": "If you hang wallpaper, you fix it to the wall.",
                            "examples": []
                        },
                        {
                            "explanation": "to hang up a bird or animal after killing it in order to make the meat relax and have a stronger taste, or to be hung up in this way: ",
                            "examples": [
                                "Hanging meat is really important to the quality of the meat, and is the first stage of good butchery.",
                                "Let the pheasant hang for a few days for the flavour to improve before you cook it."
                            ]
                        },
                        {
                            "explanation": "to kill someone, especially as punishment for a serious crime, by dropping them with a rope tied around their neck, or to die in this way: ",
                            "examples": [
                                "He was found guilty and hanged later that year.",
                                "With so little evidence to prove her guilt, few people thought she should hang.",
                                "The woman tried to hang herself with a sheet."
                            ]
                        },
                        {
                            "explanation": "to stay in the air: ",
                            "examples": [
                                "The falcon seemed to hang in the air for a moment before diving onto its prey.",
                                "Smoke from the houses hung above the village.",
                                "The sound of the bells hung in the midnight air."
                            ]
                        },
                        {
                            "explanation": "to curve down: ",
                            "examples": [
                                "The branches hung heavy with snow.",
                                "He knew he'd done something wrong and hung his head in shame."
                            ]
                        },
                        {
                            "explanation": "to spend time relaxing with a person or in a place: ",
                            "examples": [
                                "Ashley spent most of the evening hanging with her friend.",
                                "Sometimes we just hang in the park."
                            ]
                        },
                        {
                            "explanation": "(of a computer program or system) to stop working or appearing on a screen: ",
                            "examples": [
                                "In the middle of a download, it just hangs.",
                                "The update prevents the system from hanging when it receives a corrupt data fragment."
                            ]
                        },
                        {
                            "explanation": "If a pitcher in baseball hangs the ball, or if the ball hangs, it is thrown badly so that it does not spin very much and it is easy for the batter to hit it hard: ",
                            "examples": [
                                "Weaver hung a curveball, which Garcia hit for a home run.",
                                "His first pitch was a hanging slider."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hæŋ"
                            ],
                            "us": [
                                "hæŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to learn how to do something, especially if it is not obvious or simple: ",
                            "examples": [
                                "\"I've never used this program before.\" \"Don't worry - you'll soon get the hang of it.\""
                            ]
                        },
                        {
                            "explanation": "the way something made of cloth looks when it is hanging: ",
                            "examples": [
                                "That coat fits you so well - the hang is perfect."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}