{
    "word": "hard",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "hɑːd"
                            ],
                            "us": [
                                "hɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not easy to bend, cut, or break: ",
                            "examples": [
                                "a hard surface",
                                "There was a heavy frost last night and the ground is still hard.",
                                "Heating the clay makes it hard."
                            ]
                        },
                        {
                            "explanation": "difficult to understand, do, experience, or deal with: ",
                            "examples": [
                                "There were some really hard questions in the exam.",
                                "It's hard to say which of them is lying.",
                                "It's hard being a single mother.",
                                "Her handwriting is very hard to read.",
                                "He's a hard man to please.",
                                "The topics get harder later in the course.",
                                "I feel sorry for the kids, too - they've had a hard time."
                            ]
                        },
                        {
                            "explanation": "needing or using a lot of physical or mental effort: ",
                            "examples": [
                                "Go on - give it a good hard push!",
                                "It was hard work on the farm but satisfying."
                            ]
                        },
                        {
                            "explanation": "not pleasant or gentle; severe: ",
                            "examples": [
                                "You have to be quite hard to succeed in the property business.",
                                "Ooh, you're a hard woman, Elaine!",
                                "Our boss has been giving us all a hard time at work (= making our time at work difficult).",
                                "Life can be hard at times for these nomadic people."
                            ]
                        },
                        {
                            "explanation": "to criticize someone severely, or to treat someone unfairly: ",
                            "examples": [
                                "Don't be too hard on him - he's new to the job."
                            ]
                        },
                        {
                            "explanation": "A hard drink contains a high level of alcohol: ",
                            "examples": [
                                "Wine, beer and hard liquor can be purchased only at state-run liquor stores."
                            ]
                        },
                        {
                            "explanation": "Hard water contains a high level of minerals that prevent soap from cleaning.",
                            "examples": []
                        },
                        {
                            "explanation": "able to be proved: ",
                            "examples": [
                                "hard facts/evidence"
                            ]
                        },
                        {
                            "explanation": "used to describe a time when there is bad weather: ",
                            "examples": [
                                "We had a very hard winter last year."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "hɑːd"
                            ],
                            "us": [
                                "hɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "with a lot of physical or mental effort: ",
                            "examples": [
                                "Work hard and play hard, that's my motto.",
                                "I'm not surprised he failed his exam - he didn't exactly try very hard!"
                            ]
                        },
                        {
                            "explanation": "If it rains or snows hard, it rains or snows a lot: ",
                            "examples": [
                                "It had been raining hard most of the afternoon."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}