{
    "word": "hardcore",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌhɑːdˈkɔːr"
                            ],
                            "us": [
                                "ˌhɑːrdˈkɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a person) having a very strong belief or interest in something or a lot of determination to do it, sometimes to a degree that most people would consider unreasonable or unacceptable: ",
                            "examples": [
                                "A hardcore faction within the group is thought to have carried out the bombings. ",
                                "We want to develop games that have a broader appeal beyond hard-core gamers.",
                                "The team is pretty hardcore, even practising in the snow."
                            ]
                        },
                        {
                            "explanation": "having extreme qualities that are attractive to people with a very strong belief or interest in something or a lot of determination to do it: ",
                            "examples": [
                                "Hardcore activism is their mission.",
                                "Their sound is hard-core punk."
                            ]
                        },
                        {
                            "explanation": "showing sexual acts clearly and in detail: ",
                            "examples": [
                                "hardcore pornography"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhɑːd.kɔːr"
                            ],
                            "us": [
                                "ˈhɑːrd.kɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small group of people within a larger group, who have a very strong belief or interest in something or a lot of determination to do it, even if most other people consider this unreasonable or unacceptable: ",
                            "examples": [
                                "The hard core of the party has not lost sight of the original ideals.",
                                "A hard-core of drivers still persistently drive when drunk.",
                                "There was a hardcore who came to the festival mostly to fight."
                            ]
                        },
                        {
                            "explanation": "pieces of broken stone, brick, etc. used to make the base under a floor, path, or road: ",
                            "examples": [
                                "The ash from the incinerators is recycled as hardcore for construction.",
                                "The lorries brought in hard core to lay the roads."
                            ]
                        },
                        {
                            "explanation": "a type of extremely fast, loud punk music (= fast, loud, sometimes offensive music that was popular in the late 1970s), often with angry political lyrics (= words): ",
                            "examples": [
                                "We were inspired by early 80s hardcore.",
                                "We play with more sophistication than the heavy-metal, punk, and hard-core bands we listened to in our youth."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}