{
    "word": "harvesting",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhɑː.vɪst.ɪŋ"
                            ],
                            "us": [
                                "ˈhɑːr.vəst.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the activity of picking and collecting crops, or of collecting plants, animals, or fish as food: ",
                            "examples": [
                                "When maize cultivation was introduced it was probably women who did the growing and harvesting of the crops.",
                                "Abalone harvesting has been prohibited in local waters since the mid-1990s.",
                                "Timber harvesting in the boreal forest is huge in scope."
                            ]
                        },
                        {
                            "explanation": "the activity of taking or collecting a useful substance, for example water or a chemical element, from somewhere so that it can be used: ",
                            "examples": [
                                "When we started rainwater harvesting, we used the rainwater for washing, cooking, and drinking.",
                                "The area would be a good site for tidal energy harvesting."
                            ]
                        },
                        {
                            "explanation": "the activity of taking cells or other body parts from someone for medical use: ",
                            "examples": [
                                "There is a lot of controversy surrounding the harvesting of stem cells.",
                                "Large-scale harvesting of eggs from women can be medically risky."
                            ]
                        },
                        {
                            "explanation": "the activity of collecting large quantities of information, especially automatically: ",
                            "examples": [
                                "The company has been accused of unauthorised data harvesting from social media accounts.",
                                "Online users are suspicious of cookies and the harvesting of user information."
                            ]
                        },
                        {
                            "explanation": "the activity of getting an advantage or something valuable from a situation: ",
                            "examples": [
                                "Having spent several years building and adding value to a business, the entrepreneur recovers value through a process of harvesting, selling the business or its assets."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}