{
    "word": "hedging",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhedʒ.ɪŋ"
                            ],
                            "us": [
                                "ˈhedʒ.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a way of avoiding giving a direct answer or opinion: ",
                            "examples": [
                                "There has been too much hedging and delay, and not enough action.",
                                "I notice the hedging in the report, full of \"it could be\" and \"seems\"."
                            ]
                        },
                        {
                            "explanation": "a way of controlling or limiting a loss or risk: ",
                            "examples": [
                                "This type of hedging protects the trader from getting a margin call, as the second position will gain if the first loses, and vice versa. ",
                                "They posted improved profits helped by successful foreign currency hedging.",
                                "You can protect yourself against future rises in interest rates by means of a hedging instrument known as a forward rate agreement."
                            ]
                        },
                        {
                            "explanation": "the act of protecting yourself against loss by supporting more than one possible result or both sides in a competition: ",
                            "examples": [
                                "This could be seen as more hedging of bets by the electorate. "
                            ]
                        },
                        {
                            "explanation": "bushes or small trees planted very close together, especially along the edges of a garden, field, or road: ",
                            "examples": [
                                "One of my favourite parts of the garden is a raised lawn, flanked by two lines of yew hedging.",
                                "Make the back of the house secure by using prickly hedging or high fencing."
                            ]
                        },
                        {
                            "explanation": "the activity of planting, cutting, or looking after hedging in a garden, field, etc.: ",
                            "examples": [
                                "He did odd jobs for people such as roofing and hedging.",
                                "She keeps busy in the garden with pruning, weeding, digging, and hedging."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}