{
    "word": "help",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "help"
                            ],
                            "us": [
                                "help"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make it possible or easier for someone to do something, by doing part of the work yourself or by providing advice, money, support, etc.: ",
                            "examples": [
                                "How can I help you?",
                                "I wonder if you could help me - I'd like some information about flights to New Zealand.",
                                "My dad said he would help with the costs of (= give part of the cost of) buying a house.",
                                "The $10,000 loan from the bank helped her (to) start her own business.",
                                "I feel that learning English will help (= improve) my chances of promotion at work.",
                                "Nothing can help her now (= her situation is too bad for anyone to be able to improve it)."
                            ]
                        },
                        {
                            "explanation": "If something helps a difficult or painful situation, it improves it or makes it easier or less painful: ",
                            "examples": [
                                "The morphine didn't seem to help (the pain)."
                            ]
                        },
                        {
                            "explanation": "If something or someone helps to do something, that thing or person is one of several reasons for it happening: ",
                            "examples": [
                                "The drought has helped (to) make this a disastrous year for Somalia."
                            ]
                        },
                        {
                            "explanation": "If you can't/couldn't help something, such as acting in a particular way or making a particular remark, you are/were not able to control or stop it: ",
                            "examples": [
                                "It was awful, but I couldn't help laughing."
                            ]
                        },
                        {
                            "explanation": "to give something to someone: ",
                            "examples": [
                                "Can I help you to some more soup?"
                            ]
                        },
                        {
                            "explanation": "to take something for yourself: ",
                            "examples": [
                                "\"Might I have some more bread?\" \"Please, help yourself!\""
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "help"
                            ],
                            "us": [
                                "help"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of helping another person: ",
                            "examples": [
                                "Do you need any help with those boxes?",
                                "Her parents gave her some help with her bank loan (= paid some of it)."
                            ]
                        },
                        {
                            "explanation": "something or someone that helps: ",
                            "examples": [
                                "Having a satnav would be a help.",
                                "He was a great help (to me) while my husband was away."
                            ]
                        },
                        {
                            "explanation": "someone who is employed to clean and do other small jobs: ",
                            "examples": [
                                "a home help"
                            ]
                        },
                        {
                            "explanation": "a person or the people employed to work in someone's home doing cleaning, cooking, caring for children, etc.: ",
                            "examples": [
                                "He was kind to the help.",
                                "You needn't bother with that. The help will gather our dishes."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "help"
                            ],
                            "us": [
                                "help"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "shouted by a person who is asking for someone to come and save them from a dangerous situation",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}