{
    "word": "himself",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "pronoun",
                        "ipa": {
                            "uk": [
                                "hɪmˈself"
                            ],
                            "us": [
                                "hɪmˈself"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a male object of a verb that is the same person or animal as the subject of the verb: ",
                            "examples": [
                                "He'd cut himself shaving.",
                                "Most nights he would cry himself to sleep."
                            ]
                        },
                        {
                            "explanation": "used to emphasize a particular man, boy, or male animal: ",
                            "examples": [
                                "Did you want to talk to the chairman himself, or could his personal assistant help you?",
                                "Tom was going to buy a bookcase, but in the end he made one himself."
                            ]
                        },
                        {
                            "explanation": "If a man or boy does something by himself, he does it alone or without help from anyone else: ",
                            "examples": [
                                "Little Timmy made that snowman all by himself."
                            ]
                        },
                        {
                            "explanation": "for his use only: ",
                            "examples": [
                                "Johnny's got the apartment to himself next week."
                            ]
                        },
                        {
                            "explanation": "not to be, seem, or feel as happy or as healthy as usual: ",
                            "examples": [
                                "Is Tom all right? He doesn't seem quite himself this morning."
                            ]
                        },
                        {
                            "explanation": "used when describing or asking about a man's state of mind when he is physically ill: ",
                            "examples": [
                                "He's well enough in himself - he just can't shake this cold off."
                            ]
                        },
                        {
                            "explanation": "used to refer to an object of a verb that is the same person or animal as the subject of the verb, when referring to a person or animal whose gender is not known or not considered to be important: ",
                            "examples": [
                                "Any fool can teach himself to type.",
                                "When a student needs to leave the classroom, he must sign himself out. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}