{
    "word": "hit and run",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌhɪt ən ˈrʌn"
                            ],
                            "us": [
                                "ˌhɪt ən ˈrʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a road accident in which the driver who caused the accident drives away without helping the other people involved and without telling the police: ",
                            "examples": [
                                "The 24-year-old was the victim of a hit and run, killed by a speeding truck. ",
                                "She was charged in relation to a hit and run after she allegedly left the scene of an accident. "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌhɪt.ənˈrʌn"
                            ],
                            "us": [
                                "ˌhɪt.ənˈrʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "A hit-and-run road accident is one in which the driver who caused the accident drives away without helping the other people involved and without telling the police: ",
                            "examples": [
                                "He struck and killed a pedestrian in a hit-and-run accident.",
                                "A traffic policeman was killed by a hit and run driver."
                            ]
                        },
                        {
                            "explanation": "A hit-and-run military attack needs to happen unexpectedly and quickly in order to be successful: ",
                            "examples": [
                                "Insurgents continued hit-and-run attacks.",
                                "Rebels are launching hit-and-run raids on army positions throughout the country. ",
                                "hit-and-run warfare",
                                "The remaining rebels will melt into the jungle and continue a hit and run war."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌhɪt.ənˈrʌn"
                            ],
                            "us": [
                                "ˌhɪt.ənˈrʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a road accident in which the driver who caused the accident drives away without helping the other people involved and without telling the police: ",
                            "examples": [
                                "Their five-year-old daughter was killed in a hit-and-run.",
                                "Three people were injured in separate hit and runs in Glasgow last night."
                            ]
                        },
                        {
                            "explanation": "in baseball, an occasion when a player who has reached one of the bases (= one of the four positions that a player must reach to score a point) begins to run to the next base as soon as the pitcher throws the ball, expecting that the batter will hit the ball: ",
                            "examples": [
                                "A perfectly executed hit-and-run advanced Kennedy to third base.",
                                "The manager decided to put on a hit-and-run."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}