{
    "word": "hit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "hɪt"
                            ],
                            "us": [
                                "hɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move your hand or an object onto the surface of something so that it touches it, usually with force: ",
                            "examples": [
                                "Teachers are not allowed to hit their pupils.",
                                "This type of glass won't shatter no matter how hard you hit it.",
                                "She hit her thumb with the hammer."
                            ]
                        },
                        {
                            "explanation": "to touch something with sudden force: ",
                            "examples": [
                                "They were going about 60 kilometres an hour when their car hit the tree.",
                                "One journalist was hit in the leg by a stray bullet.",
                                "That new shelf in the bathroom is too low - I just hit my head on it."
                            ]
                        },
                        {
                            "explanation": "to have an unpleasant or negative effect on a person or thing: ",
                            "examples": [
                                "Production has been badly hit by the strike.",
                                "Demand for transatlantic flights has been hit by fears of terrorist attacks."
                            ]
                        },
                        {
                            "explanation": "If an idea or thought hits you, you suddenly think of it: ",
                            "examples": [
                                "That's when it hit me that my life would never be the same again."
                            ]
                        },
                        {
                            "explanation": "to shoot at or bomb a place or person, causing damage or injury: ",
                            "examples": [
                                "Two schools were hit during the air raid.",
                                "He was hit in the neck by a bullet from a sniper.",
                                "Try to hit the middle of the target."
                            ]
                        },
                        {
                            "explanation": "to arrive at a place or position: ",
                            "examples": [
                                "If we turn left at the next junction, we should hit the main road after five miles or so."
                            ]
                        },
                        {
                            "explanation": "to succeed in reaching or achieving something: ",
                            "examples": [
                                "Our profits hit an all-time high of $20 million last year.",
                                "I just can't hit (= sing) those high notes like I used to."
                            ]
                        },
                        {
                            "explanation": "to like someone and become friendly immediately: ",
                            "examples": [
                                "I didn't really hit it off with his friends."
                            ]
                        },
                        {
                            "explanation": "to kill someone: ",
                            "examples": [
                                "Three drug dealers were hit in the city over the weekend."
                            ]
                        },
                        {
                            "explanation": "in cricket, to score runs: ",
                            "examples": [
                                "Walsh hit 10 fours and two sixes in his fourth one-day century.",
                                "Yesterday, he faced 74 balls and hit nine fours and two sixes."
                            ]
                        },
                        {
                            "explanation": "in baseball, to hit the ball with a particular result : ",
                            "examples": [
                                "He hit a career-high 17 home runs last year. ",
                                "In her first at bat, she hit a single."
                            ]
                        },
                        {
                            "explanation": "in baseball, to have a particular batting average (= a number that represents how often a player successfully hits the ball compared to the number of times they have a chance to hit the ball): ",
                            "examples": [
                                "He hit .372 with 6 home runs, 14 RBIs, and 15 runs scored. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hɪt"
                            ],
                            "us": [
                                "hɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thing or person that is very popular or successful: ",
                            "examples": [
                                "The Beatles had a string of number-one hits in the 1960s.",
                                "Your cake was a real hit at the party - everyone commented.",
                                "They've just released an album of their greatest hits (= their most successful songs)."
                            ]
                        },
                        {
                            "explanation": "a request to use a web page on the internet that is then counted to calculate the number of people looking at the page: ",
                            "examples": [
                                "Our page had 243 hits this week."
                            ]
                        },
                        {
                            "explanation": "the act of hitting something or someone, or an occasion when something or someone hits you: ",
                            "examples": [
                                "She gave him a hit on the head which knocked him flying."
                            ]
                        },
                        {
                            "explanation": "in baseball, when the batter (= person trying to hit the ball) safely reaches first base after hitting the ball",
                            "examples": []
                        },
                        {
                            "explanation": "an occasion when something that has been thrown, dropped, shot, etc. at a place or object reaches that place or object: ",
                            "examples": [
                                "The rebel headquarters took a direct hit from a bomb during the attack.",
                                "I scored a hit on my second shot."
                            ]
                        },
                        {
                            "explanation": "an act of murder: ",
                            "examples": [
                                "He was the victim of a mafia hit."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}