{
    "word": "holiday",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhɒl.ə.deɪ"
                            ],
                            "us": [
                                "ˈhɑː.lə.deɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a time when someone does not go to work or school but is free to do what they want, such as travel or relax: ",
                            "examples": [
                                "a camping/skiing holiday",
                                "Have you decided where you're going for your holiday(s) this year?",
                                "Patricia is on holiday next week.",
                                "How many days' holiday do you get with your new job?",
                                "We thought we'd go to France for our summer holiday.",
                                "Surely the school holidays start soon."
                            ]
                        },
                        {
                            "explanation": "an official day when you do not have to go to work or school: ",
                            "examples": [
                                "a public holiday",
                                "St Patrick's Day is a holiday in Ireland."
                            ]
                        },
                        {
                            "explanation": "a time when you are allowed not to make a regular payment such as a mortgage payment (= money that has been lent to buy a house, paid back regularly): ",
                            "examples": [
                                "The flexible features of this mortgage allow the borrower to make overpayments and take payment holidays. ",
                                "We arranged a flexible business loan with a two year capital repayment holiday which gave us the breathing space we needed.",
                                "Struggling homeowners were handed more support as the UK's biggest banks agreed to offer a mortgage holiday to those unable to meet payments."
                            ]
                        },
                        {
                            "explanation": "the time at the end of December and beginning of January each year that includes Christmas, Hanukkah, and New Year : ",
                            "examples": [
                                "We were at home for the holidays."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈhɒl.ə.deɪ"
                            ],
                            "us": [
                                "ˈhɑː.lə.deɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to take a holiday: ",
                            "examples": [
                                "My parents are holidaying in Spain this year."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}