{
    "word": "home",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "həʊm"
                            ],
                            "us": [
                                "hoʊm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the house, apartment, etc. where you live, especially with your family: ",
                            "examples": [
                                "The senator has two homes - an apartment in Washington and a house in Colorado.",
                                "He was living on the streets for three months, and his home was a cardboard box.",
                                "Call me at home after four o'clock.",
                                "women who decide to stay at home and look after their children",
                                "He left home (= stopped living with his parents) when he was 23.",
                                "More and more couples are setting up home together without getting married."
                            ]
                        },
                        {
                            "explanation": "a house, apartment, etc. when it is considered as property that you can buy or sell: ",
                            "examples": [
                                "luxury/starter homes"
                            ]
                        },
                        {
                            "explanation": "the type of family you come from: ",
                            "examples": [
                                "We had a happy home.",
                                "children from a broken home (= from a family in which the parents had separated)"
                            ]
                        },
                        {
                            "explanation": "a place where people or animals live and are cared for by people who are not their relations or owners: ",
                            "examples": [
                                "a children's home/an old people's home/a dogs' home",
                                "He spent his early years in a home."
                            ]
                        },
                        {
                            "explanation": "someone's or something's place of origin, or the place where a person feels they belong: ",
                            "examples": [
                                "I live in London, but my home (= where I was born) is in Greece.",
                                "I was actually born in New Zealand, but I've lived in Hong Kong for so long that it feels like home now."
                            ]
                        },
                        {
                            "explanation": "your own country or your own area: ",
                            "examples": [
                                "She loves France, but she misses home.",
                                "At home we call this \"lardy cake\".",
                                "I wonder what they're doing back at home."
                            ]
                        },
                        {
                            "explanation": "If a sports team are/play at home, they play on their own sports field: ",
                            "examples": [
                                "They lost at home to the Jags but still made the playoffs."
                            ]
                        },
                        {
                            "explanation": "another word for \nhome plate : ",
                            "examples": [
                                "Garcia rounded third base and ran towards home.",
                                "When he reached home, all his teammates were there to mob him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "həʊm"
                            ],
                            "us": [
                                "hoʊm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at or to your house or the place where you live: ",
                            "examples": [
                                "Don't worry, I'll be home soon.",
                                "I'm sorry, he's not home right now.",
                                "The kids were home alone.",
                                "She decided to give up and go home.",
                                "He came home as the dawn was breaking.",
                                "Josh was tired so we took him home.",
                                "I took home a couple of books to read.",
                                "I'll bring everyone home after the party.",
                                "See you when I get home!",
                                "When you get home late you don't feel like cooking.",
                                "If he gets home early, he walks the dog.",
                                "I hope you made it home safely last night? ",
                                "women who decide to stay home and care for their children"
                            ]
                        },
                        {
                            "explanation": "in or to the country or area where you come from: ",
                            "examples": [
                                "We pray all our troops will come home safely.",
                                "I wonder what they're doing back home.",
                                "Back home we call this jelly."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "həʊm"
                            ],
                            "us": [
                                "hoʊm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to the house, flat, etc. where someone lives: ",
                            "examples": [
                                "A lot of people favour home ownership over renting.",
                                "Home improvements can increase the value of your home.",
                                "She struggles to find money for home maintenance."
                            ]
                        },
                        {
                            "explanation": "done at home, or intended to be used at home: ",
                            "examples": [
                                "I prefer simple home cooking to fancy food.",
                                "You can now get groceries delivered to your door via your home computer.",
                                "What's your home telephone number?",
                                "home-brewed beer"
                            ]
                        },
                        {
                            "explanation": "relating to your family or your life at home: ",
                            "examples": [
                                "His home life is affecting his work.",
                                "students who have a difficult home situation"
                            ]
                        },
                        {
                            "explanation": "connected with or done in your own country: ",
                            "examples": [
                                "His books were a success in his home country, but failed to find an audience abroad.",
                                "The company should strengthen its position in the home market before it expands overseas."
                            ]
                        },
                        {
                            "explanation": "relating to the place where a team is based and plays a lot of its games: ",
                            "examples": [
                                "The home team always has an advantage",
                                "The game started badly for the home side.",
                                "The next match will be at their home ground.",
                                "We play our home games on Sundays.",
                                "There's just one home match remaining; the rest are all away.",
                                "home advantage (= the improved chance of success that playing at home gives to a team) ",
                                "the home strip (= clothing worn by a team when they play a home match)"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}