{
    "word": "honour",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɒn.ər"
                            ],
                            "us": [
                                "ˈɑː.nɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a quality that combines respect, being proud, and honesty: ",
                            "examples": [
                                "a man of honour",
                                "We fought for the honour of our country."
                            ]
                        },
                        {
                            "explanation": "in order to celebrate or show great respect for someone or something: ",
                            "examples": [
                                "a banquet in honour of the president"
                            ]
                        },
                        {
                            "explanation": "to feel you must do something because it is morally right, even if you do not want to do it: ",
                            "examples": [
                                "I felt honour bound to tell him the truth."
                            ]
                        },
                        {
                            "explanation": "to make someone proud and happy by doing or being something: ",
                            "examples": [
                                "Would you do me the honour of accompanying me to the New Year Ball?"
                            ]
                        },
                        {
                            "explanation": "the way to address or refer to a judge: ",
                            "examples": [
                                "Yes, Your Honour.",
                                "The case was dealt with by Her Honour Judge Kirkham."
                            ]
                        },
                        {
                            "explanation": "a reward, prize, or title that publicly expresses admiration or respect: ",
                            "examples": [
                                "She received an honour for her services to the community.",
                                "The honours were the personal gift of the Queen."
                            ]
                        },
                        {
                            "explanation": "a university course or degree that is at a higher level than an ordinary one: ",
                            "examples": [
                                "He graduated with a second-class honours degree in physics.",
                                "Normally a student would graduate at the age of 22 after a four-year honours course."
                            ]
                        },
                        {
                            "explanation": "If you complete a school or university qualification with honours, you achieve a high standard: ",
                            "examples": [
                                "She graduated with honours in June 1970."
                            ]
                        },
                        {
                            "explanation": "in golf, the fact of being the first player to hit the ball for a particular hole: ",
                            "examples": [
                                "He had the honour on the tee at the long 12th and hit his best drive.",
                                "If I happen to win a hole, she offers me the honour at the next tee."
                            ]
                        },
                        {
                            "explanation": "a picture card, or a ten in the game of bridge (= card game for four players who play in pairs): ",
                            "examples": [
                                "Rather than start with a low card, many players prefer to lead their top honour.",
                                "She had a long string of hearts including the top honour cards."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈɒn.ər"
                            ],
                            "us": [
                                "ˈɑː.nɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to show great respect for someone or something, especially in public: ",
                            "examples": [
                                "He was honoured for his bravery.",
                                "We are honoured (= proud and happy) to have you here tonight.",
                                "I would be honoured to meet him."
                            ]
                        },
                        {
                            "explanation": "To honour a promise or agreement is to do what you said you would: ",
                            "examples": [
                                "They decided not to honour an existing order for aircraft."
                            ]
                        },
                        {
                            "explanation": "to give someone public praise or a reward: ",
                            "examples": [
                                "He was honoured with a knighthood."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}