{
    "word": "hook",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "hʊk"
                            ],
                            "us": [
                                "hʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a curved device used for catching or holding things, especially one attached to a surface for hanging things on: ",
                            "examples": [
                                "a coat/picture hook",
                                "a boat hook",
                                "a fish hook"
                            ]
                        },
                        {
                            "explanation": "in boxing, a hard swinging hit made with a bent elbow: ",
                            "examples": [
                                "We were taught three punches: the jab, the double jab and the right hook."
                            ]
                        },
                        {
                            "explanation": "in cricket, a hit made by swinging the bat across the front of the body to hit a ball that comes up from the ground towards your shoulders or head: ",
                            "examples": [
                                "She mistimed a hook and was caught. "
                            ]
                        },
                        {
                            "explanation": "in golf, an uncontrolled shot where the ball flies to the left for a right-handed player or to the right for a left-handed player: ",
                            "examples": [
                                "He hit a massive hook out to the right."
                            ]
                        },
                        {
                            "explanation": "a repeated part of a song or piece of music that is particularly pleasing and easy to remember: ",
                            "examples": [
                                "It has to be a great song, with a great hook, great lyrics, and a great melody."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "hʊk"
                            ],
                            "us": [
                                "hʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fasten something with a hook, hang something on a hook, or catch something with a hook: ",
                            "examples": [
                                "He hooked the trailer (= joined it with a hook) to his car.",
                                "How many salmon did you hook (= catch) this afternoon?",
                                "She hooked the shoe (= lifted it with a hook) out of the water."
                            ]
                        },
                        {
                            "explanation": "to have sex for money",
                            "examples": []
                        },
                        {
                            "explanation": "in golf, to hit the ball in an uncontrolled way so that it flies to the left for a right-handed player : ",
                            "examples": [
                                "She hooked the ball into the lake. ",
                                "He hooked his drive through trees at the second hole."
                            ]
                        },
                        {
                            "explanation": "in cricket, to hit a ball that bounces high by swinging the bat across the front of the body: ",
                            "examples": [
                                "He was hit on his right wrist while attempting to hook a short ball. ",
                                "He hooked a bouncer for six. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}