{
    "word": "horn of plenty",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌhɔːn əv ˈplen.ti"
                            ],
                            "us": [
                                "ˌhɔːrn əv ˈplen.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a container in the shape of an animal’s horn, full of fruit and flowers and often used as a table decoration in American homes on Thanksgiving: ",
                            "examples": [
                                "For centrepieces, consider placing a horn of plenty on each table, brimming with fruit or flower petals.",
                                "Overflowing with grapes, pomegranates, and pink roses, this horn of plenty is made from crabapple branches."
                            ]
                        },
                        {
                            "explanation": "something that provides a large amount or supply of something: ",
                            "examples": [
                                "The internet is a horn of plenty that has presented new opportunites for similarly minded individuals with unusual interests.",
                                "These new inventions proved a horn of plenty, making the last decade of the 20th century a golden age for astronomers, astrophysicists, and cosmologists."
                            ]
                        },
                        {
                            "explanation": "a type of mushroom that you can eat and is shaped like a trumpet (= a brass musical instrument consisting of a metal tube with one narrow end, into which the player blows, and one wide end): ",
                            "examples": [
                                "The horn of plenty is a dark brown wild mushroom.",
                                "I picked nearly a kilo of trompettes de la mort - I prefer the French name to the English name \"horn of plenty\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}