{
    "word": "horror",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhɒr.ər"
                            ],
                            "us": [
                                "ˈhɔːr.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an extremely strong feeling of fear and shock, or the frightening and shocking character of something: ",
                            "examples": [
                                "The crowd cried out in horror as the car burst into flames.",
                                "The thought of speaking in front of so many people fills me with horror.",
                                "I then realized to my absolute horror, that I had forgotten the present.",
                                "What the book does convey very successfully is the horror of war."
                            ]
                        },
                        {
                            "explanation": "things that are very shocking or frightening: ",
                            "examples": [
                                "The population now faces the horrors of starvation."
                            ]
                        },
                        {
                            "explanation": "frightening films, TV programmes, books, etc., often with stories about unnatural things happening, for example dead people coming to life: ",
                            "examples": [
                                "With horror, bigger budgets don't necessarily mean better movies.",
                                "In the genre of horror, the character of the monster represents all the dark and horrible qualities of humanity."
                            ]
                        },
                        {
                            "explanation": "a child who behaves very badly: ",
                            "examples": [
                                "Her youngest boy is a little horror."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈhɒr.ər"
                            ],
                            "us": [
                                "ˈhɔːr.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used especially in news reports to describe something extremely unpleasant and shocking: ",
                            "examples": [
                                "Three friends lost their lives in a horror smash as they returned from a trip to the beach.",
                                "He was just 16 when he stumbled across the horror scene after a violent row ended with his mum killing his dad."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}