{
    "word": "how",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "haʊ"
                            ],
                            "us": [
                                "haʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in what way, or by what methods: ",
                            "examples": [
                                "How do we get to the town from here?",
                                "How did you hear about the concert?",
                                "How does this machine work?",
                                "How do you plan to spend your holiday?",
                                "Roz doesn't know how to ride a bicycle.",
                                "It all depends on how you look at it.",
                                "I don't care about fashion, I dress how I please.",
                                "I was horrified to hear about how (= the way) she had been treated.",
                                "How can/could he be so stupid?",
                                "I don't know how anyone could think that way."
                            ]
                        },
                        {
                            "explanation": "used to ask about someone's physical or emotional state: ",
                            "examples": [
                                "How is your mother?",
                                "How are you feeling this morning?"
                            ]
                        },
                        {
                            "explanation": "used in questions that ask what an experience or event was like: ",
                            "examples": [
                                "How was your flight?",
                                "How did you find the lecture? (= did you think it was good)?",
                                "How did you like the concert (= did you enjoy it)?",
                                "She didn't say how far it is (= what the distance is) to her house.",
                                "How long are you going to be (= what amount of time are you going to spend) in the bathroom?",
                                "Do you know how many (= what number of) people are coming?",
                                "How much does this cost (= what is its price)?",
                                "How old is his daughter (= what age is she)?",
                                "\"Can you lift this case?\" \"It depends on how heavy it is.\"",
                                "Do you remember how (= the fact that) we used to see every new film as soon as it came out?"
                            ]
                        },
                        {
                            "explanation": "used for emphasis: ",
                            "examples": [
                                "I can't tell you how pleased I am (= I am very pleased) that you came.",
                                "How (= it is very) nice to see you!",
                                "\"She paid for everything.\" \"How (= that was very) generous.\""
                            ]
                        },
                        {
                            "explanation": "used to emphasize that something is strange, stupid, etc.: ",
                            "examples": [
                                "She let me go on the yacht. How cool is that?"
                            ]
                        },
                        {
                            "explanation": "used to ask someone if they are well and happy: ",
                            "examples": [
                                "\"Hi, Lucy, how are you?\" \"Fine, thanks, how are you?\""
                            ]
                        },
                        {
                            "explanation": "used as greetings: ",
                            "examples": [
                                "I haven't seen you for ages, Carol. How are things?"
                            ]
                        },
                        {
                            "explanation": "used when you want someone to explain what they have just said: ",
                            "examples": [
                                "\"I think we need to reconsider our position.\" \"How do you mean?\""
                            ]
                        },
                        {
                            "explanation": "used when asking if something you have done for someone is satisfactory: ",
                            "examples": [
                                "Let me put a cushion behind your back. How's that?"
                            ]
                        },
                        {
                            "explanation": "used to show that you feel the same way as someone or agree with them: ",
                            "examples": [
                                "\"I'll be so glad when this project is finished.\" \"And how!\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}