{
    "word": "huddle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈhʌd.əl"
                            ],
                            "us": [
                                "ˈhʌd.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to come close together in a group, for example because it is cold: ",
                            "examples": [
                                "Employees huddled round television sets at the company headquarters.",
                                "It was so cold that we huddled together for warmth."
                            ]
                        },
                        {
                            "explanation": "to sit or stand in a bent position with your arms and legs close to your body, especially because of cold or fear: ",
                            "examples": [
                                "Sophie was so frightened by the noise of the fireworks that she huddled (up) in a corner of the room."
                            ]
                        },
                        {
                            "explanation": "to discuss something privately in a small group: ",
                            "examples": [
                                "After huddling with advisors, the president gave a speech.",
                                "We spoke to Democratic lawmakers who are huddling on this issue on Capitol Hill tonight."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhʌd.əl"
                            ],
                            "us": [
                                "ˈhʌd.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small group of people or things that are close together: ",
                            "examples": [
                                "A small group of people stood in a huddle at the bus stop.",
                                "The campsite comprises a huddle of tents on a bend in the river."
                            ]
                        },
                        {
                            "explanation": "to get into a group in order to talk secretly: ",
                            "examples": [
                                "The judges went into a huddle to decide the winner."
                            ]
                        },
                        {
                            "explanation": "a group formed by the members of a sports team in order to have a discussion, before they separate and continue to play: ",
                            "examples": [
                                "I called a huddle and said, \"We're going to do something different this time.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}