{
    "word": "humbug",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhʌm.bʌɡ"
                            ],
                            "us": [
                                "ˈhʌm.bʌɡ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "dishonest talk, writing, or behaviour that is intended to deceive people: ",
                            "examples": [
                                "the usual political humbug",
                                "I know humbug when I see it.",
                                "Her arguments are impeccable and she has absolutely no tolerance for humbug."
                            ]
                        },
                        {
                            "explanation": "a hard sweet, usually with a mint taste and strips of two different colours on the outside: ",
                            "examples": [
                                "mint humbugs"
                            ]
                        },
                        {
                            "explanation": "someone who says they have particular moral beliefs but behaves in way that shows these are not sincere: ",
                            "examples": [
                                "You're all a bunch of humbugs, the lot of you!",
                                "He was a humbug: a former leftist who veered to the extreme right when his own interests were threatened."
                            ]
                        },
                        {
                            "explanation": "said in a critical way to someone who is complaining about something that should be enjoyable, especially Christmas. The expression was used by the character Ebenezer Scrooge in the story \"A Christmas Carol\" by Charles Dickens: ",
                            "examples": [
                                "It's easy to say \"bah humbug\" over the early appearance of Christmas decorations in the shops."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈhʌm.bʌɡ"
                            ],
                            "us": [
                                "ˈhʌm.bʌɡ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to try to make someone give you something, espcially money, by asking for it many times: ",
                            "examples": [
                                "She told her brother she had lost her job to stop him humbugging her for cash.",
                                "They don't like the fact that beggars are humbugging on the streets."
                            ]
                        },
                        {
                            "explanation": "to trick or deceive someone: ",
                            "examples": [
                                "First he humbugs them, and then they pay to hear him tell how he did it!",
                                "They believe we are being humbugged by journalists who should be providing us with reliable information."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}