{
    "word": "hybrid",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈhaɪ.brɪd"
                            ],
                            "us": [
                                "ˈhaɪ.brɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a plant or animal that has been produced from two different types of plant or animal, especially to get better characteristics: ",
                            "examples": [
                                "The garden strawberry is a large-fruited hybrid.",
                                "The animal looks like a hybrid of a zebra and a horse."
                            ]
                        },
                        {
                            "explanation": "something that is a mixture of two very different things: ",
                            "examples": [
                                "His work is an interesting hybrid of popular and classical music."
                            ]
                        },
                        {
                            "explanation": "a vehicle with an engine that uses both petrol and another type of energy, usually electricity: ",
                            "examples": [
                                "Most car manufacturers now offer hybrids."
                            ]
                        },
                        {
                            "explanation": "a bicycle that has a mixture of features of different specialized bicycles, so that it works well in a range of conditions: ",
                            "examples": [
                                "You can rent hybrids, racers, or mountain bikes. ",
                                "A hybrid bike is a good choice for commuting."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈhaɪ.brɪd"
                            ],
                            "us": [
                                "ˈhaɪ.brɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "combining two different things: ",
                            "examples": [
                                "His choreography is described as \"a hybrid mix of mime and circus tricks\"."
                            ]
                        },
                        {
                            "explanation": "used to describe a plant or animal that has been produced from two different types of plant or animal: ",
                            "examples": [
                                "Researchers began developing hybrid agricultural crops to maximize productivity."
                            ]
                        },
                        {
                            "explanation": "used to describe a vehicle with an engine that uses both petrol and another type of energy, usually electricity: ",
                            "examples": [
                                "A hybrid car could save you hundreds of pounds at the petrol pump.",
                                "The law will allow hybrid vehicles to use carpool lanes on motorways."
                            ]
                        },
                        {
                            "explanation": "used to describe a way of working that involves sometimes being physically present and sometimes working at a distance using the internet: ",
                            "examples": [
                                "Hybrid teaching combines traditional in-class teaching with online teaching.",
                                "A hybrid parliament was introduced, with a few MPs present but most contributing to debates remotely."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}