{
    "word": "ice",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "aɪs"
                            ],
                            "us": [
                                "aɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "water that has frozen and become solid, or pieces of this: ",
                            "examples": [
                                "The pond was covered in ice all winter.",
                                "Would you like ice in your juice?",
                                "He slipped on a patch of ice."
                            ]
                        },
                        {
                            "explanation": "an ice cream, especially one bought in a shop: ",
                            "examples": [
                                "The shop sign said \"Drinks, Cakes, Ices!\""
                            ]
                        },
                        {
                            "explanation": "jewellery, especially diamonds",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "aɪs"
                            ],
                            "us": [
                                "aɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cover a cake with icing (= a food made mainly with sugar): ",
                            "examples": [
                                "I've made her a chocolate cake - now I just need to ice it."
                            ]
                        },
                        {
                            "explanation": "to murder someone",
                            "examples": []
                        },
                        {
                            "explanation": "to make the kicker on an American football team wait longer before kicking in an attempt to make it harder for them to succeed: ",
                            "examples": [
                                "The defence called a timeout in order to ice the kicker before the field goal attempt. "
                            ]
                        },
                        {
                            "explanation": "in ice hockey, to hit the puck (= a small, hard rubber disc that is used instead of a ball) from your own team's half of the rink (= playing area) to the other end without it being touched, in a way that is against the rules: ",
                            "examples": [
                                "Pitkanen ices the puck, driving it in before the red line. "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "aɪs"
                            ],
                            "us": [
                                "aɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "abbreviation for Immigration and Customs Enforcement: the US government department that is responsible for making sure that laws on who is allowed to enter, stay in, and work in the US and what is allowed to be brought across US borders are obeyed: ",
                            "examples": [
                                "The senator urged ICE not to deport the woman, who has four young children.",
                                "In a raid by ICE agents on a clothing manufacturer, more than 100 workers were arrested on immigration-related offences."
                            ]
                        },
                        {
                            "explanation": "abbreviation for In Case of Emergency: used as a name for a number stored on a person's mobile phone that other people should call if the person is seriously ill or injured: ",
                            "examples": [
                                "The idea of ICE took off after the 7 July 2005 London bombings.",
                                "Some handsets provide access to a list of ICE contacts directly from the \"locked\" screen."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}