{
    "word": "idea",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "aɪˈdɪə"
                            ],
                            "us": [
                                "aɪˈdiː.ə"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a suggestion or plan for doing something: ",
                            "examples": [
                                "I've had an idea - why don't we go to the coast?",
                                "\"Let's go swimming.\" \"That's a good idea!\"",
                                "If you have any ideas for what I could buy Jack, let me know.",
                                "That's when I first had the idea of starting (= planned to start) my own business.",
                                "I like the idea of living in the countryside but I'm not sure I'd like the reality.",
                                "She's full of bright (= good) ideas.",
                                "It was Kate's idea to hire bikes.",
                                "It's a good idea to take some water with you.",
                                "I think it's often a bad idea to spend money you don't have."
                            ]
                        },
                        {
                            "explanation": "an understanding, thought, or picture in your mind: ",
                            "examples": [
                                "Do you have any idea of what he looks like?",
                                "Can you give me an idea of the cost (= can you tell me approximately how it costs)?",
                                "I don't like the idea of living so far away from my family.",
                                "I haven't the slightest/faintest idea where they've gone.",
                                "I've got a pretty good idea why they left early."
                            ]
                        },
                        {
                            "explanation": "to not know something: ",
                            "examples": [
                                "\"Where's Serge?\" \"I've no idea.\""
                            ]
                        },
                        {
                            "explanation": "a belief or opinion: ",
                            "examples": [
                                "We have very different ideas about disciplining children.",
                                "Dr Leach puts forward the idea that it is impossible to spoil a child.",
                                "I'm not married - where did you get that idea (= what made you believe that)?"
                            ]
                        },
                        {
                            "explanation": "a purpose or reason for doing something: ",
                            "examples": [
                                "The idea of the game is to get rid of all your cards as soon as you can.",
                                "The whole idea (= only purpose) of advertising is to make people buy things.",
                                "The idea behind the lottery is to raise money for good causes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}