{
    "word": "impression",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪmˈpreʃ.ən"
                            ],
                            "us": [
                                "ɪmˈpreʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an idea or opinion of what something or someone is like: ",
                            "examples": [
                                "I didn't get much of an impression of the place because it was dark when we drove through it.",
                                "What was your impression of Charlotte's husband?",
                                "I don't tend to trust first impressions (= the opinion you form when you meet someone or see something for the first time).",
                                "When I first met him I got/had the impression that he was a shy sort of person."
                            ]
                        },
                        {
                            "explanation": "to think that something is true, especially when it is not: ",
                            "examples": [
                                "I was under the impression (that) you didn't get on too well."
                            ]
                        },
                        {
                            "explanation": "the way that something seems, looks, or feels to a particular person: ",
                            "examples": [
                                "It makes/gives/creates a very bad impression if you're late for an interview.",
                                "He likes to give the impression (that) he's terribly popular and has lots of friends."
                            ]
                        },
                        {
                            "explanation": "an attempt at copying another person's manner and speech, etc., especially in order to make people laugh: ",
                            "examples": [
                                "She does a really good impression of the president."
                            ]
                        },
                        {
                            "explanation": "a mark made on the surface of something by pressing an object onto it: ",
                            "examples": [
                                "There were impressions around her ankles made by the tops of her socks."
                            ]
                        },
                        {
                            "explanation": "all the copies of a book that have been printed at the same time without any changes being made: ",
                            "examples": [
                                "This is the second impression of the encyclopedia."
                            ]
                        },
                        {
                            "explanation": "an occasion when someone visits or sees a particular page on the internet: ",
                            "examples": [
                                "The company pointed to a 15 per cent rise in page impressions on its website."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}