{
    "word": "in",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "ɪn"
                            ],
                            "us": [
                                "ɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "inside a container, place, or area, or surrounded or closed off by something: ",
                            "examples": [
                                "Is Mark still in bed?",
                                "I got stuck in a traffic jam for half an hour.",
                                "They live in a charming old house.",
                                "How much is that coat on display in the window (= in the space behind the window of the shop)?",
                                "I've got a pain in my back.",
                                "What's that in your hand?",
                                "I've got something in (= on the surface of) my eye.",
                                "They used to live in Paris, but now they're somewhere in Austria.",
                                "He's always looking at himself in the mirror (= at the image of his face produced by the mirror).",
                                "I never know what's going on in her head (= what she's thinking about).",
                                "My daughter's in hospital (US in the hospital) having her tonsils out.",
                                "Is Erika still in school (= does she still go to school)?"
                            ]
                        },
                        {
                            "explanation": "into something: ",
                            "examples": [
                                "Come on, we're late - get in the car.",
                                "Put the milk back in the fridge when you've finished with it.",
                                "They threw him in the swimming pool."
                            ]
                        },
                        {
                            "explanation": "forming a part of something: ",
                            "examples": [
                                "He used to be the lead singer in a rock band.",
                                "There are too many spelling mistakes in this essay.",
                                "I've been waiting in this queue for ages.",
                                "What do you look for in a relationship?",
                                "I can see a future champion in Joely (= I think that Joely might become a champion).",
                                "Talent like hers is rare in someone so young."
                            ]
                        },
                        {
                            "explanation": "during part or all of a period of time: ",
                            "examples": [
                                "We're going to Italy in April.",
                                "Some trees lose their leaves in (the) autumn.",
                                "I started working here in 2009.",
                                "Life in the 19th century was very different from what it is now.",
                                "Bye, see you in the morning (= tomorrow morning).",
                                "She was a brilliant gymnast in her youth (= when she was young).",
                                "How many civilians died in the Vietnam War?",
                                "This is the first cigarette I've had in three years.",
                                "I haven't had a decent night's sleep in years/ages (= for a long time)."
                            ]
                        },
                        {
                            "explanation": "between the two times mentioned: ",
                            "examples": [
                                "I have breakfast at 7.30, lunch at 1.00, and sometimes a snack in between."
                            ]
                        },
                        {
                            "explanation": "needing or using no more time than a particular amount of time: ",
                            "examples": [
                                "Can you finish the job in two weeks?",
                                "She could get that essay done in a couple of hours if she really tried.",
                                "They completed the journey in record time (= faster than ever done before)."
                            ]
                        },
                        {
                            "explanation": "before or at the end of a particular period: ",
                            "examples": [
                                "Dinner will be ready in ten minutes.",
                                "We'll all be dead in a hundred years so there's no point worrying about it.",
                                "I'm just setting off, so I should be with you in half an hour."
                            ]
                        },
                        {
                            "explanation": "experiencing a situation or condition, or feeling an emotion: ",
                            "examples": [
                                "We watched in horror as they pulled the bodies from the wreckage.",
                                "He's living in luxury in the south of France.",
                                "She left in a bit of a hurry.",
                                "You're in great danger.",
                                "Could I have a word with you in private?",
                                "Have you ever been in love?",
                                "Your car's in very good condition, considering how old it is."
                            ]
                        },
                        {
                            "explanation": "expressed or written in a particular way: ",
                            "examples": [
                                "Cheques should be written in ink.",
                                "She usually paints in watercolour.",
                                "They spoke in Russian the whole time.",
                                "He always talks in a whisper."
                            ]
                        },
                        {
                            "explanation": "used when referring to something that is done as a result of something else: ",
                            "examples": [
                                "I'd like to do something for you in return/exchange for everything you've done for me.",
                                "The changes are in response to demand from our customers.",
                                "He refused to say anything in reply to the journalists' questions."
                            ]
                        },
                        {
                            "explanation": "used to show how things or people are arranged or divided: ",
                            "examples": [
                                "We all sat down in a circle.",
                                "The desks were arranged in rows of ten.",
                                "Discounts are available to people travelling in large groups.",
                                "Sometimes customers buy books in twos and threes, but rarely in larger quantities than that.",
                                "Cut the potatoes in two.",
                                "People are dying in their thousands from cold and starvation."
                            ]
                        },
                        {
                            "explanation": "used when referring approximately to someone's age or the weather temperature: ",
                            "examples": [
                                "Nowadays many women are in their late thirties when they have their first child.",
                                "Temperatures will be in the mid-twenties (= about 25 degrees)."
                            ]
                        },
                        {
                            "explanation": "involved or connected with a particular subject or activity: ",
                            "examples": [
                                "I never knew you were in publishing.",
                                "a degree in philosophy",
                                "advances in medical science"
                            ]
                        },
                        {
                            "explanation": "wearing: ",
                            "examples": [
                                "Do you recognize that man in the grey suit?",
                                "Pat can't resist men in uniform.",
                                "You look nice in green (= green clothes)."
                            ]
                        },
                        {
                            "explanation": "used to compare one part of an amount of something with the total amount of it: ",
                            "examples": [
                                "Apparently one in ten people/one person in ten has problems with reading.",
                                "The basic rate of income tax is 25 pence in (US on) the pound."
                            ]
                        },
                        {
                            "explanation": "used to show which characteristic or part of a person or thing is being described: ",
                            "examples": [
                                "The new version is worse in every respect - I much preferred the original.",
                                "Are the two bags equal in weight?",
                                "She's deaf in her left ear."
                            ]
                        },
                        {
                            "explanation": "used to show when doing one thing is the cause of another thing happening: ",
                            "examples": [
                                "In refusing (= because she refused) to work abroad, she missed an excellent job opportunity.",
                                "The government banned tobacco advertising and, in doing so (= because of this), contributed greatly to the nation's health."
                            ]
                        },
                        {
                            "explanation": "because: ",
                            "examples": [
                                "This research is important in that it confirms the link between aggression and alcohol."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɪn"
                            ],
                            "us": [
                                "ɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "from outside, or towards the centre: ",
                            "examples": [
                                "Could you bring the clothes in for me?",
                                "The roof of their house caved in during a hurricane.",
                                "Cut the pastry into a square and turn in the corners."
                            ]
                        },
                        {
                            "explanation": "to often be staying in a particular place especially to receive treatment or for legal reasons: ",
                            "examples": [
                                "She's been in and out of hospitals ever since the accident."
                            ]
                        },
                        {
                            "explanation": "at home or at work: ",
                            "examples": [
                                "When did you get home? I never heard you come in.",
                                "Mr Ellis isn't in this week."
                            ]
                        },
                        {
                            "explanation": "within an object, area, or substance: ",
                            "examples": [
                                "We've been shut in all day.",
                                "Has the soup got any salt in?"
                            ]
                        },
                        {
                            "explanation": "having arrived at the place where people can get on or off: ",
                            "examples": [
                                "What time is Roz's flight due in?"
                            ]
                        },
                        {
                            "explanation": "given or sent to someone official in order to be read: ",
                            "examples": [
                                "When does your essay have to be in?",
                                "Remember to get your application in by the end of the week."
                            ]
                        },
                        {
                            "explanation": "towards the coast, beach, or harbour: ",
                            "examples": [
                                "The tide comes in very quickly here and you can soon find yourself stranded.",
                                "We stood watching the ship come in."
                            ]
                        },
                        {
                            "explanation": "used to refer to an activity that makes something complete: ",
                            "examples": [
                                "Just pencil in the answer unless you're sure it's correct.",
                                "The text is finished, but the pictures will have to be pasted in later.",
                                "Would you mind filling in a questionnaire about what you watch on television?"
                            ]
                        },
                        {
                            "explanation": "If the ball is in during a game of tennis or a similar sport, it has not gone outside the edges of the area on which the game is played: ",
                            "examples": [
                                "I won that point, I'm telling you! The ball was definitely in!"
                            ]
                        },
                        {
                            "explanation": "taking your turn to play, especially taking your turn to hit the ball: ",
                            "examples": [
                                "Who's in next for our team?",
                                "It started to rain just as our team was going in to bat."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ɪn"
                            ],
                            "us": [
                                "ɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "fashionable or popular: ",
                            "examples": [
                                "High heels are in this season.",
                                "The new jazz club seems to be the in place to go at the moment."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "written abbreviation for \ninch ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "ɪn-"
                            ],
                            "us": [
                                "ɪn-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to add the meaning \"not\", \"lacking\", or \"the opposite of\" to adjectives and to words formed from adjectives: ",
                            "examples": [
                                "incomplete/incompletely",
                                "illegal/illegally",
                                "impossible/impossibly",
                                "irregular/irregularly"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌaɪˈen"
                            ],
                            "us": [
                                "ˌaɪˈen"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "abbreviation for intranasal: through the nose: ",
                            "examples": [
                                "IN drug delivery offers advantages such as ease of administration and rapid onset of action."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "written abbreviation for the US state of Indiana: used in addresses",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -ɪn"
                            ],
                            "us": [
                                " -ɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to form a noun which describes an activity in which many people take part: ",
                            "examples": [
                                "a sit-in/phone-in"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}