{
    "word": "independent",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌɪn.dɪˈpen.dənt"
                            ],
                            "us": [
                                "ˌɪn.dɪˈpen.dənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not influenced or controlled in any way by other people, events, or things: ",
                            "examples": [
                                "An independent enquiry will determine whether the case should move forward.",
                                "The audit will be done by an independent organization.",
                                "They all made the same comment, quite independent of each other (= without deciding together to do so)."
                            ]
                        },
                        {
                            "explanation": "An independent politician does not agree or vote with any particular political party.",
                            "examples": []
                        },
                        {
                            "explanation": "An independent country is not governed or ruled by another country: ",
                            "examples": [
                                "Belize became fully independent from Britain in 1981.",
                                "The 2014 referendum in Scotland focused on a simple \"yes\" or \"no\" question: Should Scotland be an independent country?"
                            ]
                        },
                        {
                            "explanation": "not taking help or money from other people: ",
                            "examples": [
                                "Grandma's very independent and does all her own shopping and cooking.",
                                "I've always been financially independent."
                            ]
                        },
                        {
                            "explanation": "not supported by or part of a larger organization: ",
                            "examples": [
                                "As an independent filmmaker, the best advice I got was to take risks, because nobody will tell you what you can and can't do.",
                                "When you start working as an independent contractor, you give up your entitlement to a pension or any benefits."
                            ]
                        },
                        {
                            "explanation": "An independent grammatical clause forms part of a sentence but can also form a separate sentence.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌɪn.dɪˈpen.dənt"
                            ],
                            "us": [
                                "ˌɪn.dɪˈpen.dənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a politician who does not represent a political party: ",
                            "examples": [
                                "He left the Conservatives and stood as an independent."
                            ]
                        },
                        {
                            "explanation": "a voter who does not belong to a political party: ",
                            "examples": [
                                "She is gaining support among independents who have no political preference or who lean Democratic."
                            ]
                        },
                        {
                            "explanation": "a shop, small business, etc. that is not part of a large company: ",
                            "examples": [
                                "The band would rather sign to an independent than a major record label."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}