{
    "word": "initiative",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪˈnɪʃ.ə.tɪv"
                            ],
                            "us": [
                                "ɪˈnɪʃ.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a new plan or process to achieve something or solve a problem: ",
                            "examples": [
                                "The peace initiative was welcomed by both sides."
                            ]
                        },
                        {
                            "explanation": "the ability to use your judgment to make decisions and do things without needing to be told what to do: ",
                            "examples": [
                                "Although she was quite young, she showed a lot of initiative and was promoted to manager after a year.",
                                "I shouldn't always have to tell you what to do, use your initiative (= use your own judgment to decide what to do)!"
                            ]
                        },
                        {
                            "explanation": "If you do something on your own initiative, you plan it and decide to do it yourself without anyone telling you what to do: ",
                            "examples": [
                                "Some states acted under threat of litigation, and others on their own initiative."
                            ]
                        },
                        {
                            "explanation": "the power or opportunity to win an advantage: ",
                            "examples": [
                                "Leaders must seize/take the initiative rather than following public opinion.",
                                "The team were leading in the first half of the game, but lost the initiative in the second half.",
                                "The ideal candidate for this position will take the initiative to proactively find solutions to problems.",
                                "Legislators have seized the initiative to codify the right into law.",
                                "Rebels seized the initiative and pressed deeper into occupied territory.",
                                "I'm waiting for our team to take the initiative and start scoring, instead of constantly playing defence."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}