{
    "word": "inside",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɪnˈsaɪd"
                            ],
                            "us": [
                                "ˈɪn.saɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part, space, or side of something that is inside: ",
                            "examples": [
                                "Did you clean the inside of the car?",
                                "The hotel looked shabby from the street, but it was fine on the inside.",
                                "the insides of people's houses"
                            ]
                        },
                        {
                            "explanation": "someone's mind, thoughts, or feelings; someone's private self: ",
                            "examples": [
                                "Nobody knows how I really feel on the inside. "
                            ]
                        },
                        {
                            "explanation": "The inside of a part of the body such as the arm or leg is the part facing in towards the rest of the body: ",
                            "examples": [
                                "She dabbed perfume on the inside of her wrist."
                            ]
                        },
                        {
                            "explanation": "a person's or animal's internal organs, especially the stomach or bowels: ",
                            "examples": [
                                "The dead seal's insides were spread all over the snow."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɪnˈsaɪd"
                            ],
                            "us": [
                                "ɪnˈsaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or into a room, building, container, or something similar: ",
                            "examples": [
                                "\"Is Anna in the garden?\" \"No, she's inside (= in the house).\"",
                                "She grabbed the bag and looked inside."
                            ]
                        },
                        {
                            "explanation": "in someone's mind, thoughts, or feelings: ",
                            "examples": [
                                "She couldn't cope with the grief she felt inside.",
                                "He was outwardly calm, but inside he was in turmoil."
                            ]
                        },
                        {
                            "explanation": "in prison: ",
                            "examples": [
                                "Her husband's inside for armed robbery."
                            ]
                        },
                        {
                            "explanation": "In baseball, if a ball that is thrown to a batter is inside, it is thrown towards the side of home plate that is nearest to the batter: ",
                            "examples": [
                                "The fastball was low and inside.",
                                "Pitchers will throw inside sometimes to stop the hitters from getting too comfortable."
                            ]
                        },
                        {
                            "explanation": "If something is inside out, it has the usual inside part on the outside and the usual outside part on the inside: ",
                            "examples": [
                                "She had her sweater on inside out."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "ˌɪnˈsaɪd"
                            ],
                            "us": [
                                "ˌɪnˈsaɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a room, building, container, or something similar: ",
                            "examples": [
                                "What's inside the box?",
                                "Luckily, no one was inside the building when it collapsed."
                            ]
                        },
                        {
                            "explanation": "in someone's mind, thoughts, or feelings: ",
                            "examples": [
                                "Who can tell what goes on inside his head?",
                                "Rage was building up inside her."
                            ]
                        },
                        {
                            "explanation": "within the limits of what is allowed by something, for example the law or a set of rules: ",
                            "examples": [
                                "Investment banks are struggling to find a way of doing business that stays inside the rules.",
                                "We have to work from inside the system to improve outcomes. "
                            ]
                        },
                        {
                            "explanation": "in less than a particular amount of time or under a particular limit: ",
                            "examples": [
                                "The new faster trains can do the journey inside two hours.",
                                "He finished it inside of two hours."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈɪn.saɪd"
                            ],
                            "us": [
                                "ˈɪn.saɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "on or in the inner part of something such as a container or building: ",
                            "examples": [
                                "He put the documents carefully in his inside pocket.",
                                "Butter the inside surface of the tin.",
                                "Moisture can get trapped on the inside layer of glass."
                            ]
                        },
                        {
                            "explanation": "(of information) obtained by someone in a group, organization, or company and therefore involving special or secret knowledge: ",
                            "examples": [
                                "inside information/knowledge",
                                "I'll call up Clare and get the inside story (= a true report of the facts)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}