{
    "word": "installation",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌɪn.stəˈleɪ.ʃən"
                            ],
                            "us": [
                                "ˌɪn.stəˈleɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of putting furniture, a machine, or a piece of equipment into position and making it ready to use : ",
                            "examples": [
                                "Do you have to pay extra for installation?",
                                "There have been calls for the installation of cameras at the junction.",
                                "Among our installations is a solar thermal system for domestic hot water."
                            ]
                        },
                        {
                            "explanation": "the act of putting a computer program onto a computer so that the computer can use it: ",
                            "examples": [
                                "You will receive a message confirming correct installation of the program.",
                                "There's no guaranteed way to block unwanted software installations. "
                            ]
                        },
                        {
                            "explanation": "a place where there are buildings and equipment that have a particular, especially military, purpose: ",
                            "examples": [
                                "a nuclear installation",
                                "The military still have several bases and installations on the island."
                            ]
                        },
                        {
                            "explanation": "an occasion when someone is put in an important job or position: ",
                            "examples": [
                                "The installation of the new archbishop will take place in January."
                            ]
                        },
                        {
                            "explanation": "a form of modern sculpture where the artist uses sound, movement, or space as well as objects in order to make an often temporary work of art: ",
                            "examples": [
                                "The new installation adds an exciting interactive element to the museum's central atrium."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}