{
    "word": "intern",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɪn.tɜːn"
                            ],
                            "us": [
                                "ˈɪn.tɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a doctor working in a hospital who is in their first year after completing their medical degree : ",
                            "examples": [
                                "The popular TV series is about surgical interns doing their residency at a hospital in Seattle.",
                                "He was an intern working the emergency room at a county hospital.",
                                "He first saw a living heart in 1933 while he was a young intern at New Orleans Charity Hospital."
                            ]
                        },
                        {
                            "explanation": "someone who is working for a company or organization for a period of time, sometimes without pay, in order to get experience of a particular type of work: ",
                            "examples": [
                                "She worked in the White House as an intern.",
                                "Hiring interns has helped the company manage its growth while cultivating future employees."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put someone in prison for political or military reasons, especially during a war: ",
                            "examples": [
                                "Many foreigners were interned for the duration of the war."
                            ]
                        },
                        {
                            "explanation": "to work for a company or organization for a period of time, sometimes without pay, in order to get experience of a particular type of work: ",
                            "examples": [
                                "He moved away from marketing after he interned at a cereal company.",
                                "Melvin, who had interned for a rental-car business in college, became a manager in the company."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}