{
    "word": "interest",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɪn.trest"
                            ],
                            "us": [
                                "ˈɪn.trɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the feeling of wanting to give your attention to something or of wanting to be involved with and to discover more about something: ",
                            "examples": [
                                "I've always had an interest in astronomy.",
                                "He never seems to show any interest in his children.",
                                "Unfortunately, I lost interest half way through the film.",
                                "She takes more of an interest in politics these days.",
                                "Just out of interest, how old is your wife?"
                            ]
                        },
                        {
                            "explanation": "Your interests are the activities that you enjoy doing and the subjects that you like to spend time learning about: ",
                            "examples": [
                                "On his form he lists his interests as cycling and cooking."
                            ]
                        },
                        {
                            "explanation": "the quality that makes you think that something is interesting: ",
                            "examples": [
                                "Would this book be of any interest to you?"
                            ]
                        },
                        {
                            "explanation": "something that brings advantages to or affects someone or something: ",
                            "examples": [
                                "A union looks after the interests of its members.",
                                "It's in his interests to keep careful records.",
                                "In the interests of safety, please do not smoke.",
                                "Despite what you think, I'm only acting in your best interests (= doing what is best for you)."
                            ]
                        },
                        {
                            "explanation": "money that is charged by a bank or other financial organization for borrowing money: ",
                            "examples": [
                                "Interest charges on an overdraft are usually quite high."
                            ]
                        },
                        {
                            "explanation": "money that you earn from keeping your money in an account in a bank or other financial organization: ",
                            "examples": [
                                "You should put the money in a savings account where it will earn interest."
                            ]
                        },
                        {
                            "explanation": "an involvement or a legal right, usually relating to a business or possessions: ",
                            "examples": [
                                "He is a multi-millionaire with business interests around the world.",
                                "When they divorced she retained a legal interest in the property."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈɪn.trest"
                            ],
                            "us": [
                                "ˈɪn.trɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If someone or something interests you, you want to give that person or thing your attention and discover more about him, her, or it: ",
                            "examples": [
                                "Sport has never really interested me."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}