{
    "word": "issue",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɪʃ.uː",
                                "ˈɪs.juː"
                            ],
                            "us": [
                                "ˈɪʃ.uː",
                                "ˈɪs.juː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a subject or problem that people are thinking and talking about: ",
                            "examples": [
                                "environmental/ethical/personal issues",
                                "As employers we need to be seen to be addressing (= dealing with) these issues sympathetically.",
                                "Don't worry about who will do it - that's just a side issue (= not the main problem)."
                            ]
                        },
                        {
                            "explanation": "most important in what is being discussed: ",
                            "examples": [
                                "The point at issue is what is best for the child."
                            ]
                        },
                        {
                            "explanation": "to make something seem more important than it should be, or to argue about it: ",
                            "examples": [
                                "Of course I'll help you - there's no need to make an issue of it."
                            ]
                        },
                        {
                            "explanation": "to disagree strongly: ",
                            "examples": [
                                "I took issue with him over his interpretation of the instructions."
                            ]
                        },
                        {
                            "explanation": "to dislike or disapprove of someone or something and let it upset or worry you: ",
                            "examples": [
                                "I feel like my dad has an issue with me having a husband with a different religion."
                            ]
                        },
                        {
                            "explanation": "to have difficulty or disagreement with someone or something: ",
                            "examples": [
                                "All the people in the study had low self-esteem and had issues with their bodies."
                            ]
                        },
                        {
                            "explanation": "a set of newspapers or magazines published at the same time or a single copy of a newspaper or magazine: ",
                            "examples": [
                                "There's an article on motorbikes in the latest/next issue.",
                                "An old issue of \"Homes and Gardens\" lay on the table."
                            ]
                        },
                        {
                            "explanation": "An issue of shares is a time when a company gives people the chance to buy part of it or gives extra shares to people who already own some.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈɪʃ.uː",
                                "ˈɪs.juː"
                            ],
                            "us": [
                                "ˈɪʃ.uː",
                                "ˈɪs.juː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to produce or provide something official: ",
                            "examples": [
                                "The office will be issuing permits on Tuesday and Thursday mornings.",
                                "The school issued a statement about its plans to the press./The school issued the press with a statement about its plans."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}