{
    "word": "jerk",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dʒɜːk"
                            ],
                            "us": [
                                "dʒɝːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a short sudden movement, or to cause someone or something to do this: ",
                            "examples": [
                                "The car made a strange noise and then jerked to a halt.",
                                "\"What's wrong?\" she asked, jerking her head up."
                            ]
                        },
                        {
                            "explanation": "in weightlifting, to lift the bar quickly, from your shoulders to a position in which the arms are stretched above the head: ",
                            "examples": [
                                "You shouldn't use momentum to jerk the weights instead of lifting.",
                                "They were jerking weights around and clumsily using their backs to lift."
                            ]
                        },
                        {
                            "explanation": "to (force or cause someone or something to) suddenly behave differently, usually by understanding something or becoming active again: ",
                            "examples": [
                                "The shock of losing his job jerked him out of his settled lifestyle."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dʒɜːk"
                            ],
                            "us": [
                                "dʒɝːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a quick sudden movement: ",
                            "examples": [
                                "She pulled the bush out of the ground with a sharp jerk.",
                                "The alarm went off and he woke up with a jerk."
                            ]
                        },
                        {
                            "explanation": "a quick movement in weightlifting, where the competitor lifts the bar from his or her shoulders to a position in which the arms are stretched above the head: ",
                            "examples": [
                                "It’s very easy to let the bar travel backward when learning the jerk.",
                                "Just take the bar off the rack, do a jerk or two and replace it. "
                            ]
                        },
                        {
                            "explanation": "a stupid person, usually a man: ",
                            "examples": [
                                "You stupid jerk! You've just spilled beer all down my new shirt!"
                            ]
                        },
                        {
                            "explanation": "a style of cooking popular in the Caribbean, in which meat is rubbed or marinated (= left covered) in special spices and then cooked, usually on a wood fire: ",
                            "examples": [
                                "Jamaican home cooking includes jerk chicken and goat curry.",
                                "When it comes to jerk spices, the key flavours are scotch bonnet peppers, allspice, and thyme. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}