{
    "word": "job",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dʒɒb"
                            ],
                            "us": [
                                "dʒɑːb"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the regular work that a person does to earn money: ",
                            "examples": [
                                "a temporary/permanent job",
                                "When she left college, she got a job as an editor in a publishing company.",
                                "It's very difficult trying to bring up two children while doing a full-time job.",
                                "He's never managed to hold down (= keep) a steady (= permanent) job.",
                                "She's applied for a job with an insurance company.",
                                "He gave up his job to become a full-time novelist.",
                                "After a disastrous first month in office, many people are beginning to wonder if the new president is up to (= able to do) the job.",
                                "Hundreds of workers could lose their jobs."
                            ]
                        },
                        {
                            "explanation": "without a job: ",
                            "examples": [
                                "How long have you been out of a job?"
                            ]
                        },
                        {
                            "explanation": "a particular piece of work: ",
                            "examples": [
                                "The builders are aiming to get the job done by the end of the month.",
                                "He spent the afternoon doing jobs around the house.",
                                "Will you be able to carry all the shopping back home on your bike, or will it have to be a car job (= will you need the car)?"
                            ]
                        },
                        {
                            "explanation": "something that is your responsibility: ",
                            "examples": [
                                "She believed her job as a politician was to represent the views of her party and the people who voted for her.",
                                "I know it's not my job to tell you how to run your life, but I do think you've made a mistake."
                            ]
                        },
                        {
                            "explanation": "a problem or an activity that is difficult: ",
                            "examples": [
                                "It was a real job getting the wheel off the bike.",
                                "We were only given an hour for the exam, and I had a job finishing it."
                            ]
                        },
                        {
                            "explanation": "an example of a particular type: ",
                            "examples": [
                                "It's an original, not one of those imitation jobs."
                            ]
                        },
                        {
                            "explanation": "a crime in which money or goods are stolen, or an action or activity that is dishonest or unpleasant: ",
                            "examples": [
                                "He was put in prison for five years for doing a bank job.",
                                "He really did a job on her, telling her that he would always love her and then moving to Fiji with someone else."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}