{
    "word": "joint",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "dʒɔɪnt"
                            ],
                            "us": [
                                "dʒɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "belonging to or shared between two or more people: ",
                            "examples": [
                                "a joint bank account",
                                "The project was a joint effort between the two schools (= they worked on it together).",
                                "The two Russian ice skaters came joint second (= they were both given second prize) in the world championships.",
                                "In court, the parents were awarded joint custody of their son (= the right to care for him was shared between them)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "dʒɔɪnt"
                            ],
                            "us": [
                                "dʒɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a place in your body where two bones are connected: ",
                            "examples": [
                                "an elbow/hip/knee joint",
                                "As you become older, your joints get stiffer."
                            ]
                        },
                        {
                            "explanation": "If a joint in the body is out of joint, it has been put or forced out of its correct position by accident: ",
                            "examples": [
                                "I put my shoulder out of joint last weekend lifting heavy boxes."
                            ]
                        },
                        {
                            "explanation": "a place where two things are fastened together: ",
                            "examples": [
                                "Damp has penetrated the joints in the wood panelling."
                            ]
                        },
                        {
                            "explanation": "a large piece of meat that is cooked in one piece: ",
                            "examples": [
                                "a joint of beef/pork"
                            ]
                        },
                        {
                            "explanation": "a piece of meat for cooking, usually containing a bone: ",
                            "examples": [
                                "Fry four chicken joints in a pan with some mushrooms and garlic."
                            ]
                        },
                        {
                            "explanation": "a bar or restaurant that serves food and drink at low prices: ",
                            "examples": [
                                "We had lunch at a hamburger joint and then went to see a movie."
                            ]
                        },
                        {
                            "explanation": "a place where people go for entertainment, especially one that has a bad reputation: ",
                            "examples": [
                                "He owned several bars in the city and ran an illegal gambling joint.",
                                "We arrived at the club just before midnight and the joint was already jumping (= busy)."
                            ]
                        },
                        {
                            "explanation": "a cigarette containing the drug cannabis",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dʒɔɪnt"
                            ],
                            "us": [
                                "dʒɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut meat into large pieces ready for cooking",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}