{
    "word": "joined",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \njoin ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dʒɔɪn"
                            ],
                            "us": [
                                "dʒɔɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to connect or fasten things together: ",
                            "examples": [
                                "A long suspension bridge joins the two islands.",
                                "Join the two pieces together using strong glue.",
                                "The island is joined to the mainland by a road bridge.",
                                "If you join (up) the dots on the paper, you'll get a picture."
                            ]
                        },
                        {
                            "explanation": "If roads or rivers join, they meet at a particular point: ",
                            "examples": [
                                "The A11 joins the M11 south of Cambridge.",
                                "The River Murray and the River Darling join east of Adelaide."
                            ]
                        },
                        {
                            "explanation": "to get involved in an activity or journey with another person or group: ",
                            "examples": [
                                "I don't have time for a drink now, but I'll join you later.",
                                "Why don't you ask your sister if she would like to join us for supper?",
                                "We took the ferry across the Channel and then joined (= got on) the Paris train at Calais.",
                                "If you're buying tickets, please join the queue (= stand at the end of it).",
                                "I'm sure everyone will join me in wishing you a very happy retirement (= everyone else will do this too).",
                                "The police have joined with (= they have begun to work with) the Drug Enforcement Agency in trying to catch major drug traffickers.",
                                "The design company is planning to join up with a shoe manufacturer and create a new line of footwear."
                            ]
                        },
                        {
                            "explanation": "to become a member of an organization: ",
                            "examples": [
                                "I felt so unfit after Christmas that I decided to join a gym.",
                                "It's a great club. Why don't you join?"
                            ]
                        },
                        {
                            "explanation": "to become one of a particular large group of people: ",
                            "examples": [
                                "When I leave school at the end of this month, I'll probably have to join the ranks of the unemployed."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}