{
    "word": "jumped",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \njump ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "dʒʌmp"
                            ],
                            "us": [
                                "dʒʌmp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to push yourself suddenly off the ground and into the air using your legs: ",
                            "examples": [
                                "The children were jumping up and down with excitement.",
                                "She ran across the grass and jumped into the water.",
                                "He had to jump out of an upstairs window to escape.",
                                "Our cat is always jumping up on/onto the furniture."
                            ]
                        },
                        {
                            "explanation": "to push yourself suddenly off the ground in order to go over something: ",
                            "examples": [
                                "Can you jump over/across this stream?",
                                "All the horses are finding it difficult to jump the last fence."
                            ]
                        },
                        {
                            "explanation": "to move or act suddenly or quickly: ",
                            "examples": [
                                "He suddenly jumped to his feet/jumped up and left.",
                                "She jumped in/into a taxi and rushed to the station."
                            ]
                        },
                        {
                            "explanation": "If a noise or action causes you to jump, your body makes a sudden sharp movement because of surprise or fear: ",
                            "examples": [
                                "The loud explosion made everyone jump.",
                                "I almost jumped out of my skin when I heard a loud crash downstairs."
                            ]
                        },
                        {
                            "explanation": "to increase suddenly by a large amount: ",
                            "examples": [
                                "House prices have jumped dramatically.",
                                "The cost of building the road has jumped by 70 percent."
                            ]
                        },
                        {
                            "explanation": "If a story, film, play, etc. jumps, it moves suddenly between different parts of it: ",
                            "examples": [
                                "The movie is about his adult life, but it keeps jumping (back) to when he was a child.",
                                "His talk was hard to follow because he kept jumping from one subject to another."
                            ]
                        },
                        {
                            "explanation": "to avoid or leave out a point or stage from the correct order in a series: ",
                            "examples": [
                                "You have to follow the instructions exactly, you can't just jump a few steps ahead."
                            ]
                        },
                        {
                            "explanation": "to attack someone suddenly: ",
                            "examples": [
                                "They were just walking home when a bunch of guys jumped (on) them."
                            ]
                        },
                        {
                            "explanation": "to go past or away from something illegally or wrongly: ",
                            "examples": [
                                "The police video showed that she had jumped the (traffic) lights.",
                                "Several sailors jumped ship (= left their ship without permission) in New York."
                            ]
                        },
                        {
                            "explanation": "to fail to appear for a court trial after being released until the trial in exchange for payment: ",
                            "examples": [
                                "I'd never have thought Hugh would jump bail."
                            ]
                        },
                        {
                            "explanation": "If a place is jumping, it is crowded and full of life: ",
                            "examples": [
                                "This joint (= place of entertainment) is really jumping tonight."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}