{
    "word": "kink",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kɪŋk"
                            ],
                            "us": [
                                "kɪŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an unwanted twist or bend in a wire, rope, pipe, etc. that is usually straight: ",
                            "examples": [
                                "There was a kink in the pipe.",
                                "Track inspectors were watching for kinks or bending of the steel rails, which can be caused by excessive heat. "
                            ]
                        },
                        {
                            "explanation": "a curved shape in hair that means that it does not hang straight down: ",
                            "examples": [
                                "African American women, tired of trying to fit a white vision of beauty, have learned to love their kinks and curls.",
                                "For years I have straightened my hair, ever since I saw the first kink in it. "
                            ]
                        },
                        {
                            "explanation": "a sore place in a muscle, especially in the neck or back: ",
                            "examples": [
                                "Massage is a marvelous way to work out the kinks in tense muscles.",
                                "Thirty minutes later he was on the awards podium, working the kinks from his muscles and thinking about the next race."
                            ]
                        },
                        {
                            "explanation": "something that is wrong: ",
                            "examples": [
                                "Pete still needs to iron out a few kinks in his game.",
                                "The service is still relatively new, and the kinks - payments that are posted late, sites that are slow and hard to use - haven't been worked out yet."
                            ]
                        },
                        {
                            "explanation": "a strange habit, usually of a sexual nature: ",
                            "examples": [
                                "The movie contains many familiar themes, and a sexual kink or two."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}