{
    "word": "kowtow",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌkaʊˈtaʊ"
                            ],
                            "us": [
                                "ˌkaʊˈtaʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to show respect by going down into a position where your knees are on the floor and then bending your body forward so that your head touches the ground, in a way used especially in the past in China : ",
                            "examples": [
                                "As part of the wedding ceremony, we kowtowed to my parents and to my fiancé's parents.",
                                "They kowtowed before the grave and offered their respects to the dead.",
                                "The visitors knelt to kowtow nine times before the emperor."
                            ]
                        },
                        {
                            "explanation": "to show too much respect to someone in authority, always doing what you are told and changing what you do in order to please them: ",
                            "examples": [
                                "He has never kowtowed to the mainstream, but has remained true to his convictions.",
                                "They were accused of kowtowing to a corrupt government."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌkaʊˈtaʊ"
                            ],
                            "us": [
                                "ˌkaʊˈtaʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the action of going down into a position where your knees are on the floor and then bending your body forward so that your head touches the ground, used to show respect especially in the past in China : ",
                            "examples": [
                                "Kowtows were made to the images of the ancestors.",
                                "The emperor waived the requirement for the ambassadors to perform a ceremonial kowtow."
                            ]
                        },
                        {
                            "explanation": "an action that shows too much respect to someone in authority and tries to please them too much: ",
                            "examples": [
                                "This policy would be a kowtow to the most reactionary elements of the party.",
                                "They said that appeasement would be an ignoble kowtow to a bloody dictatorship."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}