{
    "word": "land",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "lænd"
                            ],
                            "us": [
                                "lænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the surface of the earth that is not covered by water: ",
                            "examples": [
                                "It is cheaper to drill for oil on land than at sea.",
                                "The treaty has led to a dramatic reduction in the number of land-based missiles in Europe.",
                                "The military commanders won't deploy their land forces until they're satisfied that the air attacks have done their job."
                            ]
                        },
                        {
                            "explanation": "an area of ground, especially when used for a particular purpose such as farming or building: ",
                            "examples": [
                                "This sort of land is no good for growing potatoes.",
                                "I always prosecute people who trespass on my land.",
                                "We want to buy a plot of land to build a house."
                            ]
                        },
                        {
                            "explanation": "farms, farming, and the countryside: ",
                            "examples": [
                                "Most of the families lived off the land (= grew their own food, etc.).",
                                "My parents worked (on) the land."
                            ]
                        },
                        {
                            "explanation": "a country: ",
                            "examples": [
                                "a land of ice and snow",
                                "The group want to promote their ideas in schools throughout the land."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "lænd"
                            ],
                            "us": [
                                "lænd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) arrive on the ground or other surface after moving down through the air: ",
                            "examples": [
                                "We should land in Madrid at 7 a.m.",
                                "You can land a plane on water in an emergency.",
                                "The bird landed on my finger.",
                                "The report first landed on my desk this morning."
                            ]
                        },
                        {
                            "explanation": "to arrive on land from the sea: ",
                            "examples": [
                                "We landed at Port Said in the early evening."
                            ]
                        },
                        {
                            "explanation": "to arrive at or appear on a particular website: ",
                            "examples": [
                                "If you click on the link you land on his blog. ",
                                "The allegations attracted a lot of attention when they landed on the Drudge Report site in the morning."
                            ]
                        },
                        {
                            "explanation": "to take goods or people off a ship or aircraft: ",
                            "examples": [
                                "The general's plan involved landing troops behind enemy lines."
                            ]
                        },
                        {
                            "explanation": "to catch a fish with a hook (= curved piece of wire) or net and remove it from the water: ",
                            "examples": [
                                "He landed a huge salmon."
                            ]
                        },
                        {
                            "explanation": "to get or achieve something good, especially in a way that seems easy or unexpected: ",
                            "examples": [
                                "He landed a senior editorial job."
                            ]
                        },
                        {
                            "explanation": "to happen or succeed as intended: ",
                            "examples": [
                                "Some of his jokes didn't really land, but he was pretty funny."
                            ]
                        },
                        {
                            "explanation": "If someone lands a blow or it lands, they hit another person: ",
                            "examples": [
                                "He managed to land more punches than his opponent.",
                                "One blow landed on the right side of his face."
                            ]
                        },
                        {
                            "explanation": "in sport, to make a move that is completed successfully: ",
                            "examples": [
                                "He landed the jump perfectly. ",
                                "He landed five goals from eight attempts. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}