{
    "word": "last",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "lɑːst"
                            ],
                            "us": [
                                "læst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(the person or thing) after everyone or everything else: ",
                            "examples": [
                                "I hate being the last one to arrive at a meeting.",
                                "Our house is the last one on the left before the traffic lights.",
                                "The Mets will surely finish the season in last place (= at the lowest rank of their division).",
                                "I know Johnson finished last in the race, but who was second to last (= the one before the one at the end)?",
                                "I don't know why he bothers to bet - his horses always come in last.",
                                "At the last moment (= as late as possible) he changed his mind.",
                                "He always leaves important decisions to the last (possible) moment (= as late as possible)."
                            ]
                        },
                        {
                            "explanation": "finally: ",
                            "examples": [
                                "I've finished my essay at last!"
                            ]
                        },
                        {
                            "explanation": "the least expected or wanted person or thing: ",
                            "examples": [
                                "Three extra people to feed - that's the last thing I need!"
                            ]
                        },
                        {
                            "explanation": "at the latest time in the day: ",
                            "examples": [
                                "I'll switch on the washing machine last thing so it'll be finished when I get up in the morning."
                            ]
                        },
                        {
                            "explanation": "If you say that it is the last time you will do something, you mean that you will never do it again: ",
                            "examples": [
                                "He never even thanked me, so that's the last time I do him a favour."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "lɑːst"
                            ],
                            "us": [
                                "læst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(being) the only one or part that is left: ",
                            "examples": [
                                "Do you mind if I have the last chocolate?",
                                "I'm down to my last dollar - could I borrow some money for lunch?",
                                "I'm afraid Martha's eaten the last of the ice cream.",
                                "She was the last of the great educational reformers."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "lɑːst"
                            ],
                            "us": [
                                "læst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(being) the most recent or the one before the present one: ",
                            "examples": [
                                "Did you hear the storm last night (= during the previous night)?",
                                "Did you see the news on TV last night (= yesterday evening)?",
                                "They got married last November.",
                                "When was the last time you had a cigarette?",
                                "When did you last have a cigarette?",
                                "She's been working there for the last month (= for the four weeks until now).",
                                "Could you account for your whereabouts on Sunday last?",
                                "The/These last five years have been very difficult for him.",
                                "The last we heard of her, she was working as an English teacher in France.",
                                "Each of her paintings has been better than the last."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "lɑːst"
                            ],
                            "us": [
                                "læst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to continue to exist: ",
                            "examples": [
                                "The meeting lasted two hours.",
                                "The drought lasted for several months.",
                                "They say the snow will last until the end of next week.",
                                "I can't see the ceasefire lasting.",
                                "They haven't had an argument for two weeks, but it's too good to last (= they'll have an argument soon).",
                                "I doubt their enthusiasm will last.",
                                "He's working very efficiently at the moment, but it won't last."
                            ]
                        },
                        {
                            "explanation": "to continue being good or suitable: ",
                            "examples": [
                                "There's no point buying something that isn't going to last.",
                                "The cheaper washing machines should last about five years.",
                                "This pen should last (you) a lifetime if you take care of it.",
                                "Her previous secretary only lasted a month (= left after this period)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}