{
    "word": "latinize",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈlæt.ɪ.naɪz"
                            ],
                            "us": [
                                "ˈlæt̬.ɪn.aɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a word or your speech more similar to Latin, the language used by ancient Romans and as a language of educated people in many European countries in the past: ",
                            "examples": [
                                "Linnaeus was fluent and literate in Latin, and he Latinized his own name from Lin."
                            ]
                        },
                        {
                            "explanation": "to start writing a language or words using the Roman alphabet, the alphabet used for writing most western European languages including English: ",
                            "examples": [
                                "As part of Ataturk's drive to Westernize and secularize Turkey, he Latinised its script."
                            ]
                        },
                        {
                            "explanation": "to make something more similar to or typical of ancient Roman or Latin styles, beliefs, customs, etc.: ",
                            "examples": [
                                "The Romans adapted and Latinised the Greek forms of ornament, Doric, Ionic and Corinthian. ",
                                "The Latins divided the Byzantine Empire amongst themselves and tried unsuccessfully to Latinise Eastern Christians."
                            ]
                        },
                        {
                            "explanation": "to make something more influenced by the cultures and languages of Latin America, the areas of North, South, and Central America where Spanish or Portuguese is spoken, for example because of having a large number of people originally from those areas: ",
                            "examples": [
                                "They are planning to use dulce de leche and other flavourings to Latinise their range of ice creams.",
                                "The growing popularity of the quinceañera is a good example of the Latinizing of American culture."
                            ]
                        },
                        {
                            "explanation": "to make music more similar to styles of music originally from Latin America: ",
                            "examples": [
                                "She energetically Latinised many of the numbers that she sang, even the sumptuous waltz \"Lover\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}