{
    "word": "latinized",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈlæt.ɪ.naɪzd"
                            ],
                            "us": [
                                "ˈlæt̬.ɪn.aɪzd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a word) made more similar to Latin, the language used by ancient Romans and as a language of educated people in many European countries in the past: ",
                            "examples": [
                                "The scientific name of the snowy owl is Nyctea scandiaca, \"scandiaca\" being a Latinized word referring to Scandinavia.",
                                "Many borrowed French words originated in Latin, and some became Latinised in their spelling when they entered English."
                            ]
                        },
                        {
                            "explanation": "(of a language or words) written in the Roman alphabet, the alphabet used for writing most western European languages including English: ",
                            "examples": [
                                "Like Hebrew, Arabic reads from right to left, and its graceful script bears no resemblance to the Latinized lettering of the Western world.",
                                "There was a proposal for the language to become fully Latinised, but this was reversed, leaving Cyrillic the only official script. "
                            ]
                        },
                        {
                            "explanation": "made more similar to or typical of ancient Roman or Latin styles, customs, beliefs, etc.: ",
                            "examples": [
                                "It is believed that the Etruscans becane gradually more Latinized under Roman rule."
                            ]
                        },
                        {
                            "explanation": "influenced by the cultures and languages of Latin America, the areas of North, South, and Central America where Spanish or Portuguese is spoken, for example because of having a large number of people originally from those areas: ",
                            "examples": [
                                "It is the most Latinized city in the county, with Hispanics making up 30 per cent of its residents."
                            ]
                        },
                        {
                            "explanation": "influenced by or similar to styles of music originally from Latin America: ",
                            "examples": [
                                "Their music is a punchy combination of Latinized rock, jazz and funk.",
                                "He did a Latinised cover of \"Every Day I Have The Blues\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}