{
    "word": "latinization",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌlæt.ɪ.naɪˈzeɪ.ʃən"
                            ],
                            "us": [
                                "ˌlæt̬.ɪn.aɪˈzeɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the process of making a word or your speech more similar to Latin, the language used by ancient Romans and as a language of educated people in many European countries in the past, or a word that is made similar to a Latin word: ",
                            "examples": [
                                "Features that are characteristic of his prose style include wordiness, Latinization (e. g. using \"demise\" rather than \"death\"), and frequent use of archaic forms.",
                                "Murray refused to include the word \"appendicitis\" in the dictionary, criticizing ugly Latinisations of words by the medical profession."
                            ]
                        },
                        {
                            "explanation": "the process of starting to write a language or words using the Roman alphabet, the alphabet used for writing most western European languages including English: ",
                            "examples": [
                                "The spread of Russian in the region was assisted by the difficulties experienced in Latinization of local alphabets.",
                                "He strongly objected to the colonial orthographic Latinisation of Kiswahili."
                            ]
                        },
                        {
                            "explanation": "the process of making something more similar to or typical of ancient Roman or Latin styles, beliefs, customs, etc.: ",
                            "examples": [
                                "The opening chapters of the book describe the Latinization of Gaul. "
                            ]
                        },
                        {
                            "explanation": "the process of becoming more influenced by the cultures and languages of Latin America, the areas of North, South, and Central America where Spanish or Portuguese is spoken, for example because of having a large number of people originally from those areas: ",
                            "examples": [
                                "Latinization is driving bigger sales of Latino-influenced drinks in the wider market.",
                                "The San Francisco Jazz Festival will also celebrate the Latinization of California culture.",
                                "We have seen the Latinisation of fast food menus, which now feature Cuban sandwiches and pineapple mango dipping sauce for chicken nuggets."
                            ]
                        },
                        {
                            "explanation": "the process of making music more similar to styles of music originally from Latin America: ",
                            "examples": [
                                "Critics remarked on the growing Latinisation of their sound."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}