{
    "word": "law",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "lɔː"
                            ],
                            "us": [
                                "lɑː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a rule, usually made by a government, that is used to order the way in which a society behaves: ",
                            "examples": [
                                "There are laws against drinking in the street.",
                                "The laws governing the possession of firearms are being reviewed.",
                                "They led the fight to impose laws on smoking.",
                                "Many doctors backed plans for a law banning/to ban all tobacco advertising."
                            ]
                        },
                        {
                            "explanation": "the system of rules of a particular country, group, or area of activity: ",
                            "examples": [
                                "What does the law say about having alcohol in the blood while driving?",
                                "Of course robbery is against the law!",
                                "The judge ruled that the directors had knowingly broken the law.",
                                "You can't take that course of action and remain within the law.",
                                "They have to provide a contract by law.",
                                "It was a detailed study of international human rights law."
                            ]
                        },
                        {
                            "explanation": "the area of knowledge or work that involves studying or working with the law : ",
                            "examples": [
                                "She's going to study law at university.",
                                "a law firm in New York"
                            ]
                        },
                        {
                            "explanation": "the police: ",
                            "examples": [
                                "The law was/were out in force at the demonstration."
                            ]
                        },
                        {
                            "explanation": "When someone goes to law about something, they ask a court to make a legal judgment about it: ",
                            "examples": [
                                "These people were known to be very quick to go to law."
                            ]
                        },
                        {
                            "explanation": "a general rule that states what always happens when the same conditions exist: ",
                            "examples": [
                                "Newton's laws of motion",
                                "the laws of nature/physics",
                                "The first law of (= the most important principle in) politics is - if you're going to lie, don't get found out!"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}