{
    "word": "lead",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "liːd"
                            ],
                            "us": [
                                "liːd"
                            ],
                            "uk_other_tense": [
                                "led"
                            ],
                            "us_other_tense": [
                                "led"
                            ],
                            "other_tense": "past tense and past participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to control a group of people, a country, or a situation: ",
                            "examples": [
                                "I think we've chosen the right person to lead the expedition.",
                                "I've asked Gemma to lead the discussion.",
                                "Who will be leading the inquiry into the accident?"
                            ]
                        },
                        {
                            "explanation": "(especially in sports or other competitions) to be in front, to be first, or to be winning: ",
                            "examples": [
                                "After 30 minutes the challengers were leading by two goals.",
                                "With two laps to go Ngomo led by less than two seconds.",
                                "The Lions are leading the Hawks 28–9."
                            ]
                        },
                        {
                            "explanation": "to cause someone to do something, especially something bad: ",
                            "examples": [
                                "The brochure led me to believe that the price included home delivery.",
                                "It's worrying that such a prominent politician is so easily led.",
                                "He was a weak man, led astray by ambition."
                            ]
                        },
                        {
                            "explanation": "to show the way to a group of people, animals, vehicles, etc. by going in front of them: ",
                            "examples": [
                                "I don't know the way, so you'd better lead.",
                                "If you lead in the jeep, we'll follow behind on the horses."
                            ]
                        },
                        {
                            "explanation": "To lead a group of moving people or vehicles is to walk or drive in front of them: ",
                            "examples": [
                                "The local youth band will lead the parade this weekend.",
                                "A large black hearse led the funeral procession."
                            ]
                        },
                        {
                            "explanation": "to take someone somewhere, by going with them: ",
                            "examples": [
                                "She led them down the hall.",
                                "The waiter led us to our table.",
                                "Our guide led us through the mountains."
                            ]
                        },
                        {
                            "explanation": "to take hold of a person or animal and take him, her, or it somewhere: ",
                            "examples": [
                                "She took the child by the hand and led him upstairs to bed.",
                                "He led the horse out of the stable."
                            ]
                        },
                        {
                            "explanation": "to show the way by going in front: ",
                            "examples": [
                                "You've been there before - why don't you lead the way?"
                            ]
                        },
                        {
                            "explanation": "to make more progress than other people in the development of something: ",
                            "examples": [
                                "The company has been leading the way in network applications for several years."
                            ]
                        },
                        {
                            "explanation": "(especially of roads, paths, doors, signs, information, etc.) to go in a particular direction or have a particular result, or to allow or cause this: ",
                            "examples": [
                                "There's a track that leads directly to the reservoir.",
                                "The door leads out onto a wide, shady terrace.",
                                "A narrow trail of blood led directly into the cave.",
                                "This information led the police to a house near the harbour."
                            ]
                        },
                        {
                            "explanation": "to live a particular type of life: ",
                            "examples": [
                                "He was able to lead a normal life, despite the illness."
                            ]
                        },
                        {
                            "explanation": "in sports and activities, to move forward first with a particular part of your body, especially as a habit: ",
                            "examples": [
                                "You can lead with your left or right leg, depending on which feels more comfortable. ",
                                "He was booked for leading with his elbow (= running into an opposing football player and hitting them with an elbow)."
                            ]
                        },
                        {
                            "explanation": "in boxing, to make a first attacking punch (= hit), especially with a particular hand: ",
                            "examples": [
                                "They're used to fighting against boxers who lead with their right."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "liːd"
                            ],
                            "us": [
                                "liːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a winning position during a race or other situation where people are competing: ",
                            "examples": [
                                "For the first time in the race Harrison is in the lead.",
                                "With a final burst of speed she went/moved into the lead.",
                                "After last night's win Johnson has taken (over) the lead in the championship table.",
                                "By the end of the day's play Davies had a lead of three points."
                            ]
                        },
                        {
                            "explanation": "the act of showing a person or group of people what to do: ",
                            "examples": [
                                "We'll go through the dance routine again - follow my lead (= do what I do)."
                            ]
                        },
                        {
                            "explanation": "a piece of information that allows a discovery to be made or a solution to be found: ",
                            "examples": [
                                "A lead from an informer enabled the police to make several arrests."
                            ]
                        },
                        {
                            "explanation": "the main part or actor in a film or play: ",
                            "examples": [
                                "Who's been cast as the lead?",
                                "Meryl Streep was the lead in that year's Oscar-winning film."
                            ]
                        },
                        {
                            "explanation": "a wire covered in plastic and used to connect electrical equipment to the electricity supply",
                            "examples": []
                        },
                        {
                            "explanation": "a piece of rope, chain, etc. tied to an animal, especially to a dog at its collar when taking it for a walk: ",
                            "examples": [
                                "Please keep your dog on a lead when on the beach."
                            ]
                        },
                        {
                            "explanation": "in boxing, a first attacking punch (= hit) by a fighter : ",
                            "examples": [
                                "A right-hand lead by Haye caught Ruiz on the chin. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "liːd"
                            ],
                            "us": [
                                "liːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe the main performer or part in a performance: ",
                            "examples": [
                                "Who played the lead role in the movie?",
                                "The lead guitarist was good."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "led"
                            ],
                            "us": [
                                "led"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a chemical element that is a very heavy, soft, dark grey, poisonous metal, used especially in the past on roofs and for pipes and also for protection against radiation: ",
                            "examples": [
                                "lead pipes"
                            ]
                        },
                        {
                            "explanation": "(the narrow strip of) coloured material, usually black and made of graphite, in the centre of a pencil",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}