{
    "word": "letter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈlet.ər"
                            ],
                            "us": [
                                "ˈlet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a written message from one person to another, usually put in an envelope and sent by post: ",
                            "examples": [
                                "I got a letter from the bank this morning."
                            ]
                        },
                        {
                            "explanation": "any of the set of symbols used to write a language, representing a sound in the language: ",
                            "examples": [
                                "the letter D"
                            ]
                        },
                        {
                            "explanation": "the exact words of the law and not its more important general meaning: ",
                            "examples": [
                                "She abided by the letter of the law, but not the spirit of the law. "
                            ]
                        },
                        {
                            "explanation": "a prize in the shape of the first letter of the name of a high school or university, given to a student for achievement in sport and sometimes other activities, and often worn on a special jacket or sweater: ",
                            "examples": [
                                "A naturally gifted athlete, he earned four letters in basketball and two more in baseball at high school. ",
                                "Her mission was to win a letter in basketball by the time she was a senior in high school."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈlet.ər"
                            ],
                            "us": [
                                "ˈlet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a standard size of paper in the US, 8.5 inches by 11 inches: ",
                            "examples": [
                                "Fliers are usually printed either on letter size or legal size paper."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈlet.ər"
                            ],
                            "us": [
                                "ˈlet̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a student letters in a particular sport, they are given a prize for achievement in sport in the shape of the first letter of the name of their high school or university, which is often worn on a special jacket or sweater: ",
                            "examples": [
                                "She lettered in five varsity sports in high school.",
                                "Twelve juniors lettered for the Tigers last season."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}