{
    "word": "liberal",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈlɪb.ər.əl"
                            ],
                            "us": [
                                "ˈlɪb.ər.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "respecting and allowing many different types of beliefs or behaviour: ",
                            "examples": [
                                "a liberal society/attitude",
                                "Her parents were far more liberal than mine."
                            ]
                        },
                        {
                            "explanation": "believing in or allowing a lot of personal freedom, and believing that society should change gradually so that money, property, and power are shared more fairly: ",
                            "examples": [
                                "He absorbed the attitudes of his politically liberal parents."
                            ]
                        },
                        {
                            "explanation": "believing in or allowing a lot of freedom for businesses to buy, sell, and make money without many rules or limits, and with low taxes: ",
                            "examples": [
                                "Polling data shows these voters are socially conservative and economically liberal."
                            ]
                        },
                        {
                            "explanation": "giving or given in a generous way: ",
                            "examples": [
                                "He was very liberal with the wine."
                            ]
                        },
                        {
                            "explanation": "not exact; without attention to or interest in detail: ",
                            "examples": [
                                "a liberal interpretation of the law"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈlɪb.ər.əl"
                            ],
                            "us": [
                                "ˈlɪb.ər.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who respects many different types of beliefs or behaviour: ",
                            "examples": [
                                "I am a liberal who believes in tolerance."
                            ]
                        },
                        {
                            "explanation": "someone who believes in personal freedom and that society should change gradually so that money, property, and power are shared more fairly: ",
                            "examples": [
                                "She says she is proud to identify herself as a liberal and a feminist."
                            ]
                        },
                        {
                            "explanation": "someone who believes businesses should have a lot of freedom to buy, sell, and make money without many rules or limits, and with low taxes: ",
                            "examples": [
                                "Three strands make up the party: the moderate reforming centre, the Thatcherite economic liberals, and the pro-clerical conservatives."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}