{
    "word": "liberty",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈlɪb.ə.ti"
                            ],
                            "us": [
                                "ˈlɪb.ɚ.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the freedom to live as you wish or go where you want: ",
                            "examples": [
                                "For most citizens, liberty means the freedom to practise their religious or political beliefs.",
                                "Hundreds of political prisoners are to be given their liberty (= released from prison).",
                                "Of the ten men who escaped this morning from Dartmoor Prison, only two are still at liberty (= free or not yet caught)."
                            ]
                        },
                        {
                            "explanation": "to be allowed to do something: ",
                            "examples": [
                                "I'm not at liberty to reveal any names."
                            ]
                        },
                        {
                            "explanation": "freedom to live as you wish or go where you want: ",
                            "examples": [
                                "These laws will restrict our ancient rights and liberties."
                            ]
                        },
                        {
                            "explanation": "an example of speech or behaviour that upsets other people because it shows little respect or does not follow what is thought to be polite or acceptable: ",
                            "examples": [
                                "What a liberty, to refuse the invitation on your behalf, without even asking you!"
                            ]
                        },
                        {
                            "explanation": "to change something, such as a piece of writing or information, usually in a way that people disagree with: ",
                            "examples": [
                                "There have been several legal clashes when other artists have taken liberties with the melodies."
                            ]
                        },
                        {
                            "explanation": "to be too friendly with someone, usually in a sexual way: ",
                            "examples": [
                                "Some of the younger women complained that he'd been taking liberties with them."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}