{
    "word": "lie",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "laɪ"
                            ],
                            "us": [
                                "laɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be in or move into a horizontal position on a surface: ",
                            "examples": [
                                "to lie in bed",
                                "to lie on a beach",
                                "to lie on your side",
                                "A cat lay in front of the fire.",
                                "He lies awake at night, worrying.",
                                "A pen lay on the desk."
                            ]
                        },
                        {
                            "explanation": "If something lies in a particular place, position, or direction, it is in that place, position, or direction: ",
                            "examples": [
                                "There's an old pair of shoes of yours lying at/in the bottom of the wardrobe.",
                                "The river lies 30 km to the south.",
                                "The team is lying third in the league.",
                                "Here lies the body of Mary Taylor (= this is where Mary Taylor is buried).",
                                "There are several houses lying empty in the town.",
                                "The town lay in ruins.",
                                "The ship lies off (= is positioned near) the coast of Spain."
                            ]
                        },
                        {
                            "explanation": "to exist: ",
                            "examples": [
                                "The hardest part of the competition still lies ahead of us."
                            ]
                        },
                        {
                            "explanation": "If responsibility, blame, a decision, a choice, etc. lies with someone, they have responsibility, must make the decision, etc.: ",
                            "examples": [
                                "Responsibility for the disaster must ultimately lie with the government.",
                                "Where does the blame lie?"
                            ]
                        },
                        {
                            "explanation": "When the dead body of an important person lies in state, it is arranged so that the public can see and honour it before it is buried: ",
                            "examples": [
                                "Thousands of people came to pay their respects as his body lay in state."
                            ]
                        },
                        {
                            "explanation": "to say or write something that is not true in order to deceive someone: ",
                            "examples": [
                                "Are you lying to me?",
                                "Don't trust her - she's lying.",
                                "I suspect he lies about his age."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "laɪ"
                            ],
                            "us": [
                                "laɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something you say that you know is not true: ",
                            "examples": [
                                "I told a lie when I said I liked her haircut."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}