{
    "word": "life",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "laɪf"
                            ],
                            "us": [
                                "laɪf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the period between birth and death, or the experience or state of being alive: ",
                            "examples": [
                                "Life's too short to worry about money!",
                                "I'm not sure I want to spend the rest of my life with him.",
                                "Unfortunately, accidents are part of life.",
                                "He went mad towards the end of his life.",
                                "Cats are supposed to have nine lives.",
                                "He doesn't know what he really wants in/out of life.",
                                "The accident changed my whole outlook on life.",
                                "He lost his life (= died suddenly because of a violent event or accident) in the Great War.",
                                "A simple mixture of glucose and water can save lives in many parts of the world.",
                                "He ran off with her life savings (= all the money she had saved)."
                            ]
                        },
                        {
                            "explanation": "for the whole of a person's life: ",
                            "examples": [
                                "I believe marriage is for life."
                            ]
                        },
                        {
                            "explanation": "to be willing to die in order to defend or support someone or something: ",
                            "examples": [
                                "They were ready to give their lives for their country."
                            ]
                        },
                        {
                            "explanation": "If you believe in life after death, you believe that people continue to exist in some form after they die: ",
                            "examples": [
                                "He truly believes that there is life after death."
                            ]
                        },
                        {
                            "explanation": "a way of living or a particular part of someone's life: ",
                            "examples": [
                                "her family/private/sex life",
                                "my working life",
                                "We interviewed senior politicians, famous writers, and others in public life.",
                                "Drugs and violence are deeply rooted in American life.",
                                "I left home at 16 to see life (= have different experiences with a lot of people in lots of places).",
                                "Teaching has been her life (= the most important and enjoyable thing in her life)."
                            ]
                        },
                        {
                            "explanation": "to completely change how or where you live: ",
                            "examples": [
                                "She decided to start a new life in Australia."
                            ]
                        },
                        {
                            "explanation": "the period for which a machine or organization lasts: ",
                            "examples": [
                                "The newer batteries have a much longer life.",
                                "Careful use will prolong the life of your machine.",
                                "The legislation won't be passed during the life of the present parliament."
                            ]
                        },
                        {
                            "explanation": "the quality that makes people, animals, and plants different from objects, substances, and things that are dead: ",
                            "examples": [
                                "The doctor could find no sign of life in the old man's body.",
                                "I looked through the window but I couldn't see any signs of life (= people moving)."
                            ]
                        },
                        {
                            "explanation": "the quality of having a lot of energy, interest, or excitement: ",
                            "examples": [
                                "She's so full of life.",
                                "Los Angeles was a great place to live, really full of life. ",
                                "The bright colours bring more life to the painting."
                            ]
                        },
                        {
                            "explanation": "to make something more real or exciting: ",
                            "examples": [
                                "It's always been an interesting period in history and this film really brought it to life."
                            ]
                        },
                        {
                            "explanation": "to start to be alive or to grow, or start to function: ",
                            "examples": [
                                "Just install batteries, and watch the robot come to life."
                            ]
                        },
                        {
                            "explanation": "to become more exciting or start to seem more real: ",
                            "examples": [
                                "The game really came to life in the second half."
                            ]
                        },
                        {
                            "explanation": "alive or growing again, or starting to function again: ",
                            "examples": [
                                "I wish Shakespeare could come back to life and tell us what he thinks.",
                                "In spring, the earth comes back to life as seeds begin to germinate.",
                                "Pent-up demand brought the economy roaring back to life."
                            ]
                        },
                        {
                            "explanation": "more exciting or more real again: ",
                            "examples": [
                                "Urged on by the crowd, he brought the match back to life.",
                                "This show brings an almost forgotten novel brilliantly back to life."
                            ]
                        },
                        {
                            "explanation": "everything that is alive: ",
                            "examples": [
                                "human/marine/plant life"
                            ]
                        },
                        {
                            "explanation": "In art, if you work from life, you paint, draw, etc. real people or objects, usually while they are in front of you rather than from memory: ",
                            "examples": [
                                "life drawing classes"
                            ]
                        },
                        {
                            "explanation": "especially in children's games, one of the limited number of times that you can lose, but still continue playing: ",
                            "examples": [
                                "Every time the little man gets hit, you lose a life."
                            ]
                        },
                        {
                            "explanation": "the life story of a person written by someone else: ",
                            "examples": [
                                "What moved him to write a life of John O'Hara?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}