{
    "word": "lift",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "lɪft"
                            ],
                            "us": [
                                "lɪft"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move something from a lower to a higher position: ",
                            "examples": [
                                "Could you help me lift this table, please?",
                                "Could you lift your chair a little- I've got my coat caught under it.",
                                "She lifted the cigarette (up) to her lips.",
                                "He lifted his eyes (= looked up) from the paper and glared."
                            ]
                        },
                        {
                            "explanation": "to win a race or competition in which the prize is a metal cup: ",
                            "examples": [
                                "He is the hot favourite to lift the cup again next month."
                            ]
                        },
                        {
                            "explanation": "to dig underground vegetables or plants out of the ground: ",
                            "examples": [
                                "They're lifting potatoes."
                            ]
                        },
                        {
                            "explanation": "to take hold of and raise something in order to remove, carry, or move it to a different position: ",
                            "examples": [
                                "She lifted the baby out of her chair.",
                                "He lifted the box carefully down from the shelf."
                            ]
                        },
                        {
                            "explanation": "to make your voice louder, especially when performing",
                            "examples": []
                        },
                        {
                            "explanation": "to make something more interesting or enjoyable: ",
                            "examples": [
                                "The article is informative enough, but it's a little dull - we need something to lift it."
                            ]
                        },
                        {
                            "explanation": "to make someone happier: ",
                            "examples": [
                                "Nothing - not even the prospect of dinner - could lift his spirits."
                            ]
                        },
                        {
                            "explanation": "(of mist or fog) to go away until none is left: ",
                            "examples": [
                                "The morning mist had lifted and the sun was starting to come through."
                            ]
                        },
                        {
                            "explanation": "to end a rule or law: ",
                            "examples": [
                                "The restrictions on water usage have been lifted now that the river levels are normal.",
                                "At last they've lifted the ban on jeans at the club."
                            ]
                        },
                        {
                            "explanation": "to steal something",
                            "examples": []
                        },
                        {
                            "explanation": "to use someone else's writing, music, or idea, pretending that it is your own: ",
                            "examples": [
                                "He'd lifted whole passages from a website."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "lɪft"
                            ],
                            "us": [
                                "lɪft"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device like a box that moves up and down, carrying people or goods from one floor of a building to another or taking people up and down underground in a mine: ",
                            "examples": [
                                "Take the lift to the sixth floor."
                            ]
                        },
                        {
                            "explanation": "an act of lifting or raising something: ",
                            "examples": [
                                "Give it one more lift and we'll have it at the top of the stairs."
                            ]
                        },
                        {
                            "explanation": "the force on the wing of a bird or aircraft that keeps it in the air as it moves forward",
                            "examples": []
                        },
                        {
                            "explanation": "a free journey in another person's vehicle, especially a car: ",
                            "examples": [
                                "I'll give you a lift to the train station if you like.",
                                "He hitched a lift (= stood by the road and made a signal asking a car to stop and take him) to Birmingham."
                            ]
                        },
                        {
                            "explanation": "to make someone happier: ",
                            "examples": [
                                "She'd been feeling low but hearing that she'd got the job gave her a lift."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}