{
    "word": "lightweight",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈlaɪt.weɪt"
                            ],
                            "us": [
                                "ˈlaɪt.weɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "weighing only a little or less than average: ",
                            "examples": [
                                "I need a lightweight jacket for the summer evenings."
                            ]
                        },
                        {
                            "explanation": "not showing deep understanding or knowledge of any subject: ",
                            "examples": [
                                "She's the author of some fairly lightweight historical novels."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈlaɪt.weɪt"
                            ],
                            "us": [
                                "ˈlaɪt.weɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a boxer who weighs more than a featherweight but less than a welterweight, or this division of boxing weight: ",
                            "examples": [
                                "He had taken gold as a lightweight at the 1992 Barcelona Olympics.",
                                "He was the defending world lightweight champion.",
                                "He stopped the Irish boxer in the 12th round to retain the WBC lightweight title.",
                                "In Athens he won the silver medal at lightweight."
                            ]
                        },
                        {
                            "explanation": "a person or thing that is not very serious and that other people do not consider to be important: ",
                            "examples": [
                                "In certain circles he has been dismissed as a literary lightweight.",
                                "He was seen by some as a bit of a lightweight who did not seem to stand for anything."
                            ]
                        },
                        {
                            "explanation": "someone who is unable to drink much alcohol without being affected by it or made ill: ",
                            "examples": [
                                "He's such a lightweight - two drinks and he's completely gone.",
                                "I just had a couple of drinks, nothing too mad. I'm a bit of a lightweight."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}