{
    "word": "limit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈlɪm.ɪt"
                            ],
                            "us": [
                                "ˈlɪm.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the greatest amount, number, or level of something that is either possible or allowed: ",
                            "examples": [
                                "Is there a limit on the amount of money you can claim?",
                                "I think we ought to put a strict limit on the amount of time we can spend on the project.",
                                "There's a limit to the number of times I can stop what I'm doing just so I can help him!",
                                "We set a time limit of 30 minutes for the test."
                            ]
                        },
                        {
                            "explanation": "the amount of something that is enough and not too much: ",
                            "examples": [
                                "Three cocktails are my limit.",
                                "I won't have any more - I know my limit!"
                            ]
                        },
                        {
                            "explanation": "something that is very annoying or not convenient: ",
                            "examples": [
                                "And now you're cutting your toenails in bed! That really is the limit!"
                            ]
                        },
                        {
                            "explanation": "the largest amount of alcohol that is legally allowed to be present in the blood while a person is driving a vehicle: ",
                            "examples": [
                                "She was definitely driving over the limit."
                            ]
                        },
                        {
                            "explanation": "limit: ",
                            "examples": [
                                "I'd like to play squash, but I'm 60 and I know my limits."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈlɪm.ɪt"
                            ],
                            "us": [
                                "ˈlɪm.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to control something so that it is not greater than a particular amount, number, or level: ",
                            "examples": [
                                "I've been asked to limit my speech to ten minutes maximum.",
                                "Having so little money to spend on an apartment does limit you in your choice."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}