{
    "word": "line",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "laɪn"
                            ],
                            "us": [
                                "laɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, thin mark on the surface of something: ",
                            "examples": [
                                "a straight line",
                                "Sign your name on the dotted line.",
                                "She was very old and her face was covered with lines.",
                                "My legs felt all wobbly when I stood up and I couldn't walk in a straight line (= walk without moving to the side while moving forward)."
                            ]
                        },
                        {
                            "explanation": "a group of people or things arranged in a row: ",
                            "examples": [
                                "a line of trees",
                                "The prisoners formed a line against the wall."
                            ]
                        },
                        {
                            "explanation": "a group of people standing one behind the other who are waiting for something: ",
                            "examples": [
                                "Just get in line and wait your turn like everyone else.",
                                "I had to wait/stand in line for three hours to get tickets."
                            ]
                        },
                        {
                            "explanation": "in some team sports, a number of players in a team who typically play next to or near to each other: ",
                            "examples": [
                                "The team looked good going forward, but their back line looked shaky. ",
                                "She exploited her speed to generate scoring opportunities, to the left side of a three-player forward line.",
                                "The Chargers have a strong offensive line."
                            ]
                        },
                        {
                            "explanation": "a series of people or things that follow each other in time: ",
                            "examples": [
                                "She is the latest in a long line of controversial leaders."
                            ]
                        },
                        {
                            "explanation": "a long, thin and sometimes imaginary mark that forms the edge, border, or limit of something: ",
                            "examples": [
                                "The police couldn't arrest him because he'd fled across the state line.",
                                "For many television viewers the dividing line between fact and fiction is becoming increasingly blurred."
                            ]
                        },
                        {
                            "explanation": "in sport, one of the painted marks that form the limits of the playing area or of part of the playing area: ",
                            "examples": [
                                "Carter bundled the ball over the line for the opening goal.",
                                "His long-range shot was caught on the line by the goalkeeper. ",
                                "That ball was definitely in! It was nowhere near the line!"
                            ]
                        },
                        {
                            "explanation": "in sport, the painted mark that signals the finishing point of a race: ",
                            "examples": [
                                "The British pair crossed the line more than four seconds clear of the field.",
                                "She was leading into the last 10 metres, but was pipped onthe line."
                            ]
                        },
                        {
                            "explanation": "a connection to a phone system: ",
                            "examples": [
                                "I'm afraid your line's been disconnected because your last bill hasn't been paid.",
                                "If you want to air your opinions live on the radio, the lines will be open (= you can phone) from eight o'clock.",
                                "I've got Chris Foster on the line for you. Do you want to take it now or call her back later?",
                                "Please hold the line (= wait). I'll see if she's available."
                            ]
                        },
                        {
                            "explanation": "(the route followed by) a railway track: ",
                            "examples": [
                                "The train was delayed, apparently due to leaves on the line.",
                                "The Northern Line is the worst on the London Underground.",
                                "Mainline services can be very quick, but travelling on the branch lines is much slower."
                            ]
                        },
                        {
                            "explanation": "a way of dealing with or thinking about something or someone: ",
                            "examples": [
                                "The government's official line has always been to refuse to negotiate with terrorists.",
                                "The courts should take a tougher line with (= punish more severely) sex offenders.",
                                "Several Labour MPs disagree with their party's line on taxation.",
                                "What sort of line (= method of arguing) do you think we should take in the pay negotiations?",
                                "The police are confident that this new line of inquiry will lead them to the murderer.",
                                "It seems inevitable that the country will be divided along ethnic lines."
                            ]
                        },
                        {
                            "explanation": "a way of thinking about a particular subject: ",
                            "examples": [
                                "We cannot agree with their line of reasoning."
                            ]
                        },
                        {
                            "explanation": "a row of positions used to defend against enemy attack, especially the ones closest to enemy positions: ",
                            "examples": [
                                "They were taken prisoner while on a reconnaissance mission behind enemy lines.",
                                "In a game of football, the goalkeeper is the last line of defence."
                            ]
                        },
                        {
                            "explanation": "in ice hockey, a group of players in a team who play at the same time : ",
                            "examples": [
                                "He is a left winger on the team's third line. ",
                                "The coach used the delay as an opportunity to change lines. "
                            ]
                        },
                        {
                            "explanation": "the shape of something that has been designed or created: ",
                            "examples": [
                                "They have a reputation for designing cars with elegant aerodynamic lines."
                            ]
                        },
                        {
                            "explanation": "a long, strong, thin piece of material, such as string, rope, or wire, used to support something: ",
                            "examples": [
                                "I'd hung the washing out on the clothes line.",
                                "Can you feel the fish tugging on the line?"
                            ]
                        },
                        {
                            "explanation": "a company that transports people or goods: ",
                            "examples": [
                                "a shipping line"
                            ]
                        },
                        {
                            "explanation": "a remark that is intended to entertain, persuade, or deceive: ",
                            "examples": [
                                "a speech full of memorable lines",
                                "He keeps giving me that line about not being able to do any work because his computer is down.",
                                "Who was it who came up with that famous line about \"lies, damned lies and statistics?\""
                            ]
                        },
                        {
                            "explanation": "a row of words that form part of a text: ",
                            "examples": [
                                "We could get more lines on the page if we reduced the type size.",
                                "The computer screen displays 80 characters per line."
                            ]
                        },
                        {
                            "explanation": "the words that an actor speaks when performing in a film, play, etc.: ",
                            "examples": [
                                "I only had two lines in the whole play.",
                                "She hasn't learned her lines yet, and we've got our first rehearsal tomorrow.",
                                "I'm terrified of forgetting my lines."
                            ]
                        },
                        {
                            "explanation": "a punishment for school students in which a sentence has to be written repeatedly: ",
                            "examples": [
                                "She got 200 lines for swearing at her teacher."
                            ]
                        },
                        {
                            "explanation": "a short series of musical notes",
                            "examples": []
                        },
                        {
                            "explanation": "the type of job someone does: ",
                            "examples": [
                                "\"What line of work are you in?\" \"I'm a teacher.\"",
                                "You meet some very interesting people in my line of business."
                            ]
                        },
                        {
                            "explanation": "a range of similar things that are for sale: ",
                            "examples": [
                                "There are discounts on many items from our older lines.",
                                "I was shown all their new lines."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "laɪn"
                            ],
                            "us": [
                                "laɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to form a row along the side of something: ",
                            "examples": [
                                "Thousands of people lined the streets to watch the presidential procession pass by.",
                                "Police lined the route of the demonstration.",
                                "country lanes lined with trees"
                            ]
                        },
                        {
                            "explanation": "to cover the inside surface of something: ",
                            "examples": [
                                "I lined the drawers with old wallpaper.",
                                "How much would it cost to have this jacket lined?",
                                "Full-length mirrors lined each wall of the bathroom."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}