{
    "word": "linear",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈlɪn.i.ər"
                            ],
                            "us": [
                                "ˈlɪn.i.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "consisting of relating to lines or length: ",
                            "examples": [
                                "Linear features, such as walls and roads, are easy to see from the air because they cut across natural features.",
                                "Linear measurements may be given either in imperial or metric units, but area is normally quoted in square metres.",
                                "a linear diagram"
                            ]
                        },
                        {
                            "explanation": "involving events or thoughts in which one follows another one directly: ",
                            "examples": [
                                "Usually, stories are told in a linear way, from start to finish.",
                                "These mental exercises are designed to break linear thinking habits and encourage creativity."
                            ]
                        },
                        {
                            "explanation": "involving a situation in which one thing changes at the same rate as another, so that the relationship between them does not change: ",
                            "examples": [
                                "The throughput remains constant and the latency shows a linear increase."
                            ]
                        },
                        {
                            "explanation": "A linear equation (= mathematical statement) describes a situation in which one thing changes at the same rate as another, so that the relationship between them does not change. Linear equations have the form of straight lines, rather than curves, on a graph: ",
                            "examples": [
                                "These equations form a straight line graph so they are called linear equations."
                            ]
                        },
                        {
                            "explanation": "used to refer to traditional television in which programmes are broadcast at particular times on particular channels to a general audience: ",
                            "examples": [
                                "Linear TV is the traditional way television has been provided to households for decades.",
                                "The BBC says that viewers are watching 44% more linear channels compared with this time last year."
                            ]
                        },
                        {
                            "explanation": "Linear editing is a method of editing video, images, or audio (= sound) files by working through each part of a file in order, rather than going directly to the part of the file you want to edit: ",
                            "examples": [
                                "conventional linear editing of videotape"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}