{
    "word": "live",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "lɪv"
                            ],
                            "us": [
                                "lɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(to continue) to be alive or have life: ",
                            "examples": [
                                "He only lived a few days after the accident.",
                                "I hope I live to see my grandchildren.",
                                "Her granny lived to the ripe old age of 94.",
                                "Can the right to live ever be denied to any human?",
                                "She lived on well into her 90s."
                            ]
                        },
                        {
                            "explanation": "to have your home somewhere: ",
                            "examples": [
                                "Where do you live?",
                                "We live in Kingston.",
                                "Some students live on the University campus.",
                                "He lives with four other people in a shared house.",
                                "She's still living at home (= with her parents)."
                            ]
                        },
                        {
                            "explanation": "to be kept usually in a particular place: ",
                            "examples": [
                                "Where do the knives live in your kitchen?",
                                "I'm not sure where this bowl lives."
                            ]
                        },
                        {
                            "explanation": "to live outside because you have no home and no money: ",
                            "examples": [
                                "She'd run away from home and was living rough.",
                                "She works as a mediator helping to prevent young people living rough on the streets."
                            ]
                        },
                        {
                            "explanation": "to spend your life in a particular way: ",
                            "examples": [
                                "After a while you get used to living alone.",
                                "When you retire, you want to live a comfortable life.",
                                "So the couple got married and lived happily ever after.",
                                "He simply wants to live (out) (= experience) the rest of his days in peace.",
                                "The TV's broken - we'll just have to live without (= not have) it for a while.",
                                "She certainly lived her life to the full (= was always doing something interesting).",
                                "The US is living beyond its means (= spending more than it earns)."
                            ]
                        },
                        {
                            "explanation": "to stay alive, especially by getting enough money to pay for food, a place to stay, clothing, etc.: ",
                            "examples": [
                                "For several years she lived by begging.",
                                "She has an inheritance to live off (US also live off of) so she doesn't need to work.",
                                "He only agreed to marry her so he could live off her (money)."
                            ]
                        },
                        {
                            "explanation": "(of things that are not alive) to exist or continue to exist: ",
                            "examples": [
                                "The memory of those terrible days lives on."
                            ]
                        },
                        {
                            "explanation": "to have an interesting life: ",
                            "examples": [
                                "I want to live a little before I settle down.",
                                "If you haven't seen Venice, you haven't lived."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "laɪv"
                            ],
                            "us": [
                                "laɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having life: ",
                            "examples": [
                                "Millions of live animals are shipped around the world each year.",
                                "There was a tank of live lobsters in the restaurant."
                            ]
                        },
                        {
                            "explanation": "(of a performance) broadcast, recorded, or seen while it is happening: ",
                            "examples": [
                                "This evening there will be a live broadcast of the debate.",
                                "a live recording"
                            ]
                        },
                        {
                            "explanation": "(of a wire) carrying or charged with electricity: ",
                            "examples": [
                                "a live wire"
                            ]
                        },
                        {
                            "explanation": "able to explode: ",
                            "examples": [
                                "live rounds of ammunition",
                                "live shells"
                            ]
                        },
                        {
                            "explanation": "(of a fire, coals, or a match) still burning or able to burn: ",
                            "examples": [
                                "There are live coals in the fireplace."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "laɪv"
                            ],
                            "us": [
                                "laɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "broadcast as it happens; performing or being performed in front of an audience: ",
                            "examples": [
                                "I've got two tickets to see them (perform) live."
                            ]
                        },
                        {
                            "explanation": "If a new system, especially a computer system, goes live, it starts to operate: ",
                            "examples": [
                                "Our new payments system will go live at the beginning of next month."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}