{
    "word": "lock",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "lɒk"
                            ],
                            "us": [
                                "lɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device that prevents something such as a door from being opened and can only be opened with a key: ",
                            "examples": [
                                "I heard someone turn a key in the lock.",
                                "safety locks",
                                "Thieves got in by smashing the lock off the door."
                            ]
                        },
                        {
                            "explanation": "a length of water with gates at each end where the level of water can be changed to allow boats to move between parts of a canal or river that are at different heights",
                            "examples": []
                        },
                        {
                            "explanation": "something that is certain to happen: ",
                            "examples": [
                                "She's a lock for promotion this year."
                            ]
                        },
                        {
                            "explanation": "a small group of hairs, especially a curl: ",
                            "examples": [
                                "There is a lock of Napoleon's hair in the display cabinet."
                            ]
                        },
                        {
                            "explanation": "the hair on someone's head: ",
                            "examples": [
                                "curly locks"
                            ]
                        },
                        {
                            "explanation": "short for dreadlocks; a hairstyle in which the hair hangs in long thick twisted pieces: ",
                            "examples": [
                                "Jamaican footballers were the first to sport locks."
                            ]
                        },
                        {
                            "explanation": "the amount a road vehicle's front wheels can be turned from one side to the other by turning its steering wheel: ",
                            "examples": [
                                "You need it on full lock (= with the wheel turned as much as possible)."
                            ]
                        },
                        {
                            "explanation": "a way of holding someone that you are fighting against so that they cannot move: ",
                            "examples": [
                                "The smaller wrestler held his opponent in a full body lock."
                            ]
                        },
                        {
                            "explanation": "a rugby player who plays in the second row of the scrum (= a group of players from each team who come together with their heads down and their arms joined, and push against each other to get control of the ball), or this position in the team: ",
                            "examples": [
                                "The England lock caught four vital lineout throws.",
                                "The lock forward was a member of Italy's under-19 World Cup squad."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "lɒk"
                            ],
                            "us": [
                                "lɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put an object in a safe place and fasten a lock that prevents someone from entering the place, moving the object, etc.: ",
                            "examples": [
                                "He locked the confidential documents in his filing cabinet.",
                                "I locked my bike to the railings.",
                                "You really should lock your bike up or it'll get stolen."
                            ]
                        },
                        {
                            "explanation": "to fasten something with a key, or be fastened with a key: ",
                            "examples": [
                                "Don't forget to lock the door when you go out.",
                                "If you shut the door it will lock automatically."
                            ]
                        },
                        {
                            "explanation": "to become fixed in one position: ",
                            "examples": [
                                "I tried to start moving but the wheels had locked."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}