{
    "word": "logrolling",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈlɒɡ.rəʊ.lɪŋ"
                            ],
                            "us": [
                                "ˈlɑːɡ.roʊ.lɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the practice of voting for something that someone else wants in return for them voting for something that you want: ",
                            "examples": [
                                "Logrolling is especially common when the legislators are relatively free of control by their national party leaders.",
                                "It was part of a logrolling package."
                            ]
                        },
                        {
                            "explanation": "the practice of praising someone or their work, in return for them doing the same for you: ",
                            "examples": [
                                "Attention has been drawn to alleged logrolling by authors in \"books of the year\" features published by newspapers.",
                                "I am not saying writers of those comments are engaging in logrolling, but they certainly read a different book to the one I did."
                            ]
                        },
                        {
                            "explanation": "a sport in which two people try to stay standing on a floating log (= a thick piece of a tree trunk or branch), or other long, rounded object, while trying to make the other person fall off: ",
                            "examples": [
                                "The group's eventual goal is to bring logrolling to the Olympics.",
                                "Her mum signed her up for a logrolling class at the local pond."
                            ]
                        },
                        {
                            "explanation": "the practice of turning a person who is lying down in one movement, keeping their spine (= the row of bones down the back) straight: ",
                            "examples": [
                                "To turn a patient by logrolling, the nurse first folds the patient’s arms across their chest."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}