{
    "word": "lubricating",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nlubricate ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈluː.brɪ.keɪt"
                            ],
                            "us": [
                                "ˈluː.brə.keɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use a substance such as oil to make a machine or device operate more easily, or to prevent something sticking or rubbing: ",
                            "examples": [
                                "A car engine needs to be well lubricated with oil.",
                                "Applying a few drops of oil on a key will clean and lubricate the moving parts of the lock, extending its life."
                            ]
                        },
                        {
                            "explanation": "(of a substance such as oil) to make a machine or device operate more easily, or to prevent something sticking or rubbing: ",
                            "examples": [
                                "Disconnect the ignition and rely on the starter motor to turn the engine several times so that oil can lubricate the moving parts.",
                                "Dry eyes can be treated with lubricating eye drops."
                            ]
                        },
                        {
                            "explanation": "to make a process happen easily and without problems, especially by giving money: ",
                            "examples": [
                                "Money can lubricate a deal by making minor concessions easier to accept.",
                                "It is perfectly legal for them to lubricate lobbying with big campaign donations."
                            ]
                        },
                        {
                            "explanation": "(of alcoholic drink) to make someone behave in a more open and friendly way: ",
                            "examples": [
                                "Get a bunch of writers together, lubricate them with some wine, and you get all sorts of conversations. ",
                                "He sipped his brandy and said, \"That's lubricated me nicely.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}