{
    "word": "mainstream",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈmeɪn.striːm"
                            ],
                            "us": [
                                "ˈmeɪn.striːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "considered normal, and having or using ideas, beliefs, etc. that are accepted by most people: ",
                            "examples": [
                                "This is the director's first mainstream Hollywood film."
                            ]
                        },
                        {
                            "explanation": "used to refer to education for children who can be taught in the same way as most other children, or to people, schools, etc. connected with this type of education: ",
                            "examples": [
                                "Many youngsters have been out of mainstream education for so long that they cannot adapt to a formal learning environment.",
                                "Many estimate that up to 20% of children in mainstream classrooms may have some special needs.",
                                "mainstream children/students/teachers"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmeɪn.striːm"
                            ],
                            "us": [
                                "ˈmeɪn.striːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the way of life or set of beliefs accepted by most people: ",
                            "examples": [
                                "The new law should allow more disabled people to enter the mainstream of American life."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈmeɪn.striːm"
                            ],
                            "us": [
                                "ˈmeɪn.striːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make something start to be considered normal: ",
                            "examples": [
                                "Political rhetoric mainstreams hostility.",
                                "Mainstreaming equality means that equality should not be catered for only by specific programmes or initiatives."
                            ]
                        },
                        {
                            "explanation": "to teach children with special needs in the same class or school as children who do not have special needs: ",
                            "examples": [
                                "The school has been mainstreaming children with special needs successfully for almost 20 years.",
                                "We didn't know if he could be mainstreamed."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}