{
    "word": "major",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈmeɪ.dʒər"
                            ],
                            "us": [
                                "ˈmeɪ.dʒɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "more important, bigger, or more serious than others of the same type: ",
                            "examples": [
                                "All of her major plays have been translated into English.",
                                "Sugar is a major cause of tooth decay.",
                                "There are two problems with this situation, one major, one minor.",
                                "Citrus fruits are a major source of vitamin C.",
                                "There has been a major change in attitudes recently.",
                                "The United States is a major influence in the United Nations."
                            ]
                        },
                        {
                            "explanation": "belonging or relating to a musical scale that is generally thought to have a happy sound: ",
                            "examples": [
                                "the key of C major",
                                "a concerto in A major"
                            ]
                        },
                        {
                            "explanation": "belonging or relating to the professional baseball and ice hockey leagues (= groups of teams who play games against each other) that play at the highest level: ",
                            "examples": [
                                "The team begin the major-league baseball season with high expectations of reaching the major world series.",
                                "He began this season playing major junior hockey in Canada."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmeɪ.dʒər"
                            ],
                            "us": [
                                "ˈmeɪ.dʒɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an officer of middle rank in the British, US, and many other armed forces: ",
                            "examples": [
                                "Her father was a major in the Scots Guards.",
                                "Major Winters/Richard Winters",
                                "Thank you, Major."
                            ]
                        },
                        {
                            "explanation": "the most important subject that a college or university student is studying, or the student himself or herself: ",
                            "examples": [
                                "What is your major, English or French?",
                                "She was a philosophy major at an Ivy League college."
                            ]
                        },
                        {
                            "explanation": "an important sports competition, especially in tennis or golf: ",
                            "examples": [
                                "The Australian Open is the first major of the year.",
                                "Serena Williams has won more majors than any other tennis player."
                            ]
                        },
                        {
                            "explanation": "the professional baseball leagues (= groups of teams who play games against each other) that play at the highest level: ",
                            "examples": [
                                "He first made it to the majors as a twenty-year-old."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈmeɪ.dʒər"
                            ],
                            "us": [
                                "ˈmeɪ.dʒɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to study something as your main subject at college or university: ",
                            "examples": [
                                "She majored in philosophy at Harvard."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}