{
    "word": "march",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mɑːtʃ"
                            ],
                            "us": [
                                "mɑːrtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an event in which a large number of people walk through a public place to express their support for something, or their disagreement with or disapproval of something: ",
                            "examples": [
                                "She's going on a march on Saturday in protest over the closure of the hospital."
                            ]
                        },
                        {
                            "explanation": "a piece of music with a strong, regular beat, written for marching to: ",
                            "examples": [
                                "a funeral march",
                                "Mendelssohn's Wedding March"
                            ]
                        },
                        {
                            "explanation": "a walk, especially by a group of soldiers all walking with the same movement and speed: ",
                            "examples": [
                                "It had been a long march and the soldiers were weary.",
                                "The border was within a day's march (= distance measured in time taken to walk it)."
                            ]
                        },
                        {
                            "explanation": "If soldiers are on the march, they have started marching to a place: ",
                            "examples": [
                                "Soldiers on the march were permitted to break their fast."
                            ]
                        },
                        {
                            "explanation": "If something is on the march, it is becoming successful or spreading through an area: ",
                            "examples": [
                                "In America, evangelical Christianity is on the march."
                            ]
                        },
                        {
                            "explanation": "the continuous development of a state, activity, or idea: ",
                            "examples": [
                                "It is impossible to stop the forward march of progress/time.",
                                "The island is being destroyed by the relentless march of tourism."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "mɑːtʃ"
                            ],
                            "us": [
                                "mɑːrtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to walk somewhere quickly and in a determined way, often because you are angry: ",
                            "examples": [
                                "She marched into my office and demanded to know why I hadn't written my report."
                            ]
                        },
                        {
                            "explanation": "to walk through a public place as part of a public event to express support for something, or disagreement with or disapproval of something: ",
                            "examples": [
                                "Over four thousand people marched through London today to protest against the proposed new law."
                            ]
                        },
                        {
                            "explanation": "to walk with regular steps and keeping the body stiff, usually in a formal group of people who are all walking in the same way: ",
                            "examples": [
                                "The band marched through the streets.",
                                "The soldiers marched 90 miles in three days."
                            ]
                        },
                        {
                            "explanation": "to forcefully make someone go somewhere by taking hold of that person and pulling them there or going there together: ",
                            "examples": [
                                "Without saying a word, she took hold of my arm and marched me off to the headmaster's office.",
                                "The police marched a gang of youths out of the building."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mɑːtʃ"
                            ],
                            "us": [
                                "mɑːrtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the third month of the year, after February and before April: ",
                            "examples": [
                                "The next meeting will be in March.",
                                "He left on 26 March.",
                                "She is retiring next March."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}