{
    "word": "margin",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmɑː.dʒɪn"
                            ],
                            "us": [
                                "ˈmɑːr.dʒɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the amount by which one thing is different from another: ",
                            "examples": [
                                "The Senate approved the use of military force by a margin of 52 votes to 47.",
                                "The poll shows that the government is leading by the narrowest of margins."
                            ]
                        },
                        {
                            "explanation": "the profit made on a product or service: ",
                            "examples": [
                                "Our increased profits are due to improved margins and successful cost control.",
                                "Using cheap labour increases profit margin."
                            ]
                        },
                        {
                            "explanation": "the empty space to the side of the text on a page, sometimes separated from the rest of the page by a vertical line: ",
                            "examples": [
                                "If I have any comments to make, I'll write them in the margin."
                            ]
                        },
                        {
                            "explanation": "the outer edge of an area: ",
                            "examples": [
                                "The plant tends to grow in the lighter margins of woodland areas."
                            ]
                        },
                        {
                            "explanation": "If someone is on the margins of a group of people, they are part of that group, but different in important ways, and if someone is on the margins of an activity, they are only slightly involved: ",
                            "examples": [
                                "He spent the 1980s on the margins of British politics.",
                                "We need to reach out to those on the margins of society."
                            ]
                        },
                        {
                            "explanation": "something that makes a particular thing possible, such as an extra amount of money, time, etc. allowed that makes it possible to deal with an emergency: ",
                            "examples": [
                                "There is not much margin for creativity in a job like this.",
                                "They allow an additional safety margin of five minutes between planes taking off."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}