{
    "word": "mark",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mɑːk"
                            ],
                            "us": [
                                "mɑːrk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small area on the surface of something that is damaged, dirty, or different in some way: ",
                            "examples": [
                                "There were dirty marks on her trousers where she had wiped her hands.",
                                "His fingers had left marks on the table's polished surface.",
                                "She had a red mark on her arm where she'd burned herself."
                            ]
                        },
                        {
                            "explanation": "a typical feature or one that allows you to recognize someone or something: ",
                            "examples": [
                                "Did your attacker have any distinguishing marks, such as a scar or a birthmark?",
                                "You can tell which puppy is which from the marks (also markings) on their fur."
                            ]
                        },
                        {
                            "explanation": "a symbol that is used for giving information: ",
                            "examples": [
                                "I've put a mark on the map where I think we should go for a picnic.",
                                "What do those marks in the middle of the road mean?"
                            ]
                        },
                        {
                            "explanation": "a written or printed symbol: ",
                            "examples": [
                                "a question mark",
                                "an exclamation mark",
                                "punctuation marks"
                            ]
                        },
                        {
                            "explanation": "a judgment, expressed as a number or letter, about the quality of a piece of work done at school, college, or university: ",
                            "examples": [
                                "What mark did you get in the biology exam?",
                                "Matilda's had very good marks in/for English throughout the year.",
                                "You scored full marks in the test - ten out of ten!"
                            ]
                        },
                        {
                            "explanation": "the level intended or wanted: ",
                            "examples": [
                                "Sales have already passed the million mark."
                            ]
                        },
                        {
                            "explanation": "an action that is understood to represent or show a characteristic of a person or thing or feeling: ",
                            "examples": [
                                "He took off his hat as a mark of respect for her dead husband.",
                                "It's the mark of a gentleman to stand up when someone enters the room.",
                                "I'd like to give this bottle of wine as a mark of appreciation for all the work you've done for us."
                            ]
                        },
                        {
                            "explanation": "a \nDeutschmark ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "mɑːk"
                            ],
                            "us": [
                                "mɑːrk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to correct mistakes in and give points for a piece of work: ",
                            "examples": [
                                "I was up half the night marking exam papers.",
                                "You'll be marked down (= given a lower mark) for poor spelling and punctuation."
                            ]
                        },
                        {
                            "explanation": "to make a mark on something or someone: ",
                            "examples": [
                                "Make sure you don't mark the walls while you're moving the furniture around.",
                                "A dark carpet won't mark as easily as a light one."
                            ]
                        },
                        {
                            "explanation": "to represent or show a characteristic of a person or thing or feeling: ",
                            "examples": [
                                "The band's songs have always been marked by controversial lyrics.",
                                "The signing of the treaty marked a major milestone on the road to European union."
                            ]
                        },
                        {
                            "explanation": "to show respect for or commemorate: ",
                            "examples": [
                                "Tomorrow's parade will mark the 50th anniversary of the battle."
                            ]
                        },
                        {
                            "explanation": "to show where something is by drawing or putting something somewhere: ",
                            "examples": [
                                "I've marked the route around the town's one-way system on the map.",
                                "I'd like everyone to mark their progress on the chart every week.",
                                "X marks the spot where the treasure is buried."
                            ]
                        },
                        {
                            "explanation": "to prevent a member of the opposing team from taking control of the ball by staying close to them all the time",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mɑːk"
                            ],
                            "us": [
                                "mɑːrk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used before a number to describe a particular version of a machine, especially one that is an improvement on the original version: ",
                            "examples": [
                                "The car has enjoyed modest success since its launch, but the Mark 2 version is expected to be far more popular."
                            ]
                        },
                        {
                            "explanation": "used before a number to show what temperature you should use for cooking something in a gas oven: ",
                            "examples": [
                                "Cook at Mark 5 for 20 minutes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}