{
    "word": "marriage",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmær.ɪdʒ"
                            ],
                            "us": [
                                "ˈmer.ɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a legally accepted relationship between two people in which they live together, or the official ceremony that results in this: ",
                            "examples": [
                                "They had a long and happy marriage.",
                                "She went to live in another state after the break-up of her marriage.",
                                "She has two daughters by her first marriage.",
                                "the marriage ceremony",
                                "The court decision legalized gay/same-sex marriage (= a marriage between two people of the same sex)."
                            ]
                        },
                        {
                            "explanation": "a type of relationship between people in which they live as married people but their relationship is not legally accepted : ",
                            "examples": [
                                "I believe that marriage is a divine institution and doesn't need legal status to be valid.",
                                "He has several wives, but our country does not recognize all of his marriages. ",
                                "Common-law marriage (= a marriage that is not official but is accepted because the people have lived together for a very long time) is only recognized in a few states."
                            ]
                        },
                        {
                            "explanation": "a marriage in which the partners have married not because they love each other, but in order to get an advantage, such as the right to live in the other partner's country: ",
                            "examples": [
                                "Marriages of convenience carry the risk of prosecution and even deportation."
                            ]
                        },
                        {
                            "explanation": "a combination of two or more things: ",
                            "examples": [
                                "His music is a marriage of jazz, blues, and pop."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}