{
    "word": "match",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mætʃ"
                            ],
                            "us": [
                                "mætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a sports competition or event in which two people or teams compete against each other: ",
                            "examples": [
                                "a tennis match",
                                "a football/cricket match",
                                "We won/lost the match.",
                                "Liverpool have a match with (= against) Blackburn next week."
                            ]
                        },
                        {
                            "explanation": "the person who has scored the most points or played the best in a match: ",
                            "examples": [
                                "The goalkeeper was replaced by an impressive stand-in who went on to win woman of the match."
                            ]
                        },
                        {
                            "explanation": "a short, thin stick made of wood or cardboard and covered with a special chemical at one end that burns when rubbed firmly against a rough surface: ",
                            "examples": [
                                "a box of matches",
                                "You should always strike a match away from you."
                            ]
                        },
                        {
                            "explanation": "to make something burn: ",
                            "examples": [
                                "Some of the pages were blackened, as though someone had put a match to them."
                            ]
                        },
                        {
                            "explanation": "a person or thing that is equal to another person or thing in strength, speed, or quality",
                            "examples": []
                        },
                        {
                            "explanation": "to be less powerful or effective than someone or something else: ",
                            "examples": [
                                "Gibson ran well but was no match for the young Italian."
                            ]
                        },
                        {
                            "explanation": "something that is similar to or combines well with something else: ",
                            "examples": [
                                "The curtains look great - they're a perfect match for the sofa."
                            ]
                        },
                        {
                            "explanation": "If two people who are having a relationship are a good match, they are very suitable for each other: ",
                            "examples": [
                                "Theirs is a match made in heaven (= a very good relationship)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "mætʃ"
                            ],
                            "us": [
                                "mætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be as good as someone or something else: ",
                            "examples": [
                                "It would be difficult to match the service this airline gives its customers."
                            ]
                        },
                        {
                            "explanation": "If two colours, designs, or objects match, they are similar or look attractive together: ",
                            "examples": [
                                "Do you think these two colours match?",
                                "Does this shirt match these trousers?",
                                "a sofa with curtains to match"
                            ]
                        },
                        {
                            "explanation": "to choose someone or something that is suitable for a particular person, activity, or purpose: ",
                            "examples": [
                                "In the first exercise you have to match each capital city to its country."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}