{
    "word": "matter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmæt.ər"
                            ],
                            "us": [
                                "ˈmæt̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a situation or subject that is being dealt with or considered: ",
                            "examples": [
                                "Could I talk to you about a personal matter?",
                                "Allen denied any knowledge of the matter.",
                                "Please phone me back - it's a matter of some importance.",
                                "Talking about the world's problems is one thing, but solving them is another matter altogether (= is completely different)."
                            ]
                        },
                        {
                            "explanation": "the situation being dealt with or being discussed: ",
                            "examples": [
                                "Her resignation is not going to help matters."
                            ]
                        },
                        {
                            "explanation": "the reason for pain, worry, or a problem: ",
                            "examples": [
                                "What's the matter? Why are you crying?",
                                "What's the matter with your hand? It's bleeding.",
                                "Is anything the matter?",
                                "I don't know what the matter is with the car, but it won't start."
                            ]
                        },
                        {
                            "explanation": "physical substance in the universe: ",
                            "examples": [
                                "Some scientists believe that there is about ten times as much matter in the universe as astronomers have observed."
                            ]
                        },
                        {
                            "explanation": "a substance of a particular kind: ",
                            "examples": [
                                "Most vegetable matter is compostable.",
                                "There's no waste matter left over."
                            ]
                        },
                        {
                            "explanation": "a substance or things of a particular type: ",
                            "examples": [
                                "advertising/printed matter",
                                "Do you find the subject matter of the book (= the subject that the book deals with) interesting?"
                            ]
                        },
                        {
                            "explanation": "used in expressions describing how small an amount or period of time is: ",
                            "examples": [
                                "The interview was over in a matter of minutes.",
                                "She complained he had short-changed her, but it was only a matter of a few pence."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈmæt.ər"
                            ],
                            "us": [
                                "ˈmæt̬.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be important, or to affect what happens: ",
                            "examples": [
                                "We were late but it didn't seem to matter.",
                                "\"What did you say?\" \"Oh, it doesn't matter.\"",
                                "It doesn't matter what you wear - just as long as you come.",
                                "It didn't matter that our best player was injured after ten minutes - we still won.",
                                "I know Charles doesn't think this project is important, but it matters to me."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}