{
    "word": "maximalist",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈmæk.sɪ.məl.ɪst"
                            ],
                            "us": [
                                "ˈmæk.sə.məl.ɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "belonging or relating to a style in art, design, etc. that uses the largest range of materials and colours possible, and very complicated shapes or forms: ",
                            "examples": [
                                "The current style for bar design is ostentatious and maximalist.",
                                "He showed how to wear the outfit in a maximalist way."
                            ]
                        },
                        {
                            "explanation": "taking as much action or showing as much involvement in a situation as possible: ",
                            "examples": [
                                "He argues for a maximalist interpretation of our military role.",
                                "The failure of the maximalist state does not imply the victory of the minimalist state."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmæk.sɪ.məl.ɪst"
                            ],
                            "us": [
                                "ˈmæk.sə.məl.ɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an artist or designer whose style uses the largest range of materials and colours possible, and very complicated shapes or forms: ",
                            "examples": [
                                "She is a maximalist and uses all the colour and trimming she can find in her clothing designs.",
                                "He aimed to be a maximalist in all he created."
                            ]
                        },
                        {
                            "explanation": "someone who takes as much action or shows as much involvement in a situation as possible: ",
                            "examples": [
                                "Above all, he is a romantic nationalist and political maximalist.",
                                "Maximalists believe one can always ask: is there a more just or more inclusive course of action we could take?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}