{
    "word": "might",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "modal verb",
                        "ipa": {
                            "uk": [
                                "maɪt"
                            ],
                            "us": [
                                "maɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple of the verb may, used especially when reporting what someone has said, thought, asked, etc.: ",
                            "examples": [
                                "I brought him some sandwiches because I thought he might be hungry.",
                                "Very politely the little boy asked if he might have another piece of cake (= he said \"May I have another piece of cake, please?\")."
                            ]
                        },
                        {
                            "explanation": "used to express the possibility that something will happen or be done, or that something is true although not very likely: ",
                            "examples": [
                                "I might come and visit you next year, if I can save enough money.",
                                "Don't go any closer - it might be dangerous/it might not be safe.",
                                "Driving so fast, he might have had a nasty accident (= it could have happened but it did not).",
                                "The rain might have stopped by now."
                            ]
                        },
                        {
                            "explanation": "used as a more polite form of may when asking for permission: ",
                            "examples": [
                                "Might I ask a question?",
                                "I wonder if I might have a quick look at your newspaper?"
                            ]
                        },
                        {
                            "explanation": "used to make a suggestion or suggest a possibility in a polite way: ",
                            "examples": [
                                "You might try a little more basil in the sauce next time.",
                                "I thought you might want to join me for dinner."
                            ]
                        },
                        {
                            "explanation": "used to suggest, especially angrily, what someone should do to be pleasant, correct, polite, etc.: ",
                            "examples": [
                                "You might at least try to look like you're enjoying yourself!",
                                "\"I asked my boss over for dinner tonight.\" \"Well, you might have asked me first!\""
                            ]
                        },
                        {
                            "explanation": "used to introduce a statement that is very different from the statement you really want to make, in order to compare the two: ",
                            "examples": [
                                "The amount you save might be small, but it's still worth doing."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "maɪt"
                            ],
                            "us": [
                                "maɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "power, strength, or force: ",
                            "examples": [
                                "Pizarro defeated the might of the Inca Empire with only a few hundred men.",
                                "She struggled with all her might to get free."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}