{
    "word": "mind",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "maɪnd"
                            ],
                            "us": [
                                "maɪnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part of a person that makes it possible for him or her to think, feel emotions, and understand things: ",
                            "examples": [
                                "Her mind was full of what had happened the night before, and she just wasn't concentrating.",
                                "Of course I'm telling the truth - you have such a suspicious mind!",
                                "I just said the first thing that came into my mind.",
                                "I'm not quite clear in my mind about what I'm doing."
                            ]
                        },
                        {
                            "explanation": "a very intelligent person: ",
                            "examples": [
                                "She was one of the most brilliant minds of the last century."
                            ]
                        },
                        {
                            "explanation": "If a problem is all in the mind, it does not exist and is only imagined: ",
                            "examples": [
                                "His doctor tried to convince him that he wasn't really ill and that it was all in his mind."
                            ]
                        },
                        {
                            "explanation": "to remember a piece of information when you are making a decision or thinking about a matter: ",
                            "examples": [
                                "Bearing in mind how young she is, I thought she did really well.",
                                "Of course, repair work is expensive and you have to keep that in mind."
                            ]
                        },
                        {
                            "explanation": "to think repeatedly about an event that has happened: ",
                            "examples": [
                                "She kept going over the accident again and again in her mind, wishing that she could somehow have prevented it."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "maɪnd"
                            ],
                            "us": [
                                "maɪnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(used in questions and negatives) to be annoyed or worried by something: ",
                            "examples": [
                                "Do you think he'd mind if I borrowed his book?",
                                "I don't mind having a dog in the house so long as it's clean.",
                                "I wouldn't mind (= I would like) something to eat, if that's OK.",
                                "Would you mind turning (= please turn) your radio down a little please?",
                                "Do you mind if I (= may I) put the TV on?",
                                "Do you mind me smoking?",
                                "I don't mind what you wear so long as it's not that awful pink shirt.",
                                "I'd rather stay in tonight, if you don't mind.",
                                "\"Would you like tea or coffee?\" \"I don't mind - either.\""
                            ]
                        },
                        {
                            "explanation": "said to someone when you feel annoyed with that person for what they have just done or said: ",
                            "examples": [
                                "Do you mind? That's my seat you're sitting on!"
                            ]
                        },
                        {
                            "explanation": "to be careful of, or give attention to something: ",
                            "examples": [
                                "Mind that box - the bottom isn't very strong.",
                                "Mind (that) you don't bang your head on the shelf when you stand up.",
                                "Mind (= make certain that) you take enough money with you.",
                                "Mind your language (= don't use swear words), young lady!"
                            ]
                        },
                        {
                            "explanation": "used to tell someone to move or be careful, or to warn someone of danger: ",
                            "examples": [
                                "Mind out! We're coming through with the stretcher.",
                                "\"Hey, mind!\" he said when she trod on his foot.",
                                "Mind out for falling rocks on this part of the trail."
                            ]
                        },
                        {
                            "explanation": "said when you say goodbye to someone, meaning \"take care\"",
                            "examples": []
                        },
                        {
                            "explanation": "to take care of someone or something: ",
                            "examples": [
                                "She asked me if I'd mind the children for an hour while she went shopping.",
                                "Could you mind my bag for a moment while I go to the toilet?"
                            ]
                        },
                        {
                            "explanation": "to listen to and obey someone: ",
                            "examples": [
                                "Mind your grandma!",
                                "This dog won't mind."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}