{
    "word": "miscue",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmɪs.kjuː"
                            ],
                            "us": [
                                "ˈmɪs.kjuː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in snooker and billiards, an occasion when a player does not hit the ball correctly with the cue (= the long stick used for hitting balls into the holes): ",
                            "examples": [
                                "A miscue occurs when the cue tip slides off the cue ball possibly due to insufficient chalk on the tip. ",
                                "His game contained more miscues than balls that hit the back of the pocket. "
                            ]
                        },
                        {
                            "explanation": "an occasion when a sports player makes a mistake when hitting, kicking, or catching the ball : ",
                            "examples": [
                                "Steven Gerrard's miscue was ugly and the ball skewed off-target.",
                                "The cricketer had no throwing errors and only five fielding miscues. "
                            ]
                        },
                        {
                            "explanation": "a mistake: ",
                            "examples": [
                                "The president was better known for his verbal miscues than his policymaking.",
                                "A series of procedural miscues called into question the legality of the telephone meetings."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "mɪsˈkjuː"
                            ],
                            "us": [
                                "mɪsˈkjuː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in snooker and billiards, to not hit the ball correctly with the cue (= the long stick used for hitting balls into the holes): ",
                            "examples": [
                                "Wilson miscued and split his cue tip, requiring a 15-minute break to carry out the repair.",
                                "He miscued the shot and the red missed by about six inches."
                            ]
                        },
                        {
                            "explanation": "to make a mistake when hitting, kicking, or catching the ball in sport: ",
                            "examples": [
                                "Ronaldo miscued one free kick but, potted his next one between the posts from 30 yards.",
                                "He attempted an overhead kick but miscued horribly."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}