{
    "word": "miss",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "mɪs"
                            ],
                            "us": [
                                "mɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fail to do or experience something, often something planned or expected, or to avoid doing or experiencing something: ",
                            "examples": [
                                "I missed the start of the class because my bus was late.",
                                "Often I miss (= do not eat) breakfast and have an early lunch instead.",
                                "You should leave early if you want to miss the rush hour.",
                                "I only just missed being run over by a bus this morning."
                            ]
                        },
                        {
                            "explanation": "to arrive too late to get on a bus, train, or aircraft: ",
                            "examples": [
                                "You'll miss your flight if you don't hurry up."
                            ]
                        },
                        {
                            "explanation": "to not go to something: ",
                            "examples": [
                                "Students who miss a lot of school can find it hard to catch up.",
                                "I'm trying to find an excuse for missing the office party."
                            ]
                        },
                        {
                            "explanation": "to not see or hear something or someone: ",
                            "examples": [
                                "I missed the beginning of the show.",
                                "Her latest movie is too good to miss (= it certainly should be seen).",
                                "I was sorry I missed you at Pat's party - I must have arrived after you left."
                            ]
                        },
                        {
                            "explanation": "to not notice someone or something: ",
                            "examples": [
                                "You don't miss much, do you? Nobody else noticed that mistake.",
                                "My office is first on the right with a bright red door. You can't miss it (= it is very easy to find).",
                                "A big neon sign has been put up where nobody can miss it.",
                                "A golden eagle is so large and distinctive that no birdwatcher, however inexperienced, could possibly miss it."
                            ]
                        },
                        {
                            "explanation": "to feel sad that a person or thing is not present: ",
                            "examples": [
                                "I really missed her when she went away.",
                                "She will be sadly missed by all who knew her.",
                                "I still miss my old car.",
                                "What did you miss most about home when you were living in France?",
                                "I haven't missed smoking like I expected to."
                            ]
                        },
                        {
                            "explanation": "to fail to hit something, or to avoid hitting something: ",
                            "examples": [
                                "The bullet missed his heart by a couple of centimetres.",
                                "I swerved to avoid the other car and only just missed a tree.",
                                "He threw a book at me, but he/it missed."
                            ]
                        },
                        {
                            "explanation": "to notice that something is lost or absent: ",
                            "examples": [
                                "He didn't miss his wallet until the waiter brought the bill."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mɪs"
                            ],
                            "us": [
                                "mɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when something or someone fails to hit something or avoids hitting something: ",
                            "examples": [
                                "Well done! You scored eight hits and only two misses."
                            ]
                        },
                        {
                            "explanation": "to avoid or not do something: ",
                            "examples": [
                                "We usually go to France in the summer, but we've decided to give it a miss this year."
                            ]
                        },
                        {
                            "explanation": "a girl or young woman, especially one who behaves rudely or shows no respect: ",
                            "examples": [
                                "You're a cheeky little miss! Apologize at once."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mɪs"
                            ],
                            "us": [
                                "mɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a title used before the family name or full name of a single woman who has no other title: ",
                            "examples": [
                                "Dr White will see you now, Miss Carter.",
                                "Miss Helena Lewis"
                            ]
                        },
                        {
                            "explanation": "used as a form of address for a girl or young woman: ",
                            "examples": [
                                "Excuse me, Miss, you dropped this."
                            ]
                        },
                        {
                            "explanation": "sometimes used by children to address or refer to teachers who are women: ",
                            "examples": [
                                "Can I go to the toilet, Miss?"
                            ]
                        },
                        {
                            "explanation": "a title given to a woman who wins a beauty contest, combined with the name of the place that she represents: ",
                            "examples": [
                                "Miss India/UK",
                                "the Miss World contest"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}