{
    "word": "model",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmɒd.əl"
                            ],
                            "us": [
                                "ˈmɑː.dəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that a copy can be based on because it is an extremely good example of its type: ",
                            "examples": [
                                "The educational system was a model for those of many other countries.",
                                "The developer plans to build a model community on the site.",
                                "They created an education system on the European model.",
                                "Even Chris, the very model of calmness (= someone who is usually extremely calm), was angered by having to work such long hours.",
                                "She really is a model (= perfect) student."
                            ]
                        },
                        {
                            "explanation": "a person who wears clothes so that they can be photographed or shown to possible buyers, or a person who is employed to be photographed or painted: ",
                            "examples": [
                                "a fashion/nude model",
                                "She's going out with a male model.",
                                "I worked as an artist's model when I was a college student."
                            ]
                        },
                        {
                            "explanation": "a particular type of machine, especially a car, that is slightly different from machines of the same type: ",
                            "examples": [
                                "Luxury/New models come with laser devices that help guide the car into a parking spot.",
                                "Whether it's a computer, iPod or mobile phone, she always has to have the latest model."
                            ]
                        },
                        {
                            "explanation": "a physical object, usually smaller than the real object, that is used to represent something: ",
                            "examples": [
                                "a plastic model aircraft",
                                "By looking at this model you can get a better idea of how the bridge will look."
                            ]
                        },
                        {
                            "explanation": "a simple representation of a system or process that can be used in calculations or predictions of what might happen: ",
                            "examples": [
                                "to construct a statistical/theoretical/mathematical model",
                                "No computer model of the economy can predict when the next recession will be."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈmɒd.əl"
                            ],
                            "us": [
                                "ˈmɑː.dəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US usually"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to wear fashionable clothes, jewellery, etc. in order to advertise them: ",
                            "examples": [
                                "Tatjana is modelling a Versace design.",
                                "I used to model when I was younger."
                            ]
                        },
                        {
                            "explanation": "to make a model of something: ",
                            "examples": [
                                "to model animals out of clay",
                                "to model clay into animal shapes",
                                "The whole car can be modelled on a computer before a single component is made."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}