{
    "word": "modulation",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌmɒdʒ.əˈleɪ.ʃən"
                            ],
                            "us": [
                                "ˌmɑː.dʒəˈleɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a change in the style, loudness, etc. of something such as your voice in order to achieve an effect or express an emotion: ",
                            "examples": [
                                "The Minister has evidently practised the modulation of her voice.",
                                "The actors sit on stools and present the script and character through intonation and other voice modulations."
                            ]
                        },
                        {
                            "explanation": "a small change that happens in response to something or is intended to achieve an effect: ",
                            "examples": [
                                "A surreal, nightmarish atmosphere is created in the film by constant modulations of colouring of the light.",
                                "His performance is exceptional in its intensity and subtle modulation."
                            ]
                        },
                        {
                            "explanation": "the ability to control, influence or change a particular physical process: ",
                            "examples": [
                                "This area of the brain is involved in the modulation of emotional behaviour. ",
                                "The proteinase inhibitor function has been associated with modulation of cell growth. "
                            ]
                        },
                        {
                            "explanation": "a change from one musical key to another: ",
                            "examples": [
                                "the composer's use of modulation",
                                "It is best to write what sounds smooth and natural, so we should forget about modulations to far-distant keys (e. g. C to F)."
                            ]
                        },
                        {
                            "explanation": "the process of changing the amplitude or frequency of an electrical signal by mixing it with another signal, or a signal that has been changed like this: ",
                            "examples": [
                                "With traditional radar, the modulation and frequency of the signal can be fine-tuned to produce the easiest-to-read echo."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}