{
    "word": "move",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "muːv"
                            ],
                            "us": [
                                "muːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) change position: ",
                            "examples": [
                                "I'm so cold I can't move my fingers.",
                                "Will you help me move this table to the back room?",
                                "Can we move (= change the time of) the meeting from 2 p.m. to 3.30 p.m. ?",
                                "Don't move! Stay right where you are.",
                                "I thought I could hear someone moving about/around upstairs.",
                                "If you move along/over/up (= go further to the side, back, or front) a little, Tess can sit next to me.",
                                "Police officers at the scene of the accident were asking people to move along/on (= to go to a different place).",
                                "Come on, it's time we were moving (= time for us to leave).",
                                "Let's stay here tonight, then move on (= continue our journey) tomorrow morning."
                            ]
                        },
                        {
                            "explanation": "to change the position of one of the pieces used in a board game: ",
                            "examples": [
                                "In chess, the pieces can only move in certain directions."
                            ]
                        },
                        {
                            "explanation": "to go to a different place to live or work: ",
                            "examples": [
                                "We're moving to Paris.",
                                "They've bought a new house, but it will need a lot of work before they can move into it/move in.",
                                "I hear Paula has moved in with her boyfriend (= gone to live in his house).",
                                "The couple next door moved away (= went to live somewhere else) last year.",
                                "A lot of businesses are moving out of London because it's too expensive."
                            ]
                        },
                        {
                            "explanation": "to leave your home in order to live in a new one: ",
                            "examples": [
                                "We're moving house next week."
                            ]
                        },
                        {
                            "explanation": "to (cause to) progress, change, or happen in a particular way or direction: ",
                            "examples": [
                                "The judge's decision will allow the case to move forward.",
                                "If you want to move ahead in your career, you'll have to work harder.",
                                "Share prices moved up/down slowly yesterday.",
                                "Sophie has been moved up/down a grade at school.",
                                "It's time this company moved into (= started to take advantage of the benefits of) the digital age."
                            ]
                        },
                        {
                            "explanation": "to cause someone to take action: ",
                            "examples": [
                                "I can't imagine what could have moved him to say such a thing."
                            ]
                        },
                        {
                            "explanation": "to (cause to) change an opinion or the way in which you live or work: ",
                            "examples": [
                                "He's made up his mind, and nothing you can say will move him on the issue.",
                                "More and more people are movingaway from/towards vegetarianism."
                            ]
                        },
                        {
                            "explanation": "to cause someone to have strong feelings, such as sadness, sympathy, happiness, or admiration: ",
                            "examples": [
                                "She said that she was deeply moved by all the letters of sympathy she had received.",
                                "It was such a sad film that it moved him to tears (= made him cry)."
                            ]
                        },
                        {
                            "explanation": "to sell: ",
                            "examples": [
                                "No one wants to buy these toys - we just can't move them.",
                                "This new shampoo is moving really fast."
                            ]
                        },
                        {
                            "explanation": "to spend time with people: ",
                            "examples": [
                                "She moves in/among a very small circle of people."
                            ]
                        },
                        {
                            "explanation": "to suggest something, especially formally at a meeting or in a law court: ",
                            "examples": [
                                "A vote was just about to be taken when someone stood up and said that they wished to move an amendment.",
                                "I move that the proposal be accepted.",
                                "Your Honour, we wish to move for dismissal of the charges."
                            ]
                        },
                        {
                            "explanation": "(used especially by doctors and nurses) to pass the contents of the bowels out of the body: ",
                            "examples": [
                                "The doctor asked him if he'd moved his bowels that day."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "muːv"
                            ],
                            "us": [
                                "muːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an act of moving: ",
                            "examples": [
                                "She held the gun to his head and said, \"One move and you're dead!\"",
                                "I hate the way my boss watches my every move (= watches everything I do)."
                            ]
                        },
                        {
                            "explanation": "a movement or series of movements that form part of a dance: ",
                            "examples": [
                                "I picked up some new dance moves.",
                                "Show us your moves!"
                            ]
                        },
                        {
                            "explanation": "in some board games, a change of the position of one of the pieces used to play the game, or a change of position that is allowed by the rules, or a player's turn to move their piece: ",
                            "examples": [
                                "It takes a long time to learn all the moves in chess.",
                                "It's your move."
                            ]
                        },
                        {
                            "explanation": "an occasion when you go to live or work in a different place: ",
                            "examples": [
                                "We've had four moves in three years."
                            ]
                        },
                        {
                            "explanation": "an action taken to achieve something: ",
                            "examples": [
                                "Buying those shares was a good move.",
                                "This move towards improving childcare facilities has been widely welcomed.",
                                "The city council is making a move to improve traffic flow in the city."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}