{
    "word": "movement",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈmuːv.mənt"
                            ],
                            "us": [
                                "ˈmuːv.mənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a change of position: ",
                            "examples": [
                                "He made a sudden movement and frightened the bird away.",
                                "For a long time after the accident, he had no movement in (= was unable to move) his legs.",
                                "Her movements were somewhat clumsy."
                            ]
                        },
                        {
                            "explanation": "what someone is doing during a particular period: ",
                            "examples": [
                                "I don't know his movements this week."
                            ]
                        },
                        {
                            "explanation": "a group of people with a particular set of aims or ideas : ",
                            "examples": [
                                "the women's movement",
                                "the antiwar movement",
                                "The suffragette movement campaigned for votes for women.",
                                "He was a prominent member of the artistic movement known as the Ashcan School. ",
                                "Mulligan became involved in a movement to develop a different style of jazz."
                            ]
                        },
                        {
                            "explanation": "a situation in which people change their opinion or the way that they live or work: ",
                            "examples": [
                                "There has been a movement towards more women going back to work while their children are still young.",
                                "Recently there has been some movement away from traditional methods of teaching."
                            ]
                        },
                        {
                            "explanation": "an occasion when something develops, changes, or happens in a particular way or direction: ",
                            "examples": [
                                "There has been little movement in the dollar (= it has not changed in value very much) today."
                            ]
                        },
                        {
                            "explanation": "one of the main parts of a piece of classical music: ",
                            "examples": [
                                "Beethoven's fifth symphony has four movements."
                            ]
                        },
                        {
                            "explanation": "the part of a clock or watch that turns the hands (= thin sticks) that point to the time",
                            "examples": []
                        },
                        {
                            "explanation": "(used especially by doctors and nurses) an act of emptying the bowels: ",
                            "examples": [
                                "When did you last have a (bowel) movement?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}