{
    "word": "mute",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "mjuːt"
                            ],
                            "us": [
                                "mjuːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "silent or not speaking: ",
                            "examples": [
                                "The president has remained mute about plans to curtail the number of immigrants.",
                                "I gazed at her in mute admiration."
                            ]
                        },
                        {
                            "explanation": "a word used to describe someone who is not able to speak, which was used by doctors in the past but is now offensive",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "mjuːt"
                            ],
                            "us": [
                                "mjuːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device for changing the sound of a musical instrument, usually making it quieter: ",
                            "examples": [
                                "He was playing his trumpet with a mute."
                            ]
                        },
                        {
                            "explanation": "a button on an electronic device that makes it silent: ",
                            "examples": [
                                "I pressed the mute on my phone so she couldn't hear the people talking in the background.",
                                "He was watching TV with the mute button on."
                            ]
                        },
                        {
                            "explanation": "having the mute button pressed on a device so that it does not produce any sound: ",
                            "examples": [
                                "Place your phone on mute or vibrate or turn it off completely.",
                                "Advertising annoys me; I put the TV on mute during every ad break."
                            ]
                        },
                        {
                            "explanation": "a word for someone who is not able to speak, which was used by doctors in the past but is now extremely offensive",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "mjuːt"
                            ],
                            "us": [
                                "mjuːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you mute a noise, or a device making a noise, you make it less loud or not able to be heard at all: ",
                            "examples": [
                                "Heavy curtains muted the noise of the traffic.",
                                "She muted the TV so she could hear what he was saying.",
                                "Don't forget to mute your microphone when another person on the call is speaking."
                            ]
                        },
                        {
                            "explanation": "to make a person unable to be heard, for example when using video conferencing software: ",
                            "examples": [
                                "Automatically mute participants as they join the meeting, and allow participants to unmute themselves if they want to speak to others in the meeting."
                            ]
                        },
                        {
                            "explanation": "If you mute a musical instrument, you attach a device to it that changes its sound, usually making it quieter: ",
                            "examples": [
                                "The song features muted trumpets."
                            ]
                        },
                        {
                            "explanation": "to stop someone's messages, pictures, etc. appearing on a social media website when you look at it, without removing the person as a friend: ",
                            "examples": [
                                "Instagram now lets you mute your friends."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}