{
    "word": "myself",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "pronoun",
                        "ipa": {
                            "uk": [
                                "maɪˈself"
                            ],
                            "us": [
                                "maɪˈself"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used when the subject of the verb is \"I\" and the object is the same person: ",
                            "examples": [
                                "I bought myself a new coat.",
                                "I caught sight of myself in the mirror.",
                                "Yes, I thought to myself, it's time to take a holiday."
                            ]
                        },
                        {
                            "explanation": "used to emphasize \"I\" as the subject of a sentence: ",
                            "examples": [
                                "I myself don't like a heavy meal at lunchtime.",
                                "I don't like a heavy meal at lunchtime myself."
                            ]
                        },
                        {
                            "explanation": "used instead of \"I\" or \"me\": ",
                            "examples": [
                                "My husband and myself were delighted with the gift.",
                                "They very kindly invited my sister and myself to the inauguration."
                            ]
                        },
                        {
                            "explanation": "alone or without help from anyone else: ",
                            "examples": [
                                "I live by myself .",
                                "I had to do the whole job all by myself .",
                                "I'm ashamed to say I ate the whole plateful all by myself.",
                                "Are you going to leave me all by myself?",
                                "I don't especially like travelling by myself.",
                                "I managed to take a shower by myself for the first time since the operation.",
                                "I can't move all those boxes by myself."
                            ]
                        },
                        {
                            "explanation": "for my use only: ",
                            "examples": [
                                "I never get an hour to myself.",
                                "I had a couple of hours to myself between appointments so I thought I'd visit the cathedral.",
                                "I usually get an hour or so to myself before the rest of the family get up and I love it.",
                                "I had a double room all to myself and it was wonderful.",
                                "For half an hour I had the whole pool to myself.",
                                "So I get to have you all to myself this evening, do I?"
                            ]
                        },
                        {
                            "explanation": "not to be or feel as happy or as healthy as usual: ",
                            "examples": [
                                "I'm sure you're aware that I haven't been myself lately.",
                                "I went to see the doctor because I haven't been quite myself lately.",
                                "I'm normally pretty upbeat but I really haven't felt myself since the news.",
                                "I don't know how else to put it except that I haven't been feeling like myself.",
                                "Since the accident I haven't felt myself.",
                                "I thought I was doing better, but I still don't quite feel like myself yet."
                            ]
                        },
                        {
                            "explanation": "used when describing your state of mind when you are physically ill: ",
                            "examples": [
                                "I'm well enough in myself (= happy) - I've just got this nagging headache."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}