{
    "word": "name",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "neɪm"
                            ],
                            "us": [
                                "neɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the word or words that a person, thing, or place is known by: ",
                            "examples": [
                                "\"Hi, what's your name?\" \"My name's Diane.\"",
                                "Please write your full (= complete) name and address on the form.",
                                "What's the name of that mountain in the distance?",
                                "We finally agreed on the name Luca for our son.",
                                "The students were listed by name and by country of origin."
                            ]
                        },
                        {
                            "explanation": "the opinion or reputation that someone or something has: ",
                            "examples": [
                                "She went to court to clear her name (= prove that the bad things said about her were not true).",
                                "The fans' actions gave our team a bad name in the youth league at that time.",
                                "They're trying to restore the good name of the manufacturer."
                            ]
                        },
                        {
                            "explanation": "someone who is famous or has a good reputation: ",
                            "examples": [
                                "It seemed like all the big names in football were there."
                            ]
                        },
                        {
                            "explanation": "called: ",
                            "examples": [
                                "I need to talk to a professor by the name of Bin Said."
                            ]
                        },
                        {
                            "explanation": "to give yourself a name that is not your real name: ",
                            "examples": [
                                "In the business world he goes by the name of J. Walter Fortune."
                            ]
                        },
                        {
                            "explanation": "for someone or belonging to someone: ",
                            "examples": [
                                "I'm here to pick up my tickets - I reserved them by phone yesterday in the name of Tremin."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "neɪm"
                            ],
                            "us": [
                                "neɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give someone or something a name: ",
                            "examples": [
                                "We named our dogs Shandy and Belle.",
                                "A man named Dennis answered the door."
                            ]
                        },
                        {
                            "explanation": "to say what something or someone's name is: ",
                            "examples": [
                                "In the first question you had to name three types of monkey.",
                                "He couldn't name his attacker."
                            ]
                        },
                        {
                            "explanation": "to choose someone or something: ",
                            "examples": [
                                "Just name the time and I'll be there.",
                                "Name your conditions/terms/price.",
                                "Ms Martinez has been named (as) the new Democratic candidate."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}