{
    "word": "native",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈneɪ.tɪv"
                            ],
                            "us": [
                                "ˈneɪ.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to or describing someone's country or place of birth or someone who was born in a particular country or place: ",
                            "examples": [
                                "She returned to live and work in her native Japan.",
                                "She's a native Californian."
                            ]
                        },
                        {
                            "explanation": "used to refer to plants and animals that grow naturally in a place, and have not been brought there from somewhere else: ",
                            "examples": [
                                "Henderson Island in the Pacific has more than 55 species of native flowering plants.",
                                "The horse is not native to America - it was introduced by the Spanish."
                            ]
                        },
                        {
                            "explanation": "relating to the first people to live in an area: ",
                            "examples": [
                                "The Aborigines are the native inhabitants of Australia.",
                                "the native population",
                                "native customs and traditions"
                            ]
                        },
                        {
                            "explanation": "the first language that someone learns: ",
                            "examples": [
                                "French is his native tongue."
                            ]
                        },
                        {
                            "explanation": "the country in which someone was born and lived while young: ",
                            "examples": [
                                "Our enemies have attacked us on our native soil, killing thousands.",
                                "The team's players seemed glad to be back on their native soil."
                            ]
                        },
                        {
                            "explanation": "A native ability or characteristic is one that a person or thing has naturally and is part of their basic character: ",
                            "examples": [
                                "his native wit"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈneɪ.tɪv"
                            ],
                            "us": [
                                "ˈneɪ.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who was born in a particular place, or a plant or animal that lives or grows naturally in a place and has not been brought from somewhere else: ",
                            "examples": [
                                "a native of Monaco",
                                "The red squirrel is a native of Britain."
                            ]
                        },
                        {
                            "explanation": "an extremely offensive word for someone who lived in a country, especially in Africa, before Europeans went there",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}