{
    "word": "need",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "niːd"
                            ],
                            "us": [
                                "niːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have to have something, or to want something very much: ",
                            "examples": [
                                "Babies need constant care.",
                                "The doctor said I needed an operation.",
                                "I need to go to the toilet.",
                                "Most people need to feel loved.",
                                "I need you to help me choose an outfit.",
                                "I badly need (= strongly want) a rest from all this.",
                                "I don't need all this hassle."
                            ]
                        },
                        {
                            "explanation": "If you say that someone or something needs something else, you mean that they should have it, or would get an advantage from having it: ",
                            "examples": [
                                "What you need is a nice hot bowl of soup.",
                                "This room needs cleaning.",
                                "She needs her hair washed."
                            ]
                        },
                        {
                            "explanation": "to have (to): ",
                            "examples": [
                                "He needs to lose some weight.",
                                "I need to do some shopping on my way home from work.",
                                "There needs to be more effort from everyone.",
                                "I don't think we need ask him.",
                                "Nothing need be done about this till next week.",
                                "\"Need we take your mother?\" \"No, we needn't.\""
                            ]
                        },
                        {
                            "explanation": "there is no reason for someone or something to do a particular thing: ",
                            "examples": [
                                "You needn't worry - I'm not going to mention it to anyone.",
                                "It's a wonderful way of getting to see Italy, and it needn't cost very much."
                            ]
                        },
                        {
                            "explanation": "used, often when you are angry with someone, to say that they should not do a particular thing or that they have no right to do it: ",
                            "examples": [
                                "He needn't think I'm driving him all the way there!",
                                "You needn't laugh! It'll be your turn next!"
                            ]
                        },
                        {
                            "explanation": "used to say either that someone did a particular thing although they did not have to, or that someone did not do it because they did not have to: ",
                            "examples": [
                                "I gave her some extra money - I know I didn't need to but I thought it would be kind.",
                                "\"Did you ask Sophia to help?\" \"I didn't need to - I managed perfectly well on my own.\""
                            ]
                        },
                        {
                            "explanation": "it was not necessary for someone to have done a particular thing, although they did do it: ",
                            "examples": [
                                "You needn't have washed all those dishes, you know - I'd have done them myself when I got home.",
                                "You needn't have worried about the dinner - it was delicious!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "niːd"
                            ],
                            "us": [
                                "niːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the state of having to have something that you do not have, especially something that you must have so that you can have a satisfactory life: ",
                            "examples": [
                                "Are you in need of help?",
                                "There's a growing need for cheap housing in the larger cities."
                            ]
                        },
                        {
                            "explanation": "the things that a person must have in order to have a satisfactory life: ",
                            "examples": [
                                "Housing and education are basic needs.",
                                "They don't have enough food to meet their needs."
                            ]
                        },
                        {
                            "explanation": "a feeling or state of strongly wanting something: ",
                            "examples": [
                                "He seems to have a desperate need to be loved by everyone.",
                                "I don't know about you but I'm in need of a drink.",
                                "We have no need of your sympathy."
                            ]
                        },
                        {
                            "explanation": "not having enough money or food: ",
                            "examples": [
                                "You just hope that the money goes to those who are most in need."
                            ]
                        },
                        {
                            "explanation": "the state of being necessary: ",
                            "examples": [
                                "Help yourself to stationery as the need arises.",
                                "If need/needs be (= if necessary), we can take a second car to fit everyone in.",
                                "I don't think there's any need for all of us to attend the meeting."
                            ]
                        },
                        {
                            "explanation": "If there is no need to do something, it is not necessary or it is wrong: ",
                            "examples": [
                                "There's no need to buy more food - there's plenty in the fridge.",
                                "I understand why she was angry, but there was no need to be so nasty to him.",
                                "There's no need to yell! Just calm down."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}