{
    "word": "negative",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈneɡ.ə.tɪv"
                            ],
                            "us": [
                                "ˈneɡ.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "expressing \"no\": ",
                            "examples": [
                                "We received a negative answer to our request."
                            ]
                        },
                        {
                            "explanation": "A negative sentence or phrase is one that contains a word such as \"not\", \"no\", \"never\", or \"nothing\": ",
                            "examples": [
                                "\"I've never seen him in my life\" is a negative sentence.",
                                "\"Don't\" and \"do not\" are negative forms of \"do\"."
                            ]
                        },
                        {
                            "explanation": "not expecting good things, or likely to consider only the bad side of a situation: ",
                            "examples": [
                                "a negative attitude",
                                "You're so negative about everything!"
                            ]
                        },
                        {
                            "explanation": "bad or harmful: ",
                            "examples": [
                                "The warm winter has had a very negative effect/impact on the ski industry."
                            ]
                        },
                        {
                            "explanation": "of the type of electrical charge that is carried by electrons",
                            "examples": []
                        },
                        {
                            "explanation": "(of a test) showing that an illness, condition, drug, chemical, etc. is not present : ",
                            "examples": [
                                "a negative pregnancy test",
                                "The results of his HIV test were negative.",
                                "Any urine test result that is negative for methadone should be discussed with the patient immediately."
                            ]
                        },
                        {
                            "explanation": "(of a person or thing) having had a negative test result for something: ",
                            "examples": [
                                "We each took a Covid test - I was positive but my husband was negative.",
                                "Her urine was negative for protein.",
                                "Two children were not allowed into school even though they tested negative for the virus."
                            ]
                        },
                        {
                            "explanation": "(of a number or amount) less than zero: ",
                            "examples": [
                                "negative numbers"
                            ]
                        },
                        {
                            "explanation": "not having the rhesus factor in the blood: ",
                            "examples": [
                                "Her blood type is O negative."
                            ]
                        },
                        {
                            "explanation": "A negative image is one in which the dark areas of what is being photographed are light and the light areas of what is being photographed are dark: ",
                            "examples": [
                                "A very early method of photography used paper sensitized with silver iodide to produce a negative image."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈneɡ.ə.tɪv"
                            ],
                            "us": [
                                "ˈneɡ.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an image in which dark areas of what is being photographed appear light and light areas of what is being photographed appear dark, the opposite to a normal image: ",
                            "examples": [
                                "black-and-white/colour negatives",
                                "I've borrowed the negatives of her wedding photos so I can get some pictures printed."
                            ]
                        },
                        {
                            "explanation": "a word or statement that expresses \"no\": ",
                            "examples": [
                                "I didn't hear your answer, Ed - was that a negative?",
                                "I'm afraid the reply was definitely in the negative (= was \"no\")."
                            ]
                        },
                        {
                            "explanation": "a bad feature or characteristic: ",
                            "examples": [
                                "He always looks for the negatives in any situation."
                            ]
                        },
                        {
                            "explanation": "a result of a scientific test that shows that something does not exist or is not present: ",
                            "examples": [
                                "Of the 1,000 tested, the most likely outcome is that 989 will get a true negative, one a true positive and 10 a false positive."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈneɡ.ə.tɪv"
                            ],
                            "us": [
                                "ˈneɡ.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to answer no to a question or request: ",
                            "examples": [
                                "Her request was politely and earnestly negatived.",
                                "He shook his head - not in negativing the question, but in negativing the notion that he should be expected to answer it at all."
                            ]
                        },
                        {
                            "explanation": "to refuse to allow something: ",
                            "examples": [
                                "One of the gentlemen proposed that I join them, but his wife instantly negatived the notion.",
                                "I am aware that this motion will be negatived."
                            ]
                        },
                        {
                            "explanation": "to show that something is not true: ",
                            "examples": [
                                "In criminal proceedings the burden of negativing self-defence was on the prosecution, whereas in civil proceedings the burden was on the defendant.",
                                "Do you think that science negatives the idea of a personal god as taught by Jesus Christ?"
                            ]
                        },
                        {
                            "explanation": "to cause something to have no effect: ",
                            "examples": [
                                "Ignorance of the law may not negative the fault requirements of a particular offence."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}