{
    "word": "nerve",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "nɜːv"
                            ],
                            "us": [
                                "nɝːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of long, thin fibres (= structures like threads) that carry information or instructions between the brain and other parts of the body: ",
                            "examples": [
                                "the optic nerve",
                                "a spinal nerve",
                                "Some conditions, such as diabetes, can cause nerve damage.",
                                "nerve fibres"
                            ]
                        },
                        {
                            "explanation": "the courage or confidence necessary to do something difficult, unpleasant, or rude: ",
                            "examples": [
                                "It takes a lot of nerve to be a bomb disposal expert.",
                                "I wanted to ask her out, but I lost my nerve and couldn't go through with it.",
                                "I didn't have the nerve to tell him what I really thought of his suggestion."
                            ]
                        },
                        {
                            "explanation": "worry or anxiety about something that is going to happen: ",
                            "examples": [
                                "I never suffer from nerves when I'm speaking in public."
                            ]
                        },
                        {
                            "explanation": "to annoy someone a lot: ",
                            "examples": [
                                "We really got on each other's nerves when we were living together."
                            ]
                        },
                        {
                            "explanation": "the ability to be calm in difficult situations: ",
                            "examples": [
                                "You need a cool head and steady nerves for this job."
                            ]
                        },
                        {
                            "explanation": "the rudeness to do something that you know will upset other people: ",
                            "examples": [
                                "She's late for work every day, but she still has the nerve to lecture me about punctuality.",
                                "That man has some nerve! He's always blaming me for things that are his fault.",
                                "That man has such a nerve!",
                                "She drove the car into a tree and then told me it was my fault for not concentrating, of all the nerve!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "nɜːv"
                            ],
                            "us": [
                                "nɝːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make yourself brave enough to do something: ",
                            "examples": [
                                "It took her several months before she eventually nerved herself (up) to invite him to her house.",
                                "He took a deep breath, nerved himself, and jumped into the icy waters.",
                                "Finally, twenty minutes into the meeting, she nerved herself to speak up.",
                                "On the way to the meeting room he'd been nerving himself for the confrontation.",
                                "She felt sick inside, nerving herself for the question she was about to put to him.",
                                "Eventually, I nerved myself up to speak."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}