{
    "word": "nest",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "nest"
                            ],
                            "us": [
                                "nest"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a structure built by birds or insects to leave their eggs in to develop, and by some other animals to give birth or live in: ",
                            "examples": [
                                "a bird's nest",
                                "a wasps'/hornets' nest",
                                "a rat's nest",
                                "Cuckoos are famous for laying their eggs in the nests of other birds.",
                                "The alligators build their nests out of grass near the water's edge."
                            ]
                        },
                        {
                            "explanation": "a comfortable home: ",
                            "examples": [
                                "One day the children grow up and leave the nest."
                            ]
                        },
                        {
                            "explanation": "a place where something unpleasant or unwanted has developed: ",
                            "examples": [
                                "The diplomats have been sent home because their embassy has become a nest of spies."
                            ]
                        },
                        {
                            "explanation": "a set of things that are similar but different in size and have been designed to fit inside each other: ",
                            "examples": [
                                "I'd like a nest of tables for the living room."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "nest"
                            ],
                            "us": [
                                "nest"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to build a nest, or live in a nest: ",
                            "examples": [
                                "We've got some swallows nesting in our roof at the moment.",
                                "Farm buildings are ideal nesting sites for barn owls."
                            ]
                        },
                        {
                            "explanation": "to fit one object inside another, or to fit inside in this way: ",
                            "examples": [
                                "nested coffee tables",
                                "dolls that nest inside one another"
                            ]
                        },
                        {
                            "explanation": "to put a piece of information, text, etc. inside another, or at a lower level in a system: ",
                            "examples": [
                                "Each document has a root element and all elements must be nested within other elements. ",
                                "Text documents often comprise nested regions like lists within lists or procedures within procedures."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}