{
    "word": "net zero",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌnet ˈzɪə.rəʊ"
                            ],
                            "us": [
                                "ˌnet ˈzɪr.oʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a country, city, etc.) removing as many emissions (= gases that cause the earth to warm up) as it produces: ",
                            "examples": [
                                "There are five ways to make the UK net zero.",
                                "The main goal was to be a carbon-neutral or net-zero city."
                            ]
                        },
                        {
                            "explanation": "(of a building or set of buildings) designed to produce as much energy as it uses : ",
                            "examples": [
                                "The net zero house has panels on the roof to convert sunlight to electricity.",
                                "There are plans to make the warehouse a net zero building. "
                            ]
                        },
                        {
                            "explanation": "used to refer to a situation in which there is a balance between the number of people arriving and leaving, of jobs created and lost, etc.: ",
                            "examples": [
                                "Even with net zero immigration and the current birthrate, our population would continue to grow for many years. ",
                                "He predicts a net-zero to negative growth in new jobs."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌnet ˈzɪə.rəʊ"
                            ],
                            "us": [
                                "ˌnet ˈzɪr.oʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the point at which a country, industry, company, etc. removes as many emissions (= gases that cause the earth to warm up) as it produces: ",
                            "examples": [
                                "We have definitely taken the important first steps to reducing our carbon emissions to net zero.",
                                "The government pledged to arrive at net-zero by 2021."
                            ]
                        },
                        {
                            "explanation": "a situation in which there is a balance between the number of people arriving and leaving, of jobs created and lost, etc.: ",
                            "examples": [
                                "He suggested that immigration should be reduced to at least net zero.",
                                "We'll have some move costs, but overall it will come pretty close to net-zero."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}