{
    "word": "neutral",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈnjuː.trəl"
                            ],
                            "us": [
                                "ˈnuː.trəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not saying or doing anything that would encourage or help any of the groups involved in an argument or war: ",
                            "examples": [
                                "If there's an argument between my daughter and her mother, it's important that I remain neutral.",
                                "The peace conference would have to be held in a neutral country.",
                                "I'd rather meet on neutral ground/territory (= somewhere not controlled by or connected to either of us) rather than in his apartment."
                            ]
                        },
                        {
                            "explanation": "A neutral ground or field is a sports stadium that does not belong to either of the two teams taking part in a competition or game: ",
                            "examples": [
                                "The final will, of course, be played at a neutral ground. ",
                                "The Superbowl always takes place on a neutral field."
                            ]
                        },
                        {
                            "explanation": "having features or characteristics that are not easily noticed: ",
                            "examples": [
                                "Kelly wants dark red walls, but I'd like a more neutral colour like cream."
                            ]
                        },
                        {
                            "explanation": "A neutral chemical substance is neither an acid nor an alkali: ",
                            "examples": [
                                "Pure water is neutral and has a pH of 7."
                            ]
                        },
                        {
                            "explanation": "A neutral particle has no electrical charge: ",
                            "examples": [
                                "Atoms consist of positively-charged protons, negatively-charged electrons and neutral particles called neutrons."
                            ]
                        },
                        {
                            "explanation": "A neutral wire is a wire in an electric circuit that almost always has zero voltage and is there to complete the circuit: ",
                            "examples": [
                                "The currents flowing in the live and neutral wires are the same, because they form part of a series circuit."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈnjuː.trəl"
                            ],
                            "us": [
                                "ˈnuː.trəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the position of the gears in a vehicle when they are not connected to the engine: ",
                            "examples": [
                                "to leave the car in neutral"
                            ]
                        },
                        {
                            "explanation": "a state of no activity or development: ",
                            "examples": [
                                "After two years in neutral, the economy is finally moving forward again."
                            ]
                        },
                        {
                            "explanation": "a neutral person or thing: ",
                            "examples": [
                                "Sweden and Switzerland were neutrals during the war."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}