{
    "word": "news",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "njuːz"
                            ],
                            "us": [
                                "nuːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "information or reports about recent events: ",
                            "examples": [
                                "That's the best (piece of) news I've heard for a long time!",
                                "We've had no news of them since they left for Australia.",
                                "Have you heard the news about Tina and Tom? They're getting divorced.",
                                "I can't wait to hear all your news.",
                                "The news that Dan had resigned took everyone by surprise.",
                                "We've got some good news for you. We're getting married."
                            ]
                        },
                        {
                            "explanation": "a television or radio programme consisting of reports about recent events: ",
                            "examples": [
                                "Was there anything interesting on the news tonight?",
                                "I saw it on the 6 o'clock news.",
                                "I usually watch the early evening/late night news."
                            ]
                        },
                        {
                            "explanation": "to tell someone about something bad that has just happened and may have an effect on them: ",
                            "examples": [
                                "I was devastated when the doctor broke the news to me."
                            ]
                        },
                        {
                            "explanation": "to be someone or something that will affect a person or situation well/badly: ",
                            "examples": [
                                "He's bad news for the company. He should never have been given the job.",
                                "A fall in interest rates is obviously good news for borrowers but it's bad news for savers.",
                                "Long spells of dry weather are always bad news for gardeners.",
                                "Falling house prices are good news for first-time buyers.",
                                "As soon as Sophie brought him home, I knew he was bad news.",
                                "The price reduction will be good news for consumers."
                            ]
                        },
                        {
                            "explanation": "to be reported about: ",
                            "examples": [
                                "They've been in the news a lot recently because of their marital problems."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}