{
    "word": "next",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "nekst"
                            ],
                            "us": [
                                "nekst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "being the first one after the present one or after the one just mentioned: ",
                            "examples": [
                                "Who works in the office next to yours?",
                                "Take the next street on the right.",
                                "Who do you think will be the next president?",
                                "Nothing really changes around here. One day is pretty much like the next.",
                                "(The) next time you want to borrow something, please ask me first.",
                                "I'm so busy it's hard to remember what I'm supposed to be doing from one minute to the next.",
                                "She's away for the next few days.",
                                "You'll have to wait until your next birthday for a new bike.",
                                "Can we arrange a meeting for the week after next?",
                                "What do you think you'll be doing this time next year?",
                                "We had a big argument, but he called me the next day (= the day after) to apologize.",
                                "Excuse me, it's my turn - I was next."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "nekst"
                            ],
                            "us": [
                                "nekst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "immediately after: ",
                            "examples": [
                                "So what happened next?",
                                "What would you like next?",
                                "First, fry the garlic. Next, add the ginger."
                            ]
                        },
                        {
                            "explanation": "The time when you next do something is the first time you do it again: ",
                            "examples": [
                                "When are you next going to Toronto?"
                            ]
                        },
                        {
                            "explanation": "used when describing two people or things that are very close to each other with nothing between them: ",
                            "examples": [
                                "Can I sit next to the window?"
                            ]
                        },
                        {
                            "explanation": "used to mean `after' when making a choice or a comparison: ",
                            "examples": [
                                "Cheese is my favourite food and, next to that, chocolate. (= Cheese is the only food that I like more than chocolate.)"
                            ]
                        },
                        {
                            "explanation": "almost: ",
                            "examples": [
                                "They pay me next to nothing (= very little) but I really enjoy the work."
                            ]
                        },
                        {
                            "explanation": "next in order to appear or happen, often in some form of entertainment: ",
                            "examples": [
                                "Next up is the latest news from the presidential campaign ."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}