{
    "word": "non-native",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌnɒnˈneɪ.tɪv"
                            ],
                            "us": [
                                "ˌnɑːnˈneɪ.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "A non-native plant or animal is one that lives or grows in a place where it did not originally live or grow: ",
                            "examples": [
                                "The river was stocked with a nonnative species of trout that is now preying on other fish. ",
                                "The beetle is a non-native insect responsible for destroying entire groves of ash trees. "
                            ]
                        },
                        {
                            "explanation": "A non-native person is one who was not born in the place where they currently live or who did not learn the language that is spoken there as their first language: ",
                            "examples": [
                                "The census results showed an increase in the number of non-native residents in the state.",
                                "The author provided a glossary that translated some of the local lingo for non-native readers."
                            ]
                        },
                        {
                            "explanation": "not belonging or relating to an indigenous group of people (= the people who originally lived in a place, usually before Europeans came), especially a Native North American or South American people: ",
                            "examples": [
                                "She said it was offensive for non-Native people to wear Native American headdresses as a costume. ",
                                "Navajo artists began weaving baskets and blankets that featured wry depictions of daily life, Native, and non-Native people."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}