{
    "word": "non-indian",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌnɒnˈɪn.di.ən"
                            ],
                            "us": [
                                "ˌnɑːnˈɪn.di.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not born in, living in, or coming from India: ",
                            "examples": [
                                "They stayed at a hotel in Delhi that caters to non-Indian tourists.",
                                "The non-Indian players in the cricket team now outnumber the Indians."
                            ]
                        },
                        {
                            "explanation": "not belonging to one of the groups of people who were living in North and South America before Europeans arrived : ",
                            "examples": [
                                "Non-Indian investors may not be looking out for American Indians' best interests when they are involved in gaming deals.",
                                "In the period 1806 to 1807, the entire non-Indian population of Texas was around 7,000."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌnɒnˈɪn.di.ən"
                            ],
                            "us": [
                                "ˌnɑːnˈɪn.di.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who was not born in India or does not live there or come from there: ",
                            "examples": [
                                "While Sikhism started in India, many non-Indians have converted to Sikhism.",
                                "He became one of the first nonIndians to head a leading company on the subcontinent."
                            ]
                        },
                        {
                            "explanation": "someone who is not a member of one of the groups of people who were living in North and South America before Europeans arrived: ",
                            "examples": [
                                "Some Native American spiritual leaders have spoken against excluding non-Indians from sacred, traditional ceremonies.",
                                "When the nation police arrest a nonIndian on tribal land, they have to turn him over to a sheriff's deputy."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}