{
    "word": "non-technical",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌnɒnˈtek.nɪ.kəl"
                            ],
                            "us": [
                                "ˌnɑːnˈtek.nɪ.kəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a person, job) not having or needing special knowledge about the machines, methods, etc. used in science and industry: ",
                            "examples": [
                                "She runs a course on computing for non-technical people.",
                                "Employers are also looking for graduates for non-technical roles such as consultancy, sales and marketing, and HR."
                            ]
                        },
                        {
                            "explanation": "(of language, information, etc.) not needing special knowledge relating to a particular subject or job to understand: ",
                            "examples": [
                                "She had tried as hard as possible to use non-technical language in her report so that it could be widely understood.",
                                "Although it has a non-technical title, the book deals with some advanced economic concepts."
                            ]
                        },
                        {
                            "explanation": "not involving or relating to the special knowledge, machines, methods, etc. used in science and industry: ",
                            "examples": [
                                "The reasons for the crash were deemed to be mostly non-technical.",
                                "It's possible that some non-technical aspects of cancer treatment, such as community support, make a big difference. "
                            ]
                        },
                        {
                            "explanation": "not relating to or involving practical skills and methods that are used in a particular activity: ",
                            "examples": [
                                "He found the more non-technical parts of the game a bit dull.",
                                "Once you have mastered the basic skills of the sport, you need to concentrate on the equally important non-technical side."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}