{
    "word": "nonlinear",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌnɒnˈlɪn.i.ər"
                            ],
                            "us": [
                                "ˌnɑːnˈlɪn.i.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not consisting of or relating to lines: ",
                            "examples": [
                                "His galleries have a nonlinear arrangement, and paintings are hung at different heights along the sloped walls.",
                                "The object follows a non-linear trajectory."
                            ]
                        },
                        {
                            "explanation": "involving events or thoughts in which one does not follow another one directly: ",
                            "examples": [
                                "Many films incorporate nonlinear storytelling.",
                                "Non-linear thinking is increasingly valued by corporations."
                            ]
                        },
                        {
                            "explanation": "involving a situation in which one thing does not change at the same rate as another, so that the relationship between them changes : ",
                            "examples": [
                                "A nonlinear relationship was observed between the changes in the glucose and sodium concentrations."
                            ]
                        },
                        {
                            "explanation": "A nonlinear equation (= mathematical statement) describes a situation in which one thing does not change at the same rate as another, so that the relationship between them changes. Nonlinear equations have the form of curves, rather than straight lines, on a graph: ",
                            "examples": [
                                "A nonlinear equation describes a process in which consequences are not proportional to causes."
                            ]
                        },
                        {
                            "explanation": "Nonlinear editing is a method of editing video, images, or audio (= sound) files by going directly to the part of the file you want to edit, rather then working through each part of the file in order: ",
                            "examples": [
                                "Nonlinear editing involves the manipulation of digitized video."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}