{
    "word": "nurse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "nɜːs"
                            ],
                            "us": [
                                "nɝːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(the title given to) a person whose job is to care for people who are ill or injured, especially in a hospital: ",
                            "examples": [
                                "He worked as a nurse in a psychiatric hospital.",
                                "Nurse Millard will be with you shortly.",
                                "Thank you, Nurse."
                            ]
                        },
                        {
                            "explanation": "a woman employed to take care of a young child or children",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "nɜːs"
                            ],
                            "us": [
                                "nɝːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to care for a person or an animal while they are ill: ",
                            "examples": [
                                "He gave up his job so that he could nurse his mother at home.",
                                "They found an injured cat and carefully nursed it back to health (= until it was well again)."
                            ]
                        },
                        {
                            "explanation": "to spend a lot of time taking care of something as it grows or develops: ",
                            "examples": [
                                "These young trees were carefully nursed by the head gardener.",
                                "The project will have to be nursed through its first few months."
                            ]
                        },
                        {
                            "explanation": "If you nurse an illness or injury, you rest until it gets better: ",
                            "examples": [
                                "Robert's in bed nursing a back injury."
                            ]
                        },
                        {
                            "explanation": "to hold a small child in your arms as a way of making them feel better: ",
                            "examples": [
                                "She nursed the crying child on her lap."
                            ]
                        },
                        {
                            "explanation": "When a woman nurses a baby, she feeds it with milk from her breasts.",
                            "examples": []
                        },
                        {
                            "explanation": "to have a strong feeling or an emotion for a long time: ",
                            "examples": [
                                "She had long nursed a passion for Japanese art."
                            ]
                        },
                        {
                            "explanation": "to hold a drink for a long time without drinking it: ",
                            "examples": [
                                "Mark was sitting in the corner nursing an almost empty bottle of beer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}