{
    "word": "nut",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "nʌt"
                            ],
                            "us": [
                                "nʌt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the dry fruit of particular trees that grows in a hard shell and can often be eaten: ",
                            "examples": [
                                "a Brazil/cashew nut",
                                "Sprinkle some roasted chopped nuts on top."
                            ]
                        },
                        {
                            "explanation": "a small piece of metal with a hole in it through which you put a bolt: ",
                            "examples": [
                                "Nuts and bolts are used to hold pieces of machinery together."
                            ]
                        },
                        {
                            "explanation": "an offensive word for a person who has a mental illness",
                            "examples": []
                        },
                        {
                            "explanation": "a person who behaves in a very silly, stupid, or strange way: ",
                            "examples": [
                                "What kind of nut would leave a car on a railway track?"
                            ]
                        },
                        {
                            "explanation": "someone who is extremely enthusiastic about a particular activity or thing: ",
                            "examples": [
                                "James is a tennis nut - he plays every day."
                            ]
                        },
                        {
                            "explanation": "a person's head: ",
                            "examples": [
                                "Come on, use your nut (= think clearly)!"
                            ]
                        },
                        {
                            "explanation": "the amount of money necessary to operate a business or cover your costs: ",
                            "examples": [
                                "With two houses, three cars and child-support payments, he just couldn't meet his nut, even with a second job."
                            ]
                        },
                        {
                            "explanation": "a small, raised piece of hard material at the top of the neck of a musical instrument such as a guitar or a violin that the strings pass over : ",
                            "examples": [
                                "The top two strings have been left a little high at the nut.",
                                "At the nut of the bass, the neck is quite wide, with wide string spacing."
                            ]
                        },
                        {
                            "explanation": "the bottom part of a bow (= a long, thin piece of wood with hair from the tail of a horse stretched along it, used to play musical instruments that have strings) : ",
                            "examples": [
                                "A violin is usually played using a bow consisting of a stick with a ribbon of horsehair strung between the tip and nut at opposite ends."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "nʌt"
                            ],
                            "us": [
                                "nʌt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to hit someone or something with your head: ",
                            "examples": [
                                "The guy turned round and nutted him."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}