{
    "word": "occasion",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əˈkeɪ.ʒən"
                            ],
                            "us": [
                                "əˈkeɪ.ʒən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a particular time, especially when something happens or has happened: ",
                            "examples": [
                                "We met on several occasions to discuss the issue.",
                                "I've heard him be rude to her on a number of occasions.",
                                "I seem to remember that on that occasion he was with his wife."
                            ]
                        },
                        {
                            "explanation": "a special or formal event: ",
                            "examples": [
                                "Sara's party was quite an occasion - there were over a hundred people there.",
                                "At the wedding he sang a song specially written for the occasion.",
                                "I have a suit but I only wear it on special occasions.",
                                "The coronation of a new king is, of course, a historic occasion.",
                                "Congratulations on the occasion of your wedding anniversary."
                            ]
                        },
                        {
                            "explanation": "an opportunity or reason for doing something or for something to happen: ",
                            "examples": [
                                "The 200th anniversary of Mozart's death was the occasion for hundreds of special films, books and concerts.",
                                "An occasion may arise when you can use your knowledge of French.",
                                "The bride took/used the occasion to make a short speech."
                            ]
                        },
                        {
                            "explanation": "sometimes, but not often: ",
                            "examples": [
                                "He has, on occasion, made a small mistake."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əˈkeɪ.ʒən"
                            ],
                            "us": [
                                "əˈkeɪ.ʒən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause something: ",
                            "examples": [
                                "Her refusal occasioned a lot of trouble.",
                                "The case occasioned the authorities a lot of worry/The authorities were occasioned a lot of worry by the case."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}