{
    "word": "off",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɒf"
                            ],
                            "us": [
                                "ɑːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "away from a place or position, especially the present place, position, or time: ",
                            "examples": [
                                "He drove off at the most incredible speed.",
                                "Keep the dog on the lead or he'll just run off.",
                                "Someone ran off with (= took) my pen.",
                                "She's off to Canada next week.",
                                "I saw her off (= said goodbye) at the station.",
                                "Finals are so far off that I'm not even thinking about them yet.",
                                "I'm off now - see you tomorrow.",
                                "If we can get off (= leave) early tomorrow morning we'll avoid most of the traffic."
                            ]
                        },
                        {
                            "explanation": "used with actions in which something is removed or removes itself from another thing: ",
                            "examples": [
                                "Take your jacket off.",
                                "One of my buttons has come off.",
                                "She had all her hair cut off."
                            ]
                        },
                        {
                            "explanation": "(especially of machines, electrical devices, lights, etc.) not operating because of not being switched on: ",
                            "examples": [
                                "Make sure the computers are all off before you go home.",
                                "Turn/Switch the light/engine/television off."
                            ]
                        },
                        {
                            "explanation": "(of money) taken away from the original price: ",
                            "examples": [
                                "You can get some money off if you pay cash.",
                                "There's 40 percent off this week on all winter coats.",
                                "There was $40 or $50 off most jackets in the store."
                            ]
                        },
                        {
                            "explanation": "not at work; at home or on holiday: ",
                            "examples": [
                                "I'm going to take/have some time off to work on my house.",
                                "She was off sick last week.",
                                "He's off at the moment - can I get him to call you back?"
                            ]
                        },
                        {
                            "explanation": "in such a way as to be separated: ",
                            "examples": [
                                "The police have shut/closed off all streets leading to the city.",
                                "The area in the park where the kids play is fenced off for safety reasons."
                            ]
                        },
                        {
                            "explanation": "in such a way as to be completely absent, especially because of having been used or killed: ",
                            "examples": [
                                "It says on the bottle that it kills off all known germs.",
                                "It'll take some time before she manages to pay off all her debts.",
                                "The good thing about exercise is that it burns off calories.",
                                "Between us we managed to finish off several bottles of wine."
                            ]
                        },
                        {
                            "explanation": "in such a way as to get rid of something: ",
                            "examples": [
                                "We went out for a while to walk off some of our dinner.",
                                "He's gone to sleep off a headache.",
                                "There's no point in getting upset about what he said - you just have to laugh it off."
                            ]
                        },
                        {
                            "explanation": "used to form nouns referring to a situation in which two or more people or teams compete against each other to see who is the winner: ",
                            "examples": [
                                "the BBC series, the Great British Bake Off",
                                "Audience applause determines the winner of each dance-off. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "ɒf"
                            ],
                            "us": [
                                "ɑːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "down or away from a place, position, or time, especially the present place, position, or time: ",
                            "examples": [
                                "There was a \"Keep off the grass\" sign.",
                                "All the berries had dropped off the tree.",
                                "He fell off his bike.",
                                "We're still a long way off our target of $30,000.",
                                "I hope she knows where to get off (= leave) the bus/train.",
                                "How far off finishing the project are we? (= How much more is there to do?)",
                                "We've been working on the flat for six months now but we're still a long way off finishing.",
                                "We're not far off (= we are quite near) London now."
                            ]
                        },
                        {
                            "explanation": "used with actions in which something is removed or removes itself from another thing: ",
                            "examples": [
                                "I can't get the lid off this jar.",
                                "Has anyone taken a book off my desk?",
                                "Could you cut me a small piece off that big white cheese?",
                                "Take your feet off that seat, young man!",
                                "I don't like taking money off you (= asking you for money)!",
                                "Get off me! (= Stop touching me!)",
                                "I got the knife off of him before he ran away."
                            ]
                        },
                        {
                            "explanation": "not liking or taking something or someone: ",
                            "examples": [
                                "He's been off his food ever since he had the stomach upset.",
                                "She's well enough to be off the medicine now.",
                                "She's been off drugs for a year now.",
                                "The doctor says he can come off the tablets.",
                                "I used to love coffee but I've gone off it (= stopped liking it) recently."
                            ]
                        },
                        {
                            "explanation": "near to: ",
                            "examples": [
                                "He lives just off the main road.",
                                "It's an island off the east coast of Spain."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ɒf"
                            ],
                            "us": [
                                "ɑːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of an arranged event) stopped or given up: ",
                            "examples": [
                                "The wedding's off - she's decided she's too young to settle down.",
                                "It's all off (= the relationship is over) between Kim and Mike."
                            ]
                        },
                        {
                            "explanation": "having a particular amount or number, especially of money: ",
                            "examples": [
                                "Andrew must be so well-off (= rich) by now.",
                                "I think they're fairly badly-off (= poor) now that David has lost his job.",
                                "I'm quite well off for (= have a lot of) sweaters.",
                                "How are you off for money? (= do you have enough?)"
                            ]
                        },
                        {
                            "explanation": "below the usual standard or rate: ",
                            "examples": [
                                "I'm having an off day today - I just can't seem to do anything right!"
                            ]
                        },
                        {
                            "explanation": "(of food and drink) no longer fresh or good to eat or drink because of being too old: ",
                            "examples": [
                                "This milk smells off.",
                                "I'd better eat this cheese before it goes off."
                            ]
                        },
                        {
                            "explanation": "(of food in a restaurant) not available at that particular time: ",
                            "examples": [
                                "I'm sorry, sir, the salmon is off."
                            ]
                        },
                        {
                            "explanation": "not thinking or worrying about other people's feelings; rude: ",
                            "examples": [
                                "He didn't even call her on her birthday - I thought that was a bit off."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɒf"
                            ],
                            "us": [
                                "ɑːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of leaving somewhere: ",
                            "examples": [
                                "Are we ready for the off, then?"
                            ]
                        },
                        {
                            "explanation": "from the beginning, when someone first starts to do something or a process first starts: ",
                            "examples": [
                                "She and I got on well right from the off.",
                                "I found the new car easy to drive from the off.",
                                "From the off he had me convinced that I had no choice but to help him.",
                                "Was he violent from the off, or was this just a moment of madness?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ɒf"
                            ],
                            "us": [
                                "ɑːf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to kill someone: ",
                            "examples": [
                                "They offed him and dumped his body in the swamp."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}