{
    "word": "offstage",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˌɒfˈsteɪdʒ"
                            ],
                            "us": [
                                "ˌɑːfˈsteɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "behind, at, or to the side of the stage, so that people who are watching cannot see: ",
                            "examples": [
                                "He never actually appears in the second half of the play - you just hear his voice offstage.",
                                "The figure is raised high in the air by three men who carry her slowly offstage."
                            ]
                        },
                        {
                            "explanation": "(of a performer, actor, etc.) when not acting in a play or film, etc., or not taking part in some other kind of performance: ",
                            "examples": [
                                "When we go offstage, we are normal people.",
                                "The actress had some hard times off-stage.",
                                "Off stage, the young ballet dancer plied other trades."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌɒfˈsteɪdʒ"
                            ],
                            "us": [
                                "ˌɑːfˈsteɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "off the stage, or happening behind or at the side of the stage, so that people who are watching cannot see: ",
                            "examples": [
                                "Offstage performers are hidden from view as they wait in the wings.",
                                "An off-stage choir can be heard singing."
                            ]
                        },
                        {
                            "explanation": "used for describing a performer, actor, etc. or their behaviour when they are not acting in a play or film, etc. or not taking part in some other kind of performance: ",
                            "examples": [
                                "The actor became well-known for his offstage exploits.",
                                "Before the interview, she made it clear that her off-stage life was off limits."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}