{
    "word": "old",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "əʊld"
                            ],
                            "us": [
                                "oʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having lived or existed for many years: ",
                            "examples": [
                                "an old man",
                                "We're all getting older.",
                                "I was shocked by how old he looked.",
                                "Now come on, you're old enough to tie your own shoelaces, Carlos.",
                                "I'm too old to be out in the clubs every night.",
                                "a beautiful old farm house in the country",
                                "a battered old car",
                                "That's an old joke - I've heard it about a thousand times.",
                                "I think this cheese is old, judging by the smell of it."
                            ]
                        },
                        {
                            "explanation": "unsuitable because intended for older people: ",
                            "examples": [
                                "Don't you think that book is too old for you?"
                            ]
                        },
                        {
                            "explanation": "used to describe or ask about someone's age: ",
                            "examples": [
                                "How old is your father?",
                                "Rosie's six years old now.",
                                "It's not very dignified behaviour for a 54-year-old man.",
                                "He's a couple of years older than me."
                            ]
                        },
                        {
                            "explanation": "from a period in the past: ",
                            "examples": [
                                "I saw my old English teacher last time I went home.",
                                "He bought me a new phone to replace my old one.",
                                "She showed me her old school.",
                                "I saw an old boyfriend of mine.",
                                "In my old job I had less responsibility."
                            ]
                        },
                        {
                            "explanation": "a language when it was in an early stage in its development: ",
                            "examples": [
                                "Both words come to us from Old English."
                            ]
                        },
                        {
                            "explanation": "(especially of a friend) known for a long time: ",
                            "examples": [
                                "She's one of my oldest friends - we met in kindergarten."
                            ]
                        },
                        {
                            "explanation": "used before someone's name when you are referring to or talking to them, to show that you know that person well and like them: ",
                            "examples": [
                                "There's old Sara working away in the corner.",
                                "I hear poor old Frank's lost his job."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "əʊld"
                            ],
                            "us": [
                                "oʊld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "old people considered together as a group: ",
                            "examples": [
                                "These cuts in services will particularly affect the old."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}