{
    "word": "on",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "ɒn"
                            ],
                            "us": [
                                "ɑːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show that something is in a position above something else and touching it, or that something is moving into such a position: ",
                            "examples": [
                                "Look at all the books on your desk!",
                                "Ow, you're standing on my foot!",
                                "Your suitcase is on top of the wardrobe.",
                                "They live in that old house on the hill.",
                                "I got on my bike and left."
                            ]
                        },
                        {
                            "explanation": "covering the surface of, being held by, or connected to something: ",
                            "examples": [
                                "There's blood on your shirt.",
                                "Which finger do you wear your ring on?",
                                "Can you stand on your head?",
                                "We could hang this picture on the wall next to the door.",
                                "Dogs should be kept on their leashes at all times.",
                                "We've just moved house and we're not on the phone (= not connected to the phone service) yet."
                            ]
                        },
                        {
                            "explanation": "used to show when something happens: ",
                            "examples": [
                                "Hair salons don't usually open on Sundays.",
                                "What are you doing on Friday?",
                                "My birthday's on 30 May.",
                                "Would you mind telling me what you were doing on the afternoon of Friday the 13th of March?",
                                "The bells in the clock tower ring every hour on the hour (= at exactly one o'clock, two o'clock, etc.).",
                                "On a clear day you can see the mountains from here.",
                                "She was dead on arrival (= dead when she arrived) at the hospital.",
                                "Please leave your key at the reception desk on your departure from (= when you leave) the hotel."
                            ]
                        },
                        {
                            "explanation": "used to show where something has been written, printed, or drawn: ",
                            "examples": [
                                "Which page is that curry recipe on?",
                                "His initials were engraved on the back of his watch.",
                                "What's on the menu tonight? (= What food is available?)"
                            ]
                        },
                        {
                            "explanation": "used for showing some methods of travelling: ",
                            "examples": [
                                "I love travelling on trains.",
                                "She's coming in on the 5.30 bus.",
                                "We went to France on the ferry.",
                                "It'd be quicker to get there on foot.",
                                "two figures on horseback"
                            ]
                        },
                        {
                            "explanation": "used to show that a condition or process is being experienced: ",
                            "examples": [
                                "He accidentally set his bed on fire.",
                                "Max's on holiday this week.",
                                "I often get carsick when I'm on a long journey.",
                                "Crime is on the increase (= is increasing) again.",
                                "Their flights to Paris are on special offer at the moment.",
                                "I'll be away on a training course next week."
                            ]
                        },
                        {
                            "explanation": "used to show the form in which something is recorded or performed: ",
                            "examples": [
                                "How much data can you store on the flash drive?",
                                "When's the movie coming out on DVD?",
                                "I was really embarrassed the first time I saw myself on film.",
                                "What's on TV tonight?",
                                "I wish there was more jazz on the radio."
                            ]
                        },
                        {
                            "explanation": "used to show what causes pain or injury as a result of being touched: ",
                            "examples": [
                                "I hit my head on the shelf as I was standing up.",
                                "Be careful not to cut yourself on that knife."
                            ]
                        },
                        {
                            "explanation": "to or towards: ",
                            "examples": [
                                "Our house is the first on the left after the post office.",
                                "The attack on the village lasted all night.",
                                "I wish you wouldn't sneak up on me like that!"
                            ]
                        },
                        {
                            "explanation": "relating to: ",
                            "examples": [
                                "a book on pregnancy",
                                "Her talk is on Italian women's literature.",
                                "The minister has refused to comment on the allegations.",
                                "Criticism has no effect on him.",
                                "Do the police have anything on you (= do they have any information about you that can be used against you)?"
                            ]
                        },
                        {
                            "explanation": "used to show something for which a payment is made: ",
                            "examples": [
                                "He spent €180 on a hat.",
                                "I've wasted a lot of money on this car.",
                                "We made a big profit on that deal.",
                                "How much interest are you paying on the loan?"
                            ]
                        },
                        {
                            "explanation": "used to show a person or thing that is necessary for something to happen or that is the origin of something: ",
                            "examples": [
                                "We're relying on you.",
                                "I might come - it depends on Andrew.",
                                "Most children remain dependent on their parents while they are at university.",
                                "His latest movie is based on a fairy tale."
                            ]
                        },
                        {
                            "explanation": "used to show when someone is involved or taking part in something: ",
                            "examples": [
                                "I'm working on a new book.",
                                "\"Where had we got up to?\" \"We were on page 42.\""
                            ]
                        },
                        {
                            "explanation": "used to show what is providing financial support or an income: ",
                            "examples": [
                                "I only have $70 a week to live on at the moment.",
                                "He retired on a generous pension from the company.",
                                "She's on (= earning) £25,000 a year."
                            ]
                        },
                        {
                            "explanation": "used to show something that is used as food, fuel, or a drug: ",
                            "examples": [
                                "What do mice live on?",
                                "Does this radio run on batteries?",
                                "Is he on drugs?"
                            ]
                        },
                        {
                            "explanation": "next to or along the side of: ",
                            "examples": [
                                "It's a small town on the Mississippi River.",
                                "Our house was on Sturton Street.",
                                "Strasbourg is on the border of France and Germany."
                            ]
                        },
                        {
                            "explanation": "used to show when someone is a member of a group or organization: ",
                            "examples": [
                                "Have you ever served on a jury?",
                                "There are no women on the committee.",
                                "How many people are on your staff?",
                                "She's a researcher on a women's magazine."
                            ]
                        },
                        {
                            "explanation": "used when referring to a tool, instrument, or system that is used to do something: ",
                            "examples": [
                                "I do all my household accounts on the computer.",
                                "Chris is on drums and Mike's on bass guitar.",
                                "I'm on (= talking on) the phone."
                            ]
                        },
                        {
                            "explanation": "used to show when something is repeated one or more times: ",
                            "examples": [
                                "The government suffered defeat on defeat in the local elections.",
                                "Wave on wave of refugees has crossed the border to escape the fighting."
                            ]
                        },
                        {
                            "explanation": "used when making a comparison: ",
                            "examples": [
                                "That's my final offer, and I can't improve on it.",
                                "The manufacturer has never improved on the earliest model of the car.",
                                "The productivity figures are down/up on last week's."
                            ]
                        },
                        {
                            "explanation": "used to show when someone has something in a pocket or in a bag that they are carrying: ",
                            "examples": [
                                "Do you have a spare pen on you?",
                                "I don't have my driving licence on me."
                            ]
                        },
                        {
                            "explanation": "happening after and usually because of: ",
                            "examples": [
                                "Acting on information given to them anonymously, the police arrested him.",
                                "He inherited a quarter of a million pounds on his mother's death.",
                                "On their return they discovered that their house had been broken into."
                            ]
                        },
                        {
                            "explanation": "used to show who is paying for something: ",
                            "examples": [
                                "Dinner meal is on me.",
                                "She had her operation done on the National Health Service."
                            ]
                        },
                        {
                            "explanation": "used to show who suffers when something does not operate as it should: ",
                            "examples": [
                                "The phone suddenly went dead on me.",
                                "Their car broke down on them on the way home."
                            ]
                        },
                        {
                            "explanation": "used to show the number of points a person or team has in a competition: ",
                            "examples": [
                                "Clive's team is on five points while Joan's is on seven."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ɒn"
                            ],
                            "us": [
                                "ɑːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "on your body or someone's body: ",
                            "examples": [
                                "It's very cold so put a coat on.",
                                "She wanders around the house with nothing on.",
                                "Can you remember what he had on (= was wearing)?",
                                "I tried on a few jackets, but none of them looked nice."
                            ]
                        },
                        {
                            "explanation": "covering the surface of something or connected to something: ",
                            "examples": [
                                "Screw the lid on tightly.",
                                "Surgeons managed to sew the finger back on."
                            ]
                        },
                        {
                            "explanation": "used to show when something is operating or starting to operate: ",
                            "examples": [
                                "Could you switch on the radio?",
                                "Would you turn the TV on?",
                                "You left the bedroom light on."
                            ]
                        },
                        {
                            "explanation": "continuing or not stopping: ",
                            "examples": [
                                "The referee waved at the player to play on.",
                                "Read on to discover the amazing properties of coconut water.",
                                "The police officers shook their heads and drove on.",
                                "When Jenny walks the dog, she ignores his hunting behaviour and just walks on till he comes back."
                            ]
                        },
                        {
                            "explanation": "into a bus, train, plane, etc., or in the correct position to start using some other method of travelling: ",
                            "examples": [
                                "The train suddenly started moving as I was getting on.",
                                "Her horse galloped off as soon as she was on."
                            ]
                        },
                        {
                            "explanation": "performing: ",
                            "examples": [
                                "Hurry up with the make-up - I'm on in ten minutes.",
                                "The audience cheered as the band came on (= came onto the stage)."
                            ]
                        },
                        {
                            "explanation": "continuing forward in time or space: ",
                            "examples": [
                                "They never spoke to each other from that day on (= after that day).",
                                "What are you doing later on?",
                                "When you're done with it, would you pass it on to Paul?",
                                "Move on, please, and let the ambulance through.",
                                "You cycle on and I'll meet you there."
                            ]
                        },
                        {
                            "explanation": "happening or planned: ",
                            "examples": [
                                "Is the party still on for tomorrow?",
                                "I'm busy tomorrow, but I've got nothing on the day after.",
                                "I've got a lot on at the moment.",
                                "Food had to be rationed when the war was on.",
                                "Are there any good movies on (= being shown) this week?"
                            ]
                        },
                        {
                            "explanation": "used when talking about the position of one thing compared with the position of another: ",
                            "examples": [
                                "It's amazing nobody was injured because the two buses crashed head on (= the front parts of the buses hit each other).",
                                "The bike hit our car side on (= hit the side of the car rather than the front or back).",
                                "It would be easier to get the bookcase through the doorway if we turned it sideways on (= turned it so that one of its sides is at the front)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ɒn"
                            ],
                            "us": [
                                "ɑːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in cricket, the left side of the field for a right-handed batter or the right side of the field for a left-handed batter: ",
                            "examples": [
                                "The captain moved the fielder from off to on.",
                                "She tapped the ball into the on side and ran through for a single."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}