{
    "word": "one-shot",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌwʌnˈʃɒt"
                            ],
                            "us": [
                                "ˌwʌnˈʃɑːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "happening only once: ",
                            "examples": [
                                "They stressed that the rescue plan was a one-shot deal.",
                                "They gave him a one-shot payment to compensate for the extra hours that he had to work.",
                                "Her one-shot appearance on the show last year has become a second-season recurring role."
                            ]
                        },
                        {
                            "explanation": "(of a film or part of a film) made in one continuous shot (= a short piece in which there is a single action or a short series of actions): ",
                            "examples": [
                                "One-shot movies like those by the Lumières could be run slower or faster, backward or forward, depending on the day's audience.",
                                "There is one particularly long one-shot sequence in which Jim follows his wife home from work."
                            ]
                        },
                        {
                            "explanation": "(of a gun) holding only one bullet or other piece of ammunition so that it has to be loaded again after every shot: ",
                            "examples": [
                                "He pulled a small one-shot pistol from behind him.",
                                "They were primitive one-shot guns, but guns nonetheless."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌwʌnˈʃɒt"
                            ],
                            "us": [
                                "ˈwʌn.ʃɑːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that happens only once or someone who does something only once: ",
                            "examples": [
                                "She explained to him that this was a one-shot, and she would not be helping him again.",
                                "The property tax rebates are one-shots that will provide very modest relief to homeowners.",
                                "I want to aim for one-shots as well as permanent clients."
                            ]
                        },
                        {
                            "explanation": "a film or part of a film that has one continuous shot (= a short piece in which there is a single action or a short series of actions): ",
                            "examples": [
                                "He starred in two one-shots.",
                                "The director shoots many of the exchanges as a series of one-shots - first one actor, isolated in the frame, then the other, equally isolated."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}