{
    "word": "one",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "number",
                        "ipa": {
                            "uk": [
                                "wʌn"
                            ],
                            "us": [
                                "wʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the number 1: ",
                            "examples": [
                                "He had two slices and I only had one.",
                                "She'll be one year old tomorrow."
                            ]
                        },
                        {
                            "explanation": "a member of a group of people or things: ",
                            "examples": [
                                "One of their daughters has just had a baby.",
                                "EMI is one of the world's largest record companies.",
                                "Finding a cure for cancer is one of the biggest challenges facing medical researchers.",
                                "Our organization is just one of many charities that are providing famine relief in the region."
                            ]
                        },
                        {
                            "explanation": "used to refer to a time in the future that is not yet decided: ",
                            "examples": [
                                "Why don't we meet for lunch one day next week?",
                                "I'd like to go skiing one Christmas."
                            ]
                        },
                        {
                            "explanation": "used to refer to a particular occasion while avoiding stating the exact moment: ",
                            "examples": [
                                "One night we stayed up talking till dawn.",
                                "He was attacked as he was walking home from work late one afternoon.",
                                "One moment he says he loves me, the next moment he's asking for a divorce.",
                                "She never seems to know what she's doing from one minute to the next."
                            ]
                        },
                        {
                            "explanation": "a single thing; not two or more: ",
                            "examples": [
                                "Eat them one at a time (= separately).",
                                "I think we should paint the bedroom all one (= in a single) colour.",
                                "Do you think five of us will manage to squeeze into the one car?"
                            ]
                        },
                        {
                            "explanation": "combined in a single person or object: ",
                            "examples": [
                                "With this model you get a radio, CD player, and MP3 dock all in one."
                            ]
                        },
                        {
                            "explanation": "used when saying there is no other person or thing: ",
                            "examples": [
                                "He's the one person you can rely on in an emergency.",
                                "This may be your one and only (= only ever) opportunity to meet her.",
                                "My final guest on tonight's show needs no introduction. Please welcome the one and only Michael Jordan!"
                            ]
                        },
                        {
                            "explanation": "used before the name of someone who is not known: ",
                            "examples": [
                                "Her solicitor is one John Wintersgill."
                            ]
                        },
                        {
                            "explanation": "used to emphasize an adjective: ",
                            "examples": [
                                "His mother is one (= a very) generous woman.",
                                "That's one (= a very) big ice cream cone you have there.",
                                "It was one hell of a (= a very great) shock to find out I'd lost my job."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "pronoun",
                        "ipa": {
                            "uk": [
                                "wʌn"
                            ],
                            "us": [
                                "wʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a particular thing or person within a group or range of things or people that are possible or available: ",
                            "examples": [
                                "I have a few books on Chinese food. You can borrow one if you want.",
                                "Which one would you like?",
                                "Please make a copy for everybody in the office and a few extra ones for the visitors.",
                                "\"Which cake would you like?\" \"The one in the front.\"",
                                "French croissants are so much better than the ones we get here.",
                                "There were lots of people watching, and not one of them offered to help.",
                                "I've received no replies to my job applications - not a single one (= none).",
                                "Chris is the one (= the person) with curly brown hair."
                            ]
                        },
                        {
                            "explanation": "to never do something: ",
                            "examples": [
                                "I'm not one to criticize other people, as you know."
                            ]
                        },
                        {
                            "explanation": "to like something very much: ",
                            "examples": [
                                "I've never been one for staying out late.",
                                "He's a great one for the ladies."
                            ]
                        },
                        {
                            "explanation": "used to talk about one person or thing compared with other similar or related people or things: ",
                            "examples": [
                                "They look so similar it's often difficult to distinguish one from the other.",
                                "You may have one or the other, but not both.",
                                "Crime and freedom are inseparable. You can't have one without the other."
                            ]
                        },
                        {
                            "explanation": "any person, but not a particular person: ",
                            "examples": [
                                "One has an obligation to one's friends.",
                                "One ought to make the effort to vote."
                            ]
                        },
                        {
                            "explanation": "the person speaking or writing: ",
                            "examples": [
                                "Of course, one (= I) would be delighted to dine with the Queen."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}