{
    "word": "only",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈəʊn.li"
                            ],
                            "us": [
                                "ˈoʊn.li"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show that there is a single one or very few of something, or that there are no others: ",
                            "examples": [
                                "I was the only person on the train.",
                                "Is this really the only way to do it?",
                                "The only thing that matters is that the baby is healthy.",
                                "It was the only thing I could do under the circumstances.",
                                "Rita was the only person to complain."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈəʊn.li"
                            ],
                            "us": [
                                "ˈoʊn.li"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show that something is limited to not more than, or is not anything other than, the people, things, amount, or activity stated: ",
                            "examples": [
                                "At present these televisions are only available in Japan.",
                                "Only Sue and Mark bothered to turn up for the meeting.",
                                "This club is for members only.",
                                "Only an idiot would do that.",
                                "These shoes only cost $50.",
                                "Don't worry - it's only a scratch.",
                                "I was only joking.",
                                "I was only trying to help.",
                                "I only arrived half an hour ago.",
                                "She spoke to me only a few minutes ago on the phone.",
                                "It's only four o'clock and it's already getting dark.",
                                "\"Who's there?\" \"It's only me (= it is not someone you should worry about). I've locked myself out.\"",
                                "It's only natural that you should worry about your children."
                            ]
                        },
                        {
                            "explanation": "used to refer to something that happens almost immediately after something else: ",
                            "examples": [
                                "People were leaving and I'd only just arrived.",
                                "We'd only just set off when the car broke down."
                            ]
                        },
                        {
                            "explanation": "almost not: ",
                            "examples": [
                                "There was only just enough food to go round.",
                                "We got there in time for our flight, but only just (= but we almost did not)."
                            ]
                        },
                        {
                            "explanation": "used to say that two related things are true or happened, especially when this is surprising or shocking: ",
                            "examples": [
                                "Not only did he turn up late, he also forgot his books.",
                                "If this project fails, it will affect not only our department, but also the whole organization."
                            ]
                        },
                        {
                            "explanation": "If you say you have only (got) to do something, you mean that it is all you need to do in order to achieve something else: ",
                            "examples": [
                                "If you want any help, you have only to ask.",
                                "You only have to look at her face to see that she's not well."
                            ]
                        },
                        {
                            "explanation": "used when saying that something unpleasant will happen as a result of an action or a failure to act: ",
                            "examples": [
                                "If you don't do something about it now it will only get worse."
                            ]
                        },
                        {
                            "explanation": "used to show that you feel sorry about something that cannot happen when explaining why it cannot happen: ",
                            "examples": [
                                "I'd love to go to Australia. I only wish I could afford to."
                            ]
                        },
                        {
                            "explanation": "used to emphasize what you are hoping or wishing for: ",
                            "examples": [
                                "I only hope you know what you're doing.",
                                "I only wish that they would keep in touch more regularly."
                            ]
                        },
                        {
                            "explanation": "used to show that you think someone has done something silly: ",
                            "examples": [
                                "She's only locked herself out of her flat again!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "conjunction",
                        "ipa": {
                            "uk": [
                                "ˈəʊn.li"
                            ],
                            "us": [
                                "ˈoʊn.li"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show what is the single or main reason why something mentioned in the first part of the sentence cannot be performed or is not completely true: ",
                            "examples": [
                                "I'd invite Frances to the party, only (= but I will not because) I don't want her husband to come.",
                                "I'd call him myself, only (= but I cannot because) I'm at work all day.",
                                "I'd be happy to do it for you, only (= but) don't expect it to be done before next week.",
                                "This fabric is similar to wool, only (= except that it is) cheaper."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}