{
    "word": "open",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈəʊ.pən"
                            ],
                            "us": [
                                "ˈoʊ.pən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not closed or fastened: ",
                            "examples": [
                                "an open door/window",
                                "An open suitcase lay on her bed.",
                                "You left the container open.",
                                "Someone had left the window wide (= completely) open.",
                                "He had several nasty open wounds (= those which had not begun to heal)."
                            ]
                        },
                        {
                            "explanation": "ready to be used or ready to provide a service: ",
                            "examples": [
                                "The supermarket is open till 8.00 p.m. ",
                                "The road is open now, but it is often blocked by snow in the winter.",
                                "The new hospital was declared open by the mayor."
                            ]
                        },
                        {
                            "explanation": "not closed in or covered: ",
                            "examples": [
                                "It's not a good idea to camp in the middle of an open field (= one which is not covered with trees, bushes, etc.).",
                                "Suddenly we had left the city behind and were out in open country.",
                                "The survivors were adrift on the open sea (= far from land)."
                            ]
                        },
                        {
                            "explanation": "If a computer document or program is open, it is ready to be read or used: ",
                            "examples": [
                                "Make sure you have both files open at the same time."
                            ]
                        },
                        {
                            "explanation": "available; not limited: ",
                            "examples": [
                                "There are still several possibilities open to you.",
                                "The competition is open to anyone over the age of 16.",
                                "Is the library open to the general public?",
                                "Their whole attitude to these negotiations is open to criticism (= can be criticized).",
                                "I'd like to think I'm open to (= willing to consider) any reasonable suggestion.",
                                "An accident would lay the whole issue of safety open (= cause it to be considered)."
                            ]
                        },
                        {
                            "explanation": "not secret: ",
                            "examples": [
                                "There has been open hostility between them ever since they had that argument last summer."
                            ]
                        },
                        {
                            "explanation": "honest and not trying to keep things secret: ",
                            "examples": [
                                "He's very open about his weaknesses.",
                                "I wish you'd be more open with me, and tell me what you're feeling.",
                                "She has an honest, open face."
                            ]
                        },
                        {
                            "explanation": "not decided or certain: ",
                            "examples": [
                                "We don't have to make a firm decision yet. Let's leave it open.",
                                "We can leave our offer open for another week, but we have to have your decision by then.",
                                "I want to keep my options open, so I'm not committing myself yet."
                            ]
                        },
                        {
                            "explanation": "An open question can be answered in many different ways, and not with just \"yes\" or \"no\" or by choosing one of a number of fixed answers: ",
                            "examples": [
                                "Ask an open question along the lines of \"What do you think/feel about this?\"",
                                "The interviewer should ask open and probing questions."
                            ]
                        },
                        {
                            "explanation": "If a string on an instrument such as a guitar is open, it does not have a finger or a capo (= device fixed across the strings) pressing down on it: ",
                            "examples": [
                                "The lowest note available in first position in standard tuning is an open G.",
                                "He altered the cello's usual tuning on some tracks to let open strings resound."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈəʊ.pən"
                            ],
                            "us": [
                                "ˈoʊ.pən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) begin: ",
                            "examples": [
                                "I would like to open my talk by giving a brief background to the subject.",
                                "I'm going to open an account with another bank.",
                                "The Olympic Games open tomorrow.",
                                "A new radio station is due to open (up) next month.",
                                "The film opens (= will be shown for the first time) in New York and Los Angeles next week."
                            ]
                        },
                        {
                            "explanation": "to perform before the main performer in a show: ",
                            "examples": [
                                "The band opened for The Who at a baseball stadium in 1982. ",
                                "Comedians used to regularly open for rock acts."
                            ]
                        },
                        {
                            "explanation": "to move something to a position that is not closed, or to make something change to a position that is not closed: ",
                            "examples": [
                                "Could you open the window, please?",
                                "You can open your eyes now - here's your present.",
                                "The flowers open (out) in the morning but close again in the afternoon.",
                                "From the kitchen there is a door that opens (out) into the garden.",
                                "That door opens (out) onto the patio.",
                                "\"Open up (= open the door) - it's the police!\" shouted the police officer, banging on the door."
                            ]
                        },
                        {
                            "explanation": "to remove or separate part of a container or parcel so that you can see or use what it contains: ",
                            "examples": [
                                "Don't open a new bottle just for me.",
                                "I couldn't wait to open the letter."
                            ]
                        },
                        {
                            "explanation": "If a shop or office opens at a particular time of day, it starts to do business at that time: ",
                            "examples": [
                                "The coffee shop opens at ten o'clock.",
                                "He opens (up) his coffee shop at ten o'clock."
                            ]
                        },
                        {
                            "explanation": "If someone, usually someone important, opens a building, event, etc., they officially say that it is ready to be used or to start operating: ",
                            "examples": [
                                "The new hospital will be officially opened by the mayor on Tuesday."
                            ]
                        },
                        {
                            "explanation": "to make something available: ",
                            "examples": [
                                "This research opens (up) the possibility of being able to find a cure for the disease.",
                                "The country is planning to open (up) its economy to foreign investment."
                            ]
                        },
                        {
                            "explanation": "If you open a computer document or program, you make it ready to read or use: ",
                            "examples": [
                                "To open a new document, click \"File\" and then click \"New\".",
                                "Click the desktop icon to open the Cambridge Advanced Learner's Dictionary."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈəʊ.pən"
                            ],
                            "us": [
                                "ˈoʊ.pən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "somewhere outside, rather than in a building: ",
                            "examples": [
                                "It's good to be (out) in the open after being cooped up in an office all day."
                            ]
                        },
                        {
                            "explanation": "now known or able to be seen when it was hidden before: ",
                            "examples": [
                                "It's time this issue was brought out into the open."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}