{
    "word": "order",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈɔː.dər"
                            ],
                            "us": [
                                "ˈɔːr.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a request to make, supply, or deliver food or goods: ",
                            "examples": [
                                "\"Can I take your order now?\" said the waiter.",
                                "I would like to place (= make) an order for a large pine table."
                            ]
                        },
                        {
                            "explanation": "a product or a meal that has been asked for by a customer: ",
                            "examples": [
                                "I got an email saying that the order has been shipped."
                            ]
                        },
                        {
                            "explanation": "If something is on order, you have asked for it but have not yet received it: ",
                            "examples": [
                                "The new drilling equipment has been on order for several weeks."
                            ]
                        },
                        {
                            "explanation": "to do or make something especially for a person who has asked for it: ",
                            "examples": [
                                "We make wedding cakes to order."
                            ]
                        },
                        {
                            "explanation": "the way in which people or things are arranged, either in relation to one another or according to a particular characteristic: ",
                            "examples": [
                                "The children lined up in order of age/height.",
                                "I can't find the file I need because they're all out of order (= they are no longer arranged in the correct way).",
                                "Put the files in alphabetical/chronological order.",
                                "Here's the running order for the concert (= the order in which each item will happen)."
                            ]
                        },
                        {
                            "explanation": "something that someone tells you you must do: ",
                            "examples": [
                                "The soldiers fired as soon as their commander gave the order.",
                                "Soldiers must obey orders.",
                                "What are your orders?",
                                "My orders are to search everyone's bag as they come in.",
                                "The road was closed all day by order of the police.",
                                "Clean up this room immediately - and that's an order!"
                            ]
                        },
                        {
                            "explanation": "to have been told that you must do something by someone in authority: ",
                            "examples": [
                                "We are under orders not to allow anyone into the building."
                            ]
                        },
                        {
                            "explanation": "an official instruction telling someone what they can or cannot do, or a written instruction to a bank to pay money to a particular person",
                            "examples": []
                        },
                        {
                            "explanation": "with the aim of achieving something: ",
                            "examples": [
                                "He came home early in order to see the kids before they went to bed.",
                                "I agreed to her suggestion in order not to upset her."
                            ]
                        },
                        {
                            "explanation": "a situation in which everything is arranged in its correct place: ",
                            "examples": [
                                "The house was such a mess that she spent the whole day trying to establish some kind of order."
                            ]
                        },
                        {
                            "explanation": "to organize something well: ",
                            "examples": [
                                "I try to leave my desk in order when I go home.",
                                "He put his affairs in order (= made arrangements for his personal and business matters) before he went into the hospital."
                            ]
                        },
                        {
                            "explanation": "the state of working correctly or of being suitable for use: ",
                            "examples": [
                                "TV for sale in (good) working order.",
                                "Are your immigration papers in order (= legally correct)?",
                                "The coffee machine is out of order (= not working)."
                            ]
                        },
                        {
                            "explanation": "a situation in which rules are obeyed and people do what they are expected to do: ",
                            "examples": [
                                "The teacher found it hard to keep her class in order.",
                                "As the demonstration began to turn violent, the police were called in to restore order.",
                                "After some heated discussion, the chairperson called the meeting to order (= told everyone to stop talking so that the meeting could continue).",
                                "Is it in order (= allowed) for me to park my car outside the building?"
                            ]
                        },
                        {
                            "explanation": "an expression used in a parliament or a formal meeting to get people's attention and make them stop talking, so that the meeting or discussion can start or continue",
                            "examples": []
                        },
                        {
                            "explanation": "a social or political system: ",
                            "examples": [
                                "The collapse of Communism at the end of the 1980s encouraged hopes of a new world order."
                            ]
                        },
                        {
                            "explanation": "a group of people who join together for religious or similar reasons and live according to particular rules: ",
                            "examples": [
                                "religious/holy orders",
                                "monks of the Cistercian/Franciscan Order"
                            ]
                        },
                        {
                            "explanation": "a group that people are made members of as a reward for services they have done for their country: ",
                            "examples": [
                                "He was made a knight of the Order of the Garter."
                            ]
                        },
                        {
                            "explanation": "the type or size of something: ",
                            "examples": [
                                "These were problems of a completely different order from anything we had faced before.",
                                "No successful business can be run without skills of the highest order (= great skills)."
                            ]
                        },
                        {
                            "explanation": "approximately: ",
                            "examples": [
                                "The cost will be something in the order of $500."
                            ]
                        },
                        {
                            "explanation": "(used in the classification of plants and animals) a group of related plants or animals: ",
                            "examples": [
                                "An order is below a class and above a family."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈɔː.dər"
                            ],
                            "us": [
                                "ˈɔːr.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to ask for something to be made, supplied, or delivered, especially in a restaurant or shop: ",
                            "examples": [
                                "I ordered some pasta and a mixed salad.",
                                "There are no shirts left in this size but we could order one for you/order you one."
                            ]
                        },
                        {
                            "explanation": "If a person in authority orders someone to do something, or orders something to be done, they tell someone to do it: ",
                            "examples": [
                                "The management has ordered a cutback in spending.",
                                "\"Wait over there,\" she ordered.",
                                "They ordered him to leave the room."
                            ]
                        },
                        {
                            "explanation": "to arrange a group of people or things in a list from first to last: ",
                            "examples": [
                                "The documents have been ordered alphabetically.",
                                "I've ordered the application forms into three groups."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}