{
    "word": "out",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "aʊt"
                            ],
                            "us": [
                                "aʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to show movement away from the inside of a place or container: ",
                            "examples": [
                                "She opened the window and stuck her head out.",
                                "The bag broke and the apples fell out.",
                                "I jumped out of bed and ran downstairs.",
                                "He leaned out the window.",
                                "He opened the drawer and took out a pair of socks.",
                                "Get out!",
                                "Out you go! (= Go out!)",
                                "My secretary will see you out (= go with you to the door).",
                                "Turn the trousers inside out (= put the inside on the outside)."
                            ]
                        },
                        {
                            "explanation": "outside a building or room: ",
                            "examples": [
                                "If you wait out here, we will call you when the doctor is ready.",
                                "Danger! Keep out! (= Do not enter!)",
                                "It's bitterly cold out, today."
                            ]
                        },
                        {
                            "explanation": "absent for a short time from the place where you live or work: ",
                            "examples": [
                                "I came around to see you this morning, but you were out.",
                                "Someone called while you were out."
                            ]
                        },
                        {
                            "explanation": "used to refer to a period of time when someone goes away from home for a social activity: ",
                            "examples": [
                                "I can't go out tonight - I have work to do.",
                                "Do you want to eat out (= eat in a restaurant) tonight?",
                                "He asked me out (= asked me to go with him) to the cinema next week."
                            ]
                        },
                        {
                            "explanation": "used to refer to a time when someone is away from the main office in order to do a particular job: ",
                            "examples": [
                                "The thieves were spotted by a postman out on his rounds (= as he was delivering the post).",
                                "The police were out in force (= there were a lot of police) at the demonstration."
                            ]
                        },
                        {
                            "explanation": "In a library, if a book is out, it has been borrowed by someone: ",
                            "examples": [
                                "Both copies of \"Wuthering Heights\" were out."
                            ]
                        },
                        {
                            "explanation": "to the point where something is removed or disappears: ",
                            "examples": [
                                "The stain won't come out.",
                                "Cross out any words that are not on the list.",
                                "Never use water to put out fires in electrical equipment.",
                                "Our time/money/patience ran out."
                            ]
                        },
                        {
                            "explanation": "used to say that no more of something is available: ",
                            "examples": [
                                "We're nearly out of petrol."
                            ]
                        },
                        {
                            "explanation": "(in sport) no longer able to play because your turn is over: ",
                            "examples": [
                                "Two of the best players on the team were out after ten minutes.",
                                "New Zealand were all out for 246 (= the team finished with a score of 246)."
                            ]
                        },
                        {
                            "explanation": "(in politics) no longer able to govern because you have lost an election: ",
                            "examples": [
                                "The Social Democrats were voted out after 15 years in power."
                            ]
                        },
                        {
                            "explanation": "to many people: ",
                            "examples": [
                                "The teacher gave out test books to all the students.",
                                "Greenpeace sent a letter out to all its supporters."
                            ]
                        },
                        {
                            "explanation": "spreading out from a central point over a wider area: ",
                            "examples": [
                                "The police search party spread out across the fields."
                            ]
                        },
                        {
                            "explanation": "When a book, magazine, film, or musical recording is out, it is available to the public: ",
                            "examples": [
                                "Is her new book out yet?",
                                "The new movie comes out in August."
                            ]
                        },
                        {
                            "explanation": "able to be seen: ",
                            "examples": [
                                "The stars are out tonight.",
                                "The rain stopped and the sun came out (= appeared).",
                                "In spring all the flowers came out (= their petals opened)."
                            ]
                        },
                        {
                            "explanation": "used to make the meaning of a word stronger: ",
                            "examples": [
                                "We walked all day and were tired out (= very tired) by the time we got home.",
                                "It's up to you to sort this out (= deal with it completely)."
                            ]
                        },
                        {
                            "explanation": "used with verbs describing sounds to emphasize the loudness of the sound: ",
                            "examples": [
                                "He cried out in pain as he hit his head.",
                                "Charlie Chaplin films always make me laugh out loud."
                            ]
                        },
                        {
                            "explanation": "a long distance away from land, a town, or your own country: ",
                            "examples": [
                                "The fishing boats were out at sea for three days.",
                                "They live out in the country, miles from anywhere.",
                                "He lived out in Zambia for seven years.",
                                "The weather's better out west (= a long distance away in the west of the country)."
                            ]
                        },
                        {
                            "explanation": "If a light or fire is out, it is no longer shining or burning: ",
                            "examples": [
                                "When we got home, all the lights were out.",
                                "Is that fire completely out?"
                            ]
                        },
                        {
                            "explanation": "away from the coast or beach: ",
                            "examples": [
                                "Is the tide coming in or going out?",
                                "You can only see the beach when the tide is out."
                            ]
                        },
                        {
                            "explanation": "(of information) no longer kept secret: ",
                            "examples": [
                                "You can't hide your gambling any longer - the secret's out."
                            ]
                        },
                        {
                            "explanation": "used to describe a person who is not heterosexual (= sexually attracted to men if they are a woman and women if they are a man) or not cisgender (= having a gender that matches the body they were born with) and who does not keep that fact secret from other people: ",
                            "examples": [
                                "She came out three years ago.",
                                "He hasn't come out to his family yet.",
                                "Is she out at work?"
                            ]
                        },
                        {
                            "explanation": "(of a ball in a sport such as tennis) landing outside one of the lines that mark the area where the game is played: ",
                            "examples": [
                                "He thought the ball had bounced on the line, but the umpire said it was out."
                            ]
                        },
                        {
                            "explanation": "unconscious or sleeping: ",
                            "examples": [
                                "He passes out (= loses consciousness) at the sight of blood.",
                                "I was hit on the head, and I must have been out cold (= completely unconscious) for about ten minutes."
                            ]
                        },
                        {
                            "explanation": "not accurate: ",
                            "examples": [
                                "Our estimates were only out by a few dollars.",
                                "You were an inch out in your measurements.",
                                "Those sales figures were way out (= completely wrong).",
                                "I'm out $25 on this trip (= it cost me $25 more than expected)."
                            ]
                        },
                        {
                            "explanation": "(used with superlatives) available or in existence: ",
                            "examples": [
                                "This is the best automatic camera out.",
                                "I think he's the greatest football player out."
                            ]
                        },
                        {
                            "explanation": "used to show that a period of time is finished: ",
                            "examples": [
                                "I think I can finish this project before the month's out."
                            ]
                        },
                        {
                            "explanation": "not acceptable or not possible: ",
                            "examples": [
                                "Smoking is definitely out among my friends.",
                                "The option of taking on more staff is out for the moment."
                            ]
                        },
                        {
                            "explanation": "no longer fashionable or popular: ",
                            "examples": [
                                "Every month the magazine lists what's out and what's in (= fashionable).",
                                "Trousers like that went out (= stopped being fashionable) in the 70s."
                            ]
                        },
                        {
                            "explanation": "doing something, or intending to do something, for an unpleasant reason or only because it is good for you and not others: ",
                            "examples": [
                                "She doesn't usually help the charity - she's only out for the publicity."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "aʊt"
                            ],
                            "us": [
                                "aʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make known the fact that someone is not heterosexual (= attracted to men if you are a woman and women if you are a man) or cisgender (= having a gender that matches the body you were born with), especially when that person does not want other people to know: ",
                            "examples": [
                                "Hardly a week went by without someone famous being outed.",
                                "Outing private individuals is offensive behaviour.",
                                "She was outed as transgender by a sleazy tabloid."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "aʊt"
                            ],
                            "us": [
                                "aʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an excuse or reason for avoiding an unpleasant situation: ",
                            "examples": [
                                "We must arrange the negotiations so we have an out if we need it."
                            ]
                        },
                        {
                            "explanation": "People who are on the outs have argued and are not now friendly with each other: ",
                            "examples": [
                                "Lizzie and Tyler are on the outs again."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "aʊt-"
                            ],
                            "us": [
                                "aʊt-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to add the meaning \"not central\" to nouns and adjectives: ",
                            "examples": [
                                "the outskirts of town (= the areas that form the edge of the town)"
                            ]
                        },
                        {
                            "explanation": "used to add the meaning \"going further\" or \"being better than\" to verbs: ",
                            "examples": [
                                "She doesn't drink or smoke and I'm sure she'll outlive (= live longer than) us all."
                            ]
                        },
                        {
                            "explanation": "used to add the meaning \"out of\" or \"away from\" to nouns and adjectives: ",
                            "examples": [
                                "She turned away from their outstretched hands (= hands held out)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}