{
    "word": "overreach",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌəʊ.vərˈiːtʃ"
                            ],
                            "us": [
                                "ˌoʊ.vɚˈriːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fail by trying to achieve, spend, or do more than you can manage: ",
                            "examples": [
                                "The housing meltdown hurt high-risk borrowers who overreached.",
                                "In the flush of success, he overreached.",
                                "Don't go too far and overreach yourself.",
                                "Companies that overreach themselves soon find themselves in debt."
                            ]
                        },
                        {
                            "explanation": "to make a bigger claim than is reasonable: ",
                            "examples": [
                                "Those doing sound science don’t overreach, knowing that their methodology will be replicated and their results tested."
                            ]
                        },
                        {
                            "explanation": "to do more than your authority allows: ",
                            "examples": [
                                "Some officials charged that the investigators had overreached their authority.",
                                "It was a warning to the Florida court not to overreach its powers."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈəʊ.vər.iːtʃ"
                            ],
                            "us": [
                                "ˈoʊ.vɚˌriːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of doing more than your authority allows: ",
                            "examples": [
                                "Courts act as a safeguard against executive overreach in individual counter-terrorism cases.",
                                "Already there are signs of regulatory overreach."
                            ]
                        },
                        {
                            "explanation": "the act of making a bigger claim than is reasonable: ",
                            "examples": [
                                "To say \"Organizations will be forced to pay for procedures they morally oppose\" is clearly an overreach. "
                            ]
                        },
                        {
                            "explanation": "an injury to a horse's foot caused by the foot reaching too far forward when the horse is moving: ",
                            "examples": [
                                "He was in the lead when he suffered an overreach and had to retire."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}