{
    "word": "overhaul",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əʊ.vəˈhɔːl"
                            ],
                            "us": [
                                "oʊ.vɚˈhɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to repair an engine, machine, etc. so that every part of it works as it should: ",
                            "examples": [
                                "I got the engine overhauled."
                            ]
                        },
                        {
                            "explanation": "to completely change a system so that it works more effectively: ",
                            "examples": [
                                "The government has recently overhauled the healthcare system.",
                                "The school chose to overhaul its curriculum by equipping classrooms with new technology."
                            ]
                        },
                        {
                            "explanation": "to completely change something, especially by getting rid of some people or things and replacing them with others: ",
                            "examples": [
                                "Most women don't overhaul their wardrobes from season to season.",
                                "The restaurant has overhauled its menu, cutting portions and eliminating items with lots of calories."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈəʊ.vəˌhɔːl"
                            ],
                            "us": [
                                "ˈoʊ.vɚˌhɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of repairing an engine, machine, etc. so that every part works as it should: ",
                            "examples": [
                                "I took my motorbike in for an overhaul.",
                                "Our gas turbine division is now a world market leader in the repair and overhaul of industrial gas turbines."
                            ]
                        },
                        {
                            "explanation": "the act of completely changing a system so that it works more effectively: ",
                            "examples": [
                                "They announced plans for a radical overhaul of the country's political system.",
                                "Such changes call for an overhaul of the way Britain runs air travel."
                            ]
                        },
                        {
                            "explanation": "the act of completely changing something, especially by getting rid of some people or things and replacing them with others: ",
                            "examples": [
                                "There is likely to be a major overhaul of the squad this summer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}