{
    "word": "own",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "əʊn"
                            ],
                            "us": [
                                "oʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "belonging to or done by a particular person or thing: ",
                            "examples": [
                                "Each neighbourhood in New York has its own characteristics.",
                                "I'd like to have my very own apartment.",
                                "He wanted an apartment of his own.",
                                "She makes all her own clothes.",
                                "I'm going to be out tonight, so you'll have to make your own dinner (= prepare it yourself).",
                                "Was that your own idea or did someone suggest it to you?",
                                "You'll have to make up your own mind (= decide by yourself) what you want to do.",
                                "I'd never have believed it if I hadn't seen it with my own eyes/heard it with my own ears.",
                                "\"Is that your mum's car?\" \"No, it's my own (= it belongs to me).\"",
                                "James Joyce wrote in a style that was all his own (= that was not like that of anyone else).",
                                "We like to take care of our own (= take care of people who are members of our family, or who work for us)."
                            ]
                        },
                        {
                            "explanation": "alone: ",
                            "examples": [
                                "I like living on my own."
                            ]
                        },
                        {
                            "explanation": "without any help: ",
                            "examples": [
                                "I did my buttons up all on my own, Dad ."
                            ]
                        },
                        {
                            "explanation": "If you do something in your own time, you do it at the speed at which you want to work: ",
                            "examples": [
                                "I like to do things in my own time - I don't like to be rushed."
                            ]
                        },
                        {
                            "explanation": "during the time when you are not officially working: ",
                            "examples": [
                                "You may only use company computers to access the Web in your own time."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "əʊn"
                            ],
                            "us": [
                                "oʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have something that legally belongs to you: ",
                            "examples": [
                                "We own our house.",
                                "I've never owned a suit in my life."
                            ]
                        },
                        {
                            "explanation": "to admit: ",
                            "examples": [
                                "I own (that) I was not very happy with the group's decision."
                            ]
                        },
                        {
                            "explanation": "to defeat someone completely or be much better than him or her; to perform extremely well: ",
                            "examples": [
                                "Last time we played them, we owned them!",
                                "Beyoncé owned that stage tonight!"
                            ]
                        },
                        {
                            "explanation": "to accept and be responsible for something: ",
                            "examples": [
                                "It's your life - own it.",
                                "I own who I was, and so I’m always open to admitting fault and talking through it."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}