{
    "word": "pace",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "peɪs"
                            ],
                            "us": [
                                "peɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the speed at which someone or something moves, or with which something happens or changes: ",
                            "examples": [
                                "a slow/fast pace",
                                "When she thought she heard someone following her, she quickened her pace.",
                                "Could you slow down - I can't keep pace with (= walk or run as fast as) you.",
                                "For many years this company has set the pace (= has been the most successful company) in the communications industry.",
                                "These changes seem to me to be happening at too fast a pace.",
                                "I don't like the pace of modern life."
                            ]
                        },
                        {
                            "explanation": "to make other people in a race go faster by going faster yourself: ",
                            "examples": [
                                "Sylva, in a red shirt and shorts, forced the pace lap after exhausting lap."
                            ]
                        },
                        {
                            "explanation": "the ability of a football player or team to move quickly with the ball: ",
                            "examples": [
                                "He plays on the right wing and has pace as well as skill. ",
                                "Chelsea lacked pace up front."
                            ]
                        },
                        {
                            "explanation": "a single step, or the distance you move when you take a single step: ",
                            "examples": [
                                "Take two paces forwards/backwards.",
                                "The runner collapsed just a few paces from the finish."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "peɪs"
                            ],
                            "us": [
                                "peɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to get someone to run a race at a particular speed, for example by running with them",
                            "examples": []
                        },
                        {
                            "explanation": "to be careful not to do something too quickly, so that you do not get too tired to finish it: ",
                            "examples": [
                                "No more soup, thank you. I'm pacing myself so that I have room for a dessert.",
                                "Don't try to do everything at once - pace yourself.",
                                "There's a tremendous amount to see and do in the city, so pace yourself and don't try to do it all on the first day.",
                                "The secret is to pace yourself and only increase the length of your run once a week.",
                                "I've had to learn to pace myself in order to preserve my energy.",
                                "She's not very good at pacing herself and can get pretty exhausted."
                            ]
                        },
                        {
                            "explanation": "to walk with regular steps in one direction and then back again, usually because you are worried or nervous: ",
                            "examples": [
                                "He paced the room nervously.",
                                "He paced up and down, waiting for the doctor to call."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}