{
    "word": "pack",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pæk"
                            ],
                            "us": [
                                "pæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something into a bag, box, etc.: ",
                            "examples": [
                                "We're leaving early tomorrow morning, so you'd better pack (= put clothes and other possessions into suitcases or bags) tonight.",
                                "She packed a small suitcase for the weekend.",
                                "He just packed his bags and walked out on his wife and children.",
                                "I haven't packed my clothes (= put them into a suitcase, etc.) yet.",
                                "Could you pack me a spare pair of shoes, please/pack a spare pair of shoes for me, please?",
                                "These books need to be packed in/into a box."
                            ]
                        },
                        {
                            "explanation": "to put a material around something before putting it into a bag, box, etc. so that it will not break or be damaged: ",
                            "examples": [
                                "She packed the vase in tissue paper to protect it."
                            ]
                        },
                        {
                            "explanation": "to come or bring together in large numbers or to fill a space: ",
                            "examples": [
                                "Thousands of fans are packing into the stadium.",
                                "Fans packed the stadium to watch the final game.",
                                "The people on the bus were packed (together) like sardines (= there were many of them very close together) ."
                            ]
                        },
                        {
                            "explanation": "to (cause to) form into a solid mass: ",
                            "examples": [
                                "The wind has packed the snow against the garage door.",
                                "The snow has packed down tightly, making the streets dangerous to walk on."
                            ]
                        },
                        {
                            "explanation": "to carry something, especially a gun: ",
                            "examples": [
                                "to pack a gun",
                                "Each missile packs several warheads.",
                                "This gun packs (= has) a lot of firepower."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pæk"
                            ],
                            "us": [
                                "pæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group, set, or collection of something: ",
                            "examples": [
                                "The information pack consists of a brochure and a map."
                            ]
                        },
                        {
                            "explanation": "a group of animals, such as dogs, that live and/or hunt together: ",
                            "examples": [
                                "a wolf pack",
                                "a pack of wild dogs"
                            ]
                        },
                        {
                            "explanation": "an organized group of children who are brownies or cubs: ",
                            "examples": [
                                "My uncle was the leader of my Cub pack."
                            ]
                        },
                        {
                            "explanation": "a set of playing cards: ",
                            "examples": [
                                "a pack of cards"
                            ]
                        },
                        {
                            "explanation": "a group of similar people, especially one that contains people whose activities you do not approve of: ",
                            "examples": [
                                "a pack of thieves",
                                "A pack of journalists was waiting outside the White House."
                            ]
                        },
                        {
                            "explanation": "a small paper or cardboard container in which a number of small objects are sold : ",
                            "examples": [
                                "a pack of cigarettes/gum"
                            ]
                        },
                        {
                            "explanation": "a type of bag that you usually carry on your back when you are travelling",
                            "examples": []
                        },
                        {
                            "explanation": "a thick mass of a substance, often like clay, that is used as a beauty treatment for the face",
                            "examples": []
                        },
                        {
                            "explanation": "a thick mass of cloth, etc. that can be put on an injury to stop any bleeding or swelling: ",
                            "examples": [
                                "Hold this ice pack to your head to stop the bruising."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -pæk"
                            ],
                            "us": [
                                " -pæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used in combination with an amount to show that that many of a particular type of goods have been wrapped and are being sold together: ",
                            "examples": [
                                "a six-pack of beer",
                                "a twin-pack of soap",
                                "a multi-pack of toilet paper"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}