{
    "word": "page",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "peɪdʒ"
                            ],
                            "us": [
                                "peɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a side of one of the pieces of paper in a book, newspaper, or magazine, usually with a number printed on it: ",
                            "examples": [
                                "For details on how to enter the competition, see page 134.",
                                "The article appeared on the front page of the New York Times."
                            ]
                        },
                        {
                            "explanation": "one of the sheets of paper in a book, newspaper, or magazine: ",
                            "examples": [
                                "Several pages have been torn out of this book."
                            ]
                        },
                        {
                            "explanation": "one part of a website",
                            "examples": []
                        },
                        {
                            "explanation": "in the past, a boy who worked as a servant for a knight and who was learning to become a knight: ",
                            "examples": [
                                "Below in the courtyard the knights and men-at-arms and pages were already receiving the Queen’s message.",
                                "He who would become a knight must first learn the rudiments as a page."
                            ]
                        },
                        {
                            "explanation": "in the past, a man or boy who was the personal servant of an important person: ",
                            "examples": [
                                "We know de Vere became \"poor\" with only 4 pages or attendants, after having run through his family wealth."
                            ]
                        },
                        {
                            "explanation": "a young boy who is one of the people to go with the bride (= the woman who is getting married) into the place where the wedding is taking place: ",
                            "examples": [
                                "The children of the couple became the bridesmaids and pages.",
                                "The pages, flower girls, and bridesmaids were waiting for the bride and her father."
                            ]
                        },
                        {
                            "explanation": "a young person whose job is to deliver messages, answer people's questions, do things for other staff, etc. in a company or organization : ",
                            "examples": [
                                "He is a hotel page.",
                                "He worked as a page at the old Vernon Branch Library.",
                                "As young men, her three much older brothers were Senate pages who met Presidents John Kennedy and Richard Nixon."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "peɪdʒ"
                            ],
                            "us": [
                                "peɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to call a person using a loudspeaker (= an electric device for making sounds louder) in a public place: ",
                            "examples": [
                                "He was paged at the airport and told to return home immediately."
                            ]
                        },
                        {
                            "explanation": "to send a message to someone's pager (= small electronic device that receives signals): ",
                            "examples": [
                                "Have you tried to page him?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}