{
    "word": "palette",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpæl.ət"
                            ],
                            "us": [
                                "ˈpæl.ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thin board with curved edges and a hole for your thumb, used by artists to mix their paints on while they are painting: ",
                            "examples": [
                                "I was like an artist with his palette.",
                                "He showed his student how to prepare a palette."
                            ]
                        },
                        {
                            "explanation": "the range of colours that a painter, photographer, film maker, etc. usually uses: ",
                            "examples": [
                                "Matisse's palette typically consists of bright blues, greens and oranges.",
                                "The director returns to the saturated colour palettes that made him famous."
                            ]
                        },
                        {
                            "explanation": "the range of colours used in the decoration of a house, etc.: ",
                            "examples": [
                                "She chose a muted palette - putty green in the living room, a rich brown in the bedroom.",
                                "I love this quilt, the colour palette is so soft and soothing."
                            ]
                        },
                        {
                            "explanation": "the range of colours available to the user of a computer, etc.: ",
                            "examples": [
                                "Pixels of two colours from the 16 colour palette could be displayed in each block."
                            ]
                        },
                        {
                            "explanation": "a flat case containing make-up such as eyeshadow or highlighter of different colours: ",
                            "examples": [
                                "This palette contains nine of our bestselling eye colours.",
                                "I decided I just couldn't live without those glamorous makeup palettes that I spotted in duty free."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}