{
    "word": "palliative",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpæl.i.ə.tɪv"
                            ],
                            "us": [
                                "ˈpæl.i.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a drug or medical treatment) reducing pain without curing the cause of the pain: ",
                            "examples": [
                                "Older people facing a terminal illness may want to choose palliative care only.",
                                "The success of chemotherapy as a form of palliative treatment depends on the type of tumour."
                            ]
                        },
                        {
                            "explanation": "making a problem seem less serious but not solving the problem or making it disappear: ",
                            "examples": [
                                "Short-term, palliative measures were taken which gave the appearance that the problems were being addressed.",
                                "Some of the palliative strategies do not make sense."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpæl.i.ə.tɪv"
                            ],
                            "us": [
                                "ˈpæl.i.ə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a drug or medical treatment that reduces pain without curing the cause of the pain: ",
                            "examples": [
                                "Most of the AIDS research community were either working on vaccines for prevention or on stronger palliatives.",
                                "The substance has been consumed as a palliative by indigenous groups in Appalachia."
                            ]
                        },
                        {
                            "explanation": "something that makes a problem seem less serious but does not solve the problem or make it disappear: ",
                            "examples": [
                                "We want long-term solutions, not short-term palliatives.",
                                "Knitting became a palliative for Mary as the long miserable days stretched out ahead."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}