{
    "word": "party",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɑː.ti"
                            ],
                            "us": [
                                "ˈpɑːr.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a social event at which a group of people meet to talk, eat, drink, dance, etc., often in order to celebrate a special occasion: ",
                            "examples": [
                                "a birthday party",
                                "a farewell party",
                                "a dinner party (= a small, sometimes formal party where a meal is eaten)",
                                "a fancy-dress (US costume) party (= a party where people wear clothes that make them look like someone or something else)",
                                "Peter has/gives/throws really wild parties."
                            ]
                        },
                        {
                            "explanation": "an organization of people with particular political beliefs that competes in elections to try to win positions in local or national government: ",
                            "examples": [
                                "the Democratic Party",
                                "the Green party",
                                "the Conservative party",
                                "The party have just elected a new leader.",
                                "He was elected as party leader in 2011.",
                                "They contacted party members from across the nation to ask for their support."
                            ]
                        },
                        {
                            "explanation": "a group of people who are involved in an activity together, especially a visit: ",
                            "examples": [
                                "a party of tourists",
                                "Most museums give a discount to school parties."
                            ]
                        },
                        {
                            "explanation": "one of the people or groups of people involved in an official argument, arrangement, or similar situation: ",
                            "examples": [
                                "The UN called on all parties in the conflict to take a positive stance towards the new peace initiative.",
                                "It's often difficult to establish who the guilty party is following a traffic accident."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈpɑː.ti"
                            ],
                            "us": [
                                "ˈpɑːr.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to enjoy yourself by drinking and dancing, especially at a party: ",
                            "examples": [
                                "Let's party!",
                                "They partied till dawn."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}