{
    "word": "part",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɑːt"
                            ],
                            "us": [
                                "pɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "some but not all of a thing: ",
                            "examples": [
                                "Part of my steak isn't cooked properly.",
                                "Part of this form seems to be missing.",
                                "I think part of her problem is that she doesn't listen carefully enough to what other people say."
                            ]
                        },
                        {
                            "explanation": "partly, or to some degree: ",
                            "examples": [
                                "The deadline for applications is being extended, in part because of the postal strike."
                            ]
                        },
                        {
                            "explanation": "to an important degree: ",
                            "examples": [
                                "How quickly we can finish the project depends in a large part on when we get the payments through."
                            ]
                        },
                        {
                            "explanation": "mostly or usually: ",
                            "examples": [
                                "He was, for the most part, quite helpful."
                            ]
                        },
                        {
                            "explanation": "a separate piece of something, or a piece that combines with other pieces to form the whole of something: ",
                            "examples": [
                                "We learned about all the different parts of the digestive system.",
                                "The lower part of her spine was crushed in the accident.",
                                "I think there's always a part of you that doubts what you're doing.",
                                "Fresh fruit and vegetables form an essential/important part of a healthy diet.",
                                "There'll be snow in parts (= particular areas) of the Midlands tonight."
                            ]
                        },
                        {
                            "explanation": "one of the pieces that together form a machine or some type of equipment: ",
                            "examples": [
                                "He works for a company that makes aircraft parts."
                            ]
                        },
                        {
                            "explanation": "a single broadcast of a series of television or radio programmes or a division of a story: ",
                            "examples": [
                                "Next week we publish part three of the president's diaries.",
                                "The programme will be shown in two parts."
                            ]
                        },
                        {
                            "explanation": "one of two or more equal, or almost equal, measures of something: ",
                            "examples": [
                                "Mix one part of the medicine with three parts water."
                            ]
                        },
                        {
                            "explanation": "one of the characters in a film, play, or dance, or the words, actions, or movements that are said or done by that character: ",
                            "examples": [
                                "He has a small part in the school play.",
                                "She plays the part of the sexy blonde waitress."
                            ]
                        },
                        {
                            "explanation": "the music that a particular musician plays in a group",
                            "examples": []
                        },
                        {
                            "explanation": "used to refer to an area of the country: ",
                            "examples": [
                                "We don't see many foreigners in these parts."
                            ]
                        },
                        {
                            "explanation": "to be involved in an activity with other people: ",
                            "examples": [
                                "She doesn't usually take part in any of the class activities."
                            ]
                        },
                        {
                            "explanation": "involvement in or responsibility for an activity, or action: ",
                            "examples": [
                                "He admitted his part in the robbery.",
                                "I want no part in/of your crazy plans!"
                            ]
                        },
                        {
                            "explanation": "a line on someone's head made by brushing the hair in two different directions: ",
                            "examples": [
                                "a centre/side part"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pɑːt"
                            ],
                            "us": [
                                "pɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to separate or cause something or someone to separate: ",
                            "examples": [
                                "The curtains parted, revealing a darkened stage.",
                                "To be parted from him even for two days made her sad."
                            ]
                        },
                        {
                            "explanation": "If you part your hair, you arrange it so that it falls on either side of your head by separating it with a line down the middle or on one side.",
                            "examples": []
                        },
                        {
                            "explanation": "If two people part, they leave each other, often at the end of a relationship: ",
                            "examples": [
                                "I'm afraid we parted on very bad terms."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "pɑːt"
                            ],
                            "us": [
                                "pɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "partly: ",
                            "examples": [
                                "He's part African - his father was born in Somalia.",
                                "The exam is part spoken and part written."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "pɑːt"
                            ],
                            "us": [
                                "pɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not total or complete: ",
                            "examples": [
                                "He's (a) part owner of a racehorse.",
                                "Part payment is better than no payment."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}