{
    "word": "passport",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɑːs.pɔːt"
                            ],
                            "us": [
                                "ˈpæs.pɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an official document containing personal information and usually a photograph that allows a person to travel to foreign countries and to prove who they are: ",
                            "examples": [
                                "Many refugees have arrived at the border without passports.",
                                "He was a German, travelling on a Swiss passport.",
                                "The system failure caused major delays at passport control (= the place where travellers' passports are examined).",
                                "Your passport photo must comply with international guidelines."
                            ]
                        },
                        {
                            "explanation": "a document showing information about an animal, its health, and its vaccinations (= substances that have been put into its body to prevent it getting a disease). This document also allows the animal to be taken into foreign countries. : ",
                            "examples": [
                                "The system of pet passports has been welcomed by pet owners as it now means that a single document is all that is needed for pets to travel around the EU.",
                                "In the UK all cattle, bison and buffalo must have passports, which are unique to the animal and stay with it for its entire life.",
                                "The farmer had failed to apply for cattle passports - which help to trace animal movement - for 24 beasts, rendering them valueless."
                            ]
                        },
                        {
                            "explanation": "an official document showing that a person has had a vaccination against a particular disease (= has had a substance put into their body to prevent them getting the disease). The document allows a person to travel to foreign countries or to enter certain places: ",
                            "examples": [
                                "The NHS App is now available to use as a vaccine passport. ",
                                "In the past, the government said it did not intend to launch a nationwide vaccination passport.",
                                "Some countries have already implemented their own versions of a Covid passport which has allowed people to attend large scale events.",
                                "Keep track of your child's immunizations with this specially designed passport."
                            ]
                        },
                        {
                            "explanation": "a certain way of getting something you want: ",
                            "examples": [
                                "Many students opt for business studies simply because it sounds like a passport to a good job."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}