{
    "word": "passage",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpæs.ɪdʒ"
                            ],
                            "us": [
                                "ˈpæs.ɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a usually long and narrow part of a building with rooms on one or both sides, or a covered path that connects places: ",
                            "examples": [
                                "A narrow passage led directly through the house into the garden.",
                                "The bathroom's on the right at the end of the passage."
                            ]
                        },
                        {
                            "explanation": "a hollow part of the body through which something goes: ",
                            "examples": [
                                "the nasal passages",
                                "the anal passage"
                            ]
                        },
                        {
                            "explanation": "a short piece of writing or music that is part of a larger piece of work: ",
                            "examples": [
                                "Several passages from the book were printed in a national newspaper before it was published."
                            ]
                        },
                        {
                            "explanation": "travel, especially as a way of escape: ",
                            "examples": [
                                "The gunman demanded a plane and safe passage to an unspecified destination."
                            ]
                        },
                        {
                            "explanation": "a journey, especially over the sea: ",
                            "examples": [
                                "He had booked his passage to Rio de Janeiro."
                            ]
                        },
                        {
                            "explanation": "to do work on a ship during your trip instead of paying for a ticket: ",
                            "examples": [
                                "He was allowed to work his passage from the port of Perth."
                            ]
                        },
                        {
                            "explanation": "an act of moving through somewhere: ",
                            "examples": [
                                "Many meteors disintegrate during their passage through the atmosphere.",
                                "The government prohibits the passage of foreign troops and planes across its territory."
                            ]
                        },
                        {
                            "explanation": "the process of time going past: ",
                            "examples": [
                                "Memories fade with the passage of time."
                            ]
                        },
                        {
                            "explanation": "the official approval of something, especially a new law: ",
                            "examples": [
                                "He again urged passage of a constitutional amendment outlawing abortion."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}