{
    "word": "passing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɑː.sɪŋ"
                            ],
                            "us": [
                                "ˈpæs.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in sport, the act of kicking, throwing, or hitting the ball to someone in your own team: ",
                            "examples": [
                                "Accurate passing is key in netball.",
                                "There was some slick passing in midfield.",
                                "The quarterback is near the top of the league in passing. "
                            ]
                        },
                        {
                            "explanation": "the act of giving something to someone: ",
                            "examples": [
                                "To me, it's like the passing of a baton.",
                                "His method is to organize the passing of a bribe at the official's home.",
                                "There were multiple passings of the collection plate around the congregation."
                            ]
                        },
                        {
                            "explanation": "the act of saying officially, as a judge, what a criminal's official punishment will be: ",
                            "examples": [
                                "The Court has the power to suspend the passing of sentence.",
                                "This kind of behaviour will not be tolerated and the only way that can be made plain is by the passing of a custodial sentence."
                            ]
                        },
                        {
                            "explanation": "the act of giving approval to something, especially by voting to make it law: ",
                            "examples": [
                                "The Financial Times reported the passing of a banking act intended to speed the privatization of Hungary's banks.",
                                "Foxhunters' Chase will continue to be so named despite the passing of a bill to outlaw foxhunting.",
                                "There have been enough passings of stupid laws."
                            ]
                        },
                        {
                            "explanation": "the act of being successful in an exam, a course, etc.: ",
                            "examples": [
                                "Academic credits refer to credits earned upon the successful passing of a course.",
                                "The news that a certain amount of legal knowledge would be required, and even the passing of a few exams, killed their interest. "
                            ]
                        },
                        {
                            "explanation": "the act of going past a person or thing: ",
                            "examples": [
                                "Ahead, a closed level-crossing gate promised the imminent passing of a train.",
                                "The leaves on a tree tremble at the passing of a breath of wind.",
                                "He must depart from the slight path that his passings have worn in the rock surface."
                            ]
                        },
                        {
                            "explanation": "the act of going past a particular point in time: ",
                            "examples": [
                                "The moves follow the passing of yesterday's 5pm deadline for bids.",
                                "The safe homecoming represented the passing of a critical milestone for Nasa."
                            ]
                        },
                        {
                            "explanation": "If something is said in passing, it is said while talking about something else and is not the main subject of a conversation: ",
                            "examples": [
                                "When asked if he had told the police about the incident, Mr Banks said he had mentioned it in passing to a detective."
                            ]
                        },
                        {
                            "explanation": "the process of time passing: ",
                            "examples": [
                                "My parents seem to have mellowed with the passing of the years."
                            ]
                        },
                        {
                            "explanation": "the death or end of someone or something: ",
                            "examples": [
                                "Ten years after her death, the public still mourns her passing.",
                                "the passing of the old year",
                                "There have been a few tragic passings this year in our family."
                            ]
                        },
                        {
                            "explanation": "a situation in which a person who belongs to a particular group is believed by other people to be a member of a different group, for example a different race: ",
                            "examples": [
                                "Reasons for passing are deeply individual.",
                                "Most often, racial passing means black passing for white, usually out of economic or social necessity.",
                                "Passing as straight is not something I choose. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpɑː.sɪŋ"
                            ],
                            "us": [
                                "ˈpæs.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "moving past: ",
                            "examples": [
                                "A passing motorist stopped and gave her a lift to the nearby town."
                            ]
                        },
                        {
                            "explanation": "lasting only for a short time and not important or complete: ",
                            "examples": [
                                "I gave the restaurant a passing glance as I walked by, but I didn't notice who was in there.",
                                "The matter is only of passing scientific interest."
                            ]
                        },
                        {
                            "explanation": "used to refer to a period of time that is going past: ",
                            "examples": [
                                "The situation seems to become more hopeless with each/every passing day."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}