{
    "word": "past",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "pɑːst"
                            ],
                            "us": [
                                "pæst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or to a position that is further than a particular point: ",
                            "examples": [
                                "I live on Station Road, just past the post office.",
                                "Three boys went past us on mountain bikes.",
                                "Was that Peter who just jogged past in those bright pink shorts?"
                            ]
                        },
                        {
                            "explanation": "used to say what the time is when it is a particular number of minutes after an hour: ",
                            "examples": [
                                "It's five/ten/a quarter/twenty/twenty-five/half past three.",
                                "I need to leave at twenty past or I'll miss that train."
                            ]
                        },
                        {
                            "explanation": "above a particular age or further than a particular point: ",
                            "examples": [
                                "She's past the age where she needs a babysitter.",
                                "Do what you want, I'm past caring (= I don't care any longer)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "pɑːst"
                            ],
                            "us": [
                                "pæst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a period of time before and until the present: ",
                            "examples": [
                                "The average temperature worldwide has risen by about one degree Fahrenheit in the past 100 years.",
                                "I've been walking three miles a day for the past 30 years.",
                                "He was the fifth climber to die on these mountains over the past two days.",
                                "In centuries/years past (= many centuries/years ago) even visiting the next village was considered a long journey."
                            ]
                        },
                        {
                            "explanation": "having happened or existed before now: ",
                            "examples": [
                                "I know from past experience that you can't judge by appearances.",
                                "The prime minister's family have been instructed not to discuss his past life with the press."
                            ]
                        },
                        {
                            "explanation": "finished: ",
                            "examples": [
                                "I'm feeling much better now that the cold weather is past."
                            ]
                        },
                        {
                            "explanation": "of the past tense: ",
                            "examples": [
                                "\"Must\" does not have a past form."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɑːst"
                            ],
                            "us": [
                                "pæst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the period before and until, but not including, the present time: ",
                            "examples": [
                                "Evolution can explain the past, but it can never predict the future.",
                                "In the past, this sort of work was all done by hand.",
                                "By winning the 1500 metres, he joins some of the great names of the past."
                            ]
                        },
                        {
                            "explanation": "a part of someone's life in which they did unacceptable or dishonest things: ",
                            "examples": [
                                "He's a man with a past.",
                                "His parents didn't want him to marry a woman with a past.",
                                "She had a past and she didn't care who knew about it.",
                                "People in the village knew he had a past and were wary of him.",
                                "Emigrating was an attractive option for someone with a past they wanted to leave behind."
                            ]
                        },
                        {
                            "explanation": "the form of a verb used to describe actions, events, or states that happened or existed before the present time: ",
                            "examples": [
                                "The past of \"change\" is \"changed\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}