{
    "word": "pathway",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɑːθ.weɪ"
                            ],
                            "us": [
                                "ˈpæθ.weɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a track that a person can walk along: ",
                            "examples": [
                                "New pedestrian pathways are being built alongside the road."
                            ]
                        },
                        {
                            "explanation": "a series of actions that can be taken in order to achieve something: ",
                            "examples": [
                                "Working your way up through a company is a difficult pathway.",
                                "He has supported legislation that would grant most illegal immigrants a pathway to citizenship.",
                                "Ms. Smith, the foundation's president, hopes it can help open new pathways for young black men."
                            ]
                        },
                        {
                            "explanation": "a series of actions that is taken in a particular situation, especially as part of medical treatment: ",
                            "examples": [
                                "The patient should be given a full explanation of the treatment pathway and this may include information sheets about their medication.",
                                "What proportion of Alzheimer's sufferers follow this pathway?"
                            ]
                        },
                        {
                            "explanation": "a way for something to spread within the body or between bodies: ",
                            "examples": [
                                "The mind creates its own neural pathways.",
                                "Lesions caused by syphilis can provide a pathway for HIV infection."
                            ]
                        },
                        {
                            "explanation": "a set of connected chemical reactions in biology: ",
                            "examples": [
                                "The fish can derive energy from sugars via a biochemical pathway that doesn't require oxygen but is far less efficient than the oxygen route. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}