{
    "word": "pattern",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpæt.ən"
                            ],
                            "us": [
                                "ˈpæt̬.ɚn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a particular way in which something is done, is organized, or happens: ",
                            "examples": [
                                "The pattern of family life has been changing over recent years.",
                                "A pattern is beginning to emerge from our analysis of the accident data.",
                                "In this type of mental illness, the usual pattern is bouts of depression alternating with elation.",
                                "Many behaviour(al) patterns have been identified in the chimp colony."
                            ]
                        },
                        {
                            "explanation": "any regularly repeated arrangement, especially a design made from repeated lines, shapes, or colours on a surface: ",
                            "examples": [
                                "Look, the frost has made a beautiful pattern on the window.",
                                "The curtains had a floral pattern."
                            ]
                        },
                        {
                            "explanation": "something that is used as an example, especially to copy: ",
                            "examples": [
                                "The design is so good it's sure to set the pattern for many others."
                            ]
                        },
                        {
                            "explanation": "a drawing or shape used to show how to make something: ",
                            "examples": [
                                "a knitting pattern",
                                "a dress pattern",
                                "Cut out all of the pieces from the paper pattern and pin them on the cloth."
                            ]
                        },
                        {
                            "explanation": "a small piece of cloth or paper taken from a usual-sized piece and used to show what it looks like: ",
                            "examples": [
                                "a pattern book"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used in compounds to refer to the way in which a particular type of hair loss occurs, affecting mainly the top and front of the head: ",
                            "examples": [
                                "50% of men over age 50 experience some kind of male pattern baldness.",
                                "Female-pattern hair loss, which is caused by genetic and hormonal factors, is the most common type of hair loss in women."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}