{
    "word": "pearl",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɜːl"
                            ],
                            "us": [
                                "pɝːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small, round object, usually white, that forms around a grain of sand inside the shell of a sea creature, especially an oyster. Pearls are valuable and are used to make jewellery: ",
                            "examples": [
                                "a string of pearls",
                                "a pearl necklace"
                            ]
                        },
                        {
                            "explanation": "jewellery made from pearls: ",
                            "examples": [
                                "He gave her pearls for her birthday.",
                                "You never saw her without her pearls - even on the beach!",
                                "Pearls are a safe bet for wearing with a little black dress.",
                                "She was dressed in a cashmere sweater and pearls.",
                                "She sat in front of the mirror and fastened her pearls around her neck."
                            ]
                        },
                        {
                            "explanation": "an artificially made pearl: ",
                            "examples": [
                                "cultured pearls"
                            ]
                        },
                        {
                            "explanation": "a very small ball of some types of food : ",
                            "examples": [
                                "The pearls of rice are delicate and creamy.",
                                "Tapioca is a starchy substance from the cassava plant and comes in many forms, including pellets called pearls.",
                                "Pearls of caviar rolled nicely on the tongue."
                            ]
                        },
                        {
                            "explanation": "a small drop of liquid: ",
                            "examples": [
                                "There were pearls of dew on the grass."
                            ]
                        },
                        {
                            "explanation": "the white shiny colour of pearl or a pale colour",
                            "examples": []
                        },
                        {
                            "explanation": "→ \nmother-of-pearl : ",
                            "examples": [
                                "pearl buttons"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pɜːl"
                            ],
                            "us": [
                                "pɝːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a liquid) to form small drops on a surface: ",
                            "examples": [
                                "Sweat was pearling on her brow.",
                                "He quartered an orange with the knife and the juice on the blade pearled into droplets."
                            ]
                        },
                        {
                            "explanation": "(of a surface) to have small drops of liquid form on it: ",
                            "examples": [
                                "The heavy dish cover was pearled around the edge with glistening drops.",
                                "She saw one of Annie's thin white arms, pearled with water, shoot into the sky as the boat righted itself."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}