{
    "word": "peck",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pek"
                            ],
                            "us": [
                                "pek"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "When a bird pecks, it bites, hits, or picks up something small with its beak: ",
                            "examples": [
                                "The birds learn to peck holes in the milk bottle tops.",
                                "Geese were pecking around for food.",
                                "Chickens pecked at the seeds which covered the ground."
                            ]
                        },
                        {
                            "explanation": "to give someone a quick kiss, especially on the side of the face: ",
                            "examples": [
                                "He pecked his aunt on the cheek."
                            ]
                        },
                        {
                            "explanation": "to type on a keyboard, pressing the keys using only one or two fingers, especially because you are not very good at typing: ",
                            "examples": [
                                "They hunch over keyboards, pecking individual lines of code in strange programming languages.",
                                "I'm tired of watching my 12-year-old daughter pecking at the keyboard with one finger.",
                                "It has a small qwerty keyboard which touch-typists with tiny hands can use - I hunt and peck ."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pek"
                            ],
                            "us": [
                                "pek"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a bird) the action of biting, hitting, or picking up something small with its beak: ",
                            "examples": [
                                "Be careful you don't get a peck in the face from one of the chickens.",
                                "In the game show, she had to brave the pecks of a dozen ostriches while covered in bird seed."
                            ]
                        },
                        {
                            "explanation": "a quick kiss: ",
                            "examples": [
                                "She gave me the usual peck on the cheek."
                            ]
                        },
                        {
                            "explanation": "an old-fashioned unit of measurement equal to 554.84 cubic inches (9.092 litres) in the UK and 537.6 cubic inches (8.810 litres) in the US : ",
                            "examples": [
                                "Peter Piper picked a peck of pickled peppers.",
                                "The labourer then earned two pecks of wheat a day."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}