{
    "word": "penalty",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpen.əl.ti"
                            ],
                            "us": [
                                "ˈpen.əl.ti"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a punishment, or the usual punishment, for doing something that is against a law: ",
                            "examples": [
                                "The law carries a penalty of up to three years in prison.",
                                "They asked for the maximum penalty for hoax calls to be increased to one year.",
                                "The protesters were told to clear the area around the building, on penalty of arrest (= or be arrested) if they did not."
                            ]
                        },
                        {
                            "explanation": "a type of punishment, often involving paying money, that is given to you if you break an agreement or do not follow rules: ",
                            "examples": [
                                "Currently, ticket holders pay a penalty equal to 25 percent of the ticket price when they change their flight plans.",
                                "There was a penalty clause which said you had to pay half the cost if you cancelled your booking."
                            ]
                        },
                        {
                            "explanation": "an advantage given in some sports to a team or player when the opposing team or player breaks a rule: ",
                            "examples": [
                                "The referee awarded (= gave) a penalty kick.",
                                "Hysen handled the ball and conceded the penalty that gave Manchester United the lead."
                            ]
                        },
                        {
                            "explanation": "a disadvantage brought about as a result of a situation or action: ",
                            "examples": [
                                "Loss of privacy is one of the penalties of success.",
                                "She has paid a heavy penalty for speaking the truth."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}