{
    "word": "penetrable",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpen.ɪ.trə.bəl"
                            ],
                            "us": [
                                "ˈpen.ə.trə.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a place or substance is penetrable, you can move into it or through it: ",
                            "examples": [
                                "The riverside bushes were certainly very thick, but the undergrowth behind was evidently penetrable.",
                                "The barrier of poisonous gas appeared to be less penetrable than the rock that had been tunnelled through."
                            ]
                        },
                        {
                            "explanation": "If something such as a security system or device is penetrable, it is possible to get through or into it illegally in order to get information or do something illegal: ",
                            "examples": [
                                "The U. S. airport security systems established in the early 1970s are penetrable by minimal ingenuity.",
                                "Everybody has a smartphone nowadays, and we are concerned about the safety of these vulnerable and penetrable devices."
                            ]
                        },
                        {
                            "explanation": "If an area of business or a market is penetrable, you can become part of it and work in it. : ",
                            "examples": [
                                "The truth about this market has always been that it is penetrable, but only after tremendous effort."
                            ]
                        },
                        {
                            "explanation": "able to be understood when studied or investigated: ",
                            "examples": [
                                "Parts of the book will be penetrable only by scholars.",
                                "She will presumably be the ideal person to help make the young doctor's prose more penetrable."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}