{
    "word": "performance",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pəˈfɔː.məns"
                            ],
                            "us": [
                                "pɚˈfɔːr.məns"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "how well a person, machine, etc. does a piece of work or an activity: ",
                            "examples": [
                                "He was an experienced player who was always seeking to improve his performance.",
                                "High-performance cars (= those that are fast, powerful, and easy to control) are the most expensive.",
                                "This was a very impressive performance by the young player, who scored 14 points within the first ten minutes."
                            ]
                        },
                        {
                            "explanation": "the action of entertaining other people by dancing, singing, acting, or playing music: ",
                            "examples": [
                                "a performance of Arthur Miller's play \"The Crucible\"",
                                "She gave a superb performance as Lady Macbeth."
                            ]
                        },
                        {
                            "explanation": "an action or type of behaviour that involves a lot of attention to detail or to small matters that are not important: ",
                            "examples": [
                                "Cleaning the oven is such a performance.",
                                "What a performance! Please stop shouting!",
                                "The fish pie is a bit of a performance to make.",
                                "We managed to assemble the bookshelves eventually, but it was a real performance. ",
                                "We had such a performance getting the new sofa into the house."
                            ]
                        },
                        {
                            "explanation": "an occasion when an event or a situation happens again: ",
                            "examples": [
                                "The police hope to avoid a repeat performance of last year, when the festivities turned into rioting."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}