{
    "word": "period",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɪə.ri.əd"
                            ],
                            "us": [
                                "ˈpɪr.i.əd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a length of time: ",
                            "examples": [
                                "Her work means that she spends long periods away from home.",
                                "Unemployment in the first half of the year was 2.5 percent lower than in the same period the year before.",
                                "15 people were killed in/over a period of four days.",
                                "The study will be carried out over a six-month period."
                            ]
                        },
                        {
                            "explanation": "a fixed time during the life of a person or in history: ",
                            "examples": [
                                "Most teenagers go through a rebellious period.",
                                "The house was built during the Elizabethan period."
                            ]
                        },
                        {
                            "explanation": "in school, a division of time in the day when a subject is taught: ",
                            "examples": [
                                "We have six periods of science a week."
                            ]
                        },
                        {
                            "explanation": "one of the fixed times that a sports game is divided into, especially in ice hockey (= a team game played on ice, with curved sticks and a small disc): ",
                            "examples": [
                                "The match was won and lost in the first period, when Durham fell six goals behind.",
                                "In the second period he scored by banking the puck off the right post and into the net."
                            ]
                        },
                        {
                            "explanation": "the process of blood coming from the uterus (= the organ in which a baby develops before birth), which usually happens once a month when someone is not pregnant: ",
                            "examples": [
                                "period pains",
                                "She'd missed a period and was worried."
                            ]
                        },
                        {
                            "explanation": "the symbol . used in writing at the end of a sentence or at the end of the short form of a word",
                            "examples": []
                        },
                        {
                            "explanation": "said at the end of a statement to show that you believe you have said all there is to say on a subject and you are not going to discuss it any more: ",
                            "examples": [
                                "There will be no more shouting, period!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpɪə.ri.əd"
                            ],
                            "us": [
                                "ˈpɪr.i.əd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the clothes or furniture of a particular time in history: ",
                            "examples": [
                                "They performed \"Julius Caesar\" in period dress."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}