{
    "word": "personal",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpɜː.sən.əl"
                            ],
                            "us": [
                                "ˈpɝː.sən.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating or belonging to a single or particular person rather than to a group or an organization: ",
                            "examples": [
                                "My personal opinion/view is that the students should be doing more work outside the classroom.",
                                "Her uncle takes a personal interest in her progress.",
                                "She has her own personal secretary/bodyguard/fitness instructor.",
                                "Passengers are reminded to take all their personal belongings with them when they leave the plane."
                            ]
                        },
                        {
                            "explanation": "A personal action is one that is done by someone directly rather than getting another person to do it: ",
                            "examples": [
                                "The mayor made a personal appearance at the hospital.",
                                "I will give the matter my personal attention."
                            ]
                        },
                        {
                            "explanation": "private or relating to someone's private life: ",
                            "examples": [
                                "The letter was marked \"Personal. Strictly confidential.\"",
                                "Do you mind if I ask you a personal question?",
                                "His resignation was apparently for personal rather than professional reasons.",
                                "For such a famous, wealthy man, his personal life was surprisingly simple and ordinary."
                            ]
                        },
                        {
                            "explanation": "relating to your body or appearance: ",
                            "examples": [
                                "She is obsessed with personal hygiene."
                            ]
                        },
                        {
                            "explanation": "an intentionally offensive remark about someone's character or appearance: ",
                            "examples": [
                                "Did you have to make such a personal remark about her new haircut?"
                            ]
                        },
                        {
                            "explanation": "to start being rude to someone about their character or appearance: ",
                            "examples": [
                                "As long as the criticism is honestly given and doesn't get personal, I can handle it."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɜː.sən.əl"
                            ],
                            "us": [
                                "ˈpɝː.sən.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part of a newspaper or magazine that contains short advertisements and private messages: ",
                            "examples": [
                                "Many of his friends met people through the personals."
                            ]
                        },
                        {
                            "explanation": "another name for a \npersonal foul ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}