{
    "word": "perspective",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pəˈspek.tɪv"
                            ],
                            "us": [
                                "pɚˈspek.tɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a particular way of considering something: ",
                            "examples": [
                                "Her attitude lends a fresh perspective to the subject.",
                                "He writes from a Marxist perspective.",
                                "Because of its geographical position, Germany's perspective on the situation in Russia is very different from Washington's."
                            ]
                        },
                        {
                            "explanation": "to think about a situation or problem in a wise and reasonable way: ",
                            "examples": [
                                "You must keep things in perspective - the overall situation isn't really that bad."
                            ]
                        },
                        {
                            "explanation": "to compare something to other things so that it can be accurately and fairly judged: ",
                            "examples": [
                                "Total investments for this year reached $53 million, and, to put this into perspective, investments this year were double those made in 2013."
                            ]
                        },
                        {
                            "explanation": "the way that objects appear smaller when they are further away and the way parallel lines appear to meet each other at a point in the distance: ",
                            "examples": [
                                "In 15th-century Italy, artists rediscovered the rules of perspective."
                            ]
                        },
                        {
                            "explanation": "An object or person that is in perspective has the correct size and position in comparison with other things in the picture: ",
                            "examples": [
                                "Make sure that the figures are in perspective."
                            ]
                        },
                        {
                            "explanation": "An object or person that is out of perspective does not have the correct size or position in comparison with other things in the picture, and therefore does not look real or natural: ",
                            "examples": [
                                "The painting had a naive, out-of-perspective style."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}