{
    "word": "personalization",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌpɜː.sən.əl.aɪˈzeɪ.ʃən"
                            ],
                            "us": [
                                "ˌpɝː.sən.əl.əˈzeɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of changing an object or adding to it so that it is obvious that it belongs to or comes from you: ",
                            "examples": [
                                "There is a trend towards the personalisationof cars.",
                                "Personalization for items purchased is free, and the company offers volume discounts for most wedding favours."
                            ]
                        },
                        {
                            "explanation": "the act of making something suitable for the needs of a particular person: ",
                            "examples": [
                                "There is a focus on the personalization of service, which is aimed towards building trust between companies and its customers.",
                                "Many consumers like the personalization of programming and advertising that interactive TV allows."
                            ]
                        },
                        {
                            "explanation": "on the internet, the act of providing search results that are based on the needs or interests of the user: ",
                            "examples": [
                                "Personalization learns what you like from your actions; you are what you click on and what you buy.",
                                "Personalization cookies may be used to remember the information about the user who has visited a website in order to show relevant content in the future."
                            ]
                        },
                        {
                            "explanation": "the act of talking about someone's personal qualities instead of discussing the facts in an argument or discussion: ",
                            "examples": [
                                "The deep personalization of politics under Bill Clinton reflected a deliberate Republican strategy."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}