{
    "word": "pick",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pɪk"
                            ],
                            "us": [
                                "pɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to take some things and leave others: ",
                            "examples": [
                                "Pick a card from the pack.",
                                "One of my sisters has been picked for the Olympic team.",
                                "She was picked to play for the team.",
                                "The police asked him if he could pick (out) the killer from a series of photos.",
                                "The fairest way to decide the winner is to pick a name out of a hat (= without looking or choosing).",
                                "The winning lottery numbers will be picked at random (= without choosing).",
                                "They picked their way (= carefully chose a route) down the broken steps.",
                                "He's brilliant at picking winners (= choosing what will be successful)."
                            ]
                        },
                        {
                            "explanation": "to take some things but not others: ",
                            "examples": [
                                "The richest universities can pick and choose which students they take."
                            ]
                        },
                        {
                            "explanation": "to remove separate things or small pieces from something, especially with the fingers: ",
                            "examples": [
                                "I picked a piece of fluff off my shiny black suit.",
                                "The child continued picking (at) a sore on his leg (= trying to remove parts of it with his fingers).",
                                "He kept picking his nose (= removing mucus from it with his finger)."
                            ]
                        },
                        {
                            "explanation": "When you pick flowers or fruit, you take them off a plant or tree: ",
                            "examples": [
                                "They were picking strawberries for twelve hours a day.",
                                "I picked some roses this morning.",
                                "Machines pick the fruit (from/off the trees)."
                            ]
                        },
                        {
                            "explanation": "to remove meat from the bones of a bird or animal : ",
                            "examples": [
                                "In the kitchen Maya was laboriously picking chickens.",
                                "I store the meat, and throw the picked carcass, skin, etc. into the pot with water and some vegetables.",
                                "The carcass had been picked clean (= all the flesh had been removed) by other animals and birds."
                            ]
                        },
                        {
                            "explanation": "When you pick a string on a guitar or similar instrument, you pull it quickly and release it suddenly with your fingers to produce a note.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɪk"
                            ],
                            "us": [
                                "pɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "choice: ",
                            "examples": [
                                "You can have first pick of the desserts."
                            ]
                        },
                        {
                            "explanation": "a thing or person chosen, especially a player chosen to play for a sports team: ",
                            "examples": [
                                "He was expected to be one of the top 10 picks in the upcoming draft."
                            ]
                        },
                        {
                            "explanation": "to have a large choice available: ",
                            "examples": [
                                "The plane was fairly empty so we had our pick of seats."
                            ]
                        },
                        {
                            "explanation": "to choose the one(s) you want from the different types available: ",
                            "examples": [
                                "The shirts come in five different colours - just take your pick."
                            ]
                        },
                        {
                            "explanation": "a \npickaxe : ",
                            "examples": [
                                "picks and shovels"
                            ]
                        },
                        {
                            "explanation": "especially in combinations, a sharp pointed tool: ",
                            "examples": [
                                "a toothpick"
                            ]
                        },
                        {
                            "explanation": "a small, thin piece of plastic, metal, etc. that is held between the fingers and thumb and used for playing instruments such as the guitar",
                            "examples": []
                        },
                        {
                            "explanation": "in American football, an interception (= an occasion when a player catches the ball as it is being passed between two players of the opposing team): ",
                            "examples": [
                                "The quarterback threw a pick in the fourth quarter. ",
                                "The strong safety made a pick and returned it for a touchdown. "
                            ]
                        },
                        {
                            "explanation": "in basketball, a move in which a player positions themselves between a player from their team who has the ball and a defending player from the opposing team: ",
                            "examples": [
                                "You've got to be moving without the ball, making back cuts, and setting picks.",
                                "The best players are masters at utilizing picks to create space for open shots. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}