{
    "word": "pile",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "paɪl"
                            ],
                            "us": [
                                "paɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "objects positioned one on top of another: ",
                            "examples": [
                                "a pile of books",
                                "a pile of dirty clothes"
                            ]
                        },
                        {
                            "explanation": "a mass of something that has been placed somewhere: ",
                            "examples": [
                                "a large pile of sand"
                            ]
                        },
                        {
                            "explanation": "a lot of something: ",
                            "examples": [
                                "I've got piles/a pile of things to do today.",
                                "Obviously, nobody intends to make a pile of terrible movies.",
                                "They hope that these new drugs will make them a pile of cash.",
                                "There are piles of people looking for jobs in this area.",
                                "We had to pay piles of money to get the work done."
                            ]
                        },
                        {
                            "explanation": "a strong column or post of wood, metal, or concrete that is pushed into the ground to help support a building",
                            "examples": []
                        },
                        {
                            "explanation": "the soft surface made by the ends of many short threads on a carpet or on cloth such as velvet: ",
                            "examples": [
                                "a luxurious deep-pile carpet"
                            ]
                        },
                        {
                            "explanation": "a large building: ",
                            "examples": [
                                "They've got a great big Victorian pile somewhere out in the country."
                            ]
                        },
                        {
                            "explanation": "→ \nhaemorrhoids UK specialized : ",
                            "examples": [
                                "Ask your pharmacist about the best treatment for piles.",
                                "They told us we'd get piles if we sat on the cold wall.",
                                "What's the best way to stop piles from itching?",
                                "The doctor told her she had piles.",
                                "Sometimes people need surgery to remove painful or very itchy piles."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "paɪl"
                            ],
                            "us": [
                                "paɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrange objects into a pile: ",
                            "examples": [
                                "We piled plenty of logs up next to the fire.",
                                "Please pile your homework books neatly on the table as you leave.",
                                "Her plate was piled (high) with salad.",
                                "Snow had piled up against the walls."
                            ]
                        },
                        {
                            "explanation": "(of a group of people) to move together, especially in an uncontrolled way: ",
                            "examples": [
                                "As soon as the train stopped, they all piled in/out.",
                                "A group of them had piled onto a truck, crowding on in such numbers that some were forced to sit on the roof."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}