{
    "word": "pitch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɪtʃ"
                            ],
                            "us": [
                                "pɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area painted with lines for playing particular sports, especially football: ",
                            "examples": [
                                "a football/hockey/cricket pitch",
                                "Supporters invaded (= ran onto) the pitch."
                            ]
                        },
                        {
                            "explanation": "the level or degree of something: ",
                            "examples": [
                                "If you teach children and adults in the same class, it's difficult to get the pitch (= level of difficulty or interest) right.",
                                "That June, the pitch of the local anti-pipeline campaign was turned up."
                            ]
                        },
                        {
                            "explanation": "the level of a feeling: ",
                            "examples": [
                                "By this time their disagreement had reached such a pitch that there was no hope of an amicable conclusion.",
                                "The children were at fever pitch (= very excited) the day before the party."
                            ]
                        },
                        {
                            "explanation": "the degree to which a sound or a musical note is high or low: ",
                            "examples": [
                                "The piano and organ were tuned to the same pitch.",
                                "Parts of the right brain that are sensitive to pitch in music play the same role in speech."
                            ]
                        },
                        {
                            "explanation": "a speech or act that attempts to persuade someone to buy or do something: ",
                            "examples": [
                                "The man in the shop gave me his (sales) pitch about quality and reliability.",
                                "She made a pitch for the job but she didn't get it.",
                                "The city made a pitch to stage the Olympics."
                            ]
                        },
                        {
                            "explanation": "a place in a public area where a person regularly sells goods or performs: ",
                            "examples": [
                                "The flower seller was at his usual pitch outside the station."
                            ]
                        },
                        {
                            "explanation": "the amount of slope, especially of a roof: ",
                            "examples": [
                                "This roof has a very steep/high/gentle/low pitch."
                            ]
                        },
                        {
                            "explanation": "a thick, black substance that was used in the past to make wooden ships and buildings waterproof",
                            "examples": []
                        },
                        {
                            "explanation": "a throw in a baseball game: ",
                            "examples": [
                                "a good/bad pitch"
                            ]
                        },
                        {
                            "explanation": "the piece of ground on which you can put up a tent, park a caravan, etc.: ",
                            "examples": [
                                "We chose a large level grassy pitch for our caravan."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pɪtʃ"
                            ],
                            "us": [
                                "pɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move or be moved suddenly, especially by throwing or being thrown: ",
                            "examples": [
                                "She pitched the stone into the river.",
                                "The ball pitched (= landed) short.",
                                "The bike hit a rut and I was pitched (forward) onto the road.",
                                "The ship pitched up and down in the rough seas.",
                                "We were pitched from side to side on the amusement park ride."
                            ]
                        },
                        {
                            "explanation": "in baseball, to throw a ball towards the player with the bat in order for them to try to hit it: ",
                            "examples": [
                                "Who will be pitching first for the White Sox this evening?"
                            ]
                        },
                        {
                            "explanation": "to put up a tent and make it ready to use: ",
                            "examples": [
                                "We pitched camp/our tent in the shade."
                            ]
                        },
                        {
                            "explanation": "to express or set something at a particular level: ",
                            "examples": [
                                "A teacher's got to pitch a lesson at the right level for the students."
                            ]
                        },
                        {
                            "explanation": "to set the degree to which a sound or musical note is high or low: ",
                            "examples": [
                                "The tune was pitched (= the notes in it were) too high for me to reach the top notes."
                            ]
                        },
                        {
                            "explanation": "to try to persuade someone to do something: ",
                            "examples": [
                                "She pitched her idea to me over a business lunch.",
                                "They are pitching for business at the moment."
                            ]
                        },
                        {
                            "explanation": "to slope",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}