{
    "word": "place",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pleɪs"
                            ],
                            "us": [
                                "pleɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area, town, building, etc.: ",
                            "examples": [
                                "Her garden was a cool pleasant place to sit.",
                                "What was the name of that place we drove through on the way to New York?",
                                "They decided to go to a pizza place.",
                                "There are several places of interest to visit in the area.",
                                "It's important to feel comfortable in your place of work."
                            ]
                        },
                        {
                            "explanation": "a home: ",
                            "examples": [
                                "I'm looking for a place to live.",
                                "We'll have the meeting at my place."
                            ]
                        },
                        {
                            "explanation": "a suitable area, building, situation, or occasion: ",
                            "examples": [
                                "University is a great place for making new friends.",
                                "This meeting isn't the place to discuss your problems, I'm afraid."
                            ]
                        },
                        {
                            "explanation": "a position in relation to other things or people: ",
                            "examples": [
                                "His leg was broken in two places.",
                                "When you've finished, put the book back in its place on the shelf.",
                                "This plant needs a warm, sunny place.",
                                "Will you keep my place (in the queue) (= allow me to come back to the same position)?",
                                "She spoke to me and I lost my place in the book (= I forgot where I had been reading)."
                            ]
                        },
                        {
                            "explanation": "the seat you will sit in on a particular occasion, or the seat where you usually sit, in the theatre, a class, a train, etc.: ",
                            "examples": [
                                "My ticket says 6G but there's someone sitting in my place.",
                                "The children collected their prizes and then went back to their places.",
                                "Save me a place (= keep a seat for me until I arrive) near the front."
                            ]
                        },
                        {
                            "explanation": "the space at a table where one person will sit and eat, usually with a plate and knives, forks, and spoons arranged on it: ",
                            "examples": [
                                "The waiter showed us to our places and gave us each a menu.",
                                "He laid six places at the table."
                            ]
                        },
                        {
                            "explanation": "a position in an organization, system, or competition: ",
                            "examples": [
                                "She's got a place at university",
                                "She's got a place on a fine-arts course.",
                                "She's got a place in a fine-arts course.",
                                "Our team finished in second place.",
                                "He took third place (= was the third to finish) in the marathon last year."
                            ]
                        },
                        {
                            "explanation": "used after words such as \"any\" and \"some\" as a different way of saying \"anywhere\", \"somewhere\", etc.: ",
                            "examples": [
                                "I know I left that book some place - now, where was it?",
                                "That bar was like no place I'd ever been before."
                            ]
                        },
                        {
                            "explanation": "to happen: ",
                            "examples": [
                                "The concert takes place next Thursday."
                            ]
                        },
                        {
                            "explanation": "in the wrong place or looking wrong: ",
                            "examples": [
                                "The boy looked uncomfortable and out of place among the adults."
                            ]
                        },
                        {
                            "explanation": "If something is in place, it is in its usual or correct position: ",
                            "examples": [
                                "The chairs are all in place."
                            ]
                        },
                        {
                            "explanation": "organized: ",
                            "examples": [
                                "The arrangements are all in place for the concert next Thursday."
                            ]
                        },
                        {
                            "explanation": "(of running or jumping) in one place without moving forward or backward at all: ",
                            "examples": [
                                "She looked like she was running in place as six women flew past her."
                            ]
                        },
                        {
                            "explanation": "without making any progress : ",
                            "examples": [
                                "While Maryland has been standing in place or going backward, a number of states have courted filmmakers aggressively."
                            ]
                        },
                        {
                            "explanation": "instead of someone or something: ",
                            "examples": [
                                "You can use margarine in place of butter in some recipes."
                            ]
                        },
                        {
                            "explanation": "to be used instead of someone or something: ",
                            "examples": [
                                "These portable machines can take the place of your desktop PC. "
                            ]
                        },
                        {
                            "explanation": "what a person should do or is allowed to do, especially according to the rules of society: ",
                            "examples": [
                                "It's not your place to tell me what to do.",
                                "I'm not going to criticize his decision - I know my place (= I know that I am of lower rank or have less authority)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pleɪs"
                            ],
                            "us": [
                                "pleɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something in a particular position: ",
                            "examples": [
                                "She placed the letter in front of me.",
                                "She placed her name on the list of volunteers.",
                                "I'd place him among the ten most brilliant scientists of his age.",
                                "The horse was placed first/second/third in its first race (= finished the race in first/second/third position)."
                            ]
                        },
                        {
                            "explanation": "to arrange to have an advertisement, bet, order, etc.: ",
                            "examples": [
                                "We placed the order for the furniture six weeks ago."
                            ]
                        },
                        {
                            "explanation": "to give something emphasis, importance, etc.: ",
                            "examples": [
                                "She placed the emphasis on the word \"soon\" in order to make sure she was understood."
                            ]
                        },
                        {
                            "explanation": "to find someone a job: ",
                            "examples": [
                                "The students are placed in/with companies for a period of work experience."
                            ]
                        },
                        {
                            "explanation": "to recognize someone or remember where you have seen someone and how you know them: ",
                            "examples": [
                                "She looks familiar but I can't place her - did she use to work here?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}