{
    "word": "placement",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpleɪs.mənt"
                            ],
                            "us": [
                                "ˈpleɪs.mənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a temporary position or job in an organization: ",
                            "examples": [
                                "I think we can find a placement for you in the sales department.",
                                "The trainee teachers do a school placement in the summer term.",
                                "Students then undertake a period of industrial placement."
                            ]
                        },
                        {
                            "explanation": "the act of officially putting someone in a particular home, institution (= a place such as a prison or hospital), school class, etc.: ",
                            "examples": [
                                "The state-run home is for children awaiting placement with a foster family or adoptive parents.",
                                "Her research shows a big increase in the out-of-home placements for kids being taken from their family and being put in foster care.",
                                "This is a temporary prison for inmates awaiting placement in the federal penal system.",
                                "The frail and elderly may need placement in a long-term care facility.",
                                "Placement in a self-contained classroom will mean that your child will be taken out of the mainstream classroom for all academic subjects.",
                                "There are many dogs awaiting placement in suitable homes."
                            ]
                        },
                        {
                            "explanation": "the position of something, or the act of putting something in a particular position: ",
                            "examples": [
                                "We put a lot of thought into the placement of the furniture.",
                                "The architecture and the placement of shops is not random: everything is minutely planned.",
                                "The director gives instructions for the placement of the camera.",
                                "Stent placement was successful for all patients.",
                                "They were supervising the careful placement of the crate in the back of the truck."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}