{
    "word": "plant",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "plɑːnt"
                            ],
                            "us": [
                                "plænt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a living thing that grows in earth, in water, or on other plants, usually has a stem, leaves, roots, and flowers, and produces seeds: ",
                            "examples": [
                                "native plants and animals",
                                "garden/greenhouse/indoor plants",
                                "a tomato plant"
                            ]
                        },
                        {
                            "explanation": "machines used in industry: ",
                            "examples": [
                                "The industry was accused of having invested little in workers, plant, or infrastructure."
                            ]
                        },
                        {
                            "explanation": "a factory in which a particular product is made or power is produced: ",
                            "examples": [
                                "Two more car-assembly plants were closed by the strike."
                            ]
                        },
                        {
                            "explanation": "a large, heavy machine or vehicle used in industry, for building roads, etc.: ",
                            "examples": [
                                "The sign by the roadworks said \"Slow - heavy plant crossing\".",
                                "The firm's main business was plant hire."
                            ]
                        },
                        {
                            "explanation": "something illegal or stolen that has been put secretly in a person's clothing or among the things that belong to them to make them seem guilty of a crime: ",
                            "examples": [
                                "He insisted the money was a plant."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "plɑːnt"
                            ],
                            "us": [
                                "plænt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a plant into the ground or into a container of soil so that it will grow: ",
                            "examples": [
                                "We planted trees and bushes in our new garden.",
                                "Hyacinth bulbs planted in pots now will flower early in the spring."
                            ]
                        },
                        {
                            "explanation": "If you plant a particular area, you put plants into the ground there: ",
                            "examples": [
                                "The plot was surrounded by a stone wall and planted with flowering trees.",
                                "a densely planted garden (= one in which the plants are close together)"
                            ]
                        },
                        {
                            "explanation": "to put something firmly and strongly in a particular place: ",
                            "examples": [
                                "My brother planted himself on the sofa in front of the television.",
                                "He planted a kiss on her forehead/a blow on his opponent's jaw."
                            ]
                        },
                        {
                            "explanation": "to cause an idea or story to exist: ",
                            "examples": [
                                "That incident planted doubts about him in my mind.",
                                "Who planted these rumours?"
                            ]
                        },
                        {
                            "explanation": "to put something or someone in a position secretly, especially in order to deceive someone: ",
                            "examples": [
                                "She insisted that the drugs had been planted on her without her knowledge."
                            ]
                        },
                        {
                            "explanation": "to put a bomb somewhere so that it will explode there: ",
                            "examples": [
                                "The bomb was planted in the station waiting room."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}