{
    "word": "platform",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈplæt.fɔːm"
                            ],
                            "us": [
                                "ˈplæt.fɔːrm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a flat raised area or structure",
                            "examples": []
                        },
                        {
                            "explanation": "a long, flat raised structure at a railway station, where people get on and off trains: ",
                            "examples": [
                                "The next train for Aberdeen will depart from platform 9."
                            ]
                        },
                        {
                            "explanation": "the raised part of the floor in a large room, from which you make a speech or give a musical performance: ",
                            "examples": [
                                "Speaker after speaker mounted/took the platform to denounce the policy.",
                                "This brilliant young violinist has appeared on concert platforms all round the world."
                            ]
                        },
                        {
                            "explanation": "the people who are up on a platform in order to speak to an audience: ",
                            "examples": [
                                "An elderly lady stood up and said she had a question for the platform.",
                                "The platform party (= the group on the platform) applauded loudly."
                            ]
                        },
                        {
                            "explanation": "a style of shoe with a very thick high sole (= bottom part): ",
                            "examples": [
                                "Flared trousers and platforms were in then.",
                                "Strappy heels or even clunky retro platforms can look good."
                            ]
                        },
                        {
                            "explanation": "an opportunity to make your ideas or beliefs known publicly: ",
                            "examples": [
                                "By refusing to give us a grant to make this programme, they are denying us a platform."
                            ]
                        },
                        {
                            "explanation": "all the things that a political party promises to do if they are elected: ",
                            "examples": [
                                "We campaigned on a platform of low taxation."
                            ]
                        },
                        {
                            "explanation": "the type of computer system or smartphone you are using, in relation to the type of software (= computer programs) you can use on it: ",
                            "examples": [
                                "This new personal banking software can be used with any Windows platform.",
                                "Both Apple's iOS and Google's Android mobile platforms now have emoji keyboards built into their software."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of shoes) having a very thick high sole (= bottom part): ",
                            "examples": [
                                "She borrowed her mother's platform shoes.",
                                "When I started high school, those huge platform sandals were all the rage. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}