{
    "word": "plate",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pleɪt"
                            ],
                            "us": [
                                "pleɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a flat, usually round dish with a slightly raised edge that you eat from or serve food from: ",
                            "examples": [
                                "paper/plastic/china plates",
                                "a dinner/salad plate",
                                "clean/dirty plates",
                                "There's still lots of food on your plate."
                            ]
                        },
                        {
                            "explanation": "an amount of food on a plate: ",
                            "examples": [
                                "Stephen ate three plates of spaghetti."
                            ]
                        },
                        {
                            "explanation": "a flat piece of something that is hard and does not bend: ",
                            "examples": [
                                "Thick bony plates protected the dinosaur against attack.",
                                "The ship's deck is composed of steel plates."
                            ]
                        },
                        {
                            "explanation": "a flat piece of metal with words and/or pictures on it that can be printed",
                            "examples": []
                        },
                        {
                            "explanation": "a flat heavy object that is lifted in order to make the muscles stronger: ",
                            "examples": [
                                "Lift the plate above your head eight times.",
                                "Try holding the weights for 30 seconds and add plates as you gain strength."
                            ]
                        },
                        {
                            "explanation": "a picture, especially in colour, in a book: ",
                            "examples": [
                                "The three birds differ in small features (see Plate 4)."
                            ]
                        },
                        {
                            "explanation": "informal for\nhome plate ",
                            "examples": []
                        },
                        {
                            "explanation": "ordinary metal with a layer of another metal on top: ",
                            "examples": [
                                "The knives and forks are silver plate."
                            ]
                        },
                        {
                            "explanation": "objects, especially plates, dishes, and cups, completely made of a valuable metal such as gold or silver: ",
                            "examples": [
                                "The thieves got away with a large quantity of church plate."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pleɪt"
                            ],
                            "us": [
                                "pleɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cover a metal object with a thin layer of another metal, especially gold or silver: ",
                            "examples": [
                                "We normally plate the car handles with nickel and then chrome."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}