{
    "word": "platoon",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pləˈtuːn"
                            ],
                            "us": [
                                "pləˈtuːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small group of about ten or twelve soldiers, with a lieutenant in charge of it: ",
                            "examples": [
                                "His platoon was ambushed.",
                                "a platoon commander"
                            ]
                        },
                        {
                            "explanation": "a group of vehicles, especially military vehicles: ",
                            "examples": [
                                "The captain was in the lead vehicle of the platoon.",
                                "First there is a platoon of motorcycle outriders who will clear the streets ahead. "
                            ]
                        },
                        {
                            "explanation": "a group of vehicles that are connected physically or using computer technology so they can travel close together in a group, as a way to save space, fuel, or money: ",
                            "examples": [
                                "But there is still the problem of managing the formation and dispersal of platoons as cars join and leave.",
                                "The non-mechanically linked vehicles move in platoon formation. "
                            ]
                        },
                        {
                            "explanation": "two sports players, especially baseball players, who play at the same position at different times: ",
                            "examples": [
                                "The most common platoon uses a left-handed batter against right-handed pitching and a right-handed batter against left-handed pitching."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pləˈtuːn"
                            ],
                            "us": [
                                "pləˈtuːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a sports team, especially in baseball, to use two players at different times at the same position, or to play at the same position as another player: ",
                            "examples": [
                                "Bowden says he'll be platooning the two players as much as possible.",
                                "The coach plans to platoon him with Ahman Green. ",
                                "Kotchman is now playing full time, instead of platooning."
                            ]
                        },
                        {
                            "explanation": "to connect vehicles either physically or using computer technology so they can travel close together in a group, as a way to save space, fuel, or money: ",
                            "examples": [
                                "As drivers become comfortable with the technology and see that it is safe, they might be willing to consider platooning in their own cars. ",
                                "Platooning trucks has been proposed as a way of reducing energy consumption."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}