{
    "word": "playability",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌpleɪ.əˈbɪl.ə.ti"
                            ],
                            "us": [
                                "ˌpleɪ.əˈbɪl.ə.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a video game, the quality of being easy and enjoyable to play, or the degree to which a video game is like this: ",
                            "examples": [
                                "Although the 3D design looks pretty, it doesn't add much to the playability of the game.",
                                "What i-ninja lacks in gaming innovations it makes up for in sheer playability. "
                            ]
                        },
                        {
                            "explanation": "(of a piece of music or an instrument) the quality of not being too difficult for someone to play, or the degree to which a piece of music or an instrument is like this : ",
                            "examples": [
                                "It took the music to the threshold of playability.",
                                "The fretboard is a vital part of a guitar's tone and playability. "
                            ]
                        },
                        {
                            "explanation": "(of a surface on which sports are played) the quality of being easy to play on, or the degree to which a surface is like this : ",
                            "examples": [
                                "Playability and ball bounce are two of the advantages of the Omnicourt Pro tennis court.",
                                "The ideal playing surface is judged by its playability and safety, as well as appearance."
                            ]
                        },
                        {
                            "explanation": "(of a film) a good reaction by audiences to a film when they see it: ",
                            "examples": [
                                "Both films had trouble getting American distribution because of a conflict between what movie insiders call playability and marketability.",
                                "The Untouchables has to be one of the all-time classic film tie-ins, with every aspect oozing playability. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}