{
    "word": "playable",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpleɪ.ə.bəl"
                            ],
                            "us": [
                                "ˈpleɪ.ə.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a video game is playable, it is easy and enjoyable to play: ",
                            "examples": [
                                "I've been looking for a decent, playable space empire game for ages.",
                                "These games are mostly playable but are said to still have some speed and compatibility issues."
                            ]
                        },
                        {
                            "explanation": "If a piece of music or an instrument is playable, it is not too difficult for someone to play: ",
                            "examples": [
                                "The New York is a very playable guitar.",
                                "\"Her piano music is very playable,\" he said."
                            ]
                        },
                        {
                            "explanation": "If a surface on which sports are played is playable, it is easy or possible to play on: ",
                            "examples": [
                                "The tennis courts were a little worn but very playable.",
                                "He said the pitch was perfectly playable, but the stadium management wanted to avoid further deterioration."
                            ]
                        },
                        {
                            "explanation": "If a ball is playable, it can be caught, passed, hit, etc. within the rules of the game, or because it has not gone outside the field of play: ",
                            "examples": [
                                "The ball is playable if it is touching any part of a line. ",
                                "In cricket, bowlers deliver six playable balls to batsmen in succession to account for one \"over\".",
                                "As long as the ball doesn't hit the floor, it's playable."
                            ]
                        },
                        {
                            "explanation": "If a film is playable, audiences have a good reaction to it when they see it: ",
                            "examples": [
                                "The American version of the popular film sadly failed to be playable due to poor casting."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}