{
    "word": "pocket",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɒk.ɪt"
                            ],
                            "us": [
                                "ˈpɑː.kɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small bag for carrying things in, made of cloth and sewn into the inside or onto the outside of a piece of clothing: ",
                            "examples": [
                                "a jacket/trouser/coat pocket",
                                "a hip/breast pocket",
                                "She thrust her hands deep in/into her pockets.",
                                "He took some coins from/out of his pocket."
                            ]
                        },
                        {
                            "explanation": "a container, usually made of cloth, that is sewn into or onto a bag or attached to a seat or door in a vehicle: ",
                            "examples": [
                                "Sarah put her maps in the outside pocket of her rucksack.",
                                "The safety instructions are in the pocket of the seat in front of you."
                            ]
                        },
                        {
                            "explanation": "one of several holes around the edge of a billiard or snooker table, into which balls are hit",
                            "examples": []
                        },
                        {
                            "explanation": "the amount of money that someone has for spending: ",
                            "examples": [
                                "You need deep pockets (= a lot of money) if you're involved in a long law suit.",
                                "I paid for my ticket out of my own pocket (= with my own money), but I can claim the cost of it back from my employer."
                            ]
                        },
                        {
                            "explanation": "a group, area, or mass of something that is separate and different from what surrounds it: ",
                            "examples": [
                                "Among the staff there are some pockets of resistance to the planned changes (= some small groups of them are opposed).",
                                "The pilot said that we were going to encounter a pocket of turbulence (= an area of violently moving air)."
                            ]
                        },
                        {
                            "explanation": "a space between the teeth and the gums (= the firm pink flesh inside the mouth, covering the bones into which the teeth are fixed) that can contain bacteria that cause disease : ",
                            "examples": [
                                "Studies show that people with deep periodontal pockets between their teeth and gums should have them cleaned by a dental hygienist every 3-4 months.",
                                "In periodontitis, gums pull away from the teeth and form spaces (called “pockets”) that become infected."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈpɒk.ɪt"
                            ],
                            "us": [
                                "ˈpɑː.kɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something into your pocket: ",
                            "examples": [
                                "He carefully pocketed his change."
                            ]
                        },
                        {
                            "explanation": "to hit a billiard or snooker ball into a pocket: ",
                            "examples": [
                                "Davis pocketed the black to win the game."
                            ]
                        },
                        {
                            "explanation": "to take something for yourself, especially dishonestly: ",
                            "examples": [
                                "I'll tell them I sold it for £20, not £25, then I can pocket the rest."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpɒk.ɪt"
                            ],
                            "us": [
                                "ˈpɑː.kɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe something that is small enough to put in your pocket, or that you regularly carry in your pocket: ",
                            "examples": [
                                "a pocket dictionary",
                                "a pocket diary",
                                "a pocket calculator"
                            ]
                        },
                        {
                            "explanation": "smaller than usual: ",
                            "examples": [
                                "a pocket battleship"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}