{
    "word": "pod",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɒd"
                            ],
                            "us": [
                                "pɑːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, narrow, flat part of some plants, such as beans and peas, that contains the seeds and usually has a thick skin: ",
                            "examples": [
                                "seed pods",
                                "a pea/vanilla pod"
                            ]
                        },
                        {
                            "explanation": "a long, narrow container that is attached to an aircraft for carrying engines, weapons, extra fuel, etc.: ",
                            "examples": [
                                "an escape/storage/fuel pod",
                                "a space pod"
                            ]
                        },
                        {
                            "explanation": "a small simple building, or a small simple structure in a building, often rounded in shape: ",
                            "examples": [
                                "You can camp, or stay in a single-storey \"eco pod\" with a wood-burning stove.",
                                "The club has been fitted with wooden sleeping pods for the homeless."
                            ]
                        },
                        {
                            "explanation": "a group of people who have a lot of contact with each other but limited contact with people outside the group, for example as a way to avoid spreading disease: ",
                            "examples": [
                                "Public health officials recommend that pods be no larger than 12 people who live across three households.",
                                "Pods are being created during the pandemic to provide childcare for children who are not attending school in person."
                            ]
                        },
                        {
                            "explanation": "a group of sea mammals such as whales or dolphins",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌpiː.əʊˈdiː"
                            ],
                            "us": [
                                "ˌpiː.oʊˈdiː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "abbreviation for print on demand: a way of producing books or other documents in which copies are printed only after they have been ordered ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}