{
    "word": "point",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɔɪnt"
                            ],
                            "us": [
                                "pɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an idea, opinion, or piece of information that is said or written: ",
                            "examples": [
                                "I'd like to discuss the first point in your essay.",
                                "You made some interesting points in your speech."
                            ]
                        },
                        {
                            "explanation": "the meaning or most important part of what someone says or writes: ",
                            "examples": [
                                "The point is, if you don't claim the money now you might never get it.",
                                "I think you missed (= did not understand) the point of what she was saying.",
                                "I take your point/Point taken (= I understand that what you are saying is important).",
                                "Please get to the point (= say the thing that is most important to you).",
                                "He hasn't got much money, but that's not the point (= that is not the important thing)."
                            ]
                        },
                        {
                            "explanation": "an opinion or fact that deserves to be considered seriously, or that other people agree is true: ",
                            "examples": [
                                "Yes, I can see your point/you've got a point there.",
                                "OK, you've made your point (= told us your opinion) - there's no need to go on about it."
                            ]
                        },
                        {
                            "explanation": "not important or not related to the subject being discussed: ",
                            "examples": [
                                "The fact that he doesn't want to come is beside the point - he should have been invited."
                            ]
                        },
                        {
                            "explanation": "said to show that what someone has just said is true or important: ",
                            "examples": [
                                "\"We'll take the bus.\" \"But we don't have any money for the fare.\" \"That's a point.\""
                            ]
                        },
                        {
                            "explanation": "a particular time or stage reached in a process: ",
                            "examples": [
                                "At that point, a soldier opened fire on the car.",
                                "I was completely lost at one point.",
                                "It was so confusing that eventually it got to the point where no one knew what was going on.",
                                "I said I'd tell her the bad news, but when it came to the point (= when I had to do it), I couldn't."
                            ]
                        },
                        {
                            "explanation": "a particular place: ",
                            "examples": [
                                "the point where the road bends",
                                "This is a good point from which to watch the race."
                            ]
                        },
                        {
                            "explanation": "the temperature at which a substance boils, melts, freezes, etc.",
                            "examples": []
                        },
                        {
                            "explanation": "purpose or usefulness: ",
                            "examples": [
                                "There's no point arguing about it - we're going and that's that.",
                                "I'd like to write to him, but what's the point? He never writes back.",
                                "I see little point in discussing this further."
                            ]
                        },
                        {
                            "explanation": "a mark or unit for counting, especially how much a person or team has scored in a sport: ",
                            "examples": [
                                "The youngest skier won the most points.",
                                "He won the world heavyweight boxing championship on points (= as a result of the points that he had won).",
                                "Interest rates have risen by two percentage points (= two percent)."
                            ]
                        },
                        {
                            "explanation": "a unit used for measuring the size of printed letters, equal to about 0.3 mm or 1/72 of an inch: ",
                            "examples": [
                                "The large letters are in 7.5 point type, and the small letters are in 6 point."
                            ]
                        },
                        {
                            "explanation": "the sharp end of something, such as a knife: ",
                            "examples": [
                                "The knife landed with its point sticking into the floor.",
                                "Be careful with that needle - it has a very sharp point."
                            ]
                        },
                        {
                            "explanation": "a particular quality or characteristic of a person or thing: ",
                            "examples": [
                                "There are various points to look out for when you're judging dogs in a competition.",
                                "He's boring, but I suppose he has his good points.",
                                "I think her kindness is one of her strong points (= one of her good qualities)."
                            ]
                        },
                        {
                            "explanation": "a long, thin area of land that stretches out into the sea: ",
                            "examples": [
                                "Spurn Point"
                            ]
                        },
                        {
                            "explanation": "a small, round spot that is used in numbers to separate whole numbers from parts of numbers: ",
                            "examples": [
                                "One kilogram equals two point two (= 2.2) pounds.",
                                "The error occurred when someone left out the decimal point."
                            ]
                        },
                        {
                            "explanation": "the toes of a ballet dancer's shoes: ",
                            "examples": [
                                "She is learning how to dance on her points."
                            ]
                        },
                        {
                            "explanation": "a socket to which a wire from a piece of electrical equipment is connected in order to supply it with electricity or a radio, television, or other signal: ",
                            "examples": [
                                "a TV antenna point",
                                "There is a phone point in every room."
                            ]
                        },
                        {
                            "explanation": "in some car engines, either of two parts that allow or prevent the flow of electricity: ",
                            "examples": [
                                "He checked the points and plugs and topped up the oil."
                            ]
                        },
                        {
                            "explanation": "a place on a railway track where the rails (= metal bars on which the trains travel) can be moved to allow a train to change from one track to another: ",
                            "examples": [
                                "The train rattled as it went over the points."
                            ]
                        },
                        {
                            "explanation": "a small, round mark on a line, plan, or map to show the position of something: ",
                            "examples": [
                                "Join the points A and B together on the diagram with a straight line."
                            ]
                        },
                        {
                            "explanation": "a mark on a compass that shows direction, such as north, south, east, and west",
                            "examples": []
                        },
                        {
                            "explanation": "a very small, round light that you can see in the distance: ",
                            "examples": [
                                "I could just make out the tiny points of a car's headlights far away."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pɔɪnt"
                            ],
                            "us": [
                                "pɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to direct other people's attention to something by holding out your finger towards it: ",
                            "examples": [
                                "\"Look at that!\" she said, pointing at the hole in the door.",
                                "Small children are often told that it's rude to point."
                            ]
                        },
                        {
                            "explanation": "to hold something out in the direction of someone or something: ",
                            "examples": [
                                "He said that the man had pointed a knife at him."
                            ]
                        },
                        {
                            "explanation": "If something points in a particular direction, it is turned towards that direction: ",
                            "examples": [
                                "The road sign points left.",
                                "All the cars were pointing in the same direction.",
                                "There was an arrow pointing to the door."
                            ]
                        },
                        {
                            "explanation": "to fill the gaps between bricks, etc. with mortar (= a mixture of sand, water, and cement): ",
                            "examples": [
                                "The physical work of preservation includes pointing handmade bricks and repairing windows.",
                                "They failed to identify problems such as condensation, badly pointed walls and leaky gutters."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "pɔɪnt"
                            ],
                            "us": [
                                "pɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to when a ballet dancer dances on their toes: ",
                            "examples": [
                                "a pair of point shoes",
                                "Today we'll do some point work."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}