{
    "word": "pole",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pəʊl"
                            ],
                            "us": [
                                "poʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, thin stick of wood or metal, often used standing straight up in the ground to support things: ",
                            "examples": [
                                "a telegraph/electricity pole",
                                "A flag fluttered from a 40-foot pole."
                            ]
                        },
                        {
                            "explanation": "either of the two points at the most northern and most southern ends of the earth, around which the earth turns: ",
                            "examples": [
                                "the North/South Pole",
                                "Most weather satellites are stationed over the Equator or travel over the poles."
                            ]
                        },
                        {
                            "explanation": "one of the ends of a magnet (= an object that both attracts and pushes away iron and steel objects) where the magnetic force is strongest: ",
                            "examples": [
                                "Like poles repel and unlike poles attract. ",
                                "The lightning strike created a magnetic field, similar to that which exists between the north and south poles of a magnet. "
                            ]
                        },
                        {
                            "explanation": "one of the two points on a battery (= a device that produces electricity) where a connection can be made in an electrical circuit. One point is negative and the other positive: ",
                            "examples": [
                                "A wire ran from the clock to one of the poles of the battery."
                            ]
                        },
                        {
                            "explanation": "one of the two points at which a straight line through the centre of a circle cuts the surface of a sphere (= a ball-shaped object): ",
                            "examples": [
                                "Poles and polars come in pairs."
                            ]
                        },
                        {
                            "explanation": "a fixed point that other points or lines refer to: ",
                            "examples": [
                                "In polar coordinates the origin is often called the pole."
                            ]
                        },
                        {
                            "explanation": "either of two completely opposite or different opinions, positions, or qualities: ",
                            "examples": [
                                "These two men might be thought to represent the opposite poles of economic ideology."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pəʊl"
                            ],
                            "us": [
                                "poʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person from Poland",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}