{
    "word": "politics",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɒl.ə.tɪks"
                            ],
                            "us": [
                                "ˈpɑː.lə.tɪks"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the activities of the government, members of law-making organizations, or people who try to influence the way a country is governed: ",
                            "examples": [
                                "Joe is very active in left-wing politics."
                            ]
                        },
                        {
                            "explanation": "the job of holding a position of power in the government: ",
                            "examples": [
                                "The group is campaigning to get more women into politics.",
                                "He is planning to retire from politics next year."
                            ]
                        },
                        {
                            "explanation": "the study of the ways in which a country is governed: ",
                            "examples": [
                                "She studied politics at Leicester University."
                            ]
                        },
                        {
                            "explanation": "someone's opinions about how a country should be governed: ",
                            "examples": [
                                "Her politics have become more liberal over the past few years.",
                                "He moved to Los Angeles, a place more in tune with his politics than Texas.",
                                "He was accused of twisting the facts to suit his politics.",
                                "Whatever your politics, you should be happy about these reforms.",
                                "These people really live their politics, organizing, fundraising, and demonstrating constantly."
                            ]
                        },
                        {
                            "explanation": "the relationships within a group or organization that allow particular people to have power over others: ",
                            "examples": [
                                "I don't like to get involved in office politics.",
                                "They know how to get on with people and they understand the politics of a social group. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}