{
    "word": "poll",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pəʊl",
                                "pɒl"
                            ],
                            "us": [
                                "poʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a study in which people are asked for their opinions about a subject or person: ",
                            "examples": [
                                "We're carrying out/conducting a poll to find out what people think about abortion.",
                                "The latest opinion poll puts the Democrats in the lead."
                            ]
                        },
                        {
                            "explanation": "the places where people vote in a political election: ",
                            "examples": [
                                "The TV stations agreed not to announce the projected winner until after the polls closed.",
                                "Thousands of people made their way to the polls to register their vote.",
                                "These are just some of the issues that drive people to the polls.",
                                "There isn't much overlap between the reason people go to the movies and the reason they go to the polls.",
                                "Record numbers of young voters turned up at the polls this year."
                            ]
                        },
                        {
                            "explanation": "to vote: ",
                            "examples": [
                                "The country will go to the polls on 13 September."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pəʊl"
                            ],
                            "us": [
                                "poʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "When a person or a political party polls a particular number of votes in an election, they receive that number: ",
                            "examples": [
                                "With nearly all the votes counted, Mr Soto had polled 67 percent of the vote."
                            ]
                        },
                        {
                            "explanation": "to ask a person for their opinion as part of a general study of what people think about a subject: ",
                            "examples": [
                                "Half the people polled said they would pay more for environmentally friendly food."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}