{
    "word": "pool",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "puːl"
                            ],
                            "us": [
                                "puːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small area of usually still water: ",
                            "examples": [
                                "We looked for crabs in the rock pools along the seashore."
                            ]
                        },
                        {
                            "explanation": "a small amount of liquid on a surface: ",
                            "examples": [
                                "a pool of blood/oil",
                                "a pool of light"
                            ]
                        },
                        {
                            "explanation": "a \nswimming pool : ",
                            "examples": [
                                "I spent most of my holiday lying/sunbathing by the pool."
                            ]
                        },
                        {
                            "explanation": "a number of people or a quantity of a particular thing, such as money, collected together for shared use by several people or organizations: ",
                            "examples": [
                                "Patrick crashed a Ford that he'd borrowed from the car pool at work.",
                                "As unemployment rises, the pool of cheap labour increases."
                            ]
                        },
                        {
                            "explanation": "in some card games, an amount of money that is collected from all the players and received by the player who wins the game",
                            "examples": []
                        },
                        {
                            "explanation": "the money risked by a number of people on the result of a game or event: ",
                            "examples": [
                                "a baseball/football/hockey pool",
                                "the office pool",
                                "Who won the pool?"
                            ]
                        },
                        {
                            "explanation": "a type of gambling in which people risk a small amount of money and try to guess the results of football games correctly and win a lot of money: ",
                            "examples": [
                                "They do the pools every week.",
                                "His brother won £150,000 on the pools.",
                                "Other than winning the football pools, we have no chance of owning our own house.",
                                "She booked the cruise after a lucky win on the pools.",
                                "When she was in her thirties, she won a small fortune on the football pools."
                            ]
                        },
                        {
                            "explanation": "a game in which two people use cues (= long, thin poles) to hit 16 coloured balls into six holes around the edge of a large table covered in soft cloth: ",
                            "examples": [
                                "a pool table/room/hall",
                                "Do you want to shoot (= play) some pool?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "puːl"
                            ],
                            "us": [
                                "puːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to collect something such as money in order for it to be used by several different people or groups: ",
                            "examples": [
                                "The kids pooled their money to buy their parents a wedding anniversary gift."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}