{
    "word": "portal",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɔː.təl"
                            ],
                            "us": [
                                "ˈpɔːr.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a way to get or do something: ",
                            "examples": [
                                "The laptop is my portal to the outside world.",
                                "The Post Office has lost any sense that its core business is to provide a portal to delivery services."
                            ]
                        },
                        {
                            "explanation": "a website or page on the internet that allows people, especially a group of people who are interested in a particular subject, to get useful information and to find other websites: ",
                            "examples": [
                                "A number of large access providers offer portals to the Web for their own users.",
                                "There are a huge number of knit and crochet resources online, from trade association portals to blogs."
                            ]
                        },
                        {
                            "explanation": "an entrance to a building, especially a large or important one: ",
                            "examples": [
                                "Carrell's name remains above the portal to this day.",
                                "Passing through the portals of the BBC for the first time, she felt slightly nervous."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective ",
                        "ipa": {
                            "uk": [
                                "ˈpɔː.təl"
                            ],
                            "us": [
                                "ˈpɔːr.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to an opening to an organ in the body, especially the opening where blood vessels (= thin tubes that carry blood) enter the liver (= a large organ that cleans the blood): ",
                            "examples": [
                                "A liver biopsy reveals portal fibrosis.",
                                "Nerve fibres are abundant in the liver, particularly in the portal triads."
                            ]
                        },
                        {
                            "explanation": "relating to a system in the body in which blood flows from capillaries (= very thin tubes) of one organ, through larger blood vessels (= tubes), to capillaries of another organ, before returning to the heart : ",
                            "examples": [
                                "Ultimately these veins drain into the portal system.",
                                "The problem sometimes results from obstruction of the portal circulation."
                            ]
                        },
                        {
                            "explanation": "relating to the portal vein (= a major vein in the body that leads to the liver): ",
                            "examples": [
                                "Portal hypertension is a common related condition that is caused by liver damage.",
                                "Clotting time increases because the high portal pressure backs up blood into the spleen, destroying platelets."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}