{
    "word": "positive",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpɒz.ə.tɪv"
                            ],
                            "us": [
                                "ˈpɑː.zə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "full of hope and confidence, or giving cause for hope and confidence: ",
                            "examples": [
                                "a positive attitude",
                                "On a more positive note, we're seeing signs that the housing market is picking up.",
                                "The past ten years have seen some very positive developments in East-West relations.",
                                "There was a very positive response to our new design - people seemed very pleased with it."
                            ]
                        },
                        {
                            "explanation": "certain and without any doubt: ",
                            "examples": [
                                "Are you positive (that) you saw me switch the iron off?",
                                "\"Are you sure it's okay for me to use your mother's car?\" \"Positive.\"",
                                "\"It was him - I saw him take it.\" \"Are you positive about that?\""
                            ]
                        },
                        {
                            "explanation": "(of a test) showing that an illness, condition, drug, chemical, etc. is present: ",
                            "examples": [
                                "a positive pregnancy test",
                                "She learned the next day that the test was positive, and her doctor prescribed antibiotics."
                            ]
                        },
                        {
                            "explanation": "(of a person or thing) having had a positive test result for something: ",
                            "examples": [
                                "When the doctor told me I was positive, it was a total shock.",
                                "He's HIV positive.",
                                "She tested positive for hepatitis.",
                                "The urine sample was positive for codeine."
                            ]
                        },
                        {
                            "explanation": "A positive sentence or phrase is not a negative sentence (= one that states that something is false) or a question: ",
                            "examples": [
                                "\"I have a plan\" is a positive sentence."
                            ]
                        },
                        {
                            "explanation": "A positive adjective or adverb is not comparative (= expressing the idea of \"more\") or superlative (= expressing the idea of \"most\"): ",
                            "examples": [
                                "Grammarians would say we are descending the descriptive scale for adjectives, from superlative to comparative to positive."
                            ]
                        },
                        {
                            "explanation": "(used to add force to an expression) complete: ",
                            "examples": [
                                "Far from being a nuisance, she was a positive joy to have around."
                            ]
                        },
                        {
                            "explanation": "(of a number or amount) more than zero: ",
                            "examples": [
                                "Two is a positive number."
                            ]
                        },
                        {
                            "explanation": "being the type of electrical charge that is carried by protons",
                            "examples": []
                        },
                        {
                            "explanation": "having the rhesus factor in the blood: ",
                            "examples": [
                                "My blood type is O positive."
                            ]
                        },
                        {
                            "explanation": "A positive image shows dark areas of what is being photographed as dark and light areas of what is being photographed as light: ",
                            "examples": [
                                "He transfers the printed photograph to a large canvas backing using a computer able to read a positive image and reproduce it in polychrome."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɒz.ə.tɪv"
                            ],
                            "us": [
                                "ˈpɑː.zə.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "A positive in a situation is a good thing about it: ",
                            "examples": [
                                "I sat down and wrote out the positives and negatives of having a baby.",
                                "They said employees should see the merger as a positive for the company."
                            ]
                        },
                        {
                            "explanation": "a result of a scientific test that shows something exists or is present: ",
                            "examples": [
                                "I thought a positive meant I'd have to get screened more often.",
                                "The doping scandal started with an unexpected rash of positives. "
                            ]
                        },
                        {
                            "explanation": "a normal image in which dark areas of what is being photographed appear dark and light areas of what is being photographed appear light : ",
                            "examples": [
                                "Using this online tool, it is possible to make a positive from the negative of a photo. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}