{
    "word": "position",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pəˈzɪʃ.ən"
                            ],
                            "us": [
                                "pəˈzɪʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the place where something or someone is, often in relation to other things: ",
                            "examples": [
                                "Well, I've found our position on the map if you want to see where we are.",
                                "You've moved the furniture around - the sofa is in a different position."
                            ]
                        },
                        {
                            "explanation": "(in team sports) the part someone plays in a game, relating to the area of the field in which they mostly play: ",
                            "examples": [
                                "I didn't know you played hockey - what position do you play?"
                            ]
                        },
                        {
                            "explanation": "the place where people are sent in order to carry out a course of action: ",
                            "examples": [
                                "The troops took up their battle positions at the front line.",
                                "As soon as his officers were in position/had moved into position, the police commander walked up the path towards the house."
                            ]
                        },
                        {
                            "explanation": "a situation: ",
                            "examples": [
                                "My financial position is somewhat precarious at the moment.",
                                "When two of your best friends argue, it puts you in a very awkward position."
                            ]
                        },
                        {
                            "explanation": "to be able to do something, usually because you have the necessary experience, authority, or money: ",
                            "examples": [
                                "I'm not in a position to reveal any of the details of the project at present."
                            ]
                        },
                        {
                            "explanation": "a rank or level in a company, competition, or society: ",
                            "examples": [
                                "Whether or not you're given a car depends on your position in the company.",
                                "She finished the race in third position."
                            ]
                        },
                        {
                            "explanation": "a job: ",
                            "examples": [
                                "She applied for a position in the firm that I work for."
                            ]
                        },
                        {
                            "explanation": "the way in which something is arranged: ",
                            "examples": [
                                "Keep the bottles in an upright position.",
                                "Rotate it slowly from the horizontal into a vertical position."
                            ]
                        },
                        {
                            "explanation": "the way in which someone is lying, sitting, or standing: ",
                            "examples": [
                                "This is not a very comfortable position.",
                                "I go to sleep on my back but I always wake up in a different position.",
                                "You might feel more comfortable in a sitting position."
                            ]
                        },
                        {
                            "explanation": "an opinion: ",
                            "examples": [
                                "What's the company's position on recycling?",
                                "He takes the position (= believes) that individuals have a responsibility to look after themselves."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pəˈzɪʃ.ən"
                            ],
                            "us": [
                                "pəˈzɪʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something or someone in a particular place: ",
                            "examples": [
                                "The army had been positioned to the north and east of the city.",
                                "When it came to seating people for dinner, I positioned myself as far away from him as possible."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}