{
    "word": "post-adolescent",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌpəʊst.æd.əˈles.ənt"
                            ],
                            "us": [
                                "ˌpoʊst.æd.əˈles.ənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used for describing young adults who may behave as if they have not yet fully developed into adults: ",
                            "examples": [
                                "They were a bunch of fame-struck post-adolescent wannabes. ",
                                "His post-adolescent peer group believed themselves to be intellectuals."
                            ]
                        },
                        {
                            "explanation": "relating to the period soon after someone becomes an adult, when they may behave as if they have not yet fully developed into an adult: ",
                            "examples": [
                                "He says that he worked through a lot of his post-adolescent angst on the first album. ",
                                "The research focused on postadolescent transition from high school into higher education and adult life. "
                            ]
                        },
                        {
                            "explanation": "used for describing people who are adults rather than children: ",
                            "examples": [
                                "Cellulite appears in 90% of post-adolescent women."
                            ]
                        },
                        {
                            "explanation": "relating to any period after someone becomes an adult: ",
                            "examples": [
                                "Post-adolescent acne may be \"persistent acne\" (continuing from adolescence) or \"late-onset acne\".",
                                "Very few studies compare the health of twins who were raised together, but who differ in their postadolescent socioeconomic position."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌpəʊst.æd.əˈles.ənt"
                            ],
                            "us": [
                                "ˌpoʊst.æd.əˈles.ənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who has recently become an adult, but who may behave as if they have not yet fully developed into an adult: ",
                            "examples": [
                                "Some students are moody post-adolescents, still working out what it means to be adults.",
                                "The team needs experienced muscle, not post-adolescents."
                            ]
                        },
                        {
                            "explanation": "someone who is an adult rather than a child: ",
                            "examples": [
                                "He believed that post-adolescents cannot acquire new dialects in the way that pre-adolescents can."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}