{
    "word": "power",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "paʊər"
                            ],
                            "us": [
                                "ˈpaʊ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "ability to control people and events: ",
                            "examples": [
                                "I've no power over him - he does what he wants to.",
                                "Once nicotine has you in its power, it's very difficult to stop smoking.",
                                "She has the power to charm any man she meets."
                            ]
                        },
                        {
                            "explanation": "the amount of political control a person or group has in a country: ",
                            "examples": [
                                "Does the president have more power than the prime minister?",
                                "How long has the Conservative Party been in power?",
                                "The army seized power after five days of anti-government demonstrations."
                            ]
                        },
                        {
                            "explanation": "strength: ",
                            "examples": [
                                "Our car doesn't have enough power to tow a trailer.",
                                "Weightlifters have tremendous power in their arms and legs.",
                                "Scientists are working to harness the power of the atom.",
                                "The economic power of many Asian countries has grown dramatically in recent years."
                            ]
                        },
                        {
                            "explanation": "an official or legal right to do something: ",
                            "examples": [
                                "I'd like to help but I don't have the power to intervene in this dispute.",
                                "It's not in your power to cancel the order.",
                                "I can't give you a refund - I'm afraid it's not within my power."
                            ]
                        },
                        {
                            "explanation": "authority: ",
                            "examples": [
                                "You were acting beyond your powers when you agreed to give her a pay rise."
                            ]
                        },
                        {
                            "explanation": "electricity, especially when considering its use or production: ",
                            "examples": [
                                "You should disconnect the power before attempting to repair electrical equipment.",
                                "Our building lost power (= the electricity was stopped) during the storm.",
                                "power cables/lines"
                            ]
                        },
                        {
                            "explanation": "abilities: ",
                            "examples": [
                                "My mental powers aren't as good as they used to be."
                            ]
                        },
                        {
                            "explanation": "a natural skill or an ability to do something: ",
                            "examples": [
                                "He was so shocked by what happened to his parents that he lost the power of speech.",
                                "We humans believe that we are the only animals to have the power of reason.",
                                "The surgeon did everything in her power to save him.",
                                "Environmentalists are doing everything within their power to minimize the impact of the oil spill.",
                                "Solving this problem has taken all my brain power."
                            ]
                        },
                        {
                            "explanation": "a person, organization, or country that has control over others, often because of wealth, importance, or great military strength: ",
                            "examples": [
                                "Spain was an important military power in the 16th century.",
                                "Germany is on its way to becoming a world power with a permanent seat on the UN Security Council.",
                                "She is an increasingly important power in the company."
                            ]
                        },
                        {
                            "explanation": "the rate at which energy is used, or the ability to produce energy: ",
                            "examples": [
                                "The ship was only slightly damaged in the collision and was able to sail into port under its own power.",
                                "The power rating of my amplifier is 40 watts per channel."
                            ]
                        },
                        {
                            "explanation": "the amount by which an image is increased by a device used for seeing things that are very small or a long distance away: ",
                            "examples": [
                                "What's the magnification power of your binoculars?",
                                "You'll need a very high-power microscope to see something as small as that.",
                                "A low-power telescope is enough if you only want to look at the moon."
                            ]
                        },
                        {
                            "explanation": "the number of times that a number is to be multiplied by itself: ",
                            "examples": [
                                "2 to the fourth power is 2 times 2 times 2 times 2, which equals 16.",
                                "3 to the power 4 is usually written as 34."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "paʊ.ər"
                            ],
                            "us": [
                                "ˈpaʊ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to provide a machine with energy and the ability to operate: ",
                            "examples": [
                                "Buses and trucks are usually powered by diesel engines.",
                                "Electricity costs less than petrol, so powering an electric vehicle is cheaper."
                            ]
                        },
                        {
                            "explanation": "to act with great strength or in a forceful way: ",
                            "examples": [
                                "Halfway through, she powered into the lead and went on to win the race."
                            ]
                        },
                        {
                            "explanation": "in sports, to hit or kick the ball very hard: ",
                            "examples": [
                                "She powered her return past Fernandez who had come to the net.",
                                "He powered his drive over 300 yards down the first hole."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "provided with energy by an electric motor: ",
                            "examples": [
                                "a power shower",
                                "a power drill"
                            ]
                        },
                        {
                            "explanation": "in sports, having great physical strength: ",
                            "examples": [
                                "a power pitcher",
                                "a power hitter"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}