{
    "word": "practice",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpræk.tɪs"
                            ],
                            "us": [
                                "ˈpræk.tɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "action rather than thought or ideas: ",
                            "examples": [
                                "How do you intend to put these proposals into practice, Mohamed?"
                            ]
                        },
                        {
                            "explanation": "used to describe what really happens as opposed to what you think will happen in a particular situation: ",
                            "examples": [
                                "It seemed like a good idea before we started, but in practice it was a disaster."
                            ]
                        },
                        {
                            "explanation": "something that is usually or regularly done, often as a habit, tradition, or custom: ",
                            "examples": [
                                "What can European companies learn from Japanese business practices?",
                                "It's common practice in the States to tip the hairdresser.",
                                "This is a cruel practice that should be banned immediately.",
                                "What is standard practice (= what is usually done) in a situation like this?",
                                "Newspaper editors have agreed to a new code of practice on the invasion of privacy."
                            ]
                        },
                        {
                            "explanation": "to do something regularly: ",
                            "examples": [
                                "I'll do your washing for you this time, but I'm not going to make a practice of it."
                            ]
                        },
                        {
                            "explanation": "the act of doing something regularly or repeatedly to improve your skill at doing it: ",
                            "examples": [
                                "I need to get some more practice before I take my driving test.",
                                "Are you coming to choir practice this evening?",
                                "She's never at home because she spends all her free time at hockey practices.",
                                "You'll gradually get better at it - it's just a question of practice.",
                                "I'm a little out of practice (= I haven't had any recent experience) but I'd love to play.",
                                "Do you mind if I have a few practice shots before we start the game?"
                            ]
                        },
                        {
                            "explanation": "a job or business that involves a lot of skill or training: ",
                            "examples": [
                                "a dental/medical/veterinary/legal practice",
                                "Our practice is responsible for about 5,000 patients.",
                                "She's decided to leave the Health Service and join a private practice."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈpræk.tɪs"
                            ],
                            "us": [
                                "ˈpræk.tɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "US spelling of \npractise ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}