{
    "word": "pressure",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpreʃ.ər"
                            ],
                            "us": [
                                "ˈpreʃ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the force you produce when you press something: ",
                            "examples": [
                                "He put too much pressure on the door handle and it snapped.",
                                "You can stop bleeding by applying pressure close to the injured area."
                            ]
                        },
                        {
                            "explanation": "the force that a liquid or gas produces when it presses against an area: ",
                            "examples": [
                                "gas/water pressure",
                                "The new material allows the company to make gas pipes which withstand higher pressures.",
                                "The gas is stored under pressure (= in a container which keeps it at a higher pressure than it would usually have)."
                            ]
                        },
                        {
                            "explanation": "the act of trying to make someone else do something by arguing, persuading, etc.: ",
                            "examples": [
                                "public/political pressure",
                                "Teachers are under increasing pressure to work longer hours.",
                                "Pressure to abandon the new motorway is increasing.",
                                "The government is facing pressure from environmental activists.",
                                "The Defence Secretary resigned under pressure from the Prime Minister (= because the Prime Ministerforced him to).",
                                "She's putting pressure on him (= trying to persuade him) to get married.",
                                "The international community is trying to bring pressure to bear on the government (= trying to persuade them) to resolve the situation."
                            ]
                        },
                        {
                            "explanation": "a difficult situation that makes you feel worried or unhappy: ",
                            "examples": [
                                "She's got a lot of pressure on her at work just now.",
                                "Be nice to him - he's been under a lot of pressure recently.",
                                "Can you work well under pressure?",
                                "the pressures of work"
                            ]
                        },
                        {
                            "explanation": "something that you say when what someone has just said makes you feel that you must try very hard to do something: ",
                            "examples": [
                                "\"These exams are the most important of all.\" \"Oh, so no pressure then!\""
                            ]
                        },
                        {
                            "explanation": "a situation in a football game in which attacking players are moving forward and getting closer to scoring a goal, and players from the opposing team have to work hard to stop them from scoring: ",
                            "examples": [
                                "Ryan Giggs put the home defence under pressure.",
                                "Playing four forwards puts too much pressure on the defence."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈpreʃ.ər"
                            ],
                            "us": [
                                "ˈpreʃ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to strongly persuade someone to do something they do not want to do: ",
                            "examples": [
                                "She was pressured into joining the club."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}