{
    "word": "press",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pres"
                            ],
                            "us": [
                                "pres"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to push something firmly, often without causing it to move permanently further away from you: ",
                            "examples": [
                                "Press the button to start the machine.",
                                "He pressed his face against the window.",
                                "Can you press a little harder on my shoulders, please?",
                                "The crowd pressed against the locked doors trying to get into the building.",
                                "Press down firmly on the lever."
                            ]
                        },
                        {
                            "explanation": "to make clothes smooth by ironing them: ",
                            "examples": [
                                "I'll just press these trousers."
                            ]
                        },
                        {
                            "explanation": "to put a weight on fruit in order to remove the juice: ",
                            "examples": [
                                "to press grapes"
                            ]
                        },
                        {
                            "explanation": "to make a CD, DVD, etc.: ",
                            "examples": [
                                "Over 3,000 copies of the CD were pressed and sent out to college radio stations."
                            ]
                        },
                        {
                            "explanation": "to make something flat and firm by putting it under something heavy: ",
                            "examples": [
                                "The children pressed some flowers.",
                                "pressed turkey breast"
                            ]
                        },
                        {
                            "explanation": "to try hard to persuade someone to do something: ",
                            "examples": [
                                "The committee pressed him to reveal more information.",
                                "He's pressing me for an answer.",
                                "Can I press you further on (= persuade you to say more about) this issue?"
                            ]
                        },
                        {
                            "explanation": "to complain officially about someone in a law court: ",
                            "examples": [
                                "The family have decided not to press charges against him."
                            ]
                        },
                        {
                            "explanation": "to continue to try to make people accept your demands: ",
                            "examples": [
                                "Once again he tried to press his case for promotion."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pres"
                            ],
                            "us": [
                                "pres"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "newspapers and magazines, and those parts of television and radio that broadcast news, or reporters and photographers who work for them: ",
                            "examples": [
                                "The incident has been widely reported in the press.",
                                "Freedom of the press (= the right of newspapers to publish news and opinions without being controlled by the government) must be upheld.",
                                "press reports/coverage",
                                "press reporters/photographers",
                                "the local/national press",
                                "The charity invited the press (= reporters and photographers) to a presentation of its plans for the future.",
                                "The press was out in force at the awards ceremony."
                            ]
                        },
                        {
                            "explanation": "the judgment that is given of someone or something in the newspapers or on radio or television: ",
                            "examples": [
                                "What kind of press did his play get?",
                                "The play has had a good/bad press.",
                                "The play has had good/bad press."
                            ]
                        },
                        {
                            "explanation": "a business that prints and produces books and similar things: ",
                            "examples": [
                                "Cambridge University Press"
                            ]
                        },
                        {
                            "explanation": "a machine that is used for printing: ",
                            "examples": [
                                "a printing press"
                            ]
                        },
                        {
                            "explanation": "to start to be printed: ",
                            "examples": [
                                "The newspaper will go to press at midnight."
                            ]
                        },
                        {
                            "explanation": "a firm push against something using the fingers: ",
                            "examples": [
                                "To start the machine, just give this button a press."
                            ]
                        },
                        {
                            "explanation": "the act of making cloth smooth with an iron: ",
                            "examples": [
                                "Can you give this shirt a quick press?"
                            ]
                        },
                        {
                            "explanation": "a piece of equipment that is used to put weight on something in order to crush it, remove liquid from it or to make it flat: ",
                            "examples": [
                                "a garlic/trouser/wine press"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}