{
    "word": "present",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈprez.ənt"
                            ],
                            "us": [
                                "ˈprez.ənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that you are given, without asking for it, on a special occasion, especially to show friendship, or to say thank you: ",
                            "examples": [
                                "a birthday/Christmas/wedding present",
                                "They gave me theatre tickets as a present."
                            ]
                        },
                        {
                            "explanation": "the period of time that is happening now, not the past or the future: ",
                            "examples": [
                                "That's all for the present.",
                                "The play is set in the present."
                            ]
                        },
                        {
                            "explanation": "the form of the verb that is used to show what happens or exists now: ",
                            "examples": [
                                "The verb in this sentence is in the present."
                            ]
                        },
                        {
                            "explanation": "now: ",
                            "examples": [
                                "\"Are you busy?\" \"Not at present.\""
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈprez.ənt"
                            ],
                            "us": [
                                "ˈprez.ənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a particular place: ",
                            "examples": [
                                "The whole family was present.",
                                "There were no children present."
                            ]
                        },
                        {
                            "explanation": "happening or existing now: ",
                            "examples": [
                                "I don't have her present address.",
                                "Please state your present occupation and salary."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "prɪˈzent"
                            ],
                            "us": [
                                "prɪˈzent"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give, provide, or make something known: ",
                            "examples": [
                                "The winners were presented with medals.",
                                "The letter presented the family with a problem that would be difficult to solve.",
                                "The documentary presented us with a balanced view of the issue.",
                                "He presented the report to his colleagues at the meeting.",
                                "The classroom presented a cheerful busy atmosphere to the visitors (= appeared to them to have this).",
                                "The school is presenting (= performing) \"West Side Story\" as its end-of-term production."
                            ]
                        },
                        {
                            "explanation": "to introduce a television or radio show: ",
                            "examples": [
                                "She presents the late-night news."
                            ]
                        },
                        {
                            "explanation": "to introduce a person: ",
                            "examples": [
                                "May I present Professor Carter?",
                                "Later on I'd like to present you to the headteacher."
                            ]
                        },
                        {
                            "explanation": "to arrive somewhere and introduce yourself: ",
                            "examples": [
                                "He presented himself at the doctor's at 9.30 a.m. as arranged.",
                                "You should present yourselves at the front desk at 8 o'clock in the morning.",
                                "He presented himself to the Criminal Tribunal in The Hague.",
                                "She presented herself at the abbey to begin her life as a nun.",
                                "I presented myself to the supervisor, eager to begin work."
                            ]
                        },
                        {
                            "explanation": "If something presents itself, it happens: ",
                            "examples": [
                                "An opportunity suddenly presented itself.",
                                "When a challenge to his authority presented itself, he dealt with it firmly.",
                                "She opted for cash over comfort whenever the choice presented itself.",
                                "I would be open to taking up a directorship should the right opportunity present itself.",
                                "After a couple of successful years, a new hurdle presented itself."
                            ]
                        },
                        {
                            "explanation": "to see a doctor, etc. when showing particular signs of an illness or medical condition : ",
                            "examples": [
                                "Children presenting with acute respiratory infections were referred for a chest X-ray.",
                                "When patients present with chest pain, clinical examination and patient history are fundamental to determine the probable cause of pain."
                            ]
                        },
                        {
                            "explanation": "(of an illness) to show itself in a particular way: ",
                            "examples": [
                                "Medical conditions might present differently during pregnancy.",
                                "Bone cancer generally presents as pain in the area of the tumour."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}