{
    "word": "pride",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "praɪd"
                            ],
                            "us": [
                                "praɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a feeling of pleasure and satisfaction that you get because you or people connected with you have done or got something good: ",
                            "examples": [
                                "She felt a great sense of pride as she watched him accept the award.",
                                "He felt such pride walking his little daughter down the street."
                            ]
                        },
                        {
                            "explanation": "to feel very pleased about something or someone you are closely connected with: ",
                            "examples": [
                                "If you don't take professional pride in your work, you're probably in the wrong job."
                            ]
                        },
                        {
                            "explanation": "your feelings of your own worth and respect for yourself: ",
                            "examples": [
                                "She has too much pride to accept any help.",
                                "The country's national pride has been damaged by its sporting failures."
                            ]
                        },
                        {
                            "explanation": "the belief that you are better or more important than other people: ",
                            "examples": [
                                "Pride was his downfall."
                            ]
                        },
                        {
                            "explanation": "a group of lions",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "praɪd"
                            ],
                            "us": [
                                "praɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a celebration that usually includes a parade (= a large number of people walking or in vehicles, all going in the same direction) and other events to show support and acceptance of people who are LGBTQ+ (= lesbian, gay, bisexual, transgender, queer, and other sexual and gender identities): ",
                            "examples": [
                                "We marched in the local Pride parade.",
                                "Are you going to Pride? (= Are you taking part in the Pride celebrations?)"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}