{
    "word": "print",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "prɪnt"
                            ],
                            "us": [
                                "prɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "letters, numbers, or symbols that have been produced on paper by a machine using ink: ",
                            "examples": [
                                "The title is in bold print.",
                                "This novel is available in large print for readers with poor eyesight.",
                                "The book was rushed into print (= was produced and published) as quickly as possible.",
                                "The print quality (= the quality of the text produced) of the new laser printer is excellent."
                            ]
                        },
                        {
                            "explanation": "newspapers, books, and magazines: ",
                            "examples": [
                                "The debate is still raging, both in print and online."
                            ]
                        },
                        {
                            "explanation": "If a book is in print, it is possible to buy a new copy of it, and if it is out of print, it is not now possible: ",
                            "examples": [
                                "Is her work still in print?"
                            ]
                        },
                        {
                            "explanation": "a photographic copy of a painting, or a picture made by pressing paper onto a special surface covered in ink, or a single photograph from a film: ",
                            "examples": [
                                "a print of Van Gogh's \"Sunflowers\"",
                                "a signed Hockney print",
                                "I had some prints made of the party photos."
                            ]
                        },
                        {
                            "explanation": "any type of pattern produced using ink on a piece of clothing: ",
                            "examples": [
                                "a floral/paisley print"
                            ]
                        },
                        {
                            "explanation": "informal for\nfingerprint : ",
                            "examples": [
                                "The burglar had left his prints all over the window."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "prɪnt"
                            ],
                            "us": [
                                "prɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to produce writing or images on paper or other material with a machine: ",
                            "examples": [
                                "The leaflets will be printed on recycled paper.",
                                "I'm waiting for a document to print."
                            ]
                        },
                        {
                            "explanation": "to include a piece of writing in a newspaper or magazine: ",
                            "examples": [
                                "Some newspapers still refuse to print certain swear words.",
                                "They printed his letter in Tuesday's paper."
                            ]
                        },
                        {
                            "explanation": "to produce a newspaper, magazine, or book in large quantities: ",
                            "examples": [
                                "20,000 copies of the novel will be printed in hardback."
                            ]
                        },
                        {
                            "explanation": "to write without joining the letters together: ",
                            "examples": [
                                "Please print your name clearly below your signature."
                            ]
                        },
                        {
                            "explanation": "to produce a photograph on paper: ",
                            "examples": [
                                "Photographs are better if they are printed from the original negative."
                            ]
                        },
                        {
                            "explanation": "to produce a pattern on material or paper: ",
                            "examples": [
                                "The designs are printed onto the fabric by hand."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}