{
    "word": "private",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpraɪ.vət"
                            ],
                            "us": [
                                "ˈpraɪ.vət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "only for one person or group and not for everyone: ",
                            "examples": [
                                "She has a small office that is used for private discussions.",
                                "I caught him looking through my private papers.",
                                "The sign on the gate said \"Private Property - No Trespassing!\""
                            ]
                        },
                        {
                            "explanation": "Private activities involve personal matters or relationships and are not related to your work: ",
                            "examples": [
                                "Apparently in interviews he refuses to talk about his private life."
                            ]
                        },
                        {
                            "explanation": "Private thoughts and opinions are secret and not discussed with other people: ",
                            "examples": [
                                "Although I support the project in public, my private opinion is that it will fail.",
                                "This is a private matter."
                            ]
                        },
                        {
                            "explanation": "A private place is quiet and has no other people to see or hear you: ",
                            "examples": [
                                "Is there somewhere private where we can talk?"
                            ]
                        },
                        {
                            "explanation": "A private person does not like to talk about their personal feelings and thoughts: ",
                            "examples": [
                                "She's a very private person."
                            ]
                        },
                        {
                            "explanation": "If you talk to someone or do something in private, you do it without other people being present: ",
                            "examples": [
                                "Jamie wants to speak to me in private."
                            ]
                        },
                        {
                            "explanation": "controlled or paid for by a person or company and not by the government: ",
                            "examples": [
                                "private education/healthcare",
                                "a private doctor/dentist",
                                "Banks should be supporting small private businesses."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpraɪ.vət"
                            ],
                            "us": [
                                "ˈpraɪ.vət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a soldier of the lowest rank in an army: ",
                            "examples": [
                                "Private Murray/Sam Murray",
                                "You're dismissed, Private."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}