{
    "word": "privilege",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈprɪv.əl.ɪdʒ"
                            ],
                            "us": [
                                "ˈprɪv.əl.ɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an advantage that only one person or group of people has, usually because of their position or because they are rich: ",
                            "examples": [
                                "Healthcare should be a right, not a privilege.",
                                "Senior management enjoy certain privileges, such as company cars and health insurance."
                            ]
                        },
                        {
                            "explanation": "an opportunity to do something special or enjoyable: ",
                            "examples": [
                                "I had the privilege of interviewing Picasso in the 1960s.",
                                "It was a real privilege to meet her."
                            ]
                        },
                        {
                            "explanation": "the way in which people who are rich, come from a high social class, or belong to a particular race or gender have more advantages in society than people who do not belong to these groups: ",
                            "examples": [
                                "a life of privilege",
                                "My thesis examines the role of societal privilege in the maintenance of health disparities.",
                                "Some men will even resort to violence to try to enforce and protect their male privilege."
                            ]
                        },
                        {
                            "explanation": "the special right that some people in authority have that allows them to do or say things that other people are not allowed to: ",
                            "examples": [
                                "diplomatic/parliamentary privilege"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈprɪv.əl.ɪdʒ"
                            ],
                            "us": [
                                "ˈprɪv.əl.ɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give an advantage to one person or group of people and not to others: ",
                            "examples": [
                                "Since colonization, the country has a history of privileging people who have white skin.",
                                "Family endowments were nearly all male-centric, privileging men and their descendants over female lines of descent."
                            ]
                        },
                        {
                            "explanation": "to give something more importance than other things: ",
                            "examples": [
                                "The new exhibition privileged industry over agriculture.",
                                "They do not privilege one approach over the other."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}