{
    "word": "prize",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "praɪz"
                            ],
                            "us": [
                                "praɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something valuable, such as an amount of money, that is given to someone who succeeds in a competition or game or that is given to someone as a reward for doing very good work: ",
                            "examples": [
                                "The critics' prize for best film was won by Marc Abbott for \"Belly Laugh\".",
                                "I won a prize in the raffle.",
                                "The first (= main) prize is a week for two in Miami.",
                                "The prize money for winning Wimbledon has been increased by 12.5 per cent."
                            ]
                        },
                        {
                            "explanation": "something important and valuable that is difficult to achieve or get: ",
                            "examples": [
                                "The prize would be her hand in marriage."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "praɪz"
                            ],
                            "us": [
                                "praɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to think that someone or something is very valuable or important: ",
                            "examples": [
                                "In parts of Asia this plant is prized for its medicinal qualities.",
                                "I prize that intimacy above everything."
                            ]
                        },
                        {
                            "explanation": "to use force to lift something off something else, for example by pressing a tool against a fixed point; to separate things using force: ",
                            "examples": [
                                "I prized the lid off with a spoon.",
                                "The window had been prized open with a jemmy.",
                                "She couldn't prize his fingers apart to get the key."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "praɪz"
                            ],
                            "us": [
                                "praɪz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "A prize animal, flower, or vegetable is one that has won or deserves to win a prize in a competition because it is of very good quality: ",
                            "examples": [
                                "a prize bull",
                                "a prize marrow"
                            ]
                        },
                        {
                            "explanation": "used to describe something that is a very good or important example of its type: ",
                            "examples": [
                                "prize assets",
                                "Some prize idiot (= extremely foolish person) forgot to lock the door."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}