{
    "word": "process",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈprəʊ.ses"
                            ],
                            "us": [
                                "ˈprɑː.ses"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a series of actions that you take in order to achieve a result: ",
                            "examples": [
                                "the peace process",
                                "Increasing the number of women in top management jobs will be a slow process.",
                                "This decision may delay the process of European unification.",
                                "The party has begun the painful (= difficult) process of rethinking its policies and strategy.",
                                "Going to court to obtain compensation is a long process.",
                                "She arrived at the correct answer by a process of elimination (= by deciding against each answer that was unlikely to be correct until only one was left)."
                            ]
                        },
                        {
                            "explanation": "a series of changes that happen naturally: ",
                            "examples": [
                                "the digestive process",
                                "the ageing process",
                                "It's all part of the learning process."
                            ]
                        },
                        {
                            "explanation": "a method of producing goods in a factory by treating natural substances: ",
                            "examples": [
                                "They have developed a new process for extracting aluminium from bauxite."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈprəʊ.ses"
                            ],
                            "us": [
                                "ˈprɑː.ses"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to deal with documents in an official way: ",
                            "examples": [
                                "Visa applications take 28 days to process."
                            ]
                        },
                        {
                            "explanation": "If a computer processes information, it performs a particular series of operations on the information, such as a set of calculations.",
                            "examples": []
                        },
                        {
                            "explanation": "to prepare, change, or treat food or natural substances as a part of an industrial operation: ",
                            "examples": [
                                "a waste processing plant"
                            ]
                        },
                        {
                            "explanation": "to think about a difficult or sad situation so that you can gradually accept it: ",
                            "examples": [
                                "Returning soldiers need time to process what they have experienced in combat. "
                            ]
                        },
                        {
                            "explanation": "to make pictures from photographic film: ",
                            "examples": [
                                "I need to get those films processed."
                            ]
                        },
                        {
                            "explanation": "to walk slowly: ",
                            "examples": [
                                "We watched them process down the aisle."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}