{
    "word": "produce",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "prəˈdʒuːs"
                            ],
                            "us": [
                                "prəˈduːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make something or bring something into existence: ",
                            "examples": [
                                "France produces a great deal of wine for export.",
                                "Red blood cells are produced in the bone marrow.",
                                "She works for a company that produces (= makes for sale) electrical goods.",
                                "I was wondering whether I could produce a meal out of what's left in the fridge.",
                                "She's asked me to produce a report on the state of the project."
                            ]
                        },
                        {
                            "explanation": "When animals produce young, they give birth to them: ",
                            "examples": [
                                "Our cat produced four kittens during the course of the night.",
                                "All our friends seem to be busy producing offspring at the moment."
                            ]
                        },
                        {
                            "explanation": "to cause a reaction or result: ",
                            "examples": [
                                "The senator's speech produced an angry response from the opposition.",
                                "Her remarks produced an awkward silence.",
                                "If used on delicate skin, this cream may produce a stinging sensation."
                            ]
                        },
                        {
                            "explanation": "to organize the practical and financial matters relating to the preparation of a film, play, or television or radio programme",
                            "examples": []
                        },
                        {
                            "explanation": "to be in charge of making a musical recording and to be responsible for the arrangement of the music, the combination of the different instruments or voices and the general sound of it",
                            "examples": []
                        },
                        {
                            "explanation": "to bring something out from somewhere and show it: ",
                            "examples": [
                                "He produced a letter from his desk that he asked me to read.",
                                "One of the men suddenly produced a knife from his pocket."
                            ]
                        },
                        {
                            "explanation": "to result in or discover something, especially proof: ",
                            "examples": [
                                "A lengthy police investigation failed to produce any evidence on which the suspect could be convicted."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈprɒdʒ.uːs"
                            ],
                            "us": [
                                "ˈprɑː.duːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "food or any other substance or material that is grown or obtained through farming: ",
                            "examples": [
                                "agricultural/dairy/fresh produce"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}