{
    "word": "professional",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "prəˈfeʃ.ən.əl"
                            ],
                            "us": [
                                "prəˈfeʃ.ən.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to work that needs special training or education: ",
                            "examples": [
                                "Chris, you're a nurse, so can I ask your professional opinion on bandaging ankles?",
                                "Both doctors have been charged with professional misconduct (= bad or unacceptable behaviour in their work)."
                            ]
                        },
                        {
                            "explanation": "having the qualities that you connect with trained and skilled people, such as effectiveness, skill, organization, and seriousness of manner: ",
                            "examples": [
                                "It would look more professional if the letter was typed.",
                                "She always looks very professional in her smart suits.",
                                "You've done a very professional job stripping that floor!"
                            ]
                        },
                        {
                            "explanation": "used to describe someone who does a job that people usually do as a hobby: ",
                            "examples": [
                                "She's a professional dancer/photographer.",
                                "He's a runner who's just turned professional."
                            ]
                        },
                        {
                            "explanation": "having the type of job that is respected because it involves a high level of education and training: ",
                            "examples": [
                                "Room for rent in shared house - would suit professional person.",
                                "a bar full of young professional types in suits"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "prəˈfeʃ.ən.əl"
                            ],
                            "us": [
                                "prəˈfeʃ.ən.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who has the type of job that needs a high level of education and training: ",
                            "examples": [
                                "health professionals"
                            ]
                        },
                        {
                            "explanation": "someone who has worked hard in the same type of job for a long time and has become skilled at dealing with any problem that might happen: ",
                            "examples": [
                                "I thought the whole meeting was going to fall apart but you rescued it like a true professional!",
                                "the consummate professional"
                            ]
                        },
                        {
                            "explanation": "a person who does a job that people usually do as a hobby: ",
                            "examples": [
                                "He's only been playing football as a professional for two years."
                            ]
                        },
                        {
                            "explanation": "a person who plays a sport, especially a golf or tennis player, who is employed by a club to train its members in a particular sport",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}