{
    "word": "progress",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈprəʊ.ɡres"
                            ],
                            "us": [
                                "ˈprɑː.ɡres"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "movement to an improved or more developed state, or to a forward position: ",
                            "examples": [
                                "Technological progress has been so rapid over the last few years.",
                                "I'm not making much progress with my Spanish.",
                                "The doctor said that she was making good progress (= getting better after a medical operation or illness).",
                                "The recent free elections mark the next step in the country's progress towards democracy.",
                                "The yacht's crew said that they were making relatively slow progress."
                            ]
                        },
                        {
                            "explanation": "happening or being done now: ",
                            "examples": [
                                "Repair work is in progress on the south-bound lane of the motorway and will continue until June."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "prəˈɡres"
                            ],
                            "us": [
                                "prəˈɡres"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to improve or develop in skills, knowledge, etc.: ",
                            "examples": [
                                "My Spanish never really progressed beyond the stage of being able to order drinks at the bar."
                            ]
                        },
                        {
                            "explanation": "to continue gradually: ",
                            "examples": [
                                "As the war progressed, more and more countries became involved.",
                                "We started off talking about the weather and gradually the conversation progressed to politics."
                            ]
                        },
                        {
                            "explanation": "to move something to a more advanced or developed state: ",
                            "examples": [
                                "I decided to do a postgraduate course because it's a good way to progress your career.",
                                "I am anxious to progress discussions on the two projects as soon as possible."
                            ]
                        },
                        {
                            "explanation": "to move forward: ",
                            "examples": [
                                "As you progress up the valley, views open up.",
                                "There were no signs indicating that workers should not progress beyond that point."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}