{
    "word": "progressive",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "prəˈɡres.ɪv"
                            ],
                            "us": [
                                "prəˈɡres.ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "developing or happening gradually: ",
                            "examples": [
                                "There's been a progressive decline in the standard of living over the past few years."
                            ]
                        },
                        {
                            "explanation": "A progressive medical condition continues to develop, or gradually becomes worse or more serious. : ",
                            "examples": [
                                "Alzheimer's disease is a progressive brain condition.",
                                "He was diagnosed with syringomyelia, a disease of the spinal cord that results in progressive weakening of the body."
                            ]
                        },
                        {
                            "explanation": "Progressive ideas or systems are new and modern, encouraging change in society or in the way that things are done: ",
                            "examples": [
                                "progressive ideas/attitudes",
                                "The left of the party is pressing for a more progressive social policy.",
                                "a progressive school"
                            ]
                        },
                        {
                            "explanation": "A progressive tax system is one in which the rate of tax is higher on larger amounts of money.",
                            "examples": []
                        },
                        {
                            "explanation": "The progressive form of a verb is used to show that the action is continuing. It is formed with the verb \"be\" followed by the present participle (= -ing form of the verb): ",
                            "examples": [
                                "\"He's working hard at the moment\" is an example of the present progressive form of the verb \"work\".",
                                "\"I was eating when the phone rang\" is an example of the past progressive."
                            ]
                        },
                        {
                            "explanation": "used to describe a lens (= a curved piece of glass) that allows you to see things clearly at different distances: ",
                            "examples": [
                                "Progressive lenses provide vision correction for both near and distance prescriptions, but in a single lens.",
                                "They sell many types of glasses: rimless, progressive, tinted and so on."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "prəˈɡres.ɪv"
                            ],
                            "us": [
                                "prəˈɡres.ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who supports new ideas and social change, especially one who belongs to a political party",
                            "examples": []
                        },
                        {
                            "explanation": "glasses with special lenses that let you see things clearly at different distances: ",
                            "examples": [
                                "Are those glasses progressives?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}