{
    "word": "project",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈprɒdʒ.ekt"
                            ],
                            "us": [
                                "ˈprɑː.dʒekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of planned work or an activity that is finished over a period of time and intended to achieve a particular purpose: ",
                            "examples": [
                                "the Kings Cross housing project",
                                "a scientific research project",
                                "Her latest project is a film based on the life of a 19th-century music hall star.",
                                "My next project is decorating the kitchen."
                            ]
                        },
                        {
                            "explanation": "a study of a particular subject done over a period of time, especially by students: ",
                            "examples": [
                                "He's doing a class project on pollution.",
                                "In our third year at college everyone had to do a special project."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "prəˈdʒekt"
                            ],
                            "us": [
                                "prəˈdʒekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to calculate an amount or number expected in the future from information already known: ",
                            "examples": [
                                "Government spending is projected to rise by three percent next year."
                            ]
                        },
                        {
                            "explanation": "to throw or direct something forwards, with force: ",
                            "examples": [
                                "90 percent of the projected missiles will hit their target."
                            ]
                        },
                        {
                            "explanation": "to sing or speak loudly and clearly: ",
                            "examples": [
                                "It's a big theatre so you really have to project your voice if you're going to be heard at the back."
                            ]
                        },
                        {
                            "explanation": "to cause a film, image, or light to appear on a screen or other surface: ",
                            "examples": [
                                "Laser images were projected onto a screen."
                            ]
                        },
                        {
                            "explanation": "to wrongly imagine that someone else is feeling a particular emotion or desire when in fact it is you who feels this way: ",
                            "examples": [
                                "I suspect he's projecting his fears onto you."
                            ]
                        },
                        {
                            "explanation": "If you project a particular quality, that quality is what most people notice about you: ",
                            "examples": [
                                "Recently the president has sought to project a much tougher image."
                            ]
                        },
                        {
                            "explanation": "to stick out over an edge or from a surface: ",
                            "examples": [
                                "The hotel dining room projects out over the water."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}