{
    "word": "projection",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "prəˈdʒek.ʃən"
                            ],
                            "us": [
                                "prəˈdʒek.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a calculation or guess about the future based on information that you have: ",
                            "examples": [
                                "The company has failed to achieve last year's sales projections by 30 percent.",
                                "Spending was well below projections."
                            ]
                        },
                        {
                            "explanation": "the act of projecting a film or an image onto a screen or wall, or the film or image itself: ",
                            "examples": [
                                "A few chairs and rear projections supplied the scene."
                            ]
                        },
                        {
                            "explanation": "something that projects from a surface or above the edge of something",
                            "examples": []
                        },
                        {
                            "explanation": "a drawing or image that represents a line, figure, or solid shown on a particular plane (= a flat or level surface that continues in all directions): ",
                            "examples": [
                                "CT scans can be reformatted in multiple projections, regardless of the original plane of scanning."
                            ]
                        },
                        {
                            "explanation": "the act of imagining that someone else feels a particular emotion or wants something when in fact it is you who feels this way; an example of this act: ",
                            "examples": [
                                "Projection is where you see in others what is really within yourself.",
                                "The relative's negativity toward the patient involves a projection of the relative's own feelings of vulnerability from previous personal distress."
                            ]
                        },
                        {
                            "explanation": "the act of expressing your feelings and wishes; an example of this act: ",
                            "examples": [
                                "the projection of repressed feelings",
                                "The things we think we see objectively are really projections of our emotions, memories, and thoughts."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}