{
    "word": "projective",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "prəˈdʒek.tɪv"
                            ],
                            "us": [
                                "prəˈdʒek.tɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to or involving calculations or guesses about the future: ",
                            "examples": [
                                "The five-year plan was a projective document intended for internal management use only.",
                                "We have to reduce our projective emissions growth, because otherwise the climate will be in serious trouble."
                            ]
                        },
                        {
                            "explanation": "relating to or involving the way a line, figure, or solid is shown on a given plane (= a flat or level surface that continues in all directions): ",
                            "examples": [
                                "V will denote a flat projective scheme over B. ",
                                "They questioned the dominance of perspective as a projective representation of proposed architecture."
                            ]
                        },
                        {
                            "explanation": "relating to or involving projection (= the act of encouraging someone to express their feelings and desires): ",
                            "examples": [
                                "Projective techniques are based on Freudian theory. ",
                                "The illustrations were specifically designed to be projective in nature."
                            ]
                        },
                        {
                            "explanation": "relating to or involving projection (= the act of imagining that someone else feels a particular emotion or wants something when in fact it is you who feels this way): ",
                            "examples": [
                                "The more one partner complains about the behaviour of the other, the more likely it is that a projective system is in operation. ",
                                "We noted his projective criticism of the project and its contributors."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}