{
    "word": "propose",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "prəˈpəʊz"
                            ],
                            "us": [
                                "prəˈpoʊz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to offer or suggest a possible plan or action for other people to consider: ",
                            "examples": [
                                "I propose that we wait until the budget has been announced before committing ourselves to any expenditure.",
                                "He proposed dealing directly with the suppliers.",
                                "She proposed a boycott of the meeting.",
                                "He proposed a motion that the chairman resign."
                            ]
                        },
                        {
                            "explanation": "to suggest someone for a position in, or as a member of, an organization: ",
                            "examples": [
                                "To be nominated for union president you need one person to propose you and another to second you."
                            ]
                        },
                        {
                            "explanation": "to ask someone to marry you: ",
                            "examples": [
                                "I remember the night your father proposed to me."
                            ]
                        },
                        {
                            "explanation": "to ask people at a formal social occasion to express their good wishes or respect for someone by holding up their glasses, usually of alcohol, at the same time and then drinking from them: ",
                            "examples": [
                                "Now, if you'd all please raise your glasses, I'd like to propose a toast to the bride and groom."
                            ]
                        },
                        {
                            "explanation": "to intend to do something: ",
                            "examples": [
                                "How do you propose to complete the project in such a short time?",
                                "How do you propose tackling this problem?",
                                "I do not propose to reveal details at this stage.",
                                "What we are proposing is a radical change in approach."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}