{
    "word": "proportion",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "prəˈpɔː.ʃən"
                            ],
                            "us": [
                                "prəˈpɔːr.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the number or amount of a group or part of something when compared to the whole: ",
                            "examples": [
                                "Children make up a large proportion of the world's population.",
                                "A higher proportion of men are willing to share household responsibilities than used to be the case.",
                                "The report shows that poor families spend a larger proportion of their income on food."
                            ]
                        },
                        {
                            "explanation": "the number, amount, or level of one thing when compared to another: ",
                            "examples": [
                                "The proportion of women to men at my college was about five to one.",
                                "The chart shows how weight increases in proportion to height (= the increase in weight depends on the increase in height).",
                                "The level of crime in an area is almost always in direct proportion to the number of unemployed."
                            ]
                        },
                        {
                            "explanation": "the correct or most attractive relationship between the size of different parts of the same thing or between one thing and another: ",
                            "examples": [
                                "Your legs are very much in proportion to (= the right size for) the rest of your body.",
                                "His feet seem very small in proportion to his body.",
                                "My head was much nearer the camera than the rest of me so I'm all out of proportion."
                            ]
                        },
                        {
                            "explanation": "the size, shape, or level of something: ",
                            "examples": [
                                "a building of elegant proportions"
                            ]
                        },
                        {
                            "explanation": "used in a number of phrases to mean importance and seriousness: ",
                            "examples": [
                                "You have to keep a sense of proportion (= the ability to understand what is important and what is not).",
                                "I think a certain amount of worry about work is very natural, but you've got to keep it in proportion (= judge correctly its seriousness)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}