{
    "word": "public",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpʌb.lɪk"
                            ],
                            "us": [
                                "ˈpʌb.lɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to or involving people in general, rather than being limited to a particular group of people: ",
                            "examples": [
                                "Public opinion (= the opinions of most people) has turned against him.",
                                "Is it really in the public interest (= useful to people) to publish this information?",
                                "We need to increase public awareness of the disease.",
                                "Peaceful demonstrations that do not cause a public nuisance (= do not harm other people) are a fundamental right in any truly democratic country.",
                                "The government has had to bow to public pressure on the issue.",
                                "The information only became public after his death.",
                                "The results will not be made public (= told to everyone) until tomorrow."
                            ]
                        },
                        {
                            "explanation": "provided by the government from taxes to be available to everyone: ",
                            "examples": [
                                "public funds/services/spending",
                                "public buildings",
                                "a public library",
                                "He is unlikely to hold public office (= have an important job in national or local government)."
                            ]
                        },
                        {
                            "explanation": "A public place is one where a lot of people are: ",
                            "examples": [
                                "It's too public here - let's go back to my room to talk."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpʌb.lɪk"
                            ],
                            "us": [
                                "ˈpʌb.lɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "all ordinary people: ",
                            "examples": [
                                "The public has a right to know about this.",
                                "The palace and its grounds are open to the public (= people can visit) during the summer months.",
                                "When will the product be available to the general public (= all ordinary people)?",
                                "Members of the public were asked about their shopping habits."
                            ]
                        },
                        {
                            "explanation": "the group of people who are involved with you or your organization, especially in a business relationship: ",
                            "examples": [
                                "Newspapers publish these outrageous stories because they know what their public wants."
                            ]
                        },
                        {
                            "explanation": "in a place where people can see you: ",
                            "examples": [
                                "I'd never behave like that in public."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}