{
    "word": "puffer",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpʌf.ər"
                            ],
                            "us": [
                                "ˈpʌf.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small device that you use in order to inhale (= take in by breathing) particular medicines: ",
                            "examples": [
                                "His bedside drawers were filled with empty asthma puffers.",
                                "I came home from the chemists with a carrier bag of steroid puffers."
                            ]
                        },
                        {
                            "explanation": "a device or machine that blows out air, gas, powder, etc. in short bursts: ",
                            "examples": [
                                "Treat all cracks and crevices and entry points using the cockroach puffer, remembering to dust lightly and thoroughly.",
                                "About 95 puffers, which use quick blasts of air to test for traces of explosive substances, are in use at the nation's airports."
                            ]
                        },
                        {
                            "explanation": "a steamboat (= a boat that is driven by steam): ",
                            "examples": [
                                "The puffer was lying over slightly to one side and her mast lay at an awkward, unnatural angle.",
                                "The last Clyde puffer to have lugged cargo around the West coast is going home."
                            ]
                        },
                        {
                            "explanation": "a steam train (= a train pulled by an engine powered by steam): ",
                            "examples": [
                                "The venerable puffer will make three excursions a day between York and Scarborough from 20 July to 31 August."
                            ]
                        },
                        {
                            "explanation": "someone who smokes: ",
                            "examples": [
                                "Most bars provide an outside area for the puffers to puff in.",
                                "All but the most blinkered puffers among us will freely admit that smoking is a nasty habit."
                            ]
                        },
                        {
                            "explanation": "someone who breathes out heavily when they run, walk, or do exercise : ",
                            "examples": [
                                "Then, after a few months, I started to overtake the occasional huffer and puffer."
                            ]
                        },
                        {
                            "explanation": "a warm coat filled with thick soft material sewn into sections, especially one in which the sections look as though they are puffed up (= full of air): ",
                            "examples": [
                                "She was wearing a puffer with a fur-lined hood."
                            ]
                        },
                        {
                            "explanation": "a type of fish, usually found in warm or tropical seas, that can make itself larger by filling its stomach with water or air: ",
                            "examples": [
                                "Among other fish taken were a few small flounders, an occasional mackerel, and even sculpins and puffers."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}