{
    "word": "pulling",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \npull ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pʊl"
                            ],
                            "us": [
                                "pʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move something towards yourself, sometimes with great physical effort: ",
                            "examples": [
                                "Could you help me move this bookcase over there? You pull and I'll push.",
                                "He pulled the chair away from the desk.",
                                "He pulled the heavy box across the floor to the door.",
                                "He pulled the door open.",
                                "The car was pulling a caravan.",
                                "The sun was so strong we had to pull down the blinds.",
                                "She pulled out the drawer."
                            ]
                        },
                        {
                            "explanation": "to take something out of or away from a place, especially using physical effort: ",
                            "examples": [
                                "He pulled off his sweater.",
                                "The dentist pulled both teeth out.",
                                "I spent the morning pulling up the weeds in the flowerbeds."
                            ]
                        },
                        {
                            "explanation": "to remove or stop something that was going to be published or broadcast, especially because it is found to be offensive or not accurate: ",
                            "examples": [
                                "When officials realized the cultural gaffe, the company pulled the ad and apologized."
                            ]
                        },
                        {
                            "explanation": "to move in the stated direction: ",
                            "examples": [
                                "During the last lap of the race one of the runners began to pull ahead.",
                                "We waved as the train pulled out of the station.",
                                "Our armies are pulling back on all fronts."
                            ]
                        },
                        {
                            "explanation": "to take hold of something and use effort to move your body forwards or up: ",
                            "examples": [
                                "She pulled herself up the stairs, holding onto the rail.",
                                "He put his hands on the side of the pool and pulled himself out of the water."
                            ]
                        },
                        {
                            "explanation": "to attract a person or people: ",
                            "examples": [
                                "The show has certainly pulled (in) the crowds."
                            ]
                        },
                        {
                            "explanation": "to succeed in starting a sexual relationship with someone: ",
                            "examples": [
                                "He certainly knows how to pull women.",
                                "Did Tracy pull at the nightclub last night?"
                            ]
                        },
                        {
                            "explanation": "to injure a muscle by stretching it too much: ",
                            "examples": [
                                "I pulled a muscle in my back lifting some drawers.",
                                "He pulled a hamstring."
                            ]
                        },
                        {
                            "explanation": "to perform a dishonest action: ",
                            "examples": [
                                "The gang that pulled the bank robbery were all arrested.",
                                "No one's gonna pull that kind of trick on me!"
                            ]
                        },
                        {
                            "explanation": "to get information from the internet, after asking or searching for it: ",
                            "examples": [
                                "Companies should encourage customers to pull information from their website, thus putting the customer in control."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}