{
    "word": "purging",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɜː.dʒɪŋ"
                            ],
                            "us": [
                                "ˈpɝː.dʒɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of getting rid of people from an organization because you do not agree with them : ",
                            "examples": [
                                "He then announced a large-scale purging of the federal police.",
                                "Power was smoothly transferred from one set of leaders to another without killings or purgings."
                            ]
                        },
                        {
                            "explanation": "the act of taking names off an official list, sometimes in a way that is not legal : ",
                            "examples": [
                                "The purging of the voters' roll appears to have disproportionately affected black voters."
                            ]
                        },
                        {
                            "explanation": "the act of getting rid of something unwanted, harmful, or evil: ",
                            "examples": [
                                "Dejunking involves a gradual purging of all the stuff you don't need.",
                                "He believes there are areas when the word of God must simply be applied and purging of evil effected.",
                                "Books often get tossed back in the car boot in those last-minute trailhead purgings to make your pack lighter."
                            ]
                        },
                        {
                            "explanation": "the act of getting rid of food from your body, for example in order to stop yourself gaining weight, either by making yourself vomit or by using laxatives (= substances that make it easier for waste from the body to come out): ",
                            "examples": [
                                "Binging or purging may be ways of dealing with feelings of trauma."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}