{
    "word": "purge",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pɜːdʒ"
                            ],
                            "us": [
                                "pɝːdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to get rid of people from an organization because you do not agree with them: ",
                            "examples": [
                                "Party leaders have undertaken to purge the party of extremists.",
                                "Hard-liners are expected to be purged from the administration."
                            ]
                        },
                        {
                            "explanation": "to take names off an official list, sometimes in a way that is not legal: ",
                            "examples": [
                                "Because they have not been purging the list of old names and addresses, there may be thousands of duplicate names.",
                                "The names of thousands of minority voters were purged from the electoral rolls in the run-up to the election. "
                            ]
                        },
                        {
                            "explanation": "to get rid of something unwanted, harmful, or evil: ",
                            "examples": [
                                "Roman Catholics go to confession to purge their souls/themselves (from/of sin).",
                                "The new state governor has promised to purge the police force of corruption."
                            ]
                        },
                        {
                            "explanation": "to get rid of food from your body, for example in order to stop yourself gaining weight, either by making yourself vomit or by using laxatives (= substances that make it easier for waste from the bowels to come out): ",
                            "examples": [
                                "Girls who had never heard the terms anorexia or bulimia still starved and purged.",
                                "People with bulimia feel trapped in a cycle of binge-eating then purging the body of the unwanted food."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pɜːdʒ"
                            ],
                            "us": [
                                "pɝːdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of getting rid of people from an organization because you do not agree with them: ",
                            "examples": [
                                "Between 1934 and 1938, Stalin mounted a massive purge of the Communist Party, the government and the armed forces in the Soviet Union."
                            ]
                        },
                        {
                            "explanation": "the act of taking names off an official list, sometimes in a way that is not legal: ",
                            "examples": [
                                "The groups claim tens of thousands of voters may have been affected by the purges."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}