{
    "word": "purple",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈpɜː.pəl"
                            ],
                            "us": [
                                "ˈpɝː.pəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "of a dark reddish-blue colour: ",
                            "examples": [
                                "purple plums",
                                "a dark purple bruise"
                            ]
                        },
                        {
                            "explanation": "dark red in the face because of anger: ",
                            "examples": [
                                "By this point, and purple with rage, all I could think of saying was, \"I think we'll have to agree to disagree.\""
                            ]
                        },
                        {
                            "explanation": "a period of success: ",
                            "examples": [
                                "Often a company will go through a purple patch of achievement because of a talented director at the helm.",
                                "United could have extended their lead during a purple patch following the goal."
                            ]
                        },
                        {
                            "explanation": "used to describe a piece of writing that is complicated or sounds false because the writer has tried too hard to make the style interesting: ",
                            "examples": [
                                "Despite occasional patches of purple prose, the book is mostly clear and incisive.",
                                "The prose is quite purple, filled with ridiculous adjectives and unnecessary descriptions.",
                                "She shuns the purple passage in favour of concise, striking images."
                            ]
                        },
                        {
                            "explanation": "used to describe an area where a similar number of people usually vote Republican and Democrat, so that a small number of votes can change the result in elections: ",
                            "examples": [
                                "This group of voters has potential to tip the balance in two or more purple states.",
                                "She has to run against a Democrat in a district that’s mighty purple."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɜː.pəl"
                            ],
                            "us": [
                                "ˈpɝː.pəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a dark reddish-blue colour: ",
                            "examples": [
                                "Purple is my favourite colour.",
                                "The evening sky was full of purples and reds."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}