{
    "word": "purpose",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈpɜː.pəs"
                            ],
                            "us": [
                                "ˈpɝː.pəs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "why you do something or why something exists: ",
                            "examples": [
                                "The purpose of the research is to try to find out more about the causes of the disease.",
                                "His only purpose in life seems to be to enjoy himself.",
                                "Her main/primary purpose in suing the newspaper for libel was to clear her name.",
                                "I came to Brighton for/with the express purpose of seeing you.",
                                "Letters whose sole purpose is to make a political point will not be published.",
                                "She had the operation entirely for cosmetic purposes.",
                                "a multi-purpose kitchen knife",
                                "I can see no useful purpose in continuing this conversation.",
                                "All my efforts were to no purpose (= failed).",
                                "He gave her a sum of money which she used to good purpose (= well)."
                            ]
                        },
                        {
                            "explanation": "If you do something on purpose, you do it intentionally, not by accident: ",
                            "examples": [
                                "I didn't do it on purpose - it was an accident."
                            ]
                        },
                        {
                            "explanation": "determination or a feeling of having a reason for what you do: ",
                            "examples": [
                                "I've always admired her for her strength of purpose.",
                                "Parenthood would give him a sense of purpose."
                            ]
                        },
                        {
                            "explanation": "a need: ",
                            "examples": [
                                "We haven't yet managed to find new premises that are suitable for our purposes.",
                                "The fabric I bought isn't exactly what I wanted, but it will serve my purposes (= fulfil my needs)."
                            ]
                        },
                        {
                            "explanation": "to have a use: ",
                            "examples": [
                                "These small village shops serve a very useful purpose."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}