{
    "word": "pursue",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pəˈsjuː"
                            ],
                            "us": [
                                "pɚˈsuː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to follow someone or something, usually to try to catch him, her, or it: ",
                            "examples": [
                                "The car was pursued by helicopters.",
                                "The hunters spent hours pursuing their prey.",
                                "He was killed by the driver of a stolen car who was being hotly pursued by the police."
                            ]
                        },
                        {
                            "explanation": "to try very hard to persuade someone to accept a job: ",
                            "examples": [
                                "The company has been pursuing Holton for some time, but so far he has rejected all their offers."
                            ]
                        },
                        {
                            "explanation": "to try to discover information about a subject: ",
                            "examples": [
                                "We will not be pursuing this matter any further.",
                                "The police are currently pursuing several lines of inquiry into the case.",
                                "I don't think this idea is worth pursuing any further.",
                                "The press has pursued this story relentlessly."
                            ]
                        },
                        {
                            "explanation": "to try very hard to persuade someone to have a relationship with you: ",
                            "examples": [
                                "He's been pursuing her for months and yet she's so clearly not interested."
                            ]
                        },
                        {
                            "explanation": "If you pursue a plan, activity, or situation, you try to do it or achieve it, usually over a long period of time: ",
                            "examples": [
                                "He decided to pursue a career in television.",
                                "We need to decide soon what marketing strategy we should pursue for these new products.",
                                "Michael Evans is leaving the company to pursue his own business interests.",
                                "She is ruthless in pursuing her goals."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}