{
    "word": "push",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pʊʃ"
                            ],
                            "us": [
                                "pʊʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use physical pressure or force, especially with your hands, in order to move something into a different position, usually one that is further away from you: ",
                            "examples": [
                                "Can you help me move this table? You push and I'll pull.",
                                "The window sticks - you have to push hard to open it.",
                                "He helped me push my car off the road.",
                                "He pushed his plate away from him, refusing to eat any more.",
                                "She pushed her hair out of her eyes.",
                                "I tried to push the door open but it was stuck.",
                                "It isn't clear whether he fell off the balcony or was pushed.",
                                "To turn the television on, you just push (= press) this button.",
                                "He pushed the money into my hand (= forcefully gave me the money), saying, \"Please take it.\"",
                                "We pushed the boat off from (= moved the boat forward by using pressure against) the river bank."
                            ]
                        },
                        {
                            "explanation": "to move forcefully, especially in order to cause someone or something that is in your way to move, so that you can go through or past them: ",
                            "examples": [
                                "Stop pushing - wait your turn.",
                                "She pushed through the crowd.",
                                "I'm sorry - I didn't mean to push in front of you.",
                                "The celebrities pushed past the waiting journalists, refusing to speak to them.",
                                "In the final lap of the race, he managed to push (= move strongly) ahead.",
                                "Weeds push (= grow strongly) up through the cracks in the concrete.",
                                "They pushed (= forcefully made) their way to the front."
                            ]
                        },
                        {
                            "explanation": "When an army pushes in a particular direction, it moves forward in that direction: ",
                            "examples": [
                                "The invading troops have pushed further into the north of the country."
                            ]
                        },
                        {
                            "explanation": "to forcefully persuade or direct someone to do or achieve something: ",
                            "examples": [
                                "Her parents pushed her into marrying him.",
                                "The school manages to push most of its students through their exams.",
                                "If we want an answer from them by Friday, I think we're going to have to push them for it.",
                                "We had to push them to accept our terms, but they finally agreed to the deal.",
                                "You'll never be successful if you don't push yourself (= work) harder."
                            ]
                        },
                        {
                            "explanation": "to advertise something repeatedly in order to increase its sales: ",
                            "examples": [
                                "They're really pushing their new car."
                            ]
                        },
                        {
                            "explanation": "to sell illegal drugs: ",
                            "examples": [
                                "He was arrested for pushing drugs to schoolchildren."
                            ]
                        },
                        {
                            "explanation": "to send information over the internet without receiving a request for it first",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "pʊʃ"
                            ],
                            "us": [
                                "pʊʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of moving someone or something by pressing them with your hands or body: ",
                            "examples": [
                                "Get on the swing and I'll give you a push.",
                                "I gave the door a hard push, but it still wouldn't open.",
                                "I can order all these goods at the push of a button (= by pushing a button)."
                            ]
                        },
                        {
                            "explanation": "a strong movement towards a place: ",
                            "examples": [
                                "The army is continuing its push (= advance) towards the capital."
                            ]
                        },
                        {
                            "explanation": "a determined attempt to get an advantage over other companies in business: ",
                            "examples": [
                                "The company plans to make a big push into the European market next spring.",
                                "The hotel is making a major push to attract customers."
                            ]
                        },
                        {
                            "explanation": "encouragement to make someone do something: ",
                            "examples": [
                                "My mother had always wanted to learn how to paint - she just needed a gentle push."
                            ]
                        },
                        {
                            "explanation": "a lot of advertising: ",
                            "examples": [
                                "This film is unlikely to attract large audiences unless it gets/it is given a big push in the media."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}