{
    "word": "put",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "pʊt"
                            ],
                            "us": [
                                "pʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move something or someone into the stated place, position, or direction: ",
                            "examples": [
                                "Where have you put the keys?",
                                "Put your clothes in the cupboard.",
                                "He put salt into the sugar bowl by mistake.",
                                "She put her bag on the table.",
                                "She put her hands over her eyes.",
                                "I put my arm around him to comfort him.",
                                "We always put the cat out (= outside the house) at night.",
                                "Every night, she puts out her clothes (= takes them from where they are kept so that they are ready) for the next day.",
                                "If we put the chairs a little closer together (= move them nearer to each other), we should be able to get another one around the table.",
                                "If you put together (= mix) yellow and blue paint you get green.",
                                "The prisoners were put up against (= moved into a position next to) a wall and shot."
                            ]
                        },
                        {
                            "explanation": "to write something: ",
                            "examples": [
                                "She puts her name in all her books.",
                                "Put an X next to the name of the candidate you want to vote for.",
                                "I've put the date of the party down in my diary.",
                                "He asked me to put my objections (down) on paper.",
                                "It was an interesting article but I wish they'd put in more information (= included more information) about the costs."
                            ]
                        },
                        {
                            "explanation": "to express something in words: ",
                            "examples": [
                                "She wanted to tell him that she didn't want to see him any more, but she didn't know how to put it.",
                                "We're going to have to work very hard, but as Chris so succinctly put it, there's no gain without pain.",
                                "Why do you always have to put things so crudely?",
                                "Has everyone had a chance to put their point of view?"
                            ]
                        },
                        {
                            "explanation": "to say what you think the price or value of something is: ",
                            "examples": [
                                "The agent has put a price of £720,000 on our house."
                            ]
                        },
                        {
                            "explanation": "used to describe the way you are expressing an event or opinion: ",
                            "examples": [
                                "To put it bluntly, you're going to have to improve."
                            ]
                        },
                        {
                            "explanation": "to cause someone or something to be in the stated condition or situation: ",
                            "examples": [
                                "Are you prepared to put your children at risk?",
                                "This puts me in a very difficult position.",
                                "What has put you in such a bad mood?",
                                "This election is a chance for the country to put a new government in (= elect a new government).",
                                "It's broken into so many pieces, it'll be impossible to put it back together again (= repair it).",
                                "Let's give her the chance to put her ideas into practice.",
                                "The terrorists were put on trial (= their case was judged in a court of law) six years after the bombing.",
                                "Wilson was put out (of the competition) (= was defeated) by Clarke in the second round.",
                                "How much did it cost to have the television put right (= repaired)?",
                                "I originally thought he was Australian, but he soon put me straight (= corrected me) and explained he was from New Zealand.",
                                "I know she's gone forever, but I just can't put her out of my mind/head (= forget her).",
                                "He's putting me under pressure to change my mind."
                            ]
                        },
                        {
                            "explanation": "to bring into operation; to cause to be used: ",
                            "examples": [
                                "When the drugs failed to cure her, she put her faith/trust in herbal medicine.",
                                "The school puts a lot of emphasis on teaching children to read and write.",
                                "He's putting pressure on me to change my mind.",
                                "The events of the last few weeks have put a real strain on him.",
                                "In the story of Sleeping Beauty, the wicked fairy puts a spell/curse (US hex) on the baby princess.",
                                "You know it was your fault, so don't try to put the blame on anyone else.",
                                "The government is expected to put a new tax on cars.",
                                "The new tax will put 15 percent on fuel prices (= increase them by 15 percent).",
                                "She's never put a bet/money on a race before.",
                                "He put everything he had into (= he used all his abilities and strength in) the final game.",
                                "The more you put into something, the more you get out of it (= the harder you work at something, the more satisfying it is).",
                                "They put (= invested) a lot of money into the family business.",
                                "The president is trying to put through (= bring into operation) reforms of the country's economic system.",
                                "They've got to put an end to/a stop to their fighting (= to stop fighting)."
                            ]
                        },
                        {
                            "explanation": "to judge something or someone in comparison with other similar things or people: ",
                            "examples": [
                                "I'd put him among the top six tennis players of all time.",
                                "Drama critics have put her on a level/par with the great Shakespearean actresses.",
                                "He always puts the needs of his family first/last (= they are the most/least important thing to him)."
                            ]
                        },
                        {
                            "explanation": "to travel in a boat or ship across the sea: ",
                            "examples": [
                                "Our mast broke, so we had to put about (= turn round) and return to port.",
                                "The ship put in at (= stopped at) Cape Town for fresh supplies.",
                                "We put to sea (= began our journey by sea) at dawn."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}