{
    "word": "qualifying",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nqualify ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkwɒl.ɪ.faɪ"
                            ],
                            "us": [
                                "ˈkwɑː.lə.faɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to successfully finish a training course so that you are able to do a job; to have or achieve the necessary skills, etc.: ",
                            "examples": [
                                "She hopes to qualify (as a lawyer) at the end of the year.",
                                "This course qualifies you to teach in any secondary school."
                            ]
                        },
                        {
                            "explanation": "to have the legal right to have or do something because of the situation you are in, or to cause someone to have such a right: ",
                            "examples": [
                                "She doesn't qualify for maternity leave because she hasn't been in her job long enough.",
                                "To qualify for the competition you need to be over 18.",
                                "Being a single parent qualifies you for extra benefits.",
                                "He thinks the fact that he's worked here longer than the rest of us qualifies him (= gives him the right) to tell us all what to do."
                            ]
                        },
                        {
                            "explanation": "to succeed in getting into a competition: ",
                            "examples": [
                                "Nigeria was the first team to qualify for the World Cup.",
                                "England has to win tonight's qualifying match to advance to the next round of the competition.",
                                "Our goal has always been to reach the qualifying rounds of the Champions League."
                            ]
                        },
                        {
                            "explanation": "to limit the strength or meaning of a statement: ",
                            "examples": [
                                "I'd like to qualify my criticisms of the school's failings, by adding that it's a very happy place."
                            ]
                        },
                        {
                            "explanation": "In grammar, a word or phrase that qualifies another word or phrase limits its meaning and makes it less general: ",
                            "examples": [
                                "In the sentence \"He walked quickly along the road\", \"quickly\" and \"along the road\" qualify \"walked\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}