{
    "word": "quarter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkwɔː.tər"
                            ],
                            "us": [
                                "ˈkwɔːr.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "one of four equal or almost equal parts of something; ¼: ",
                            "examples": [
                                "He cut the orange into quarters.",
                                "Under a quarter of people questioned said that they were happily married.",
                                "My house is situated a mile and three-quarters from here."
                            ]
                        },
                        {
                            "explanation": "15 minutes: ",
                            "examples": [
                                "I waited a quarter of an hour and then went home."
                            ]
                        },
                        {
                            "explanation": "15 minutes before two, three, etc.: ",
                            "examples": [
                                "It was a quarter to six when I left."
                            ]
                        },
                        {
                            "explanation": "15 minutes after two, three, etc.: ",
                            "examples": [
                                "I'll meet you at a quarter past five."
                            ]
                        },
                        {
                            "explanation": "one of four periods of time into which a year is divided for financial calculations, such as for profits or taxes: ",
                            "examples": [
                                "There was a fall in unemployment in the second quarter of the year.",
                                "I get an electricity bill every quarter."
                            ]
                        },
                        {
                            "explanation": "one of four periods in a game of American football and other ball sports",
                            "examples": []
                        },
                        {
                            "explanation": "in the US and Canada, a coin worth 25 cents",
                            "examples": []
                        },
                        {
                            "explanation": "an area of a town where a particular group of people live or work or where a particular activity happens: ",
                            "examples": [
                                "This is the bustling commercial quarter of the city."
                            ]
                        },
                        {
                            "explanation": "one or more people who provide help, information, or a particular reaction to something but who are not usually named: ",
                            "examples": [
                                "Help came from an unexpected quarter.",
                                "There is a feeling in certain/some quarters (= some people consider) that a change is needed."
                            ]
                        },
                        {
                            "explanation": "a room or house that has been provided, especially for servants or soldiers and their families, to live in: ",
                            "examples": [
                                "The army's married quarters are just outside the town."
                            ]
                        },
                        {
                            "explanation": "a house or other place to live that has been provided by a company for an employee",
                            "examples": []
                        },
                        {
                            "explanation": "the fact of being kind towards or forgiving an enemy or opponent: ",
                            "examples": [
                                "We can expect no quarter from our enemies.",
                                "He gave no quarter to anyone that disappointed him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkwɔː.tər"
                            ],
                            "us": [
                                "ˈkwɔːr.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut something into four parts",
                            "examples": []
                        },
                        {
                            "explanation": "to send someone, especially soldiers, to live in a place: ",
                            "examples": [
                                "The soldiers were quartered with (= they lived with) local people during the war."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}