{
    "word": "quarantine",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈkwɒr.ən.tiːn"
                            ],
                            "us": [
                                "ˈkwɔːr.ən.tiːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a specific period of time in which a person or animal that has a disease, or may have one, must stay or be kept away from others in order to prevent the spread of the disease: ",
                            "examples": [
                                "The doctor said I could go home as long as I agreed to stay in quarantine for at least seven days.",
                                "Owners risk having to leave their pets abroad or put them in quarantine if they fail to follow the rules.",
                                "The government announced mandatory quarantines for high-risk travellers returning from countries with Ebola outbreaks."
                            ]
                        },
                        {
                            "explanation": "a general period of time in which people are not allowed to leave their homes or travel freely, so that they do not catch or spread a disease: ",
                            "examples": [
                                "I’ve been doing a lot of baking during quarantine.",
                                "The country has been hit hard, with many people under quarantine and food supplies scarce.",
                                "The couple created a podcast to showcase their quarantine life while raising funds for people affected by the pandemic."
                            ]
                        },
                        {
                            "explanation": "a period of time in which something such as a product or plant that is infected or poisonous, or that contains substances that could be dangerous, is kept in a place where it cannot harm anyone or anything until it is no longer dangerous or can be dealt with safely: ",
                            "examples": [
                                "Oregon has imposed an emergency quarantine on oak firewood from California to slow the spread of the fungus.",
                                "Please note that certain pharmaceutical items are subject to quarantine and customs restrictions in some countries. ",
                                "If a radiation alarm is confirmed for a shipment, Radiation Protection agents will order it to be put into quarantine. "
                            ]
                        },
                        {
                            "explanation": "a period of time in which people or animals are not allowed to enter or leave a particular area or building where some or all of those in it have been affected by a harmful substance or disease, until the danger of harming others has passed: ",
                            "examples": [
                                "Two farms north of the city were placed under quarantine due to an anthrax outbreak among livestock.",
                                "The office was put into a brief quarantine on Friday after an editor opened a Halloween card with a powdery substance.",
                                "Patients taking radioactive iodine must stay in quarantine in hospital for 24 hours to avoid exposing other people to radiation."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈkwɒr.ən.tiːn"
                            ],
                            "us": [
                                "ˈkwɔːr.ən.tiːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to stay away from others for a period of time because you have a disease, or may have one, in order to prevent the spread of the disease: ",
                            "examples": [
                                "All international arrivals, regardless of where they are from, must quarantine upon their arrival.",
                                "The government is looking into how long those who have been exposed to COVID-19 need to quarantine.",
                                "A friend of mine had symptoms but instead of quarantining himself he decided to carry on as normal. "
                            ]
                        },
                        {
                            "explanation": "to keep a person or animal away from others because they have a disease, or may have one, in order to prevent the spread of the disease: ",
                            "examples": [
                                "It's not uncommon to quarantine passengers after a widespread illness appears to be present on board a plane.",
                                "The dogs are being quarantined for 10 days because it was not clear whether they are up to date on rabies shots.",
                                "Two weeks ago, authorities quarantined 1,222 cattle that had eaten feed containing cattle byproducts."
                            ]
                        },
                        {
                            "explanation": "to keep something such as a product or plant that is infected or poisonous, or that contains substances that could be dangerous, in a place where it cannot harm anyone or anything until it is no longer dangerous or can be dealt with safely: ",
                            "examples": [
                                "If the traps capture a certain number of flies in a particular area, fruit from that area is quarantined until the end of the season.",
                                "After a single bag of rice tested positive for melamine, the company decided to quarantine the entire shipment.",
                                "The items were quarantined after a reported exposure to asbestos"
                            ]
                        },
                        {
                            "explanation": "to prevent people or animals from entering or leaving a particular area or building where some or all of those in it have been affected by a harmful substance or disease, until the danger of harming others has passed: ",
                            "examples": [
                                "Ranches with confirmed cases of foot-and-mouth disease are quarantined until at least 10 days after all livestock are vaccinated.",
                                "The hotel has been quarantined due to an outbreak of legionnaire’s disease"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}