{
    "word": "queer",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "kwɪər"
                            ],
                            "us": [
                                "kwɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having or relating to a gender identity or a sexuality that does not fit society's traditional ideas about gender or sexuality: ",
                            "examples": [
                                "He says they use the word \"queer\" to include anyone who wants to be included (gay, bi, trans, whatever).",
                                "They strongly identify with queer culture."
                            ]
                        },
                        {
                            "explanation": "strange, unusual, or not expected: ",
                            "examples": [
                                "What a queer thing to say!",
                                "I'm feeling rather queer (= ill), may I sit down?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "kwɪər"
                            ],
                            "us": [
                                "kwɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person whose gender identity or sexuality does not fit society's traditional ideas about gender or sexuality: ",
                            "examples": [
                                "Critiques of mainstream queer representation from trans people and queers of colour played an important role in improving representation."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "kwɪər"
                            ],
                            "us": [
                                "kwɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change something so that it does not relate only to one gender, either male or female, or so that it no longer fits traditional ideas about gender or sexuality: ",
                            "examples": [
                                "Teenage boys with Instagram accounts are queering the cosmetics industry."
                            ]
                        },
                        {
                            "explanation": "to spoil a chance or an opportunity for someone, often intentionally: ",
                            "examples": [
                                "If she asks Dan for a pay rise before I do, it will probably queer my pitch.",
                                "She'd accused him of queering her pitch.",
                                "I certainly had no intention of queering his pitch.",
                                "I'm quite sure you didn't mean to queer my pitch.",
                                "I suspect he thinks I tried to queer his pitch, which I assuredly did not. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}