{
    "word": "race",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "reɪs"
                            ],
                            "us": [
                                "reɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a competition in which all the competitors try to be the fastest and to finish first: ",
                            "examples": [
                                "Do you know who won/lost the race?",
                                "Let's have a swimming race.",
                                "They're taking part in a race to the top of Mont Blanc."
                            ]
                        },
                        {
                            "explanation": "an attempt to be the first to do or to get something: ",
                            "examples": [
                                "Kieran and Andrew are in a race for promotion.",
                                "Three newspapers are involved in a race to publish the story.",
                                "Another candidate has now entered the presidential race (= the attempt to be elected as president).",
                                "Finishing this project by December is going to be a race against time/the clock (= an attempt to finish fast within a time limit)."
                            ]
                        },
                        {
                            "explanation": "a series of horse races in a particular place on one day: ",
                            "examples": [
                                "He often has a day at the races."
                            ]
                        },
                        {
                            "explanation": "one of the main groups to which people are often considered to belong, based on physical characteristics that they are perceived to share such as skin colour, eye shape, etc.: ",
                            "examples": [
                                "People of many different races were living side by side."
                            ]
                        },
                        {
                            "explanation": "the idea that people can be divided into different groups based on physical characteristics that they are perceived to share such as skin colour, eye shape, etc., or the dividing of people in this way: ",
                            "examples": [
                                "Discrimination on grounds of race will not be tolerated.",
                                "What they don't realize is that these issues transcend (= rise above) race. Anyone can be affected. "
                            ]
                        },
                        {
                            "explanation": "a group of people who share the same language, history, characteristics, etc.: ",
                            "examples": [
                                "The British are an island race."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "reɪs"
                            ],
                            "us": [
                                "reɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) compete in a race: ",
                            "examples": [
                                "He has been racing for over ten years.",
                                "I used to race (against) him when we were boys.",
                                "He's racing three of his dogs on Saturday."
                            ]
                        },
                        {
                            "explanation": "to move or go fast: ",
                            "examples": [
                                "He raced down the street.",
                                "The ambulance raced (= quickly took) the injured to a nearby hospital.",
                                "The summer seems to have raced by (= passed very quickly).",
                                "He raced the car engine (= made it work faster than it needed to) as he sat impatiently at the traffic lights."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}