{
    "word": "rainbow",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈreɪn.bəʊ"
                            ],
                            "us": [
                                "ˈreɪn.boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an arch (= curved shape) of different colours seen in the sky when rain is falling and the sun is shining: ",
                            "examples": [
                                "The sun came out and we saw a rainbow.",
                                "The tropical butterfly's wings were shimmering with all the colours of the rainbow."
                            ]
                        },
                        {
                            "explanation": "the effect seen when white light separates into its different colours : ",
                            "examples": [
                                "The prisms will cast rainbows on the walls.",
                                "A perfectly circular rainbow appeared in the spray as the children played in the water."
                            ]
                        },
                        {
                            "explanation": "a combination of different colours: ",
                            "examples": [
                                "Her dress was a rainbow of shimmering gold and mauve and tan and cerise.",
                                "The huge bruise went through a rainbow - scarlet, purple and yellow, green, black and blue - before it disappeared. "
                            ]
                        },
                        {
                            "explanation": "a combination of many different things: ",
                            "examples": [
                                "She spoke about a rainbow of topics.",
                                "Here there’s a whole rainbow of different courses to choose from."
                            ]
                        },
                        {
                            "explanation": "(used especially by people who go fishing) a rainbow trout (= a large fish with a reddish stripe along the side) : ",
                            "examples": [
                                "I caught a 2.5kg rainbow."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈreɪn.bəʊ"
                            ],
                            "us": [
                                "ˈreɪn.boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "bright and colourful, often with the colours arranged in stripes: ",
                            "examples": [
                                "I love your rainbow sweater!",
                                "She was wearing a rainbow wig.",
                                "The rainbow flag has become a symbol of the LGBT movement."
                            ]
                        },
                        {
                            "explanation": "involving or including people of different races: ",
                            "examples": [
                                "the rainbow nation of South Africa"
                            ]
                        },
                        {
                            "explanation": "involving or including people who have different political ideas, or who belong to different political parties: ",
                            "examples": [
                                "He did not rule out a rainbow coalition."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈreɪn.bəʊ"
                            ],
                            "us": [
                                "ˈreɪn.boʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the section of the Guides in the UK for girls aged around 4 to 7: ",
                            "examples": [
                                "Girlguiding UK is the governing body of Rainbows, Brownies, and Guides."
                            ]
                        },
                        {
                            "explanation": "a meeting of Rainbows: ",
                            "examples": [
                                "Dad will pick you up from Rainbows tonight."
                            ]
                        },
                        {
                            "explanation": "a girl who is a member of Rainbows: ",
                            "examples": [
                                "Thousands of Girl Guides, Brownies, and Rainbows attended the concert.",
                                "She has been with the Guide Association since the age of five when she was a Rainbow."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}