{
    "word": "rate",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "reɪt"
                            ],
                            "us": [
                                "reɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the speed at which something happens or changes, or the amount or number of times it happens or changes in a particular period: ",
                            "examples": [
                                "Although she's recovering from her illness, her rate of progress is quite slow.",
                                "I told my assistants to work at their own rate.",
                                "The taxi was going at a tremendous rate.",
                                "the growth/inflation/mortality/unemployment, etc. rate",
                                "The drug has a high success/failure rate."
                            ]
                        },
                        {
                            "explanation": "an amount or level of payment: ",
                            "examples": [
                                "We agreed a rate with the painter before he started work.",
                                "What's the going (= standard) rate for this type of work?",
                                "Do you pay your mortgage on a fixed or variable rate (= of interest)?"
                            ]
                        },
                        {
                            "explanation": "a local tax paid in Australia, and in Britain in the past, by the owners of houses and other buildings: ",
                            "examples": [
                                "I see rates are going up again."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "reɪt"
                            ],
                            "us": [
                                "reɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to judge the value or character of someone or something: ",
                            "examples": [
                                "How do you rate him as a football player?",
                                "She is rated very highly by the people she works for.",
                                "\"What do you think of her as a singer?\" \"I don't really rate her (= I do not think that she is very good).\"",
                                "I rate cars as one of the worst polluters of the environment.",
                                "On a scale of one to ten, I'd rate his book a five.",
                                "Traffic accidents are so frequent that they don't rate a mention (= are not considered to be worth reporting) in the newspaper unless a lot of people are killed."
                            ]
                        },
                        {
                            "explanation": "to be considered to be something of a particular quality: ",
                            "examples": [
                                "That rates as the worst film I've ever seen."
                            ]
                        },
                        {
                            "explanation": "In Britain in the past, a building was rated to decide how much local tax the owner should pay.",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -reɪt"
                            ],
                            "us": [
                                " -reɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used with words such as first, second, etc. to show how good you think something is: ",
                            "examples": [
                                "His suggestions are always first-rate (= very good).",
                                "This company produces second/third-rate (= not very good) goods."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}