{
    "word": "reach",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "riːtʃ"
                            ],
                            "us": [
                                "riːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrive at a place, especially after spending a long time or a lot of effort travelling: ",
                            "examples": [
                                "We won't reach Miami until five or six o'clock.",
                                "They finally reached the coast after five weeks sailing.",
                                "News of his accident had only just reached us."
                            ]
                        },
                        {
                            "explanation": "to make a decision, agreement, etc. about something: ",
                            "examples": [
                                "She reached the conclusion that there was no more she could do."
                            ]
                        },
                        {
                            "explanation": "to get to a particular level, especially a high one: ",
                            "examples": [
                                "The temperature is expected to reach 30°C today.",
                                "He's just reached the grand old age of 95.",
                                "I've reached the point where I'm not going to put up with her criticisms of me any more."
                            ]
                        },
                        {
                            "explanation": "to stretch out your arm in order to get or touch something: ",
                            "examples": [
                                "She's grown so tall that she can reach the door handle now.",
                                "He reached for the phone and knocked over a glass.",
                                "The child reached down/out/over and picked up the kitten.",
                                "He reached his hand out for the money.",
                                "Can you reach me (down) that book?"
                            ]
                        },
                        {
                            "explanation": "If an object reaches something, the top or bottom of it touches that thing: ",
                            "examples": [
                                "The ladder won't quite reach the top of the wall.",
                                "She was wearing a dress that reached (to) her ankles."
                            ]
                        },
                        {
                            "explanation": "to communicate with someone in a different place, especially by phone or email: ",
                            "examples": [
                                "I've been trying to reach you on the phone all day."
                            ]
                        },
                        {
                            "explanation": "to understand and communicate with someone: ",
                            "examples": [
                                "He's a strange child and his teachers find it difficult to reach him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "riːtʃ"
                            ],
                            "us": [
                                "riːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "Your reach is the distance within which you can stretch out your arm and touch something: ",
                            "examples": [
                                "I like to keep a notebook and pencil within (arm's) reach.",
                                "The top shelf is within/out of (his) reach.",
                                "Make sure that you keep all dangerous substances out of the reach of the children."
                            ]
                        },
                        {
                            "explanation": "the distance that can be travelled, especially easily: ",
                            "examples": [
                                "We live within (easy) reach of the station."
                            ]
                        },
                        {
                            "explanation": "the length of your arm when you stretch it out: ",
                            "examples": [
                                "You've got quite a long reach - can you get that box down from the top shelf for me?"
                            ]
                        },
                        {
                            "explanation": "an act of stretching out your arm: ",
                            "examples": [
                                "He made a sudden reach for his gun."
                            ]
                        },
                        {
                            "explanation": "the limit within which someone can achieve something: ",
                            "examples": [
                                "An expensive trip like that would be completely beyond/out of (my) reach (= I would not have enough money to pay for it).",
                                "After years of saving, the car was at last within (her) reach (= she had enough money to pay for it)."
                            ]
                        },
                        {
                            "explanation": "a part of a river or part of an area of land: ",
                            "examples": [
                                "The expedition set out for the upper reaches of the Amazon."
                            ]
                        },
                        {
                            "explanation": "the highest or lowest levels of an organization: ",
                            "examples": [
                                "The news has shocked the upper reaches of the government."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}