{
    "word": "reached",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nreach ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "riːtʃ"
                            ],
                            "us": [
                                "riːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrive at a place, especially after spending a long time or a lot of effort travelling: ",
                            "examples": [
                                "We won't reach Miami until five or six o'clock.",
                                "They finally reached the coast after five weeks sailing.",
                                "News of his accident had only just reached us."
                            ]
                        },
                        {
                            "explanation": "to make a decision, agreement, etc. about something: ",
                            "examples": [
                                "She reached the conclusion that there was no more she could do.",
                                "We'll inform you when a decision has been reached.",
                                "The jury took four days to reach a verdict."
                            ]
                        },
                        {
                            "explanation": "to get to a particular level, especially a high one: ",
                            "examples": [
                                "The temperature is expected to reach 30°C today.",
                                "He's just reached the grand old age of 95.",
                                "I've reached the point where I'm not going to put up with her criticisms of me any more."
                            ]
                        },
                        {
                            "explanation": "to stretch out your arm in order to get or touch something: ",
                            "examples": [
                                "She's grown so tall that she can reach the door handle now.",
                                "He reached for the phone and knocked over a glass.",
                                "The child reached down/out/over and picked up the kitten.",
                                "He reached his hand out for the money.",
                                "Can you reach me (down) that book?"
                            ]
                        },
                        {
                            "explanation": "If an object reaches something, the top or bottom of it touches that thing: ",
                            "examples": [
                                "The ladder won't quite reach the top of the wall.",
                                "She was wearing a dress that reached (to) her ankles."
                            ]
                        },
                        {
                            "explanation": "to communicate with someone in a different place, especially by phone or email: ",
                            "examples": [
                                "I've been trying to reach you on the phone all day."
                            ]
                        },
                        {
                            "explanation": "to understand and communicate with someone: ",
                            "examples": [
                                "He's a strange child and his teachers find it difficult to reach him."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}