{
    "word": "read",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "riːd"
                            ],
                            "us": [
                                "riːd"
                            ],
                            "uk_other_tense": [
                                "red"
                            ],
                            "us_other_tense": [
                                "red"
                            ],
                            "other_tense": "past tense and past participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to look at words or symbols and understand what they mean: ",
                            "examples": [
                                "He spent a pleasant afternoon reading (the newspaper/a book).",
                                "I read about the family's success in the local paper.",
                                "It was too dark to read our map and we took a wrong turning.",
                                "Can you read music?",
                                "Your handwriting is so untidy I can't read it.",
                                "I've read in the newspapers (that) there is a threat of war.",
                                "Put your plastic card in the slot, and the machine will read it and identify who you are.",
                                "Some children can read (= have learned the skill of reading) by the age of four."
                            ]
                        },
                        {
                            "explanation": "to say the words that are printed or written: ",
                            "examples": [
                                "She read (the poem) slowly and quietly.",
                                "Their teacher always reads them a story at the end of the day.",
                                "Children love to have stories read (aloud/out) to them."
                            ]
                        },
                        {
                            "explanation": "to understand and give a particular meaning to written information, a statement, a situation, etc.: ",
                            "examples": [
                                "She missed the train because she read 18.30 p.m. as 8.30 p.m. instead of 6.30 p.m. ",
                                "On page 19, for \"Blitish\", please read \"British\".",
                                "If I've read the situation correctly, we should have some agreement on the contract by the end of the week."
                            ]
                        },
                        {
                            "explanation": "How you read a piece of writing, or how it reads, is how it seems when you read it: ",
                            "examples": [
                                "The letter reads as if it was written in a hurry.",
                                "Her latest novel reads well (= is written in an attractive way)."
                            ]
                        },
                        {
                            "explanation": "(especially when communicating by radio), to hear and understand someone: ",
                            "examples": [
                                "Do you read me?",
                                "I read you loud and clear."
                            ]
                        },
                        {
                            "explanation": "to read aloud to someone until they go to sleep: ",
                            "examples": [
                                "Every night when I was a child my father used to read me to sleep."
                            ]
                        },
                        {
                            "explanation": "(of something written or printed) to have or give the stated information or meaning: ",
                            "examples": [
                                "The start of the US Constitution reads \"We, the people of the United States...\"",
                                "The thermometer is reading 40°C in the shade."
                            ]
                        },
                        {
                            "explanation": "to study at university or to study for a specialized qualification: ",
                            "examples": [
                                "They're both reading history at Cambridge.",
                                "She's reading for the Bar (= studying to become a type of lawyer called a barrister)."
                            ]
                        },
                        {
                            "explanation": "to make a judgment about something that you are looking at, especially about the distances and angles on the green in golf (= the flat area around the hole) or on another area of land: ",
                            "examples": [
                                "He wants to help golfers to read the greens more easily.",
                                "My putting wasn’t good today – I wasn’t reading the greens right. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "riːd"
                            ],
                            "us": [
                                "riːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of reading something: ",
                            "examples": [
                                "It's not brilliant but it's worth a read.",
                                "The book is a good/easy, etc. read.",
                                "Could I have a read of (= can I read) your newspaper?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}