{
    "word": "realist",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈrɪə.lɪst"
                            ],
                            "us": [
                                "ˈriː.ə.lɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who hopes for or accepts only what seems possible or likely, and does not hope for or expect more: ",
                            "examples": [
                                "I'm a realist - I knew there was no way I could win, so I swam for a good finish, for points."
                            ]
                        },
                        {
                            "explanation": "someone who believes that things continue to exist in the world even when no one is there to see them: ",
                            "examples": [
                                "Empiricists only allow observables to qualify as \"phenomena\", while realists do not impose any such restrictions.",
                                "Montague was one of the new realists who presented an alternative to the idealism then dominant in philosophy ."
                            ]
                        },
                        {
                            "explanation": "an artist, writer, etc. who represents life as it really is, rather than in an imagined way: ",
                            "examples": [
                                "More than being a realist, he considers himself a narrative painter, in that there's always an implied story in his paintings.",
                                "In 1895, The Lumière brothers, cinema's pioneer realists, shocked audiences with a film of a train appearing to come straight towards the spectators."
                            ]
                        },
                        {
                            "explanation": "someone who believes that politics is about political power, not doing the right thing or creating a better world: ",
                            "examples": [
                                "Kerry was often portrayed as a narrow realist uncomfortable with the moral elements of American power.",
                                "The realists approach foreign policy with a more pragmatic, less visionary point of view."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈrɪə.lɪst"
                            ],
                            "us": [
                                "ˈriː.ə.lɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in science and philosophy, believing that things continue to exist in the world even when no one is there to see them, or relating to this belief: ",
                            "examples": [
                                "An altogether different view of science has emerged from the realist school.",
                                "This philosophical thriller is based on the realist notion that two identical women co-exist in different countries after being born on the same day."
                            ]
                        },
                        {
                            "explanation": "representing life as it really is, rather than in an imagined way: ",
                            "examples": [
                                "Readers who like the clear lines of realist fiction may find the novel frustrating.",
                                "There are many talented realist painters competing for the public's attention."
                            ]
                        },
                        {
                            "explanation": "believing that politics is about political power, not doing the right thing or creating a better world, or relating to this belief : ",
                            "examples": [
                                "From the viewpoint of a realist politician like Bismarck, such dangerous enterprises had the potential to become political nightmares.",
                                "The realist view of power has been particularly influential in the United States among foreign-policy practitioners."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}