{
    "word": "reason",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈriː.zən"
                            ],
                            "us": [
                                "ˈriː.zən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the cause of an event or situation or something that provides an excuse or explanation: ",
                            "examples": [
                                "The reason for the disaster was engine failure, not human error.",
                                "The reason why grass is green was a mystery to the little boy.",
                                "The reason (that) I'm calling is to ask a favour.",
                                "The reason I walked out was because I was bored.",
                                "The police have (every good) reason to believe that he is guilty.",
                                "She was furious, and with reason (= with good cause).",
                                "For some reason/For reasons best known to himself (= for reasons no one else knows about) he's decided to leave his job."
                            ]
                        },
                        {
                            "explanation": "because of: ",
                            "examples": [
                                "He's always asked to these occasions by reason of his position."
                            ]
                        },
                        {
                            "explanation": "the ability of a healthy mind to think and make judgments, especially based on practical facts: ",
                            "examples": [
                                "We humans believe that we are the only animals to have the power of reason.",
                                "He lost his reason (= became mentally ill) when both his parents were killed in the crash."
                            ]
                        },
                        {
                            "explanation": "within the limits of what is acceptable and possible: ",
                            "examples": [
                                "We can wear anything we like to the office, within reason."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈriː.zən"
                            ],
                            "us": [
                                "ˈriː.zən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to try to understand and to make judgments based on practical facts: ",
                            "examples": [
                                "Newton reasoned (that) there must be a force such as gravity",
                                "I spent hours reasoning out the solution to the puzzle."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}