{
    "word": "record",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈkɔːd"
                            ],
                            "us": [
                                "rɪˈkɔːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to store sounds or moving pictures using electronic equipment so that they can be heard or seen later: ",
                            "examples": [
                                "Cliff Richard has recorded more number one hit songs than any other British pop star.",
                                "We recorded their wedding on video.",
                                "I tried to call her, but all I got was a recorded message saying that she was away for the weekend.",
                                "Was the concert live or was it recorded (= made before being broadcast)?"
                            ]
                        },
                        {
                            "explanation": "to keep information for the future, by writing it down or storing it on a computer: ",
                            "examples": [
                                "She records everything that happens to her in her diary.",
                                "Unemployment is likely to reach the highest total that has ever been recorded.",
                                "In his journal, Captain Scott recorded that he and his companions were weakened by lack of food.",
                                "The coroner recorded (= decided) a verdict of accidental death."
                            ]
                        },
                        {
                            "explanation": "If a device records a measurement, it shows that measurement: ",
                            "examples": [
                                "The thermometer recorded a temperature of 30 degrees Celsius."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈrek.ɔːd"
                            ],
                            "us": [
                                "ˈrek.ɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of information or a description of an event that is written on paper or stored on a computer: ",
                            "examples": [
                                "The weather centre keeps a record of the weather.",
                                "This summer has been the hottest on record (= the hottest summer known about)."
                            ]
                        },
                        {
                            "explanation": "information about someone or something that is stored by the police or by a doctor: ",
                            "examples": [
                                "A person's medical records are confidential.",
                                "He is well known to the police and has a long criminal record (= a list kept by the police of his previous crimes)."
                            ]
                        },
                        {
                            "explanation": "the facts that are known about a person or a company and the actions they have done in the past: ",
                            "examples": [
                                "I won't fly with an airline that has a bad safety record (= whose aircraft have often had accidents)."
                            ]
                        },
                        {
                            "explanation": "something that you say before you tell someone something important that you want them to remember: ",
                            "examples": [
                                "And, just for the record, we were never any more than good friends."
                            ]
                        },
                        {
                            "explanation": "a flat plastic disc on which music is recorded: ",
                            "examples": [
                                "Would you like to listen to some records?"
                            ]
                        },
                        {
                            "explanation": "a song or music that has been recorded and is available for the public to buy: ",
                            "examples": [
                                "The Beatles' first hit record was \"Love Me Do\"."
                            ]
                        },
                        {
                            "explanation": "the best or fastest ever done: ",
                            "examples": [
                                "He ran the 100 metres in 9.79 seconds and broke/smashed the world record.",
                                "She set/established a new European record in the high jump."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈrek.ɔːd"
                            ],
                            "us": [
                                "ˈrek.ɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "at a higher level than ever achieved before: ",
                            "examples": [
                                "The long hot summer has led to a record harvest this year.",
                                "Inflation has reached record levels.",
                                "We finished the work in record time (= faster than had ever been done before)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}