{
    "word": "red pill",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌred ˈpɪl"
                            ],
                            "us": [
                                "ˌred ˈpɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "beliefs, choices, or information that allow you to see the world as it really is, even though you would feel safer or happier if you did not. This refers to a scene in the film \"The Matrix\" where a character is offered a choice between a red pill, which reveals the true world, and a blue pill, which keeps it hidden: ",
                            "examples": [
                                "Now you are living in reality. It's not easy. If you hadn't taken that red pill you would be so happy returning from the mall with your new $300 jeans.",
                                "What these artists sought was equivalent to swallowing the red pill in the movie \"The Matrix\". "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌred ˈpɪl"
                            ],
                            "us": [
                                "ˌred ˈpɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give someone information that allows them to see the world as it really is. This word is often used on the internet by people with views on the political right, especially people who are against feminism (= the belief that women do not have the same rights, power, and opportunities as men and should have them): ",
                            "examples": [
                                "We need to red pill these people and make them see what is really going on.",
                                "Being red-pilled, he says, means understanding that everything you were taught, everything you were led to believe is a lie."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}