{
    "word": "redisplay",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌriː.dɪˈspleɪ"
                            ],
                            "us": [
                                "ˌriː.dɪˈspleɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrange something or a collection of things again in a new place or way so that it can be seen by the public: ",
                            "examples": [
                                "Redisplaying the exhibits in a flexible, accessible way will embody our commitment to being a modern city.",
                                "Most of the collection would be re-displayed in another building on the site."
                            ]
                        },
                        {
                            "explanation": "to show words, pictures, etc. again for a second, third, etc. time on a screen: ",
                            "examples": [
                                "If you have lost the task bar, just press Ctrl-Esc to redisplay it.",
                                "Click here to re-display the list of houses to allow you to select another house."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈriː.dɪˌspleɪ"
                            ],
                            "us": [
                                "ˈriː.dɪˌspleɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of arranging something or a collection of things again in a new place or way so that it can be seen by the public: ",
                            "examples": [
                                "A redisplay has been forced on English Heritage by the buildingconstruction work.",
                                "The committee have been consulted over the redisplay of the existing porcelain collection."
                            ]
                        },
                        {
                            "explanation": "the fact of words, pictures, etc. being shown electronically again, for a second, third, etc. time, for example on a computer screen: ",
                            "examples": [
                                "Instantaneous images can also be saved for redisplay or for printout.",
                                "It is forbidden to copy any of the recipes for redisplay on other web sites."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}