{
    "word": "refire",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌriːˈfaɪər"
                            ],
                            "us": [
                                "ˌriːˈfaɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause a weapon to shoot bullets, arrows, or missiles for a second, third, etc. time: ",
                            "examples": [
                                "It took, on average, five minutes for the gun crews to reload and refire.",
                                "In no case will the gun be re-fired."
                            ]
                        },
                        {
                            "explanation": "to start an engine or a machine for a second, third, etc. time, or to start for a second, third, etc. time: ",
                            "examples": [
                                "The train runs out of steam every now and again, but generally gets re-fired.",
                                "On one occasion, the motor stalled, but quickly refired."
                            ]
                        },
                        {
                            "explanation": "to cause someone to have a particular feeling for a second, third, etc. time: ",
                            "examples": [
                                "Recent research projects have refired my interest in this subject. ",
                                "The two goals re-fired her competitive urge."
                            ]
                        },
                        {
                            "explanation": "to remove someone from their job for a second, third, etc. time, either because they have done something wrong or badly, or as a way of saving the cost of employing them: ",
                            "examples": [
                                "She has reorganised her staff members and even refired some.",
                                "He has been hired and fired and re-hired and re-fired numerous times."
                            ]
                        },
                        {
                            "explanation": "to heat objects made of clay in a kiln (= a special oven) for a second, third, etc. time: ",
                            "examples": [
                                "Grind off the excess enamel and re-fire.",
                                "Refired ceramics, collage, and found objects all figure in the show of 21 artists."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}