{
    "word": "register",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈredʒ.ɪ.stər"
                            ],
                            "us": [
                                "ˈredʒ.ə.stɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put information, especially your name, into an official list or record: ",
                            "examples": [
                                "I registered the car in my name.",
                                "Within two weeks of arrival all foreigners had to register with the local police.",
                                "Students have to register for the new course by the end of April."
                            ]
                        },
                        {
                            "explanation": "to record, show, or express something: ",
                            "examples": [
                                "The Geiger counter registered a dangerous level of radioactivity.",
                                "The earthquake was too small to register on the Richter scale.",
                                "His face registered extreme disapproval of what he had witnessed."
                            ]
                        },
                        {
                            "explanation": "If something registers, someone realizes it and if someone registers something, they realize it: ",
                            "examples": [
                                "I did mention the address but I'm not sure that it registered (with him).",
                                "I scarcely registered the fact that he was there."
                            ]
                        },
                        {
                            "explanation": "If you register a letter or parcel, you send it using a special postal service, so that it will be dealt with in a special way and not be lost: ",
                            "examples": [
                                "a registered letter"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈredʒ.ɪ.stər"
                            ],
                            "us": [
                                "ˈredʒ.ə.stɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a book or record containing a list of names: ",
                            "examples": [
                                "Guests write their names in the (hotel) register.",
                                "Is your name on the register of voters?"
                            ]
                        },
                        {
                            "explanation": "a book used to record if a child is present at school: ",
                            "examples": [
                                "If a child is absent, the teacher notes it down in the (class) register."
                            ]
                        },
                        {
                            "explanation": "in school, the period at the start of the morning and afternoon when a teacher records on an official list that children are present",
                            "examples": []
                        },
                        {
                            "explanation": "the style of language, grammar, and words used for particular situations: ",
                            "examples": [
                                "People chatting at a party will usually be talking in (an) informal register."
                            ]
                        },
                        {
                            "explanation": "all the notes that a musical instrument or a person's voice can produce, from the highest to the lowest: ",
                            "examples": [
                                "music written mainly for the lower/higher register of the clarinet"
                            ]
                        },
                        {
                            "explanation": "the drawer in a cash register (= a machine which records sales in a shop, and in which money is kept) or the cash register itself: ",
                            "examples": [
                                "Next time you have the register open, could you give me some change?",
                                "I think these items have been rung up wrongly on the register."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}