{
    "word": "regressive",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɪˈɡres.ɪv"
                            ],
                            "us": [
                                "rɪˈɡres.ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "returning to a previous and less advanced or worse state or way of behaving: ",
                            "examples": [
                                "Incinerating waste rather than recycling it would be a regressive step.",
                                "Vigilance is needed to overcome the natural regressive tendency to become complacent."
                            ]
                        },
                        {
                            "explanation": "(of an illness or its effects) becoming less severe: ",
                            "examples": [
                                "18 patients had active leprosy, and in 27 the disease was regressive."
                            ]
                        },
                        {
                            "explanation": "returning to a previous way of reacting to something: ",
                            "examples": [
                                "Regressive behaviour - bed-wetting, throwing tantrums, waking in the night - is common.",
                                "Separation anxiety, regressive symptoms, and psychosomatic manifestations are frequently associated with PTSD ."
                            ]
                        },
                        {
                            "explanation": "used to refer to a type of autism (= a brain condition that affects the development of social and communication skills in ways that can be severe or slight, and that can make someone's behaviour and interests different from people without the condition) that develops between the ages of around 15 to 30 months, after a child has been developing in the usual way : ",
                            "examples": [
                                "Most autism is regressive.",
                                "An association was found between regressive autism and bowel problems."
                            ]
                        },
                        {
                            "explanation": "(of tax) lower on large amounts of money, so that the rich are less affected: ",
                            "examples": [
                                "Regressive taxation means that poor people wind up paying a larger percentage of their income in tax than rich people do.",
                                "The single most regressive tax is the tax on food because everyone has to eat."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}