{
    "word": "regularity",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌreɡ.jəˈlær.ə.ti"
                            ],
                            "us": [
                                "ˌreɡ.jəˈler.ə.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the fact of something happening or being done often: ",
                            "examples": [
                                "The same familiar faces reappear in the law courts with depressing regularity.",
                                "Large projects fail with monotonous regularity. "
                            ]
                        },
                        {
                            "explanation": "the fact of something existing or happening repeatedly in a fixed pattern, with equal or similar amounts of space or time between one and the next: ",
                            "examples": [
                                "The amounts and regularity of payments are set in the membership agreement."
                            ]
                        },
                        {
                            "explanation": "the fact of someone emptying their bowels often enough, or of a woman having her periods with approximately the same time between them: ",
                            "examples": [
                                "Bulk-forming laxatives can be used on a daily basis to restore regularity.",
                                "Reducing stress levels can help your menstrual cycle to revert to regularity."
                            ]
                        },
                        {
                            "explanation": "something that happens in the usual way, or the fact of something doing this: ",
                            "examples": [
                                "Sociology stresses the patterns and the regularities of social life which is, most of the time, orderly and largely predictable."
                            ]
                        },
                        {
                            "explanation": "the fact of a verb, noun, or adjective following the usual rules of a language in its various forms, or a form that follows the usual rules: ",
                            "examples": [
                                "Our research looks at verb regularity in a historical corpus of English.",
                                "Researchers in language acquisition have shown that children play an active role in extracting regularities from the language around them."
                            ]
                        },
                        {
                            "explanation": "the fact of being the same on both or all sides: ",
                            "examples": [
                                "Symmetry and regularity in the shape and size of facial features is universally recognized as being beautiful."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}