{
    "word": "regular",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈreɡ.jə.lər"
                            ],
                            "us": [
                                "ˈreɡ.jə.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "happening or doing something often: ",
                            "examples": [
                                "a regular customer/churchgoer/reader/user",
                                "Professional athletes make regular appearances on TV."
                            ]
                        },
                        {
                            "explanation": "existing or happening repeatedly in a fixed pattern, with equal or similar amounts of space or time between one and the next; even: ",
                            "examples": [
                                "Her heartbeat was regular.",
                                "The gardeners planted the trees at regular intervals.",
                                "I suggest that we have regular meetings/meet on a regular basis."
                            ]
                        },
                        {
                            "explanation": "Someone who is regular empties their bowels often enough, and a woman who is regular always has her period at approximately the same time: ",
                            "examples": [
                                "The doctor asked if I was regular/if my bowel movements were regular."
                            ]
                        },
                        {
                            "explanation": "usual or ordinary: ",
                            "examples": [
                                "Her regular secretary was off sick for a week.",
                                "I couldn't see my regular dentist.",
                                "You can use low-fat or regular cream cheese.",
                                "Do you want large fries or regular fries with that?"
                            ]
                        },
                        {
                            "explanation": "A regular verb, noun, or adjective follows the usual rules in the structure of its various forms: ",
                            "examples": [
                                "\"Talk\" is a regular verb but \"be\" is not."
                            ]
                        },
                        {
                            "explanation": "a normal man who is liked and trusted: ",
                            "examples": [
                                "He just seemed like a regular guy - like one of us."
                            ]
                        },
                        {
                            "explanation": "an army that exists all the time, or a soldier in such an army: ",
                            "examples": [
                                "The following year she enlisted in the regular army."
                            ]
                        },
                        {
                            "explanation": "the same on both or all sides: ",
                            "examples": [
                                "He's very handsome, with regular features and deep brown eyes.",
                                "A square is a regular quadrilateral."
                            ]
                        },
                        {
                            "explanation": "real; complete: ",
                            "examples": [
                                "The situation here now is becoming a regular disaster.",
                                "That child is a regular charmer/little nuisance."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈreɡ.jə.lər"
                            ],
                            "us": [
                                "ˈreɡ.jə.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who often goes to a particular event or place, such as a shop or restaurant: ",
                            "examples": [
                                "He's one of the regulars at the pub."
                            ]
                        },
                        {
                            "explanation": "a soldier whose permanent job is being a soldier",
                            "examples": []
                        },
                        {
                            "explanation": "a player who usually plays in most of a team's competitive matches: ",
                            "examples": [
                                "They rested several of their first-team regulars.",
                                "Young players are eager to become regulars in the team. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}