{
    "word": "released",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nrelease ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈliːs"
                            ],
                            "us": [
                                "rɪˈliːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give freedom or free movement to someone or something: ",
                            "examples": [
                                "He was released from prison after serving two years of a five-year sentence.",
                                "She was arrested for shoplifting but was released on bail (= after paying a sum of money to the court).",
                                "The surgery released him from years of pain."
                            ]
                        },
                        {
                            "explanation": "to move a device from a fixed position to allow it to move freely: ",
                            "examples": [
                                "He released the handbrake and the car jumped forwards."
                            ]
                        },
                        {
                            "explanation": "to fire a bomb or a missile (= flying weapon), or to allow it to fall: ",
                            "examples": [
                                "The plane released its bombs at 10,000 feet."
                            ]
                        },
                        {
                            "explanation": "to allow a substance to flow out from somewhere: ",
                            "examples": [
                                "Coal power stations release sulphur dioxide into the atmosphere.",
                                "Hormones are released from glands into the bloodstream."
                            ]
                        },
                        {
                            "explanation": "to express a feeling that you have been trying not to show: ",
                            "examples": [
                                "He punched the pillow in an effort to release his anger."
                            ]
                        },
                        {
                            "explanation": "to allow something to be shown in public or to be available for use: ",
                            "examples": [
                                "Police have released a picture of the man they want to question.",
                                "The mayor has released a statement explaining the reasons for his resignation."
                            ]
                        },
                        {
                            "explanation": "If a company releases a film or musical recording, it allows the film to be shown in cinemas, or makes the musical recording available for the public to buy: ",
                            "examples": [
                                "The band's latest album will be released next week."
                            ]
                        },
                        {
                            "explanation": "to make a product, for example a book, available for the public to buy, often with a celebration; launch: ",
                            "examples": [
                                "The new edition of the dictionary will be released by the education minister later this month."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}