{
    "word": "remote",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɪˈməʊt"
                            ],
                            "us": [
                                "rɪˈmoʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "far away in distance: ",
                            "examples": [
                                "Australia is large, and remote from the great centres of population of the world. ",
                                "remote galaxies"
                            ]
                        },
                        {
                            "explanation": "A remote area, house, or village is a long way from any towns or cities: ",
                            "examples": [
                                "They live in a remote corner of Scotland, miles from the nearest shop.",
                                "a remote mountain village"
                            ]
                        },
                        {
                            "explanation": "remote computer systems are available to users in another part of a building or in another place, for example through a network: ",
                            "examples": [
                                "This enables you to get remote access to your email.",
                                "a remote server"
                            ]
                        },
                        {
                            "explanation": "used to refer to an activity that is done away from the place where it usually happens, especially by means of technology : ",
                            "examples": [
                                "Participants in the remote learning program will interact with mentors through interactive video sessions.",
                                "A new safety system is being developed for remote monitoring of radiation in nuclear reactors."
                            ]
                        },
                        {
                            "explanation": "far away in time: ",
                            "examples": [
                                "It happened in the remote past, so no one worries about it any more.",
                                "He believes that the problems of global warming are urgent and that hydrogen technologies are too remote in time to be of any real help."
                            ]
                        },
                        {
                            "explanation": "not closely related to something: ",
                            "examples": [
                                "They take little interest in a conflict far from their homes and remote from their everyday problems.",
                                "Since both cases are remote from reality we can safely ignore them."
                            ]
                        },
                        {
                            "explanation": "slight: ",
                            "examples": [
                                "a remote possibility",
                                "The chances of a visit by Martians to Earth are remote."
                            ]
                        },
                        {
                            "explanation": "not very friendly or showing little interest in other people: ",
                            "examples": [
                                "Her manner was remote and cool."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈməʊt"
                            ],
                            "us": [
                                "rɪˈmoʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a \nremote control ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}