{
    "word": "repeat",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈpiːt"
                            ],
                            "us": [
                                "rɪˈpiːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to say or tell people something more than once: ",
                            "examples": [
                                "Would you mind repeating what you just said?",
                                "Please don't repeat what I've just told you to anyone else.",
                                "She repeated that she had no intention of running for president."
                            ]
                        },
                        {
                            "explanation": "to happen, or to do something, more than once: ",
                            "examples": [
                                "The test must be repeated several times.",
                                "This is an offer never to be repeated.",
                                "Johnny had to repeat a year/class at school.",
                                "Some historians think that history repeats itself."
                            ]
                        },
                        {
                            "explanation": "to perform part of a piece of music more than once: ",
                            "examples": [
                                "Now repeat all sixteen bars in a more lively style.",
                                "This additional feature is present each time the phrase is repeated.",
                                "After this, the piano part repeats without a break."
                            ]
                        },
                        {
                            "explanation": "to say the same thing again, or the same things again and again: ",
                            "examples": [
                                "His speech was dreadful - he just kept repeating himself.",
                                "Do stop me if I'm repeating myself.",
                                "She's forgetful and often repeats herself.",
                                "He lost the thread of what he was saying and ended up repeating himself.",
                                "She kept it up for over an hour and never once repeated herself.",
                                "At times he seemed distracted and repeated himself."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈpiːt"
                            ],
                            "us": [
                                "ˈriːˌpiːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a situation in which something happens or is done more than once: ",
                            "examples": [
                                "All this is a repeat/a repeat performance of what happened last year."
                            ]
                        },
                        {
                            "explanation": "a television or radio programme that is broadcast again: ",
                            "examples": [
                                "There's nothing but repeats on television these days."
                            ]
                        },
                        {
                            "explanation": "part of a piece of music that is performed more than once: ",
                            "examples": [
                                "The repeat comes in bars 46–57, and then the slow movement continues.",
                                "Only the horns play the first repeat of the melody."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}