{
    "word": "reserve",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈzɜːv"
                            ],
                            "us": [
                                "rɪˈzɝːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to keep something for a particular purpose or time: ",
                            "examples": [
                                "I reserve Mondays for tidying my desk and answering letters.",
                                "These seats are reserved for the elderly and women with babies.",
                                "I reserve judgment on this issue (= I won't give an opinion on it now) until we have more information."
                            ]
                        },
                        {
                            "explanation": "If you reserve something such as a seat on an aircraft or a table at a restaurant, you arrange for it to be kept for your use: ",
                            "examples": [
                                "I reserved a double room at the Lamb Hotel.",
                                "If you get there early, reserve me a seat/reserve a seat for me."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈzɜːv"
                            ],
                            "us": [
                                "rɪˈzɝːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the habit of not showing your feelings or thoughts: ",
                            "examples": [
                                "I took her out for a drink and tried to break through her reserve."
                            ]
                        },
                        {
                            "explanation": "the act of keeping something or a supply of something until it is needed, or a supply that you keep: ",
                            "examples": [
                                "She keeps a little money in reserve (= for use if and when needed).",
                                "The librarian has put the book on reserve for me (= will keep it for me when it becomes available).",
                                "We still have a reserve of food/food reserves in case of emergency."
                            ]
                        },
                        {
                            "explanation": "a supply of something such as money or fuel that you are not using, but that is available if you need it: ",
                            "examples": [
                                "Government reserves include a £1.3 billion \"rainy day\" fund set aside for emergencies.",
                                "Cash reserves on June 30 stood at about £950 million, giving them some protection against future shocks. ",
                                "Maybe, when the Earth's oil reserves finally run dry, we'll all get back on our bikes."
                            ]
                        },
                        {
                            "explanation": "an area of land kept in its natural state, especially for wild animals to live in and be protected: ",
                            "examples": [
                                "a nature/game/wildlife reserve"
                            ]
                        },
                        {
                            "explanation": "in sports, an extra player who is ready to play if needed: ",
                            "examples": [
                                "We had two reserves in case anyone was injured."
                            ]
                        },
                        {
                            "explanation": "a football team consisting of players who are not in the first team, but who play in a league against reserve teams from other clubs: ",
                            "examples": [
                                "Frank was a prolific scorer for the reserves before he graduated to the first team. "
                            ]
                        },
                        {
                            "explanation": "a group of people who are not permanently in the armed forces but are used only if needed: ",
                            "examples": [
                                "They will call up the reserves."
                            ]
                        },
                        {
                            "explanation": "a feeling of doubt about someone or something: ",
                            "examples": [
                                "I can recommend him to you without reserve."
                            ]
                        },
                        {
                            "explanation": "the lowest amount of money the owners will accept for something being sold, especially at auction (= public sale): ",
                            "examples": [
                                "A rare Stradivarius violin failed to reach its reserve price (= no one offered to pay it) when put up for auction on Tuesday.",
                                "We set/put a reserve of €500 on the picture."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}