{
    "word": "responsible",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɪˈspɒn.sə.bəl"
                            ],
                            "us": [
                                "rɪˈspɑːn.sə.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have control and authority over something or someone and the duty of taking care of it, him, or her: ",
                            "examples": [
                                "Paul is directly responsible for the efficient running of the office.",
                                "Her department is responsible for overseeing the councils."
                            ]
                        },
                        {
                            "explanation": "to be controlled by someone or something: ",
                            "examples": [
                                "In Australia, the prime minister and the Cabinet are responsible to the House of Representatives."
                            ]
                        },
                        {
                            "explanation": "to be the person who caused something to happen, especially something bad: ",
                            "examples": [
                                "Who is responsible for this terrible mess?",
                                "Last month's bad weather was responsible for the crop failure."
                            ]
                        },
                        {
                            "explanation": "to blame someone or something: ",
                            "examples": [
                                "He held me personally responsible whenever anything went wrong in the project."
                            ]
                        },
                        {
                            "explanation": "to be in control of yourself so that you can fairly be blamed for your bad actions: ",
                            "examples": [
                                "The defendant was depressed and therefore not fully responsible for her own actions."
                            ]
                        },
                        {
                            "explanation": "having good judgment and the ability to act correctly and make decisions on your own: ",
                            "examples": [
                                "a hard-working and responsible employee",
                                "Let's stay calm and try to behave like responsible adults.",
                                "Many big companies are now becoming more responsible about the way they operate."
                            ]
                        },
                        {
                            "explanation": "A responsible job or position involves making important decisions or doing important things.",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}