{
    "word": "respect",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈspekt"
                            ],
                            "us": [
                                "rɪˈspekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "admiration felt or shown for someone or something that you believe has good ideas or qualities: ",
                            "examples": [
                                "I have great/the greatest respect for his ideas, although I don't agree with them.",
                                "She is a formidable figure who commands a great deal of respect (= who is greatly admired by others).",
                                "New teachers have to earn/gain the respect of their students."
                            ]
                        },
                        {
                            "explanation": "politeness, honour, and care shown towards someone or something that is considered important: ",
                            "examples": [
                                "You really should treat your parents with more respect.",
                                "She has no respect for other people's property (= she does not treat it carefully)."
                            ]
                        },
                        {
                            "explanation": "a feeling that something is right or important and you should not attempt to change it or harm it: ",
                            "examples": [
                                "In their senseless killing of innocent people, the terrorists have shown their lack of respect for human life.",
                                "She grumbled that young people today have/show no respect for the law."
                            ]
                        },
                        {
                            "explanation": "the feeling you show when you accept that different customs or cultures are different from your own and behave towards them in a way that would not cause offence: ",
                            "examples": [
                                "She teaches the students to have respect for different races and appreciate the diversity of other cultures."
                            ]
                        },
                        {
                            "explanation": "polite formal greetings: ",
                            "examples": [
                                "Please convey my respects to your parents.",
                                "Please give my respects to Mr Taylor when you see him.",
                                "If you see Mrs Morris at the event, do convey my respects.",
                                "I know my mother would want me to convey her respects.",
                                "Klara asked me to give her respects to you."
                            ]
                        },
                        {
                            "explanation": "a particular feature or detail: ",
                            "examples": [
                                "This proposal differs from the last one in many important respects/one important respect.",
                                "In most respects, the new film is better than the original."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈspekt"
                            ],
                            "us": [
                                "rɪˈspekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to feel or show admiration for someone or something that you believe has good ideas or qualities: ",
                            "examples": [
                                "I deeply respect David for what he has achieved."
                            ]
                        },
                        {
                            "explanation": "to be proud of your own qualities or achievements: ",
                            "examples": [
                                "If you don't respect yourself, how can you expect others to respect you?",
                                "I like to think I've raised my daughter to respect herself.",
                                "I just knew that if I didn't take a stand and say something, I'd never be able to respect myself.",
                                "He has a sense of his own worth - he respects himself.",
                                "The whole experience has taught me to respect myself."
                            ]
                        },
                        {
                            "explanation": "to treat something or someone with kindness and care: ",
                            "examples": [
                                "to respect someone's feelings",
                                "We should respect the environment and not pollute it."
                            ]
                        },
                        {
                            "explanation": "to accept the importance of someone's rights or customs and to do nothing that would harm them or cause offence: ",
                            "examples": [
                                "The agreement will respect the rights of both nations.",
                                "I would appreciate it if you would respect my privacy."
                            ]
                        },
                        {
                            "explanation": "to accept that something is right or important and not to attempt to change it or harm it: ",
                            "examples": [
                                "The president pledged to respect the existing frontiers between the two countries."
                            ]
                        },
                        {
                            "explanation": "to think that it is important to obey a law or rule: ",
                            "examples": [
                                "I was always taught to respect the law."
                            ]
                        },
                        {
                            "explanation": "to do what someone has asked to have done: ",
                            "examples": [
                                "His children respected his last wishes and held a simple funeral for him."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}