{
    "word": "retool",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌriːˈtuːl"
                            ],
                            "us": [
                                "ˌriːˈtuːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change something in order to improve it or make it more suitable for a particular purpose: ",
                            "examples": [
                                "Politics is being retooled for a new audience.",
                                "We need to help workers retrain and retool their careers in areas of stable employment.",
                                "Even more changes are expected next year, as businesses re-tool their operations."
                            ]
                        },
                        {
                            "explanation": "to provide a factory, industry, vehicle, etc. with new equipment or tools in order to improve it or make it more suitable for a particular purpose: ",
                            "examples": [
                                "We should be retooling our factories to build solar panels and solar electricity.",
                                "In the retooled aeroplane of tomorrow, there will be a host of new security devices.",
                                "We need to re-tool the motor industry, reconfigure the power grid, and convert buildings into power plants."
                            ]
                        },
                        {
                            "explanation": "(of a factory, industry, etc.) to get newer or different equipment in order to improve or become more suitable for a particular purpose: ",
                            "examples": [
                                "She said industries must retool for an innovation economy.",
                                "The money will help our auto companies re-tool, so that the fuel-efficient cars of the future are built right here in this country."
                            ]
                        },
                        {
                            "explanation": "to get new skills or experience that are more suitable for a particular job, purpose, etc. than the skills or experience that you already have: ",
                            "examples": [
                                "Many students are retooling by getting more training in fields such as health care or computers."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}