{
    "word": "retrograde",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈret.rə.ɡreɪd"
                            ],
                            "us": [
                                "ˈret.rə.ɡreɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "returning to older and worse conditions, methods, ideas, etc.: ",
                            "examples": [
                                "He said it would be a retrograde step to remove single parent benefits.",
                                "The proposal is miserably retrograde."
                            ]
                        },
                        {
                            "explanation": "moving in the opposite direction to that of most other stars, planets, etc.: ",
                            "examples": [
                                "The apparent retrograde motion of the planets arises from the Earth’s motion."
                            ]
                        },
                        {
                            "explanation": "in astrology (= the study of the movements and positions of the sun, moon, planets, and stars in the belief that they affect the character and lives of people), used to describe a star or planet moving from east to west : ",
                            "examples": [
                                "Retrograde planets don't so much make things go wrong as make us more aware. "
                            ]
                        },
                        {
                            "explanation": "used to describe a backward movement or a movement that is opposite to the usual direction of flow: ",
                            "examples": [
                                "In colour Doppler sonography the patients showed retrograde blood flow.",
                                "Retrograde ejaculation is a common side effect of this kind of surgery."
                            ]
                        },
                        {
                            "explanation": "used to describe the fact that someone is unable to remember things that happen before a particular event: ",
                            "examples": [
                                "There is evidence to show that ECT can cause both retrograde (i.e. before treatment) and anterograde (i.e. after treatment) memory loss."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈret.rə.ɡreɪd"
                            ],
                            "us": [
                                "ˈret.rə.ɡreɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in astrology (= the study of the movements and positions of the sun, moon, planets, and stars in the belief that they affect the character and lives of people), moving from east to west: ",
                            "examples": [
                                "Things tend to go wrong when Mercury is in retrograde."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}