{
    "word": "retreat",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈtriːt"
                            ],
                            "us": [
                                "rɪˈtriːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to go away from a place or person in order to escape from fighting or danger: ",
                            "examples": [
                                "Attacks by enemy aircraft forced the tanks to retreat (from the city).",
                                "When she came towards me shouting, I retreated (behind my desk)."
                            ]
                        },
                        {
                            "explanation": "to go to a quiet safe place in order to avoid a difficult situation: ",
                            "examples": [
                                "When he's done something wrong, he retreats to his bedroom."
                            ]
                        },
                        {
                            "explanation": "to decide not to do something, or to stop believing something, because it causes too many problems: ",
                            "examples": [
                                "The government is retreating from its promises."
                            ]
                        },
                        {
                            "explanation": "If a price retreats, it goes down after it has gone up: ",
                            "examples": [
                                "Wheat prices retreated after a two-day increase."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈtriːt"
                            ],
                            "us": [
                                "rɪˈtriːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a move back by soldiers or an army, either because they have been defeated or in order to avoid fighting: ",
                            "examples": [
                                "the retreat from Dunkirk",
                                "Enemy soldiers are now in (full) retreat."
                            ]
                        },
                        {
                            "explanation": "a private and safe place: ",
                            "examples": [
                                "a country/mountain/lakeside retreat"
                            ]
                        },
                        {
                            "explanation": "a period of time used to pray and study quietly, or to think carefully, away from normal activities and duties: ",
                            "examples": [
                                "We went on (a) retreat at/to a monastery in Wales."
                            ]
                        },
                        {
                            "explanation": "a change from previous beliefs or behaviour: ",
                            "examples": [
                                "The professor's speech marked/signalled a retreat from his usual extreme views."
                            ]
                        },
                        {
                            "explanation": "a situation in which the price of something goes down: ",
                            "examples": [
                                "Over the past few weeks we have seen the currency's big retreat from its historic high."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}