{
    "word": "return",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈtɜːn"
                            ],
                            "us": [
                                "rɪˈtɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to come or go back to a previous place: ",
                            "examples": [
                                "Odysseus returned home/returned to his home after many years of travelling.",
                                "She left South Africa at the age of 15 and has never returned.",
                                "David returned (from work) to find his house had burned down."
                            ]
                        },
                        {
                            "explanation": "If people or things return to a previous condition, they go back to that condition: ",
                            "examples": [
                                "Within a week, the situation had returned to normal."
                            ]
                        },
                        {
                            "explanation": "If you return to an activity or subject, you start doing it or talking about it again: ",
                            "examples": [
                                "Gandhi urged Indians to return to spinning their own yarn.",
                                "Every five minutes, he returned to the same subject."
                            ]
                        },
                        {
                            "explanation": "to give, do, or get something after something similar has been given or done to you: ",
                            "examples": [
                                "to return an invitation/greeting",
                                "I returned his stare.",
                                "I gave her a ride when her car broke down and now she is returning the favour (= doing something to help me in exchange).",
                                "The terrorists started shooting and the police returned fire (= started shooting back)."
                            ]
                        },
                        {
                            "explanation": "to reply to someone's question or request: ",
                            "examples": [
                                "His representatives did not return a request for comment.",
                                "She hadn't returned their earlier queries because, she said, she had already explained herself clearly."
                            ]
                        },
                        {
                            "explanation": "to give a particular amount of profit: ",
                            "examples": [
                                "My investments return a high rate of interest."
                            ]
                        },
                        {
                            "explanation": "to send, take, give, put, etc. something back to where it came from: ",
                            "examples": [
                                "The new TV broke so they returned it to the shop.",
                                "He returned two books he had borrowed from me in 2003.",
                                "She carefully returned the book to its place on the shelf."
                            ]
                        },
                        {
                            "explanation": "to bring someone back from somewhere: ",
                            "examples": [
                                "We're all hoping that Jill will be returned safely to her family."
                            ]
                        },
                        {
                            "explanation": "in sports such as tennis, to hit the ball back to your opponent",
                            "examples": []
                        },
                        {
                            "explanation": "to happen again: ",
                            "examples": [
                                "You must go to the doctor if the pain returns."
                            ]
                        },
                        {
                            "explanation": "to decide and say if you think someone is guilty or not guilty, or what punishment the person will be given in a court of law: ",
                            "examples": [
                                "The jury returned a verdict of not guilty."
                            ]
                        },
                        {
                            "explanation": "to formally accuse someone of something in a court of law: ",
                            "examples": [
                                "His case will proceed to a grand jury, which must decide whether to return an indictment.",
                                "The grand jury returned an indictment in January, charging the respondent with the three murders."
                            ]
                        },
                        {
                            "explanation": "to elect someone to be a member of parliament, or to another political job: ",
                            "examples": [
                                "It was expected that he would be returned as premier."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈtɜːn"
                            ],
                            "us": [
                                "rɪˈtɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when someone goes or comes back to a place where they were before: ",
                            "examples": [
                                "The whole town came out to celebrate his return (from the war).",
                                "On her return, she went straight to the office."
                            ]
                        },
                        {
                            "explanation": "an occasion when you start to do or have something again: ",
                            "examples": [
                                "Some environmentalists argue for a return to a pre-industrial society.",
                                "Most people have welcomed her return to power/office."
                            ]
                        },
                        {
                            "explanation": "a ticket for travel to a place and back again: ",
                            "examples": [
                                "A return to Birmingham, please."
                            ]
                        },
                        {
                            "explanation": "in exchange: ",
                            "examples": [
                                "Some tenants get rent reductions in return for help managing the building.",
                                "I'll come with you, but you have to do something for me in return."
                            ]
                        },
                        {
                            "explanation": "the act of giving, doing, or receiving something in exchange for something: ",
                            "examples": [
                                "Several soldiers were wounded in the return of fire."
                            ]
                        },
                        {
                            "explanation": "the profit that you get from an investment: ",
                            "examples": [
                                "The return on the money we invested was very low."
                            ]
                        },
                        {
                            "explanation": "an occasion when something starts to happen or be used again: ",
                            "examples": [
                                "Will we ever see the return of/a return to comfortable fashion clothes?"
                            ]
                        },
                        {
                            "explanation": "the key on a computer keyboard that you press in order to say that the words or numbers on the screen are correct, or that an instruction should be performed, or in order to move down a line on the screen: ",
                            "examples": [
                                "Press return/the return key twice to leave a blank line."
                            ]
                        },
                        {
                            "explanation": "the act of giving, putting, or sending something back: ",
                            "examples": [
                                "the return of the stolen goods"
                            ]
                        },
                        {
                            "explanation": "the act of hitting the ball back to your opponent in sports such as tennis: ",
                            "examples": [
                                "Chang's return of serve was powerful."
                            ]
                        },
                        {
                            "explanation": "goods that have been taken back to the shop where they were bought by customers because they are damaged or unsuitable",
                            "examples": []
                        },
                        {
                            "explanation": "the votes that are returned, or the results of the voting, in an election: ",
                            "examples": [
                                "The election returns produced a confusing picture of gains and losses."
                            ]
                        },
                        {
                            "explanation": "in the first post collection that leaves after you receive a letter: ",
                            "examples": [
                                "She answered my letter by return."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɪˈtɜːn"
                            ],
                            "us": [
                                "rɪˈtɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "The return part of a journey is the part in which you go back to the place where you started: ",
                            "examples": [
                                "The return journey took longer because the train was rerouted."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}