{
    "word": "reverse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪˈvɜːs"
                            ],
                            "us": [
                                "rɪˈvɝːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change the direction, order, position, result, etc. of something to its opposite: ",
                            "examples": [
                                "The new manager hoped to reverse the decline in the company's fortunes.",
                                "Now that you have a job and I don't, our situations are reversed.",
                                "The Court of Appeal reversed the earlier judgment."
                            ]
                        },
                        {
                            "explanation": "to drive a vehicle backwards: ",
                            "examples": [
                                "He reversed into a lamppost and damaged the back of the car.",
                                "She reversed the car into the parking space."
                            ]
                        },
                        {
                            "explanation": "to make a phone call that is paid for by the person receiving it",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪˈvɜːs"
                            ],
                            "us": [
                                "rɪˈvɝːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the opposite of what has been suggested: ",
                            "examples": [
                                "You might think that people who don't worry about their diet are fatter and more unhealthy; in fact, the reverse is true.",
                                "Whatever official news broadcasts claimed, he believed the reverse."
                            ]
                        },
                        {
                            "explanation": "the back of a coin, medal, etc.: ",
                            "examples": [
                                "The coin has a royal coat of arms on the reverse."
                            ]
                        },
                        {
                            "explanation": "in the opposite order or way: ",
                            "examples": [
                                "To stop the engine, you repeat the same procedures, but in reverse (order)."
                            ]
                        },
                        {
                            "explanation": "the method of controlling a vehicle that makes it go backwards : ",
                            "examples": [
                                "To go backwards, you must put the car in/into reverse (gear)."
                            ]
                        },
                        {
                            "explanation": "a defeat or failure: ",
                            "examples": [
                                "They suffered a serious military/political reverse."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɪˈvɜːs"
                            ],
                            "us": [
                                "rɪˈvɝːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "opposite to what has just happened, or to what is usual or expected: ",
                            "examples": [
                                "Repeat the steps in reverse order to shut the system off.",
                                "The intervention was designed to help, but it had the reverse effect."
                            ]
                        },
                        {
                            "explanation": "towards the direction that is opposite to the one you are facing: ",
                            "examples": [
                                "He delivered a perfect reverse pass to his teammate.",
                                "The diver then does three and a half reverse somersaults in the air before plunging head first into the water."
                            ]
                        },
                        {
                            "explanation": "the back of something: ",
                            "examples": [
                                "On the reverse side of the coin will be a portrait of the Queen.",
                                "Each entry must be clearly labelled with your name, address, and date of birth on the reverse side."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}