{
    "word": "rich",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɪtʃ"
                            ],
                            "us": [
                                "rɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a lot of money or valuable possessions: ",
                            "examples": [
                                "He's the third richest man in the country.",
                                "They're one of the world's richest nations.",
                                "He is determined to get rich quickly."
                            ]
                        },
                        {
                            "explanation": "containing a large amount of a valuable natural substance such as coal, oil, or wood: ",
                            "examples": [
                                "The region is rich in minerals and coal deposits.",
                                "The country has vast oil reserves and rich deposits of other minerals."
                            ]
                        },
                        {
                            "explanation": "containing a lot of something good or useful: ",
                            "examples": [
                                "Pineapple juice is rich in vitamins A and B."
                            ]
                        },
                        {
                            "explanation": "Rich land or soil contains a large amount of substances that help plants to grow: ",
                            "examples": [
                                "the richest arable land in the country"
                            ]
                        },
                        {
                            "explanation": "used in compounds to say that someone has a lot of a particular thing, or that something contains a lot of a particular substance: ",
                            "examples": [
                                "This type of pension plan is popular with business owners or property-rich investors."
                            ]
                        },
                        {
                            "explanation": "containing a lot of exciting events or experiences and therefore very interesting: ",
                            "examples": [
                                "He has written a book about the island's rich history.",
                                "She had a rich and varied life and met many famous and exciting people."
                            ]
                        },
                        {
                            "explanation": "If the style of something such as a piece of furniture or a building is rich, it contains a lot of decoration: ",
                            "examples": [
                                "The temple is noted for its rich carvings."
                            ]
                        },
                        {
                            "explanation": "A rich colour, sound, smell, or taste is strong in a pleasing or attractive way: ",
                            "examples": [
                                "This lipstick gives long-lasting rich colour.",
                                "She produced a rich, deep tone from her clarinet.",
                                "The wine has a rich aromatic flavour."
                            ]
                        },
                        {
                            "explanation": "A rich material is very beautiful and valuable: ",
                            "examples": [
                                "She wore a velvet skirt and a rich brocade jacket."
                            ]
                        },
                        {
                            "explanation": "If food is rich, it contains a large amount of oil, butter, eggs, or cream: ",
                            "examples": [
                                "This chocolate mousse is too rich for me."
                            ]
                        },
                        {
                            "explanation": "used to describe someone's opinions when that person has the same bad qualities as the person they are criticizing: ",
                            "examples": [
                                "The education minister's criticism of the new exam system seems rich, considering it was he who demanded the changes in the first place.",
                                "\"He said I looked fat.\" \"That's a bit rich coming from him.\" (= he himself is fat)"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪtʃ"
                            ],
                            "us": [
                                "rɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "rich people considered together as a group: ",
                            "examples": [
                                "The resort is frequented by the rich and famous."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -rɪtʃ"
                            ],
                            "us": [
                                " -rɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "containing a large amount of a valuable substance: ",
                            "examples": [
                                "milk and other calcium-rich food",
                                "an oil-rich country"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}