{
    "word": "rigger",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈrɪɡ.ər"
                            ],
                            "us": [
                                "ˈrɪɡ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who arranges and works with the ropes that support and control a ship's sails: ",
                            "examples": [
                                "He had a licence to act as a rigger on a sailing ship around 1880.",
                                "A whole army of shipwrights, boiler-makers, painters, and riggers slowly rebuilt the ship."
                            ]
                        },
                        {
                            "explanation": "someone who works with ropes, chains, lifting devices, etc. on a building site (= a piece of land on which a building or other structure is being built): ",
                            "examples": [
                                "When they have cut through a section, the riggers come in and cable it to a crane.",
                                "I can't get the standard of riggers, chippies, and plasterers I need."
                            ]
                        },
                        {
                            "explanation": "someone who puts up large pieces of stage, lighting, and sound equipment for concerts, festivals, film sets, etc.: ",
                            "examples": [
                                "He leads a team of riggers on the film set.",
                                "A rigger suffered a broken leg in the accident at Earl's Court in London."
                            ]
                        },
                        {
                            "explanation": "someone who repairs the moving parts and flight controls of an aircraft : ",
                            "examples": [
                                "The riggers spent a couple of weeks checking the aircraft before it flew again.",
                                "He worked as a rigger with the ground crew, responsible for examining the aircraft."
                            ]
                        },
                        {
                            "explanation": "someone who works on or helps build an oil rig (= a large structure with equipment for removing oil from under the ground, especially from under the sea): ",
                            "examples": [
                                "In some jobs, for example divers and offshore riggers, physical fitness is essential.",
                                "A rigger from Elgin was one of the first oilmen to arrive back at Aberdeen Airport."
                            ]
                        },
                        {
                            "explanation": "someone who takes care of, repairs, and packs parachutes (= large pieces of cloth that are fastened to people who jump from an aircraft, to make them fall safely to the ground): ",
                            "examples": [
                                "He served as a parachute rigger in Vietnam.",
                                "He has been a rigger for 15 years and has jumped at least 800 times."
                            ]
                        },
                        {
                            "explanation": "in animation (= moving images created from drawings, models, etc. that are photographed or created by a computer), someone who creates the frameworks that make the characters move : ",
                            "examples": [
                                "Riggers create digital skeletons for computer-generated characters.",
                                "A character rigger designs the skeletal frameworks of animated characters."
                            ]
                        },
                        {
                            "explanation": "someone who arranges dishonestly for the result of something, for example an election, to be changed: ",
                            "examples": [
                                "The US has hit election riggers from that country with a visa ban. ",
                                "Market riggers should be punished with with fines and prison."
                            ]
                        },
                        {
                            "explanation": "a long part that sticks out from the side of a rowing boat and holds the supports for the oars (= long poles used for rowing): ",
                            "examples": [
                                "The dented bow rigger needed repair.",
                                "A blade got caught between the water and the rigger."
                            ]
                        },
                        {
                            "explanation": "a long pointed brush for painting with bristles (= hairs) made of sable (= the hair of a small animal): ",
                            "examples": [
                                "For painting tree branches, he uses riggers in sizes 2, 4, and 6.",
                                "A fine sable rigger brush will make very precise lines."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}