{
    "word": "right",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "raɪt"
                            ],
                            "us": [
                                "raɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "correct: ",
                            "examples": [
                                "You got three answers right and two wrong.",
                                "I set the clock to the right time.",
                                "\"Is that Ms Kramer?\" \"Yes, that's right.\"",
                                "Am I right in thinking (= is it true) that you will be at the conference?",
                                "You're right to be annoyed - you've been treated very badly.",
                                "You must put matters right (= make the situation better) by telling the truth."
                            ]
                        },
                        {
                            "explanation": "If you are right about something or someone, you are correct in your judgment or statement about it, him, or her: ",
                            "examples": [
                                "You were right about Pete - he's a real troublemaker."
                            ]
                        },
                        {
                            "explanation": "suitable or correct, or as it should be: ",
                            "examples": [
                                "He's the right person for the job.",
                                "I think you've made the right decision.",
                                "The temperature of the swimming pool was just right (= exactly as I wanted it).",
                                "That hat looks just right on you.",
                                "He thought the time was right to let his intentions be known."
                            ]
                        },
                        {
                            "explanation": "used to refer to a person who is considered to be socially important or a place that such people go to: ",
                            "examples": [
                                "She knows all the right people.",
                                "He likes to be seen in the right clubs and restaurants."
                            ]
                        },
                        {
                            "explanation": "in the correct position: ",
                            "examples": [
                                "The lid has to go on the right way round or it won't fit."
                            ]
                        },
                        {
                            "explanation": "considered fair or morally acceptable by most people: ",
                            "examples": [
                                "I don't believe they should have put him in prison. It isn't right.",
                                "It's not right to criticize people behind their back.",
                                "It is only (= completely) right that men and women should be paid the same for doing the same work."
                            ]
                        },
                        {
                            "explanation": "healthy, or working correctly: ",
                            "examples": [
                                "I haven't felt right since I ate that meal last night.",
                                "Something isn't quite right with the brakes on your bike."
                            ]
                        },
                        {
                            "explanation": "used for emphasizing when something is bad: ",
                            "examples": [
                                "He's a right idiot.",
                                "His house is a right mess."
                            ]
                        },
                        {
                            "explanation": "on or towards the side of your body that is to the east when you are facing north: ",
                            "examples": [
                                "Most people write with their right hand.",
                                "He likes to sleep on the right side of the bed."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "raɪt"
                            ],
                            "us": [
                                "raɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "on or towards the side of your body that is to the east when you are facing north: ",
                            "examples": [
                                "Turn/Go right (= take the road on the right) at the first traffic lights."
                            ]
                        },
                        {
                            "explanation": "exactly or all the way: ",
                            "examples": [
                                "I've got a pimple right on the end of my nose.",
                                "They built a row of hotels right along the sea-front."
                            ]
                        },
                        {
                            "explanation": "used for emphasis: ",
                            "examples": [
                                "The car ran right (= completely) out of fuel.",
                                "She walked right (= all the way) past me without noticing me.",
                                "I'll be right back/I'll be right with you (= I will return very soon)."
                            ]
                        },
                        {
                            "explanation": "immediately: ",
                            "examples": [
                                "I'll call them right away, because if I wait, I'll probably forget to do it."
                            ]
                        },
                        {
                            "explanation": "at the present time: ",
                            "examples": [
                                "We're very busy right now."
                            ]
                        },
                        {
                            "explanation": "immediately: ",
                            "examples": [
                                "You'd better leave right now."
                            ]
                        },
                        {
                            "explanation": "used as part of the title of particular people, such as bishops and some members of Parliament: ",
                            "examples": [
                                "the Right Honourable Diane Abbott, MP"
                            ]
                        },
                        {
                            "explanation": "correctly: ",
                            "examples": [
                                "Why does he never do anything right?"
                            ]
                        },
                        {
                            "explanation": "If something goes right, it is successful or happens in a way that you hoped it would: ",
                            "examples": [
                                "Things haven't been going right for me these past few months."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "raɪt"
                            ],
                            "us": [
                                "raɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the right side: ",
                            "examples": [
                                "English is written and read from left to right.",
                                "King's Avenue is the first right (= the first road on the right side).",
                                "In this photo, my wife is the woman standing on/to my right.",
                                "I took/made (informal hung) a right (= turned into the next road on the right side) after crossing the bridge."
                            ]
                        },
                        {
                            "explanation": "political parties or people that have traditional opinions, and that believe in low taxes, property, and industry being privately owned, and less help for the poor: ",
                            "examples": [
                                "The right was/were in power after 1979.",
                                "He's a man of the far (= extreme) right."
                            ]
                        },
                        {
                            "explanation": "what is considered to be morally good or acceptable: ",
                            "examples": [
                                "Your conscience should tell you the difference between right and wrong."
                            ]
                        },
                        {
                            "explanation": "If you are in the right, what you are doing is morally or legally correct: ",
                            "examples": [
                                "You're definitely in the right - there's no doubt about that."
                            ]
                        },
                        {
                            "explanation": "the fact that a person or animal can expect to be treated in a fair, morally acceptable, or legal way, or to have the things that are necessary for life: ",
                            "examples": [
                                "She campaigned for women's rights during the 1960s.",
                                "Everyone has a right to education.",
                                "She has no more right to a company car than I have (= she does not deserve one more than I do).",
                                "You're not my boss, so what right (= authority) do you have to tell me what to do?",
                                "You have every right (= you have a good reason) to complain."
                            ]
                        },
                        {
                            "explanation": "If you are within your rights to do something, you are legally allowed to do it: ",
                            "examples": [
                                "I think I'm quite within my rights to demand a full refund."
                            ]
                        },
                        {
                            "explanation": "legal controls over who is allowed to use a book or film: ",
                            "examples": [
                                "He has acquired the film rights to the book (= he is allowed to make a film of the book)."
                            ]
                        },
                        {
                            "explanation": "new shares in a particular company that have become available for people to buy who already own shares: ",
                            "examples": [
                                "The company made a rights issue of one new share for every four held."
                            ]
                        },
                        {
                            "explanation": "to improve or correct something: ",
                            "examples": [
                                "The company needs over a million dollars to set its finances to rights."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "raɪt"
                            ],
                            "us": [
                                "raɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to express agreement with someone or to show that you have understood what someone has said: ",
                            "examples": [
                                "\"Johnny, you climb up first.\" \"Right.\""
                            ]
                        },
                        {
                            "explanation": "said when you want to make a group of people notice you, especially so that you can start an activity: ",
                            "examples": [
                                "Right, everyone. Could you all stop talking, and then we'll begin."
                            ]
                        },
                        {
                            "explanation": "said between parts of a story that you are telling, in order to make certain that people are paying attention and understanding: ",
                            "examples": [
                                "So there I was right, middle of the night, right, and this guy came up to me..."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "raɪt"
                            ],
                            "us": [
                                "raɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you right a situation or a mistake, you make it better or correct it: ",
                            "examples": [
                                "It's a terrible situation and we should right it as soon as possible."
                            ]
                        },
                        {
                            "explanation": "If a boat rights itself, it turns itself back to its correct position in the water: ",
                            "examples": [
                                "The canoe will right itself if it capsizes."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}