{
    "word": "ringer",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈrɪŋ.ər"
                            ],
                            "us": [
                                "ˈrɪŋ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thing that makes a ringing sound, especially part of a mobile phone: ",
                            "examples": [
                                "Turn off the phone's ringer by flipping the switch.",
                                "Other buttons include a volume rocker on the left, with a slider that turns the ringer off."
                            ]
                        },
                        {
                            "explanation": "someone who rings a bell: ",
                            "examples": [
                                "The church ringers meet for practice every Wednesday evening.",
                                "The doorbell ringer turned out to be my aunt."
                            ]
                        },
                        {
                            "explanation": "a person or horse that takes part in a competition, game, or race illegally or unfairly, for example by someone pretending that they are another person or horse: ",
                            "examples": [
                                "They had a ringer on their team - someone who usually plays for a team in a different league.",
                                "The under-9 team's star player was a ringer: he was two years older than the other kids.",
                                "Ringer scandals, in which one horse runs under the name of another, have a long and colourful history."
                            ]
                        },
                        {
                            "explanation": "in various games, a ring or horseshoe that lands around the target that is being aimed at: ",
                            "examples": [
                                "He said the game was very stressful because you felt you needed to throw a ringer every time.",
                                "The top-ranked player entering the event throws a ringer on an average of 88 percent of his tosses."
                            ]
                        },
                        {
                            "explanation": "someone or something that looks very similar to someone or something else: ",
                            "examples": [
                                "With his top hat and red nose, he is a ringer for W. C. Fields.",
                                "His drawing of a circle of dancing women is a ringer for Matisse's Dancers."
                            ]
                        },
                        {
                            "explanation": "a vehicle that has been given a false registration number: ",
                            "examples": [
                                "The police officer was told the van was a ringer as the owner and his van were still at home."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}