{
    "word": "risk",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɪsk"
                            ],
                            "us": [
                                "rɪsk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the possibility of something bad happening: ",
                            "examples": [
                                "In this business, the risks and the rewards are high.",
                                "There's a high risk of another accident happening in this fog.",
                                "The risk (that) we might fail made us work twice as hard.",
                                "It's always a risk starting up a new business.",
                                "The company is quite a good risk (= safe to lend money to).",
                                "We want clean rivers and lakes, where you can swim without risk to your health.",
                                "It's a low/high-risk strategy (= one that is safe/not safe)."
                            ]
                        },
                        {
                            "explanation": "something bad that might happen: ",
                            "examples": [
                                "This wire is a safety/fire risk.",
                                "His employers thought he was a security risk (= he might tell their secrets to a competitor)."
                            ]
                        },
                        {
                            "explanation": "in a dangerous situation: ",
                            "examples": [
                                "All houses within 100 metres of the seas are at risk of flooding."
                            ]
                        },
                        {
                            "explanation": "used to mean that you are responsible for any damage, loss, or difficulty: ",
                            "examples": [
                                "Drivers are reminded that they leave their cars here at their own risk."
                            ]
                        },
                        {
                            "explanation": "to do something that might be dangerous: ",
                            "examples": [
                                "Don't take any risks - just call the police."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɪsk"
                            ],
                            "us": [
                                "rɪsk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to do something although there is a chance of a bad result: ",
                            "examples": [
                                "\"It's dangerous to cross here.\" \"I'll just have to risk it.\"",
                                "He risked losing his house when his company went bankrupt."
                            ]
                        },
                        {
                            "explanation": "If you risk something important, you cause it to be in a dangerous situation where you might lose it: ",
                            "examples": [
                                "I'm not risking my life (informal neck) in that old car.",
                                "He risked life and limb to get the cat down from the tree.",
                                "She was prepared to risk everything on a last throw of the dice."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}