{
    "word": "roamed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nroam ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rəʊm"
                            ],
                            "us": [
                                "roʊm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move about or travel, especially without a clear idea of what you are going to do: ",
                            "examples": [
                                "After the bars close, gangs of youths roam the city streets.",
                                "She roamed around America for a year, working in bars and restaurants."
                            ]
                        },
                        {
                            "explanation": "If someone's hands or eyes roam, they touch or look in many different places, especially in a sexual way or when they should not do this: ",
                            "examples": [
                                "She enjoys his company, but occasionally he lets his hands roam where they shouldn't.",
                                "We are sick of fighting off roaming hands on dates.",
                                "Her eyes boldly roamed the room."
                            ]
                        },
                        {
                            "explanation": "to have sexual relationships or experiences outside of your marriage or usual relationship: ",
                            "examples": [
                                "There are some people who are faithful and some who tend to roam.",
                                "She put up with a roaming husband in order to protect her child."
                            ]
                        },
                        {
                            "explanation": "to connect to a mobile phone service that is not the one that you normally use, for example if you are in another country: ",
                            "examples": [
                                "Trying to place an outbound mobile phone call results in an error message telling you that you are roaming.",
                                "You can stop your phone from roaming if you want to avoid big charges when abroad."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}