{
    "word": "rock",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɒk"
                            ],
                            "us": [
                                "rɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the dry solid part of the earth's surface, or any large piece of this that sticks up out of the ground or the sea: ",
                            "examples": [
                                "Mountains and cliffs are formed from rock.",
                                "The boat struck a rock outside the bay and sank."
                            ]
                        },
                        {
                            "explanation": "a piece of rock or stone: ",
                            "examples": [
                                "The demonstrators were hurling rocks at the police."
                            ]
                        },
                        {
                            "explanation": "a line of large stones sticking up from the sea: ",
                            "examples": [
                                "The storm forced the ship onto the rocks."
                            ]
                        },
                        {
                            "explanation": "slang for a valuable stone used in jewellery, especially a diamond: ",
                            "examples": [
                                "Have you seen the size of the rock he gave her for their anniversary?"
                            ]
                        },
                        {
                            "explanation": "a type of popular music with a strong, loud beat that is usually played with electric guitars and drums: ",
                            "examples": [
                                "a rock group",
                                "a rock star"
                            ]
                        },
                        {
                            "explanation": "a type of hard sweet, usually in the shape of a stick: ",
                            "examples": [
                                "The vivid pink of seaside rock is very attractive to a child.",
                                "a stick of rock"
                            ]
                        },
                        {
                            "explanation": "If someone is your rock, you feel that you can depend on them and that they will always support you. : ",
                            "examples": [
                                "\"He's always been my rock,\" said his lifelong friend and teammate."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɒk"
                            ],
                            "us": [
                                "rɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause someone or something to) move backwards and forwards or from side to side in a regular way: ",
                            "examples": [
                                "He picked up the baby and gently rocked her to sleep.",
                                "If you rock back on that chair, you're going to break it."
                            ]
                        },
                        {
                            "explanation": "If a person or place is rocked by something such as an explosion, the force of it makes the person or place shake: ",
                            "examples": [
                                "The explosion, which rocked the city, killed 300."
                            ]
                        },
                        {
                            "explanation": "If an event rocks a group of people or society, it causes feelings of shock: ",
                            "examples": [
                                "The managing director's resignation rocked the whole company."
                            ]
                        },
                        {
                            "explanation": "to wear a particular style of clothing, etc. and look good or fashionable: ",
                            "examples": [
                                "There are celebrities over 40 years old who can still rock a tattoo."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}