{
    "word": "roll",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rəʊl"
                            ],
                            "us": [
                                "roʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause something to) move somewhere by turning over and over or from side to side: ",
                            "examples": [
                                "The vase rolled off the edge of the table and smashed.",
                                "The dog rolled over onto its back.",
                                "I rolled the wheel along the side of the road back to the car."
                            ]
                        },
                        {
                            "explanation": "to move somewhere easily and without sudden movements: ",
                            "examples": [
                                "A tear rolled down his cheek.",
                                "A wave of cigarette smoke rolled towards me.",
                                "The piano's on wheels, so we can roll it into the room."
                            ]
                        },
                        {
                            "explanation": "If an aircraft or a ship rolls, it leans to one side and then to the other because of the wind or waves.",
                            "examples": []
                        },
                        {
                            "explanation": "If a machine is rolling, it is operating: ",
                            "examples": [
                                "Just as the television cameras started rolling, it began to pour down with rain."
                            ]
                        },
                        {
                            "explanation": "If you roll your eyes, you move them so that you are looking up, to show that you consider someone or something stupid or silly: ",
                            "examples": [
                                "When he suggested they should buy a new car, she rolled her eyes in disbelief."
                            ]
                        },
                        {
                            "explanation": "to (cause something to) turn over onto itself to form the shape of a ball or a tube: ",
                            "examples": [
                                "He rolled the clay into a ball in his hands.",
                                "As I got closer, the hedgehog rolled itself (up) into a ball."
                            ]
                        },
                        {
                            "explanation": "to make a cigarette by wrapping a piece of paper around some tobacco",
                            "examples": []
                        },
                        {
                            "explanation": "to fold over a piece of clothing or material to make it shorter: ",
                            "examples": [
                                "We rolled back the carpet to see the floorboards."
                            ]
                        },
                        {
                            "explanation": "to make something smooth and flat: ",
                            "examples": [
                                "She borrowed a garden roller to roll the grass flat.",
                                "When you have rolled (out) the pastry, place it in a pie dish."
                            ]
                        },
                        {
                            "explanation": "to make a continuous, repeated, deep sound: ",
                            "examples": [
                                "The drums rolled as the acrobat walked along the tightrope."
                            ]
                        },
                        {
                            "explanation": "If you roll your r's, you pronounce them with your tongue moving quickly and repeatedly against the top of the mouth: ",
                            "examples": [
                                "When you speak Spanish you roll your r's."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rəʊl"
                            ],
                            "us": [
                                "roʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of film, paper, or cloth that is rolled into the shape of a tube: ",
                            "examples": [
                                "a roll of carpet",
                                "a toilet roll (= a roll of toilet paper)"
                            ]
                        },
                        {
                            "explanation": "If a person or animal has rolls of fat on their body, that person or animal is very fat: ",
                            "examples": [
                                "The dog had rolls of fat along its neck."
                            ]
                        },
                        {
                            "explanation": "a small round loaf of bread for one person: ",
                            "examples": [
                                "Would you like a roll and butter with your soup?",
                                "I bought a cheese/ham/tuna roll (= a sandwich made with a roll) for lunch."
                            ]
                        },
                        {
                            "explanation": "an official list of names: ",
                            "examples": [
                                "Is your name on the electoral roll (= the list of people who can vote)?"
                            ]
                        },
                        {
                            "explanation": "If you take/call the roll, you read aloud the names of all the people on the list to make certain that they are present: ",
                            "examples": [
                                "The teacher called the roll to see if any students were absent."
                            ]
                        },
                        {
                            "explanation": "an act of rolling on the ground: ",
                            "examples": [
                                "The dog went for a roll in the grass."
                            ]
                        },
                        {
                            "explanation": "sexual activity that is quick and enjoyable and does not involve serious feelings: ",
                            "examples": [
                                "I wouldn't sacrifice my marriage for a roll in the hay with a waitress."
                            ]
                        },
                        {
                            "explanation": "The roll of a ship or aircraft is its movement from side to side in the water or air.",
                            "examples": []
                        },
                        {
                            "explanation": "a continuous repeated deep sound: ",
                            "examples": [
                                "a drum roll",
                                "a deafening roll of thunder"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}