{
    "word": "rule",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ruﾋ人"
                            ],
                            "us": [
                                "ruﾋ人"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an accepted principle or instruction that states the way things are or should be done, and tells you what you are allowed or are not allowed to do: ",
                            "examples": [
                                "A referee must know all the rules of the game.",
                                "The first/most important rule in life is always to appear confident.",
                                "Before you start your own business you should be familiar with the government's rules and regulations.",
                                "You must follow/obey/observe the rules.",
                                "You must not break the rules.",
                                "In special cases the manager will bend/stretch the rules (= allow the rules to be broken slightly).",
                                "You can trust Ruth because she always plays (it) by/goes by/does things by the rules (= follows instructions, standards, or rules).",
                                "It's against the rules (of/in boxing) to hit below the belt.",
                                "It's a club rule that new members must sing a song."
                            ]
                        },
                        {
                            "explanation": "a period of time during which a particular person or group is in control of a country: ",
                            "examples": [
                                "The period of Fascist rule is one people try to forget.",
                                "We don't want one-party rule - we want rule by the people."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ruﾋ人"
                            ],
                            "us": [
                                "ruﾋ人"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to control or be the person in charge of something such as a country: ",
                            "examples": [
                                "Most modern kings and queens rule (their countries) only in a formal way, without real power.",
                                "She rules her household with an iron hand/fist (= severely)."
                            ]
                        },
                        {
                            "explanation": "to be the most important and controlling influence on someone: ",
                            "examples": [
                                "Love ruled supreme in her heart.",
                                "The desperate desire to go to Moscow ruled their lives."
                            ]
                        },
                        {
                            "explanation": "to decide officially: ",
                            "examples": [
                                "Only the Appeal Court can rule on this point.",
                                "The judge ruled for/in favour of/against the defendant.",
                                "The government has ruled that the refugees must be deported.",
                                "The courts have ruled his brave action illegal."
                            ]
                        },
                        {
                            "explanation": "to draw a straight line using something that has a straight edge: ",
                            "examples": [
                                "She ruled two red lines under the title."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}