{
    "word": "run",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rʌn"
                            ],
                            "us": [
                                "rʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of people and some animals) to move along, faster than walking, by taking quick steps in which each foot is lifted before the next foot touches the ground: ",
                            "examples": [
                                "The children had to run to keep up with their father.",
                                "I can run a mile in five minutes.",
                                "The sheep ran away/off in fright.",
                                "A little girl ran up to (= came quickly beside) me, crying for her daddy.",
                                "In the semi-final she will be running against her nearest rival. ",
                                "The first two races will be run (= will happen) in 20 minutes."
                            ]
                        },
                        {
                            "explanation": "If you run an animal in a race, you cause it to take part: ",
                            "examples": [
                                "Thompson Stables are running three horses in the next race."
                            ]
                        },
                        {
                            "explanation": "to go quickly or in a hurry: ",
                            "examples": [
                                "Would you run to the post office and get me some stamps?",
                                "You don't put on weight when you spend all day running around after small children."
                            ]
                        },
                        {
                            "explanation": "to run fast in order to get or avoid something: ",
                            "examples": [
                                "I ran for the bus but it drove off."
                            ]
                        },
                        {
                            "explanation": "to move your legs as if running, while you stay in one place: ",
                            "examples": [
                                "I run on the spot to warm up before I start training."
                            ]
                        },
                        {
                            "explanation": "in American football, to carry the ball towards the opponent's goal : ",
                            "examples": [
                                "It might be better to run the ball more against this defence instead of trying to pass it. ",
                                "He had a good game, running for 120 yards and two touchdowns. "
                            ]
                        },
                        {
                            "explanation": "to (cause something to) travel, move, or continue in a particular way: ",
                            "examples": [
                                "Trains are still running, despite the snow.",
                                "A bus runs (= goes on a particular route at particular times) three times a day into town.",
                                "Skis are waxed on the bottom so that they run smoothly over the snow.",
                                "The route/railway/road runs (= goes) across the border/into Italy/through the mountains.",
                                "A climbing rose bush runs (= grows) up the side of the door.",
                                "There's a beautiful cornice running around/round all the ceilings.",
                                "The film runs (= lasts) for two hours.",
                                "The show/course/film runs (= continues) for another week.",
                                "A magazine subscription usually only runs (= can be used) for one year.",
                                "Buses are running an hour late, because of an earlier accident.",
                                "The truck's brakes failed and it ran (= went) off the road.",
                                "Trains run on rails (= move along on top of them).",
                                "Electricity is running through (= moving along within) this cable.",
                                "An angry muttering ran through (= went through) the crowd.",
                                "A shiver of fear ran through his (body).",
                                "She ran her finger along/down the page/list, looking for her name.",
                                "Could you run the tape/film/video back/forwards, please?",
                                "Could you possibly run me (= take me in your car) home/to the station?",
                                "He ran (= pushed) his fingers through his hair and looked up at me."
                            ]
                        },
                        {
                            "explanation": "to (cause something to) operate: ",
                            "examples": [
                                "Keep clear of the machines while they're running.",
                                "The government took desperate measures to keep the economy running.",
                                "Do you know how to run this sort of machinery?",
                                "The mechanic asked me to run the engine (= switch it on and allow it to work) for a minute.",
                                "They had the new computer system up and running (= working) within an hour.",
                                "We've run the computer program, but nothing happens.",
                                "We're running (= doing) an experiment.",
                                "The football team asked the coach which play they should run next. "
                            ]
                        },
                        {
                            "explanation": "to be in control of something: ",
                            "examples": [
                                "He's been running a restaurant/his own company since he left school.",
                                "The local college runs (= provides) a course in self-defence.",
                                "a well-run/badly-run organization/business/course"
                            ]
                        },
                        {
                            "explanation": "to control a business or other organization firmly and effectively: ",
                            "examples": [
                                "Ruth runs a tight ship and has no time for shirkers."
                            ]
                        },
                        {
                            "explanation": "If you run a car, you own one, drive it, and pay for the costs: ",
                            "examples": [
                                "I can't afford to run a car."
                            ]
                        },
                        {
                            "explanation": "to organize the way you live or work: ",
                            "examples": [
                                "Some people run their lives according to the movements of the stars."
                            ]
                        },
                        {
                            "explanation": "to (cause something to) flow or produce liquid : ",
                            "examples": [
                                "I can feel trickles of sweat running down my neck.",
                                "Don't cry, or your make-up will run (= become liquid and move down your face).",
                                "The walls were running with damp.",
                                "The river runs (down) to/into the sea.",
                                "The hot tap is running cold (= producing cold water)!",
                                "I turned the tap on and ran some cold water on the burn.",
                                "I'll run you a hot bath (= fill a bath with water for you).",
                                "My nose and eyes have been running all week because of hay fever.",
                                "After twelve hours at her computer, the words began to run into one another (= seem mixed together)."
                            ]
                        },
                        {
                            "explanation": "(of colours in clothes, etc.) to come out or spread: ",
                            "examples": [
                                "I must have washed my dress at too high a temperature, because the colour has run.",
                                "If the first layer isn't dry before you add the next one, the colours will run into each other (= mix)."
                            ]
                        },
                        {
                            "explanation": "to be or become: ",
                            "examples": [
                                "Differences between the two sides run deep (= are serious).",
                                "The river/reservoir/well ran dry (= its supply of water finished).",
                                "Supplies are running low (= there's not much left).",
                                "We're beginning to run short of money/Money is beginning to run short (= there's not much left)."
                            ]
                        },
                        {
                            "explanation": "If tights (= thin clothing that covers the legs) run, a long, thin hole appears in them: ",
                            "examples": [
                                "Oh no, my tights have run!"
                            ]
                        },
                        {
                            "explanation": "to show something in a newspaper or magazine, on television, etc.: ",
                            "examples": [
                                "All the newspapers ran (= printed) stories about the new peace talks.",
                                "Channel 4 is running a series on the unfairness of the legal system."
                            ]
                        },
                        {
                            "explanation": "If a film is running at a particular place, you can see it there: ",
                            "examples": [
                                "What's running at the the Metro this week?"
                            ]
                        },
                        {
                            "explanation": "to compete as a candidate in an election: ",
                            "examples": [
                                "Mrs Thatcher wanted to run a fourth time.",
                                "He's going to run against Smith in the election.",
                                "I think she might run for re-election."
                            ]
                        },
                        {
                            "explanation": "to suggest and support someone as a candidate (= someone competing to get a job or elected position): ",
                            "examples": [
                                "He wanted to run her for district attorney of Brooklyn.",
                                "At the time, some thought running Obama for president in 2008 was premature."
                            ]
                        },
                        {
                            "explanation": "to compete as a candidate in an election for a position of authority and responsibility in a government or other organization: ",
                            "examples": [
                                "She is considering running for office."
                            ]
                        },
                        {
                            "explanation": "to take guns or drugs illegally from one place to another: ",
                            "examples": [
                                "He was arrested for running drugs across the border.",
                                "Gangs are running guns into the city, and that is increasing violent crime."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rʌn"
                            ],
                            "us": [
                                "rʌn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the action of running, especially for exercise: ",
                            "examples": [
                                "We go for/do a three-mile run every evening after work.",
                                "If you set off at a run (= running), you'll be exhausted later."
                            ]
                        },
                        {
                            "explanation": "a journey: ",
                            "examples": [
                                "The number of aircraft on the New York-Moscow run is being increased.",
                                "Let's go for a run (out) in the car somewhere.",
                                "The plane swooped in on its bombing run."
                            ]
                        },
                        {
                            "explanation": "the period during which a play is performed: ",
                            "examples": [
                                "The musical's London run was a disaster.",
                                "They're doing a run at the Cambridge Playhouse."
                            ]
                        },
                        {
                            "explanation": "a situation in which many people suddenly buy a particular product: ",
                            "examples": [
                                "There's been a run on umbrellas because of all this rain."
                            ]
                        },
                        {
                            "explanation": "a situation in which many people suddenly sell a particular product: ",
                            "examples": [
                                "A sudden run on the dollar has lowered its value."
                            ]
                        },
                        {
                            "explanation": "A run of something is a continuous period during which it lasts or is repeated: ",
                            "examples": [
                                "a run of successes/defeats/bad luck"
                            ]
                        },
                        {
                            "explanation": "the usual type of something: ",
                            "examples": [
                                "Their food is the general run of hotel cooking."
                            ]
                        },
                        {
                            "explanation": "an area of ground of limited size for keeping animals: ",
                            "examples": [
                                "a sheep/chicken/hen run"
                            ]
                        },
                        {
                            "explanation": "in cricket and baseball, a single point, scored by running from one place to another: ",
                            "examples": [
                                "England need 105 runs to win the game.",
                                "The pitcher allowed three runs in just two innings."
                            ]
                        },
                        {
                            "explanation": "a long, vertical hole in tights and stockings: ",
                            "examples": [
                                "I've got a run in my tights from the nail on my chair."
                            ]
                        },
                        {
                            "explanation": "a condition of the bowels in which the contents are passed out of the body too often and in a form that is too liquid",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}