{
    "word": "rush",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rʌʃ"
                            ],
                            "us": [
                                "rʌʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) go or do something very quickly: ",
                            "examples": [
                                "I've been rushing (about/around) all day trying to get everything done.",
                                "I rushed up the stairs/to the office/to find a phone.",
                                "When she turned it upside down the water rushed out.",
                                "We shouldn't rush to blame them.",
                                "You can't rush a job like this.",
                                "The emergency legislation was rushed through Parliament in a morning.",
                                "Don't rush me!",
                                "The United Nations has rushed medical aid and food to the famine zone.",
                                "He rushed the children off to school so they wouldn't be late."
                            ]
                        },
                        {
                            "explanation": "If a group of people rush an enemy or the place where an enemy is, they attack suddenly and all together: ",
                            "examples": [
                                "We rushed the palace gates and killed the guards."
                            ]
                        },
                        {
                            "explanation": "In American football, to rush is to carry the ball forward across the place on the field where play begins. Also, a member of the opposite team rushes when they force their way to the back of the field quickly to catch the player carrying the ball.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rʌʃ"
                            ],
                            "us": [
                                "rʌʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a situation in which you have to hurry or move somewhere quickly: ",
                            "examples": [
                                "Slow down! What's the rush?",
                                "Why is it always such a rush to get ready in the mornings?",
                                "Everyone seemed to be in a rush.",
                                "He was in a rush to get home.",
                                "They were in no rush to sell the house."
                            ]
                        },
                        {
                            "explanation": "a time when a lot of things are happening or a lot of people are trying to do or get something: ",
                            "examples": [
                                "There's always a rush to get the best seats.",
                                "I try to do my shopping before the Christmas rush.",
                                "There's been a rush for (= sudden popular demand for) tickets."
                            ]
                        },
                        {
                            "explanation": "the act of suddenly moving somewhere quickly: ",
                            "examples": [
                                "There was a rush of air as she opened the door.",
                                "They made a rush at him to get his gun."
                            ]
                        },
                        {
                            "explanation": "a sudden movement of people to a certain area, usually because of some economic advantage: ",
                            "examples": [
                                "the California gold rush"
                            ]
                        },
                        {
                            "explanation": "in American football, an attempt to run forwards carrying the ball, or an attempt to quickly reach and stop a player from the opposing team who is carrying the ball",
                            "examples": []
                        },
                        {
                            "explanation": "a sudden strong emotion or physical feeling: ",
                            "examples": [
                                "The memory of who he was came back to him with a rush.",
                                "I had my first cigarette for a year and felt a sudden rush (of dizziness)."
                            ]
                        },
                        {
                            "explanation": "a plant like grass that grows in or near water and whose long, thin, hollow stems can be dried and made into floor coverings, containers, etc.: ",
                            "examples": [
                                "a rush mat"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}