{
    "word": "sack",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sæk"
                            ],
                            "us": [
                                "sæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large bag made of strong cloth, paper, or plastic, used to store large amounts of something: ",
                            "examples": [
                                "The corn was stored in large sacks.",
                                "a sack of potatoes/coal/flour"
                            ]
                        },
                        {
                            "explanation": "a paper or plastic bag used to carry things, especially things bought in a food shop: ",
                            "examples": [
                                "a sack of groceries"
                            ]
                        },
                        {
                            "explanation": "a situation in which someone is removed from their job: ",
                            "examples": [
                                "They gave him the sack for being late.",
                                "Two workers got the sack for fighting in the warehouse.",
                                "I heard she got the sack last week."
                            ]
                        },
                        {
                            "explanation": "an attack on a building or town in which a lot of destruction is caused and many valuable things are stolen: ",
                            "examples": [
                                "The sack of Rome by the Visigoths occurred in the fifth century."
                            ]
                        },
                        {
                            "explanation": "in American football, an attack on the quarterback that prevents him from throwing the ball: ",
                            "examples": [
                                "The Colts have allowed only six sacks this season."
                            ]
                        },
                        {
                            "explanation": "bed: ",
                            "examples": [
                                "It's late - I'm going to hit the sack (= go to bed).",
                                "He came home and found Judy and Brad in the sack (= in bed) together."
                            ]
                        },
                        {
                            "explanation": "If someone is good/bad in the sack, they are sexually skilled/not sexually skilled: ",
                            "examples": [
                                "Isabel used to say she was only with him because he was so good in the sack."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sæk"
                            ],
                            "us": [
                                "sæk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to remove someone from a job, usually because they have done something wrong or badly, or sometimes as a way of saving the cost of employing them: ",
                            "examples": [
                                "They sacked her for being late.",
                                "He got sacked from his last job."
                            ]
                        },
                        {
                            "explanation": "in American football, to attack the quarterback in order to prevent him from throwing the ball: ",
                            "examples": [
                                "The quarterback was sacked only once and completed 16 out of 23 passes."
                            ]
                        },
                        {
                            "explanation": "to attack a building or town, causing a lot of destruction and stealing many valuable things: ",
                            "examples": [
                                "The invaders sacked every village they passed on their route."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}