{
    "word": "safe",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "seɪf"
                            ],
                            "us": [
                                "seɪf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not in danger or likely to be harmed: ",
                            "examples": [
                                "In some cities you don't feel safe going out alone at night."
                            ]
                        },
                        {
                            "explanation": "not harmed or damaged: ",
                            "examples": [
                                "She said that all the hostages were safe."
                            ]
                        },
                        {
                            "explanation": "completely safe and without injury or damage: ",
                            "examples": [
                                "After three days lost in the mountains, all the climbers arrived home safe and sound."
                            ]
                        },
                        {
                            "explanation": "not dangerous or likely to cause harm: ",
                            "examples": [
                                "a safe play area for children",
                                "a safe driver",
                                "That ladder doesn't look safe.",
                                "She wished us a safe journey.",
                                "Is this medicine safe for children?",
                                "It's safe to cross the road now."
                            ]
                        },
                        {
                            "explanation": "(of a place) where something is not likely to be lost or stolen: ",
                            "examples": [
                                "Keep your passport in a safe place."
                            ]
                        },
                        {
                            "explanation": "used to refer to things that do not involve any risk: ",
                            "examples": [
                                "I think we should go for the safest option (= the one that involves the least risks).",
                                "He never remembers my birthday, so it's a safe bet (= I am certain) he'll forget again this time!"
                            ]
                        },
                        {
                            "explanation": "If an official elected position in is safe, it is likely to be won by the political party that has won it at previous elections: ",
                            "examples": [
                                "a safe Conservative seat"
                            ]
                        },
                        {
                            "explanation": "In baseball, if a player is safe, they have reached one of the bases (= positions that a player must reach to score a point) successfully before they have been tagged (= touched with the ball to end their turn) by an opponent or before the ball has been thrown to a player defending the base: ",
                            "examples": [
                                "The umpire called the runner safe.",
                                "The throw was too late and Perez was safe at second base."
                            ]
                        },
                        {
                            "explanation": "used to say that you like and approve of someone or something: ",
                            "examples": [
                                "He was a safe guy. He was decent, kind and caring, he put others before himself."
                            ]
                        },
                        {
                            "explanation": "used to show that you agree or are happy with something: ",
                            "examples": [
                                "\"You OK?\" \"Safe, man,\" Shaun muttered."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "seɪf"
                            ],
                            "us": [
                                "seɪf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a strong box or cupboard with special locks where valuable things, especially money or jewels (= precious stones), are kept: ",
                            "examples": [
                                "Thieves broke into/cracked (= opened by force) the safe and stole everything in it."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}