{
    "word": "saved",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nsave ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "seɪv"
                            ],
                            "us": [
                                "seɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to stop someone or something from being killed, injured, or destroyed: ",
                            "examples": [
                                "Wearing seat belts has saved many lives.",
                                "He fell in the river but his friend saved him from drowning.",
                                "He had to borrow money to save his business.",
                                "He was desperately trying to save their failing marriage.",
                                "We all need to do our part to save the planet.",
                                "The former tennis champion was now serving to save the match (= to win the next point so that the other player did not win this part of the competition)."
                            ]
                        },
                        {
                            "explanation": "to stop someone from being killed",
                            "examples": []
                        },
                        {
                            "explanation": "to help someone escape from a difficult or unpleasant situation: ",
                            "examples": [
                                "Thanks for helping me with that report - you saved my life!"
                            ]
                        },
                        {
                            "explanation": "to keep something, especially money, for use in the future: ",
                            "examples": [
                                "Tom's been saving his pocket money every week.",
                                "We're saving (up) for a new car.",
                                "I save all my old letters in case I want to read them again.",
                                "Save me a place at your table, OK?"
                            ]
                        },
                        {
                            "explanation": "to put information into a computer's memory or onto a computer disk: ",
                            "examples": [
                                "Don't forget to save your work regularly.",
                                "To save, press Control S."
                            ]
                        },
                        {
                            "explanation": "to prevent time, money, or effort being wasted or spent: ",
                            "examples": [
                                "You'll save time if you take the car.",
                                "Thanks for your help - it saved me a lot of work.",
                                "I'll lend you a bag for your trip - it'll save you buying one.",
                                "Can you save it for later (= tell me your news later when I am less busy)?"
                            ]
                        },
                        {
                            "explanation": "in football and similar games, to stop the ball from going into the goal when a player on the other team has kicked or hit it",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}