{
    "word": "scale",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skeɪl"
                            ],
                            "us": [
                                "skeɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a set of numbers, amounts, etc., used to measure or compare the level of something: ",
                            "examples": [
                                "the Centigrade/Fahrenheit scale",
                                "How would you rate his work on a scale of 1 to 5?"
                            ]
                        },
                        {
                            "explanation": "the relation between the real size of something and its size on a map, model, or diagram: ",
                            "examples": [
                                "a scale of 1:50,000",
                                "This map is large scale (= things are shown in detail).",
                                "Is the bridge drawn to scale (= so that it shows the exact shape of the bridge, but much smaller)?",
                                "He was building a scale model of the Empire State Building."
                            ]
                        },
                        {
                            "explanation": "the size or level of something, especially when this is large: ",
                            "examples": [
                                "We don't yet know the scale of the problem.",
                                "Nuclear weapons cause destruction on a massive scale (= cause a lot of destruction).",
                                "My parents used to entertain friends on a large/small scale (= they had large/small parties)."
                            ]
                        },
                        {
                            "explanation": "a device for weighing things or people: ",
                            "examples": [
                                "kitchen/bathroom scales"
                            ]
                        },
                        {
                            "explanation": "a weighing device with two containers connected to a metal bar that is free to move up and down about its fixed central point. An object of known weight is put in one container and the thing to be weighed is put in the other.",
                            "examples": []
                        },
                        {
                            "explanation": "a set of notes played or sung in order, going up or down: ",
                            "examples": [
                                "the scale of G major",
                                "You should practise your scales every day."
                            ]
                        },
                        {
                            "explanation": "one of the many very small, flat pieces that cover the skin of fish, snakes, etc.",
                            "examples": []
                        },
                        {
                            "explanation": "a hard, white or grey layer of material that forms on the inside of pipes or containers that heat water",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skeɪl"
                            ],
                            "us": [
                                "skeɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to climb up a steep surface, such as a wall or the side of a mountain, often using special equipment: ",
                            "examples": [
                                "The prisoner scaled the high prison wall and ran off."
                            ]
                        },
                        {
                            "explanation": "to remove tartar (= hard white substance) and plaque (= soft substance in which bacteria breed) from teeth: ",
                            "examples": [
                                "The dentist scaled and polished my teeth last week."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}