{
    "word": "scarify",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈskær.ɪ.faɪ"
                            ],
                            "us": [
                                "ˈsker.ɪ.faɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use a scarifier (= a tool with sharp points) to break up and remove unwanted grass or plants that are covering the surface of a lawn (= an area of grass): ",
                            "examples": [
                                "It is important to scarify regularly to avoid a mossy and spongy lawn.",
                                "When is the best time to scarify your lawn?"
                            ]
                        },
                        {
                            "explanation": "to use a scarifier (= a machine with sharp points) to break up the surface of the ground or a road: ",
                            "examples": [
                                "The work will include scarifying the asphalt to improve the road surface."
                            ]
                        },
                        {
                            "explanation": "to make small cuts in someone's skin, especially for cultural reasons: ",
                            "examples": [
                                "The boy was scarified, but every effort was made to reduce his suffering to the minimum.",
                                "It would be very shocking if a supermodel decided to scarify her skin in the name of art."
                            ]
                        },
                        {
                            "explanation": "to break into the surface of the outer part of a seed, either by cutting it or using chemicals, in order to help it to germinate (= start to grow): ",
                            "examples": [
                                "Once canna seeds have been scarified, they are easy to grow.",
                                "Seeds were scarified prior to sowing or later during incubation."
                            ]
                        },
                        {
                            "explanation": "to express strong disapproval of someone, especially in an unpleasant or cruel way: ",
                            "examples": [
                                "He scarified our leading politicians, seizing upon their vulnerable points with a destructive analysis that left them bereft of merit or morality. ",
                                "His scarifying essays were capable of destroying literary reputations. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}