{
    "word": "scratch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skrætʃ"
                            ],
                            "us": [
                                "skrætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut or damage a surface or your skin slightly with or on something sharp or rough: ",
                            "examples": [
                                "We scratched the wall trying to get the bed into Martha's room.",
                                "Be careful not to scratch yourself on the roses.",
                                "A few chickens were scratching about/around (= searching with their beaks) in the yard for grain."
                            ]
                        },
                        {
                            "explanation": "If you scratch something on or off a surface, you add it or remove it by scratching: ",
                            "examples": [
                                "People have been scratching their names on this rock for years.",
                                "I scratched some paint off the door as I was getting out of the car."
                            ]
                        },
                        {
                            "explanation": "If an animal scratches, it rubs something with its claws (= sharp nails): ",
                            "examples": [
                                "The dog's scratching at the door – he wants to be let in."
                            ]
                        },
                        {
                            "explanation": "to rub your skin with your nails: ",
                            "examples": [
                                "He was scratching (at) his mosquito bites.",
                                "Hannah scratched her head thoughtfully."
                            ]
                        },
                        {
                            "explanation": "to remove yourself or another person or an animal from a competition before the start: ",
                            "examples": [
                                "The world champion scratched from the 800 metres after injuring herself the day before.",
                                "They scratched the horse from the race because she had become lame."
                            ]
                        },
                        {
                            "explanation": "to decide not to do something you had planned to do: ",
                            "examples": [
                                "We had to scratch our plans when I lost my job."
                            ]
                        },
                        {
                            "explanation": "used for saying you take back something you have just said, especially in order to say it in a better way or to say something different: ",
                            "examples": [
                                "Everything I did was in the cause of safety. No, scratch that – not safety but survival.",
                                "It would have been better to say your brother wasn’t driving the car at all. Scratch that – telling the truth is usually best in the end. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skrætʃ"
                            ],
                            "us": [
                                "skrætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a mark made by scratching: ",
                            "examples": [
                                "Her legs were covered in scratches and bruises after her walk through the forest.",
                                "There was a scratch on the CD.",
                                "Amazingly, he survived the accident without a scratch (= without suffering any injuries at all)."
                            ]
                        },
                        {
                            "explanation": "an act of scratching: ",
                            "examples": [
                                "That dog is having a good scratch. It must have fleas."
                            ]
                        },
                        {
                            "explanation": "a person or animal that leaves a competition before it starts: ",
                            "examples": [
                                "The Australian Open winner was a late scratch.",
                                "He was a last-minute scratch from Sunday's game because of inflammation in his right knee."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "skrætʃ"
                            ],
                            "us": [
                                "skrætʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of people brought together in a hurry in order to play together on a particular occasion: ",
                            "examples": [
                                "He knew that any shortcomings of what was essentially a scratch side would be exposed by the opposition."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}