{
    "word": "scratching",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈskrætʃ.ɪŋ"
                            ],
                            "us": [
                                "ˈskrætʃ.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of rubbing your skin with your nails: ",
                            "examples": [
                                "There are lots of hand movements and scratching of chins.",
                                "Keep your fingernails short to avoid skin damage from any unconscious scratching."
                            ]
                        },
                        {
                            "explanation": "the sound of something such as an animal's sharp nails rubbing on a surface: ",
                            "examples": [
                                "Then I heard it again - the sound of scratching behind the wall. ",
                                "The scratching of his pen was the only sound.",
                                "They were soft scratchings or shufflings, like the sounds made by an animal as it sniffed about in search of food."
                            ]
                        },
                        {
                            "explanation": "cuts on or damage to a surface caused by something hard or rough rubbing on it: ",
                            "examples": [
                                "Metal utensils will cause some scratching of the surface of your non-stick cookware."
                            ]
                        },
                        {
                            "explanation": "writing cut into the surface of something: ",
                            "examples": [
                                "In the abandoned school there were hundreds of scratchings carved into wooden desktops.",
                                "These characters were more like the ancient scratchings on Chinese oracle bones than their complicated modern Chinese counterparts."
                            ]
                        },
                        {
                            "explanation": "writing, especially notes written in a quick and untidy way: ",
                            "examples": [
                                "I looked at the scratchings on my notepad.",
                                "These are not the scratchings of someone who is keeping up with current events."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}