{
    "word": "scramble",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈskræm.bəl"
                            ],
                            "us": [
                                "ˈskræm.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move or climb quickly but with difficulty, often using your hands to help you: ",
                            "examples": [
                                "She scrambled up the steep hillside and over the rocks.",
                                "He scrambled into his clothes (= put them on quickly) and raced to get help.",
                                "As the burning plane landed, the terrified passengers scrambled for the door (= tried to reach the door quickly)."
                            ]
                        },
                        {
                            "explanation": "to compete with other people for something there is very little of: ",
                            "examples": [
                                "People are scrambling to buy property before prices rise even further."
                            ]
                        },
                        {
                            "explanation": "(of a quarterback in American football) to run quickly with the ball to avoid an opponent who has broken through the line of players that protects them: ",
                            "examples": [
                                "The quarterback saw the defender coming and scrambled to his right for six yards. "
                            ]
                        },
                        {
                            "explanation": "to put things such as words or letters in the wrong order so that they do not make sense: ",
                            "examples": [
                                "He had a habit of scrambling his words when excited."
                            ]
                        },
                        {
                            "explanation": "to mix food as it is being fried, especially eggs or tofu (= a soft, pale food that has very little flavour but is high in protein, made from the seed of the soya plant): ",
                            "examples": [
                                "I’m sure this dish would be just as delicious if you scrambled the eggs first.",
                                "You can use any kind of tofu when scrambling it."
                            ]
                        },
                        {
                            "explanation": "to change a radio or phone signal so that it can only be understood using a special device",
                            "examples": []
                        },
                        {
                            "explanation": "to (cause a plane to) take off very quickly: ",
                            "examples": [
                                "A helicopter was scrambled within minutes of the news."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈskræm.bəl"
                            ],
                            "us": [
                                "ˈskræm.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a climb that is difficult so that you have to use your hands to help you: ",
                            "examples": [
                                "It was a real scramble to the top of the hillside."
                            ]
                        },
                        {
                            "explanation": "an act of hurrying: ",
                            "examples": [
                                "As soon as the plane landed there was a mad/wild scramble to get out."
                            ]
                        },
                        {
                            "explanation": "a hurried attempt to get something: ",
                            "examples": [
                                "After the death of the dictator there was an unseemly scramble for power among the generals."
                            ]
                        },
                        {
                            "explanation": "a \nmotocross  event: ",
                            "examples": [
                                "We're planning a scramble through the forest next weekend."
                            ]
                        },
                        {
                            "explanation": "a dish of food that is mixed as it is being fried, especially eggs or tofu (= a soft, pale food that has very little flavour but is high in protein, made from the seed of the soya plant): ",
                            "examples": [
                                "a potato-sausage scramble",
                                "tofu scramble with mushrooms and spinach "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}