{
    "word": "screen",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skriːn"
                            ],
                            "us": [
                                "skriːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a flat surface in a cinema, on a television, or as part of a computer, on which pictures or words are shown: ",
                            "examples": [
                                "Our television has a 19-inch screen.",
                                "Coming to your screens (= cinemas) shortly, \"The Adventures of Robin Hood\".",
                                "Her ambition is to write for the screen (= for television and films).",
                                "Write the letter on the computer, then you can make changes easily on screen."
                            ]
                        },
                        {
                            "explanation": "television: ",
                            "examples": [
                                "He's made several films for the small screen."
                            ]
                        },
                        {
                            "explanation": "cinema: ",
                            "examples": [
                                "So this is your first appearance on the big screen?"
                            ]
                        },
                        {
                            "explanation": "a vertical structure that is used to separate one area from another, especially to hide something or to protect you from something unpleasant or dangerous: ",
                            "examples": [
                                "The nurse pulled a screen around the bed so that the doctor could examine the patient in private.",
                                "A screen of trees at the bottom of the garden hid the ugly factory walls."
                            ]
                        },
                        {
                            "explanation": "an activity that is not dangerous or illegal but is used to hide something that is: ",
                            "examples": [
                                "That café's just a screen for their criminal activities."
                            ]
                        },
                        {
                            "explanation": "in American football, an occasion when the ball is thrown to a player behind the line of scrimmage (= the line on which the ball is positioned at the beginning of a period of action) who runs behind a line of other players who try to stop the defence from tackling that player: ",
                            "examples": [
                                "They set up a screen to the wide receiver, who ran for 14 yards and a first down. ",
                                "The running back caught a screen pass, but was tackled before he could advance the ball. "
                            ]
                        },
                        {
                            "explanation": "in sports such as basketball and ice hockey, an occasion when a player is blocked by one opponent from approaching and stopping another opponent who has the ball or puck: ",
                            "examples": [
                                "They set up a screen for the forward, who advanced to the basket to score. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skriːn"
                            ],
                            "us": [
                                "skriːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to test or examine someone or something to discover if there is anything wrong with him, her, or it: ",
                            "examples": [
                                "Women over 50 should be screened for breast cancer.",
                                "Completely unsuitable candidates were screened out (= tested and refused) at the first interview."
                            ]
                        },
                        {
                            "explanation": "to delay your decision to answer the phone until you know who is calling you: ",
                            "examples": [
                                "I always screen my calls while I'm eating dinner."
                            ]
                        },
                        {
                            "explanation": "to show or broadcast a film or television programme: ",
                            "examples": [
                                "The programme was not screened on British television."
                            ]
                        },
                        {
                            "explanation": "to protect or hide: ",
                            "examples": [
                                "She raised her hand to screen her eyes from the bright light."
                            ]
                        },
                        {
                            "explanation": "to protect someone by taking the blame yourself: ",
                            "examples": [
                                "The husband says he's the murderer but we think it was his wife - he's just screening her."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}