{
    "word": "screw",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skruː"
                            ],
                            "us": [
                                "skruː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thin, pointed piece of metal with a raised edge twisting round along its length and a flat top with a cut in it, used to join things together, especially pieces of wood",
                            "examples": []
                        },
                        {
                            "explanation": "an act of twisting or turning done to fasten or tighten something: ",
                            "examples": [
                                "Give it another screw to make sure the lid doesn't come off while we're travelling."
                            ]
                        },
                        {
                            "explanation": "(a word used especially by prisoners) a prison guard",
                            "examples": []
                        },
                        {
                            "explanation": "the act of sex, or a sexual partner: ",
                            "examples": [
                                "I never feel like a screw when I wake up in the morning.",
                                "He's a really good screw."
                            ]
                        },
                        {
                            "explanation": "→ \nthumbscrew : ",
                            "examples": [
                                "Tell me or I'll tighten the screws."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skruː"
                            ],
                            "us": [
                                "skruː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fasten something using a screw: ",
                            "examples": [
                                "Screw this piece of wood to the wall.",
                                "Screw these two pieces together."
                            ]
                        },
                        {
                            "explanation": "to fasten something using an object similar to a screw: ",
                            "examples": [
                                "We'll have to screw a hook into the wall."
                            ]
                        },
                        {
                            "explanation": "If something screws in/together, it fits or fastens together by being turned: ",
                            "examples": [
                                "This light bulb screws in."
                            ]
                        },
                        {
                            "explanation": "to tighten the muscles of your face or part of your face into a particular expression, especially one of disapproval or pain: ",
                            "examples": [
                                "He screwed his eyes tight shut against the bright light.",
                                "The woman at the breakfast table screwed her mouth into a grimace."
                            ]
                        },
                        {
                            "explanation": "to twist and crush something, especially paper or cloth, roughly with your hands: ",
                            "examples": [
                                "She screwed the bag up and threw it in the bin.",
                                "He screwed the letter into a ball and flung it away."
                            ]
                        },
                        {
                            "explanation": "to fasten something by turning it or twisting it: ",
                            "examples": [
                                "Screw the lid firmly on to the jar and shake well."
                            ]
                        },
                        {
                            "explanation": "to cheat or deceive someone: ",
                            "examples": [
                                "It was only after we'd had the car for a few days that we realized we'd been screwed by the dealer."
                            ]
                        },
                        {
                            "explanation": "to have sex with someone: ",
                            "examples": [
                                "They say he's screwing the boss's wife."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}