{
    "word": "screamer",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈskriː.mər"
                            ],
                            "us": [
                                "ˈskriː.mɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who screams (= cries out loudly in a high voice): ",
                            "examples": [
                                "He heard the screams before he saw the screamer.",
                                "I dug my fingernails into the beauty therapist's table, determined not to be the first screamer."
                            ]
                        },
                        {
                            "explanation": "someone who shouts a lot, especially in an angry way: ",
                            "examples": [
                                "The screamer uses rage and temper tantrums to intimidate.",
                                "Her boss was a screamer, demeaning and embarrassing her and her co-workers in public.",
                                "After tolerating foul language for years from overaggressive sideline screamers, college referees intend to clean up bad language."
                            ]
                        },
                        {
                            "explanation": "someone who sings in a very loud, high-pitched way: ",
                            "examples": [
                                "He's a screamer and by the end of the show, it sounded like he'd screeched the flesh off his throat."
                            ]
                        },
                        {
                            "explanation": "a device that makes a very loud, unpleasant sound: ",
                            "examples": [
                                "My car alarm is equipped with extra screamers inside the cabin, so its quite painful to be inside when it goes off."
                            ]
                        },
                        {
                            "explanation": "an internet video that pretends to be an image, game, test, etc. but is intended to frighten or shock you unexpectedly: ",
                            "examples": [
                                "How can you avoid screamers on YouTube?",
                                "Screamers are uploaded to a site by pranksters, and they can be both surprising and upsetting. "
                            ]
                        },
                        {
                            "explanation": "something that is extremely good: ",
                            "examples": [
                                "It's an absolute screamer of a deal.",
                                "My current computer was built in March 2009 but it's still a screamer."
                            ]
                        },
                        {
                            "explanation": "a very good shot or kick, especially one that is hit hard and that travels a long distance, or a goal, etc. that is scored from such a shot: ",
                            "examples": [
                                "He finished off by diving way to his left and catching a screamer.",
                                "United scored an absolute screamer."
                            ]
                        },
                        {
                            "explanation": "a very large newspaper headline (= title), especially one that says something shocking: ",
                            "examples": [
                                "The tabloids make every headline a screamer.",
                                "The newspaper industry depends on \"interactivity\" with readers rather than daily screamer headlines and scandal."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}