{
    "word": "script",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skrɪpt"
                            ],
                            "us": [
                                "skrɪpt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the words of a film, play, broadcast, or speech: ",
                            "examples": [
                                "Bruce Robinson wrote the script for \"The Killing Fields\"."
                            ]
                        },
                        {
                            "explanation": "the way people are expected to behave or the way a situation is expected to be: ",
                            "examples": [
                                "The Stones wrote the script for how a rock band should behave and misbehave.",
                                "The Earth is refusing to follow the script climatologists have written for it. "
                            ]
                        },
                        {
                            "explanation": "a set of letters used for writing a particular language: ",
                            "examples": [
                                "Arabic/Cyrillic/Roman script"
                            ]
                        },
                        {
                            "explanation": "writing, especially when well-formed: ",
                            "examples": [
                                "The invitation was written in beautiful italic script."
                            ]
                        },
                        {
                            "explanation": "a type of language for programming computers that is used for finding and showing websites on the internet",
                            "examples": []
                        },
                        {
                            "explanation": "an answer paper written by a student in an exam: ",
                            "examples": [
                                "Don't forget to write your name at the top of your script."
                            ]
                        },
                        {
                            "explanation": "short for \nprescription a piece of paper or an electronic document on which a doctor writes the details of the medicine or other treatment that someone needs. Script is short for : ",
                            "examples": [
                                "She went to her doctor who wrote her a script for antidepressants."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skrɪpt"
                            ],
                            "us": [
                                "skrɪpt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to write the words of a film, play, broadcast, or speech: ",
                            "examples": [
                                "He scripted the TV series \"Homicide\".",
                                "He's a very good actor, but the part was scripted for an older person."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}