{
    "word": "seal",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "siːl"
                            ],
                            "us": [
                                "siːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large mammal that eats fish and lives partly in the sea and partly on land or ice",
                            "examples": []
                        },
                        {
                            "explanation": "something fixed around the edge of an opening to prevent liquid or gas flowing through it: ",
                            "examples": [
                                "Clean the seal on/around the fridge door regularly so that it remains airtight."
                            ]
                        },
                        {
                            "explanation": "a thin piece of material such as paper or plastic that covers the opening of a container and has to be broken in order to open the container and use the contents",
                            "examples": []
                        },
                        {
                            "explanation": "an official mark on a document, sometimes made with wax, that shows that it is legal or has been officially approved: ",
                            "examples": [
                                "The lawyer stamped the certificate with her seal."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "siːl"
                            ],
                            "us": [
                                "siːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to close an entrance or container so that nothing can enter or leave it",
                            "examples": []
                        },
                        {
                            "explanation": "to cover a surface with a special liquid to protect it: ",
                            "examples": [
                                "This floor has just been sealed (with varnish), so don't walk on it!"
                            ]
                        },
                        {
                            "explanation": "to close a letter or parcel by sticking the edges together: ",
                            "examples": [
                                "Seal the package (up) with tape.",
                                "He sealed (down) the envelope and put a stamp on it."
                            ]
                        },
                        {
                            "explanation": "to make an agreement more certain or to approve it formally: ",
                            "examples": [
                                "The two leaders sealed their agreement with a handshake."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "siːl"
                            ],
                            "us": [
                                "siːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in the US and some other countries, a member of an elite (= especially good and highly trained) force within the navy that deals with special operations that involve water. SEAL is an abbreviation for Sea, Air, and Land Team: ",
                            "examples": [
                                "The 23-year-old from Massachusetts wants to become a Navy SEAL.",
                                "Tributes were paid to the Thai Navy Seal who died during the cave rescue."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}