{
    "word": "season",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsiː.zən"
                            ],
                            "us": [
                                "ˈsiː.zən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "one of the four periods of the year; spring, summer, autumn, or winter",
                            "examples": []
                        },
                        {
                            "explanation": "the period of the year when something that happens every year happens: ",
                            "examples": [
                                "How long does the dry/hurricane/monsoon season last?"
                            ]
                        },
                        {
                            "explanation": "the period of the year during which a particular sport is played: ",
                            "examples": [
                                "The British football season begins in August."
                            ]
                        },
                        {
                            "explanation": "the period when most people take their holidays, spend time with their families, go to visit places, or take part in an activity outside work: ",
                            "examples": [
                                "Air fares are more expensive during the holiday season."
                            ]
                        },
                        {
                            "explanation": "one of several series of television programmes with the same title and the same characters: ",
                            "examples": [
                                "the third season of Homeland"
                            ]
                        },
                        {
                            "explanation": "a period when a set of programmes, plays, or musical events are broadcast or performed: ",
                            "examples": [
                                "There will be more documentaries and fewer quiz shows in the autumn season on TV.",
                                "There's a season (US festival) of 1960s French films at the Arts Cinema next month."
                            ]
                        },
                        {
                            "explanation": "If fruit and vegetables are in season, they are being produced in the area and are available and ready to eat: ",
                            "examples": [
                                "Fruit is cheaper when it's in season."
                            ]
                        },
                        {
                            "explanation": "at the time of year when many people want to travel or have a holiday: ",
                            "examples": [
                                "Hotel rooms are more expensive in season."
                            ]
                        },
                        {
                            "explanation": "A female animal that is in season is ready to have sex and able to become pregnant.",
                            "examples": []
                        },
                        {
                            "explanation": "An animal that is in season can be hunted legally during a particular period of time.",
                            "examples": []
                        },
                        {
                            "explanation": "If fruit and vegetables are out of season, they do not grow in the area during that time: ",
                            "examples": [
                                "In Europe, tomatoes are out of season in winter."
                            ]
                        },
                        {
                            "explanation": "during the period when fewer people want to travel or have a holiday",
                            "examples": []
                        },
                        {
                            "explanation": "during the period when it is not legal to hunt animals",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsiː.zən"
                            ],
                            "us": [
                                "ˈsiː.zən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to improve the flavour of savoury food by adding salt, herbs, or spices when cooking or preparing it: ",
                            "examples": [
                                "Drain the rice, stir in the salmon and season to taste (= so that it has the taste you like)."
                            ]
                        },
                        {
                            "explanation": "to make wood hard by drying it gradually, in order to make it ready for use ",
                            "examples": []
                        },
                        {
                            "explanation": "to put oil or fat onto a pan and then bake it in order to create a good surface for cooking and to prevent rust: ",
                            "examples": [
                                "Cast iron pans need to be seasoned before the first use."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}