{
    "word": "second",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "ordinal number",
                        "ipa": {
                            "uk": [
                                "ˈsek.ənd"
                            ],
                            "us": [
                                "ˈsek.ənd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "immediately after the first and before any others: ",
                            "examples": [
                                "Is Carla her first or second child?",
                                "This is the second time I've had flu this winter.",
                                "Today is the second (of March)."
                            ]
                        },
                        {
                            "explanation": "the position in which a person finishes a race or competition if they finish immediately behind the winner: ",
                            "examples": [
                                "First prize is two weeks in Barbados and second prize is a weekend in Rome.",
                                "Jones took second place in the long jump."
                            ]
                        },
                        {
                            "explanation": "Second is used to show that only one thing is better, bigger, etc. than the thing mentioned: ",
                            "examples": [
                                "St Petersburg is Russia's second (biggest/largest) city.",
                                "Iraq's oil reserves are second only to Saudi Arabia's."
                            ]
                        },
                        {
                            "explanation": "another: ",
                            "examples": [
                                "She is often described as a second Marilyn Monroe.",
                                "You really should make the most of the opportunity, because you won't get a second chance.",
                                "Richard and Liz have a second home in the mountains.",
                                "Pay attention to what she's saying because she won't explain it a second time."
                            ]
                        },
                        {
                            "explanation": "happening only once out of every two possible times: ",
                            "examples": [
                                "We've decided to hold the conference every second year."
                            ]
                        },
                        {
                            "explanation": "in a group of musicians or singers, relating to the lower of two instruments, voices, or parts: ",
                            "examples": [
                                "She sings second soprano in the school choir.",
                                "I started as second trumpet, and I'm still second trumpet."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈsek.ənd"
                            ],
                            "us": [
                                "ˈsek.ənd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "after the first and before any others: ",
                            "examples": [
                                "Robertson won the race and Cameron was/came/finished second.",
                                "In this business, money comes first and principles come a very poor second (= they are much less important)."
                            ]
                        },
                        {
                            "explanation": "used to introduce the second thing in a list of things you want to say or write: ",
                            "examples": [
                                "There are two good reasons why we can't do it. First, we can't afford it, and second, we don't have time."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsek.ənd"
                            ],
                            "us": [
                                "ˈsek.ənd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a short unit of time that is equal to a 60th of a minute: ",
                            "examples": [
                                "There are 60 seconds in a minute.",
                                "These computers process millions of instructions per second.",
                                "The new system can trace a phone call in a fraction of a second."
                            ]
                        },
                        {
                            "explanation": "a very short period of time: ",
                            "examples": [
                                "\"Come on, hurry up!\" \"I'll just/only be a second - I need to close the window.\"",
                                "Do you have a second, Paul? I need to talk to you.",
                                "It won't take a second (= it will be very quick).",
                                "Wait a couple of/a few seconds before trying again."
                            ]
                        },
                        {
                            "explanation": "as soon as : ",
                            "examples": [
                                "The second I saw him, I knew he was going to be a star."
                            ]
                        },
                        {
                            "explanation": "the second person or thing to do or be something, or the second person or thing mentioned: ",
                            "examples": [
                                "This is the second of the four tests."
                            ]
                        },
                        {
                            "explanation": "an extra amount of food that is given after the first amount has been eaten: ",
                            "examples": [
                                "Would anyone like seconds of ice cream?"
                            ]
                        },
                        {
                            "explanation": "the smallest unit used for measuring an angle: ",
                            "examples": [
                                "There are 3,600 seconds in a degree."
                            ]
                        },
                        {
                            "explanation": "a product that is sold cheaply because it is damaged or not in perfect condition",
                            "examples": []
                        },
                        {
                            "explanation": "a person who takes care of someone who is fighting in a boxing competition or, in the past, in a duel (= organized fight): ",
                            "examples": [
                                "At the end of the fight he had to be helped out of the ring by his seconds."
                            ]
                        },
                        {
                            "explanation": "in a vehicle, the gear that combines power with limited speed and is used when increasing or reducing speed: ",
                            "examples": [
                                "You'll have to change (down/up) into second."
                            ]
                        },
                        {
                            "explanation": "an undergraduate degree from a university in the UK and some other countries that is a good degree but not the best possible",
                            "examples": []
                        },
                        {
                            "explanation": "another word for \nsecond base : ",
                            "examples": [
                                "Garcia reached second on a throwing error.",
                                "He is an equally good fielder at second and shortstop."
                            ]
                        },
                        {
                            "explanation": "In a group of musicians or singers, a second is a person who plays or sings the lower of two parts: ",
                            "examples": [
                                "The first violins were seated on the left side of the stage, opposite the seconds.",
                                "She's usually a second but today she's singing first."
                            ]
                        },
                        {
                            "explanation": "the distance between two musical notes that are two notes apart: ",
                            "examples": [
                                "a major/minor second",
                                "Here, the brass and woodwinds play minor seconds to represent bleating sheep. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsek.ənd"
                            ],
                            "us": [
                                "ˈsek.ənd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a formal statement of support for a suggestion made by someone else during a meeting so that there can be a discussion or vote: ",
                            "examples": [
                                "The motion was proposed by the club's chairwoman and seconded by the secretary.",
                                "\"I could use a drink.\" \"I'll second that (= I agree with you)!\""
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɪˈkɒnd"
                            ],
                            "us": [
                                "səˈkɑːnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to send an employee to work somewhere else temporarily, either to increase the number of workers or to replace other workers, or to exchange experience or skills: ",
                            "examples": [
                                "During the dispute, many police officers were seconded from traffic duty to the prison service."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}