{
    "word": "section",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsek.ʃən"
                            ],
                            "us": [
                                "ˈsek.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "one of the parts that something is divided into: ",
                            "examples": [
                                "the sports section of the newspaper",
                                "the tail section of an aircraft",
                                "Does the restaurant have a non-smoking section?",
                                "The poorest sections of the community have much worse health.",
                                "He was charged under section 17 of the Firearms Act (= according to that part of the law)."
                            ]
                        },
                        {
                            "explanation": "one of the parts of an orchestra (= a group of musicians who play many different instruments together) or band, consisting of people who play the same kind of instruments: ",
                            "examples": [
                                "With the string sections sitting at the front of the stage, they can sometimes overwhelm the woodwind section.",
                                "The piece gave the horn section a chance to shine."
                            ]
                        },
                        {
                            "explanation": "a cut made in part of the body in an operation",
                            "examples": []
                        },
                        {
                            "explanation": "an operation in which a woman's uterus is cut open to allow a baby to be born",
                            "examples": []
                        },
                        {
                            "explanation": "a very thin slice of a part of an animal, plant, or other object made in order to see its structure: ",
                            "examples": [
                                "Each section is mounted on a slide and examined under the microscope."
                            ]
                        },
                        {
                            "explanation": "a drawing or model that shows the structure of something by cutting part of it away: ",
                            "examples": [
                                "This vertical section of the soil shows four basic soil layers."
                            ]
                        },
                        {
                            "explanation": "the shape of a flat surface that is produced when an object is cut into separate pieces",
                            "examples": []
                        },
                        {
                            "explanation": "showing what something would look like if the surface was cut away and you could see inside: ",
                            "examples": [
                                "The first diagram is a view of the building from the street, and the second shows it in section."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsek.ʃən"
                            ],
                            "us": [
                                "ˈsek.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to officially force someone who has mental health problems to stay in a hospital and receive treatment because they might harm themselves or other people: ",
                            "examples": [
                                "He was sectioned under section 4 of the Mental Health Act."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}