{
    "word": "secure",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "sɪˈkjʊər"
                            ],
                            "us": [
                                "səˈkjʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "positioned or fixed firmly and correctly and therefore not likely to move, fall, or break: ",
                            "examples": [
                                "That ladder doesn't look very secure to me.",
                                "Check that all windows and doors are secure."
                            ]
                        },
                        {
                            "explanation": "likely to continue and not fail or be lost: ",
                            "examples": [
                                "Her promotion has made her position in the company more secure.",
                                "The museum has been promised $22 million by the government, so its future is relatively secure.",
                                "She's just left a secure job to start her own company."
                            ]
                        },
                        {
                            "explanation": "(especially of objects, situations, etc.) able to avoid being harmed by any risk, danger, or threat: ",
                            "examples": [
                                "Car manufacturers ought to produce vehicles that are more secure against theft.",
                                "Endangered species need to be kept secure from poachers.",
                                "We've done everything we can to make the house as secure as possible."
                            ]
                        },
                        {
                            "explanation": "(of a computer or phone connection, etc.) safe or protected, for example against someone stealing information: ",
                            "examples": [
                                "He spoke to the president on a secure phone line.",
                                "The data sent and received is encrypted to ensure secure communications."
                            ]
                        },
                        {
                            "explanation": "A secure place is one that it is difficult to get out of or escape from: ",
                            "examples": [
                                "He killed the man just a month after his release from a secure psychiatric hospital.",
                                "At the age of 14 he was placed in secure accommodation."
                            ]
                        },
                        {
                            "explanation": "not doubting or being worried about yourself and your personal relationships: ",
                            "examples": [
                                "Children need to feel secure in order to do well at school."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɪˈkjʊər"
                            ],
                            "us": [
                                "səˈkjʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to get something, sometimes with difficulty: ",
                            "examples": [
                                "He was disappointed by his failure to secure the top job with the bank.",
                                "The change in the law will make it harder for the police to secure convictions."
                            ]
                        },
                        {
                            "explanation": "to make certain something is protected from danger or risk: ",
                            "examples": [
                                "The building has only one main entrance and would be easy to secure (against/from intruders).",
                                "This form of investment is an excellent way of securing your children's financial future."
                            ]
                        },
                        {
                            "explanation": "to make certain that money that has been lent will be paid back, by giving the person who lends the money the right to own property belonging to the person who borrows it, if the money is not paid back: ",
                            "examples": [
                                "a secured loan",
                                "Her bank loan is secured against/by/on her house."
                            ]
                        },
                        {
                            "explanation": "to fasten one object firmly to another: ",
                            "examples": [
                                "The gate won't stay open, so we'll have to secure it to that post."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}