{
    "word": "security",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sɪˈkjʊə.rə.ti"
                            ],
                            "us": [
                                "səˈkjʊr.ə.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "protection of a person, building, organization, or country against threats such as crime or attacks by foreign countries: ",
                            "examples": [
                                "The station was closed for two hours because of a security alert.",
                                "30 demonstrators were killed in clashes with the security forces over the weekend.",
                                "The tighter security measures/precautions include video cameras throughout the city centre.",
                                "The students were deported because they posed a threat to national security.",
                                "The banks must tighten security against fraud.",
                                "The most dangerous criminals are held in maximum-security prisons (= prisons that are as difficult as possible to escape from)."
                            ]
                        },
                        {
                            "explanation": "the group of people responsible for protecting a building: ",
                            "examples": [
                                "You'll need to notify security if you want to work late in the office."
                            ]
                        },
                        {
                            "explanation": "the fact that something is not likely to fail or be lost: ",
                            "examples": [
                                "If it's a choice between higher pay and job security, I'd prefer to keep my job.",
                                "I'm on a temporary contract and have little financial security (= cannot be sure of having enough money to live on)."
                            ]
                        },
                        {
                            "explanation": "property or goods that you promise to give to someone if you cannot pay what you owe them: ",
                            "examples": [
                                "She used her shares in the company as security against a $23 million bank loan.",
                                "The hotel held onto our suitcases as security while we went to the bank to get money to pay the bill."
                            ]
                        },
                        {
                            "explanation": "investment in a company or in government debt that can be traded on the financial markets and produces an income for the investor: ",
                            "examples": [
                                "He pleaded guilty to three counts of securities fraud."
                            ]
                        },
                        {
                            "explanation": "the feeling of being confident in one's family and relationships: ",
                            "examples": [
                                "Most children need the security of a stable family life."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}