{
    "word": "see",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "siː"
                            ],
                            "us": [
                                "siː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be conscious of what is around you by using your eyes: ",
                            "examples": [
                                "Turn the light on so I can see.",
                                "I can see you!",
                                "The teacher could see (that) the children had been fighting.",
                                "Jacqui saw the car drive up outside the police station.",
                                "From the window we could see the children playing in the yard.",
                                "His parents saw him awarded the winner's medal.",
                                "See (= look at) p. 23 for prices and flight details.",
                                "See over (= look at the next page) for further information."
                            ]
                        },
                        {
                            "explanation": "to watch a film, television programme, etc.: ",
                            "examples": [
                                "Did you see that documentary on Channel 4 last night?"
                            ]
                        },
                        {
                            "explanation": "to be the time or place when something happens: ",
                            "examples": [
                                "This summer has seen the end of water restrictions in the area thanks to a new reservoir."
                            ]
                        },
                        {
                            "explanation": "said to mean that more surprising or exciting things are likely to happen: ",
                            "examples": [
                                "If you thought that show was amazing, just you wait. You ain't seen nothing yet!"
                            ]
                        },
                        {
                            "explanation": "to understand, know, or realize: ",
                            "examples": [
                                "I see (that) the club is organizing a theatre trip next month.",
                                "He can't see what difference it makes to come (= he doesn't think it is important if he comes) on Thursday instead of Friday.",
                                "They didn't see the need/any need (= understand that it was important) to notify their members of the changes in writing.",
                                "They refused to help because they're too busy, but he seems to see more in it than that.",
                                "\"I'm tired.\" \"So I see - you've been yawning all afternoon.\"",
                                "I was surprised that they couldn't see my point of view.",
                                "The government didn't want to be seen to be making concessions to terrorists.",
                                "After she read his book she started to see the issue in another/a different/a new light (= differently)."
                            ]
                        },
                        {
                            "explanation": "to meet or visit someone, or to visit a place: ",
                            "examples": [
                                "We're seeing friends this weekend.",
                                "I haven't seen Jerry around (= in the places I usually meet him) in the last few weeks.",
                                "No one has seen much of Daryl since he got married.",
                                "They see a lot of each other (= are often together).",
                                "My mother is seeing the doctor again next week.",
                                "The children wanted to see the circus.",
                                "The agent said they could see the house (UK also see round the house) at 3 p.m."
                            ]
                        },
                        {
                            "explanation": "to have a romantic relationship with someone: ",
                            "examples": [
                                "How long has she been seeing him?"
                            ]
                        },
                        {
                            "explanation": "to consider or think about, especially to think about someone or something in a particular way, or to imagine someone doing a particular activity: ",
                            "examples": [
                                "She didn't see herself as brave.",
                                "It was easy to see the gift as a kind of bribe.",
                                "I can't see her accepting (= I don't think she will accept) the job in the present circumstances.",
                                "As I see it/things/the situation, we'll have to get extra help.",
                                "Try and see it my way - I'll be left without any help if you go."
                            ]
                        },
                        {
                            "explanation": "to take someone somewhere by going there with them: ",
                            "examples": [
                                "He saw his visitors to the door.",
                                "Her friends saw her home.",
                                "The security guard saw the protesters off the premises."
                            ]
                        },
                        {
                            "explanation": "to try to discover: ",
                            "examples": [
                                "Will you see if you can get anyone to help?",
                                "I'll see what I can do."
                            ]
                        },
                        {
                            "explanation": "to make certain that something happens: ",
                            "examples": [
                                "The receptionist said he'd see (that) she got the message.",
                                "See (that) you're ready by five, or there'll be trouble."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "siː"
                            ],
                            "us": [
                                "siː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a place where there is a cathedral and where a bishop or archbishop has authority: ",
                            "examples": [
                                "the See of York/Exeter/Lincoln",
                                "bishops and their sees"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}