{
    "word": "seed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "siːd"
                            ],
                            "us": [
                                "siːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small, round or oval object produced by a plant and from which, when it is planted, a new plant can grow: ",
                            "examples": [
                                "Sow the seeds (= put them in the ground) about three centimetres deep.",
                                "The chemical will stop all seeds from sprouting (= starting to grow).",
                                "The farmers grow these crops for seed (= for planting to grow more crops, rather than for eating)."
                            ]
                        },
                        {
                            "explanation": "→ \nsemen ",
                            "examples": []
                        },
                        {
                            "explanation": "If a food plant goes or runs to seed, it produces flowers and seeds because it has not been picked early enough: ",
                            "examples": [
                                "In hot weather lettuces can suddenly run to seed."
                            ]
                        },
                        {
                            "explanation": "If people or places go or run to seed, their physical appearance becomes worse because no one is taking care of them: ",
                            "examples": [
                                "After he retired, he really went to seed."
                            ]
                        },
                        {
                            "explanation": "the cause of a feeling or situation, or the early stages of it: ",
                            "examples": [
                                "From these early seeds of their friendship, they grew into lifelong companions.",
                                "He may be sowing the seeds of his own destruction in the long term by using violence against his own people."
                            ]
                        },
                        {
                            "explanation": "especially in tennis, a good player who is given a place on the list of those expected to win games in a particular competition because of the way they have played in the past: ",
                            "examples": [
                                "Turner's opponent in the quarter-finals is the number one seed."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "siːd"
                            ],
                            "us": [
                                "siːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to produce seeds: ",
                            "examples": [
                                "The plants have seeded themselves (= their seeds have fallen) into the cracks between the paving stones."
                            ]
                        },
                        {
                            "explanation": "to remove the seeds from a fruit or vegetable: ",
                            "examples": [
                                "Wash, seed, and cut the pepper into small pieces."
                            ]
                        },
                        {
                            "explanation": "to sow (= plant) seeds somewhere: ",
                            "examples": [
                                "Winter wheat can be seeded into open plots.",
                                "Spring is a great time to seed the bare patches in your lawn."
                            ]
                        },
                        {
                            "explanation": "to cause something to exist and develop: ",
                            "examples": [
                                "This was the article that seeded his book.",
                                "The main strategy was getting others to buy into a vision, seeding ideas at different levels in the organization."
                            ]
                        },
                        {
                            "explanation": "to make a player a seed: ",
                            "examples": [
                                "Jones, seeded second, has won her last ten matches."
                            ]
                        },
                        {
                            "explanation": "to spread substances such as certain chemicals in clouds, in order to try to make them produce rain, or more rain: ",
                            "examples": [
                                "Scientists have experimented with cloud control, including seeding clouds to promote the shedding of rain.",
                                "He seeds clouds in west Texas."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}