{
    "word": "sense",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sens"
                            ],
                            "us": [
                                "sens"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an ability to understand, recognize, value, or react to something, especially any of the five physical abilities to see, hear, smell, taste, and feel: ",
                            "examples": [
                                "With her excellent sense of smell, she could tell if you were a smoker from the other side of the room.",
                                "My cold is so bad I've lost my sense of smell/taste (= I can't smell/taste anything)."
                            ]
                        },
                        {
                            "explanation": "a general feeling or understanding: ",
                            "examples": [
                                "Did you get any sense of how they might react?",
                                "The helicopters hovering overhead added to the sense of urgency."
                            ]
                        },
                        {
                            "explanation": "the ability to enjoy life and not be too serious: ",
                            "examples": [
                                "Don't be angry - it was just a joke - where's your sense of fun?",
                                "Come on, you've got no sense of fun!",
                                "People who knew her talk about her great warmth and sense of fun.",
                                "Even in her nineties, she never lost her sense of fun.",
                                "He was known for his great energy and sense of fun.",
                                "He brought a much needed sense of fun into the proceedings."
                            ]
                        },
                        {
                            "explanation": "your ability to understand funny things: ",
                            "examples": [
                                "She has a really good sense of humour.",
                                "We have the same sense of humour.",
                                "Come on, lighten up! Where's your sense of humour?",
                                "What people don't seem to know about her is that she's got a wicked sense of humour .",
                                "He accused her of having no sense of humour ."
                            ]
                        },
                        {
                            "explanation": "the feeling people have when there is a very important event or celebration: ",
                            "examples": [
                                "The decorations, flowers, and crowds gave the town a real sense of occasion.",
                                "The venue itself was spectacular and really helped to create a sense of occasion.",
                                "There was quite a sense of occasion when they finally came on stage.",
                                "Flowers and candles in a church all add to the sense of occasion.",
                                "Dress codes give an event like this a sense of occasion.",
                                "The whole affair was very informal and rather lacked a sense of occasion."
                            ]
                        },
                        {
                            "explanation": "the characteristic of having good judgment, especially when it is based on practical ideas or understanding: ",
                            "examples": [
                                "I hope they'll have the (good) sense/have enough sense to shut the windows before they leave.",
                                "It makes (good) sense to buy a big pack because it works out cheaper in the end.",
                                "There's no sense in waiting (= it is not practical to wait) - the next train isn't for two hours.",
                                "Where's/What's the sense (= what is the advantage) in paying someone when you could get a volunteer?",
                                "Planning so far ahead makes no sense - so many things will have changed by next year."
                            ]
                        },
                        {
                            "explanation": "the ability to use good judgment: ",
                            "examples": [
                                "Have you taken leave of/lost your senses? (= Have you lost your ability to make a good judgment?)",
                                "It's time you came to your senses (= started to use your good judgment) and realized that they are not going to help you.",
                                "The accident brought him to his senses (= caused him to use his good judgment again) and made him stop drinking.",
                                "I'm just relieved they've come to their senses and realized what a disastrous leader he was.",
                                "Perhaps losing his job like that will bring him to his senses and make him understand that he can't carry on like this."
                            ]
                        },
                        {
                            "explanation": "one of the possible meanings of a word or phrase: ",
                            "examples": [
                                "They are not immigrants, at least not in any sense that I understand.",
                                "The packaging is green - in both senses of the word (= it is green in colour and it is good for the environment).",
                                "Security defined in the broad/broadest sense of the term means getting at the root causes of trouble and helping to reduce regional conflicts.",
                                "This passage doesn't make (any) sense (= the meaning is not clear).",
                                "I've read the letter twice, but I can't make (any) sense of it (= I can't understand it)."
                            ]
                        },
                        {
                            "explanation": "in every way or feature: ",
                            "examples": [
                                "It's a book which is, in every sense, about different ways of seeing the world.",
                                "She was in every sense beautiful.",
                                "He was, she said, the personification of a gentleman, in every sense.",
                                "A tall man with real gravitas, he was a heavyweight in every sense.",
                                "These women were professionals in every sense.",
                                "A giant in every sense, he will be missed terribly."
                            ]
                        },
                        {
                            "explanation": "thinking about something in one way, but not in every way: ",
                            "examples": [
                                "She claims that the system is at fault and she's right, in a sense (= she is partly right).",
                                "In a sense, I guess she has it easy compared with John.",
                                "In a sense, this affects you more than me.",
                                "In a sense, all of this is relevant.",
                                "She died before all of this trouble and in a sense was lucky.",
                                "Of course, the break-up of my marriage was awful at the time but in a sense, it was a very positive thing in my life."
                            ]
                        },
                        {
                            "explanation": "not at all: ",
                            "examples": [
                                "We are in no sense obliged to agree to this.",
                                "In no sense has she chosen an easy option.",
                                "These people are in no sense ordinary citizens and we should not forget that.",
                                "In no sense did she bear responsibility for what happened that night.",
                                "I am an enthusiast but in no sense an expert."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sens"
                            ],
                            "us": [
                                "sens"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to feel or experience something without being able to explain exactly how: ",
                            "examples": [
                                "Although she said nothing, I could sense her anger.",
                                "He sensed something was about to happen.",
                                "He sensed (that) his guests were bored, although they were listening politely.",
                                "Could you sense what was likely to happen?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}