{
    "word": "serious",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsɪə.ri.əs"
                            ],
                            "us": [
                                "ˈsɪr.i.əs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "severe in effect; bad: ",
                            "examples": [
                                "a serious illness",
                                "There were no reports of serious injuries.",
                                "The new tax regulations have landed some of the smaller companies in serious trouble.",
                                "Drugs have become a serious problem in a lot of schools.",
                                "This is a very serious offence.",
                                "He's been taken to hospital where his condition is described as serious but stable."
                            ]
                        },
                        {
                            "explanation": "very ill",
                            "examples": []
                        },
                        {
                            "explanation": "not joking or intended to be funny: ",
                            "examples": [
                                "Please don't laugh - I'm being serious.",
                                "He was wearing a very serious expression and I knew something was wrong.",
                                "On the surface it's a very funny novel but it does have a more serious underlying theme."
                            ]
                        },
                        {
                            "explanation": "A serious person is quiet, thinks carefully about things, and does not laugh a lot: ",
                            "examples": [
                                "I remember her as a very serious child."
                            ]
                        },
                        {
                            "explanation": "determined to follow a particular plan of action: ",
                            "examples": [
                                "Is she serious about going to live abroad?"
                            ]
                        },
                        {
                            "explanation": "If two people who have a loving relationship are serious about each other, they intend to stay with each other for a long time and possibly marry: ",
                            "examples": [
                                "She's had a lot of boyfriends but Simon's the only one she's been serious about."
                            ]
                        },
                        {
                            "explanation": "needing or deserving your complete attention: ",
                            "examples": [
                                "That's an interesting job offer - I'd give it some serious consideration if I were you.",
                                "We've got some serious talking to do, you and me."
                            ]
                        },
                        {
                            "explanation": "extreme in degree or amount: ",
                            "examples": [
                                "We did some fairly serious walking over the weekend.",
                                "I mean we're talking serious (= a large amount of) money, right?"
                            ]
                        },
                        {
                            "explanation": "very good of its type: ",
                            "examples": [
                                "This is a serious wine, Belle, you have to try some."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}