{
    "word": "service",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsɜː.vɪs"
                            ],
                            "us": [
                                "ˈsɝː.vɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a government system or private organization that is responsible for a particular type of activity, or for providing a particular thing that people need: ",
                            "examples": [
                                "the postal service",
                                "the National Park Service",
                                "the National Health Service",
                                "the ambulance/prison service",
                                "I've worked in public health services throughout my career."
                            ]
                        },
                        {
                            "explanation": "the fact that a system is working: ",
                            "examples": [
                                "There is a very limited bus service on Sundays.",
                                "We hope to be operating a normal service as soon as possible."
                            ]
                        },
                        {
                            "explanation": "a place at the side of a large road at which fuel, food, drink, and other things that people want on their journey are sold: ",
                            "examples": [
                                "We stopped at the services to get fuel."
                            ]
                        },
                        {
                            "explanation": "the act of dealing with customers in a shop, restaurant, or hotel by taking their orders, showing or selling them goods, etc.: ",
                            "examples": [
                                "The only trouble with this café is that the service is so slow.",
                                "You should leave a generous tip to reward good service."
                            ]
                        },
                        {
                            "explanation": "an amount of money charged for serving a customer in a restaurant, often paid directly to the waiter: ",
                            "examples": [
                                "There is a ten percent service charge included in the bill."
                            ]
                        },
                        {
                            "explanation": "work that someone does or time that someone spends working for an organization: ",
                            "examples": [
                                "These teenagers all do community service in their free time.",
                                "She was given the award for a lifetime of public service.",
                                "Service on a jury may be deferred for health reasons."
                            ]
                        },
                        {
                            "explanation": "a business that offers a particular type of help or work: ",
                            "examples": [
                                "Why don't you call the babysitting service?",
                                "Guests may take advantage of free internet access and a reasonably priced laundry/ironing service. "
                            ]
                        },
                        {
                            "explanation": "a government department that is responsible for a particular area of activity: ",
                            "examples": [
                                "the diplomatic service",
                                "the security services"
                            ]
                        },
                        {
                            "explanation": "the particular skills that someone has and can offer to others: ",
                            "examples": [
                                "I may be needing the services of a surveyor soon, as I'm buying a house."
                            ]
                        },
                        {
                            "explanation": "in use: ",
                            "examples": [
                                "The battleship has been in service since 1965."
                            ]
                        },
                        {
                            "explanation": "to be employed as a servant: ",
                            "examples": [
                                "Her mother was in service."
                            ]
                        },
                        {
                            "explanation": "(work in) the armed forces: ",
                            "examples": [
                                "He joined the air force in 1964 and spent ten years in the service.",
                                "All men under 35 were told to report for military service.",
                                "Service personnel are subject to the Official Secrets Act."
                            ]
                        },
                        {
                            "explanation": "the army, navy, and/or air force: ",
                            "examples": [
                                "a career in the services"
                            ]
                        },
                        {
                            "explanation": "fighting in a war: ",
                            "examples": [
                                "He was the first member of his regiment to die while on active service."
                            ]
                        },
                        {
                            "explanation": "a formal religious ceremony: ",
                            "examples": [
                                "A memorial service is being held on Sunday for victims of the explosion."
                            ]
                        },
                        {
                            "explanation": "in sports such as tennis, the act of hitting the ball to the other player to start play: ",
                            "examples": [
                                "She has a very fast service."
                            ]
                        },
                        {
                            "explanation": "a set of objects such as plates, cups, or other things that are used in providing and eating food: ",
                            "examples": [
                                "a 24-piece dinner service",
                                "a tea service"
                            ]
                        },
                        {
                            "explanation": "a check and repair of a vehicle or machine that is done after regular periods: ",
                            "examples": [
                                "She took the car in for a service yesterday."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsɜː.vɪs"
                            ],
                            "us": [
                                "ˈsɝː.vɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to examine a machine and repair any damaged parts: ",
                            "examples": [
                                "I'm taking the car in to have it serviced this afternoon."
                            ]
                        },
                        {
                            "explanation": "to make payments to pay back a debt: ",
                            "examples": [
                                "The country is still spending $3 million a week servicing debt."
                            ]
                        },
                        {
                            "explanation": "to provide services to or for someone: ",
                            "examples": [
                                "We're quite happy to service our customers wherever they are.",
                                "Together they service 46 buildings, including 37 schools."
                            ]
                        },
                        {
                            "explanation": "to provide transport, communications, etc. systems in an area: ",
                            "examples": [
                                "Wembley stadium is serviced by Wembley Stadium, Wembley Park and Wembley Central stations.",
                                "The village is small, unspoilt and well serviced."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}