{
    "word": "served",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nserve ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɜːv"
                            ],
                            "us": [
                                "sɝːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to provide food or drinks: ",
                            "examples": [
                                "Do they serve meals in the bar?",
                                "Breakfast is served in the restaurant between 7.00 and 11.00.",
                                "We arrived at the hotel and were served with champagne and canapés.",
                                "All recipes in this book, unless otherwise stated, will serve (= be enough for) four to five people.",
                                "Serve the pie warm with ice cream or whipped cream."
                            ]
                        },
                        {
                            "explanation": "to work for; to do your duty to: ",
                            "examples": [
                                "He served in the army for 22 years.",
                                "She has served on the committee for the last 15 years.",
                                "He served under Ronald Reagan as Secretary of State."
                            ]
                        },
                        {
                            "explanation": "to help achieve something or to be useful as something: ",
                            "examples": [
                                "An official investigation would not serve any useful purpose.",
                                "The judge said that the fine would serve as a warning to other drivers.",
                                "In the absence of anything better the settee could serve as a bed for a couple of nights.",
                                "Nothing serves to explain the violent fighting we have seen recently.",
                                "My umbrella will serve for a weapon."
                            ]
                        },
                        {
                            "explanation": "If something serves you, it is good or helpful for you: ",
                            "examples": [
                                "If your anger doesn't serve you, let it go.",
                                "You're growing and changing, so your \"stick with it\" motto may not be serving you well. "
                            ]
                        },
                        {
                            "explanation": "to provide with something that is needed: ",
                            "examples": [
                                "The report says the police are out of touch with the communities that they serve."
                            ]
                        },
                        {
                            "explanation": "in a shop, restaurant, or hotel, to deal with a customer by taking their order, showing or selling them goods, etc.: ",
                            "examples": [
                                "Are you being served, madam?",
                                "Have you been served, ma'am?",
                                "That's the restaurant where they refused to serve John because he was so rude."
                            ]
                        },
                        {
                            "explanation": "to spend a period of time doing something: ",
                            "examples": [
                                "He served four years in prison for robbery.",
                                "After he'd served his apprenticeship he set up his own business."
                            ]
                        },
                        {
                            "explanation": "to spend time in prison: ",
                            "examples": [
                                "He's serving time for drug offences."
                            ]
                        },
                        {
                            "explanation": "in sports such as tennis, to hit the ball to the other player as a way of starting the game: ",
                            "examples": [
                                "Whose turn is it to serve?",
                                "That's the third ace you've served this game."
                            ]
                        },
                        {
                            "explanation": "to give a legal document to someone, demanding that they go to a law court or that they obey an order: ",
                            "examples": [
                                "Less than two weeks ago Gough finally served a writ on Slater, claiming damages for alleged loss of royalties.",
                                "Each person served with a summons will be given six weeks before they have to appear in the Magistrates' Court."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}