{
    "word": "set",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "set"
                            ],
                            "us": [
                                "set"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something in a particular place or position: ",
                            "examples": [
                                "He set a vase of flowers on the table.",
                                "The campsite is set in the middle of a pine forest.",
                                "Our house is set back from the road."
                            ]
                        },
                        {
                            "explanation": "If a story, film, etc. is set in a particular time or place, the action in it happens in that time or place: ",
                            "examples": [
                                "\"West Side Story\" is set in New York City in the late 1950s."
                            ]
                        },
                        {
                            "explanation": "to cause something or someone to be in the stated condition or situation: ",
                            "examples": [
                                "It is believed that the building was set alight/ablaze/on fire deliberately.",
                                "The new director has set a lot of changes in motion in our department.",
                                "After years in prison, the men who had wrongfully been found guilty of the bombing were finally set free.",
                                "If I've made a mistake, then it's up to me to set it right (= correct it)."
                            ]
                        },
                        {
                            "explanation": "to cause someone or something to start doing something: ",
                            "examples": [
                                "His remarks set me thinking.",
                                "The thunderstorm set the radio crackling."
                            ]
                        },
                        {
                            "explanation": "to give someone work to do: ",
                            "examples": [
                                "I was set to work dusting the bookshelves."
                            ]
                        },
                        {
                            "explanation": "to establish or decide something: ",
                            "examples": [
                                "The school has been criticized for failing to set high standards for its students.",
                                "The committee has set new limits on spending.",
                                "Lewis has set a new world record.",
                                "The court's decision has set a legal precedent.",
                                "Parents should set a good example to their children.",
                                "He's set himself the goal/target of making his first million by the time he's 30."
                            ]
                        },
                        {
                            "explanation": "to get something ready so that it comes into operation or can be used: ",
                            "examples": [
                                "The heating is set to come on at 5 p.m.",
                                "Have you set up the DVD player?",
                                "I usually set my watch by the time on the computer.",
                                "He set the alarm for 7 a.m.",
                                "Will you set the table (= put plates, knives, forks, etc. on it ready for use), please?"
                            ]
                        },
                        {
                            "explanation": "to put furniture and other things on a stage so that it represents the time and the place in which the action of a play, film, or television programme is going to happen: ",
                            "examples": [
                                "During the interval the stage was set for the second act."
                            ]
                        },
                        {
                            "explanation": "to fix or make certain: ",
                            "examples": [
                                "Has a date/time been set for the meeting yet?",
                                "The price of the house has been set at €425,000."
                            ]
                        },
                        {
                            "explanation": "If a precious stone is set in/into a piece of jewellery, or a piece of jewellery is set with a precious stone, the stone is fixed firmly to the piece of jewellery: ",
                            "examples": [
                                "a gold ring with a diamond set into it",
                                "a brooch set with rubies and pearls"
                            ]
                        },
                        {
                            "explanation": "When a doctor sets a broken bone, he or she puts it into the right position so that it will heal.",
                            "examples": []
                        },
                        {
                            "explanation": "When a broken bone sets, it heals in a particular position.",
                            "examples": []
                        },
                        {
                            "explanation": "If you have your hair set, you have it arranged while it is wet so that it will be in a particular style when it is dry.",
                            "examples": []
                        },
                        {
                            "explanation": "If you set a part of your body, you tighten the muscles around it in order to show that you are determined about something: ",
                            "examples": [
                                "\"I'm never going back to him,\" she said, setting her jaw firmly.",
                                "His face was set in determination."
                            ]
                        },
                        {
                            "explanation": "If a liquid or soft material sets, it becomes firm or hard: ",
                            "examples": [
                                "Leave the jelly in the fridge to set.",
                                "Don't walk on the concrete until it has set."
                            ]
                        },
                        {
                            "explanation": "to give someone a piece of school work or homework to do: ",
                            "examples": [
                                "My science teacher always sets a lot of homework.",
                                "What books have been set for this term?",
                                "What homework have you been set for the holidays?"
                            ]
                        },
                        {
                            "explanation": "to give someone a particular task to do: ",
                            "examples": [
                                "Harry set them to work painting the walls. ",
                                "We set the kids the task of clearing the snow from the drive."
                            ]
                        },
                        {
                            "explanation": "to write or provide music for a poem or other words so that they can be sung: ",
                            "examples": [
                                "poems set to music"
                            ]
                        },
                        {
                            "explanation": "(of the sun, moon, or planets) to go down below the horizon (= the line at which the earth seems to join the sky): ",
                            "examples": [
                                "We sat on the beach and watched the sun set.",
                                "The setting sun cast long shadows across the lawn."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "set"
                            ],
                            "us": [
                                "set"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of similar things that belong together in some way: ",
                            "examples": [
                                "We bought Charles and Mandy a set of cutlery as a wedding present.",
                                "I always keep a tool set in the back of my car.",
                                "The doctor said that he hadn't seen this particular set of symptoms before.",
                                "We need to establish a new set of priorities."
                            ]
                        },
                        {
                            "explanation": "a number of objects or pieces of equipment needed for a particular activity, especially playing a game: ",
                            "examples": [
                                "a chess/train/chemistry set"
                            ]
                        },
                        {
                            "explanation": "a group of repeated movements performed as part of a period of physical exercise: ",
                            "examples": [
                                "I did three sets of 10 push-ups every night before bed.",
                                "Sprint up the hill and jog down. Do three sets, then jog easy for 10 minutes. "
                            ]
                        },
                        {
                            "explanation": "In mathematics, a set is a group of objects with stated characteristics.",
                            "examples": []
                        },
                        {
                            "explanation": "a group of people who have similar interests and ways of living: ",
                            "examples": [
                                "the fashionable set",
                                "She's got in with a very arty set."
                            ]
                        },
                        {
                            "explanation": "the place where a film or play is performed or recorded, and the pictures, furniture, etc. that are used: ",
                            "examples": [
                                "a movie set",
                                "a stage set",
                                "a set designer",
                                "They first met on the set of \"Star Wars\"."
                            ]
                        },
                        {
                            "explanation": "a part of a game of tennis or volleyball: ",
                            "examples": [
                                "They won in straight sets (= they won every set)."
                            ]
                        },
                        {
                            "explanation": "a musical performance that forms part of a concert, especially one of pop music or jazz: ",
                            "examples": [
                                "The band's opening set lasted 45 minutes."
                            ]
                        },
                        {
                            "explanation": "the position in which you hold a part of your body: ",
                            "examples": [
                                "I could tell from the set of his jaw that he was angry."
                            ]
                        },
                        {
                            "explanation": "the act of having your hair set: ",
                            "examples": [
                                "a shampoo and set"
                            ]
                        },
                        {
                            "explanation": "a television: ",
                            "examples": [
                                "We need a new television set."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "set"
                            ],
                            "us": [
                                "set"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "ready and prepared: ",
                            "examples": [
                                "Shall we go now - is everyone set?",
                                "Is everything all set for the party?",
                                "At the start of the race, the starter said \"On your marks, get set, go\".",
                                "We were just getting set to leave when Ben said he had something important to tell us."
                            ]
                        },
                        {
                            "explanation": "likely or in a suitable condition: ",
                            "examples": [
                                "He looks set to become world champion again this year."
                            ]
                        },
                        {
                            "explanation": "always the same, never changing: ",
                            "examples": [
                                "My parents say I have to be home by a set time.",
                                "The restaurant does a set lunch (= a meal which is offered at a fixed price, but with little or no choice about what you have to eat) on Sundays.",
                                "The receptionist had a bright set smile on his face, but I could tell that he was bored.",
                                "My father has very set opinions/views on the matter."
                            ]
                        },
                        {
                            "explanation": "a phrase in which the words are always used in the same order",
                            "examples": []
                        },
                        {
                            "explanation": "used to describe a book or writer that must be studied for a particular course: ",
                            "examples": [
                                "The students are reading \"Lord of the Flies\" as one of their set books this year.",
                                "Eventually, he became a set author in Australian schools."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}