{
    "word": "settle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈset.əl"
                            ],
                            "us": [
                                "ˈset̬.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to reach a decision or an agreement about something, or to end a disagreement: ",
                            "examples": [
                                "Good, that's all settled - you send out the invitations for the party, and I'll organize the food.",
                                "They haven't yet settled when the wedding is going to be.",
                                "\"The tickets are €40 each.\" \"Well, that settles that - I can't afford that much.\"",
                                "I'd like to get this matter settled once and for all (= reach a final decision on it)."
                            ]
                        },
                        {
                            "explanation": "to arrange something: ",
                            "examples": [
                                "The details of the contract have not yet been settled.",
                                "Our lawyer advised us that it would be better to settle out of court (= reach an agreement in a legal case without it being decided in a court of law).",
                                "It took months to settle (= bring to an end) the dispute/strike.",
                                "My father and I have agreed finally to settle our differences (= stop arguing)."
                            ]
                        },
                        {
                            "explanation": "to relax into a comfortable position: ",
                            "examples": [
                                "After dinner we settled in front of the television for the evening.",
                                "The dentist told her patient to settle back in the chair.",
                                "He settled himself down with a newspaper, and waited for the flight to arrive."
                            ]
                        },
                        {
                            "explanation": "to begin to play a game in a relaxed and comfortable way: ",
                            "examples": [
                                "England's aggressive play never allowed the New Zealanders to settle.",
                                "After a frantic start, the team settled into a good rhythm."
                            ]
                        },
                        {
                            "explanation": "to go and live somewhere, especially permanently: ",
                            "examples": [
                                "After they got married, they settled in Brooklyn."
                            ]
                        },
                        {
                            "explanation": "to arrive, especially from another country, in a new place and start to live there and use the land: ",
                            "examples": [
                                "America was first settled by people who came across from Asia over 25,000 years ago."
                            ]
                        },
                        {
                            "explanation": "to move to a lower level and stay there; to drop: ",
                            "examples": [
                                "The house had been empty for years, and dust had settled on all the surfaces.",
                                "Do you think the snow will settle (= remain on the ground and other surfaces without melting)?",
                                "The contents of this package may settle (= fall towards the bottom of the container and so seem to be less)."
                            ]
                        },
                        {
                            "explanation": "to pay, especially money that you owe: ",
                            "examples": [
                                "Please settle your account/bill without further delay.",
                                "It took the insurance company months to settle my claim.",
                                "Payment of your account is now overdue, and we must ask you to settle (= pay the money you owe) immediately."
                            ]
                        },
                        {
                            "explanation": "to become quiet and calm, or to make something or someone do this: ",
                            "examples": [
                                "The weather is expected to settle towards the end of the week.",
                                "I'll call you back as soon as I've settled the kids for the night.",
                                "Before a performance, she takes three deep breaths to settle her nerves.",
                                "We're very busy this week, but things should settle (down) a bit after the weekend.",
                                "Joe's parents are very worried about him because he doesn't seem to be able to settle to (= to give his whole attention to) anything."
                            ]
                        },
                        {
                            "explanation": "to reach and remain at a certain level or in a certain state: ",
                            "examples": [
                                "The pound rose slightly against the dollar today, then settled at $1.53.",
                                "A peaceful expression settled on her face.",
                                "After the recent riots, an uneasy calm has settled on the city."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}