{
    "word": "shade",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃeɪd"
                            ],
                            "us": [
                                "ʃeɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "slight darkness caused by something blocking the direct light from the sun: ",
                            "examples": [
                                "The sun was hot, and there were no trees to offer us shade.",
                                "The children played in/under the shade of a large beach umbrella."
                            ]
                        },
                        {
                            "explanation": "a covering that is put over an electric light in order to make it less bright: ",
                            "examples": [
                                "The lamps all had matching purple shades."
                            ]
                        },
                        {
                            "explanation": "the parts of a picture or painting that the artist has made slightly darker than the other parts: ",
                            "examples": [
                                "A good artist can produce a very realistic effect using only light and shade."
                            ]
                        },
                        {
                            "explanation": "→ \nsunglasses : ",
                            "examples": [
                                "She was wearing a black leather jacket and shades."
                            ]
                        },
                        {
                            "explanation": "a piece of material fixed onto a wooden or metal roller that can be pulled down to cover a window",
                            "examples": []
                        },
                        {
                            "explanation": "a type or degree of a colour: ",
                            "examples": [
                                "Their kitchen is painted an unusual shade of yellow/an unusual yellow shade.",
                                "This hair colouring comes in several shades.",
                                "The room has been decorated in pastel shades (= soft and light colours) throughout."
                            ]
                        },
                        {
                            "explanation": "something that is slightly different from other, similar things: ",
                            "examples": [
                                "They are hoping to satisfy all shades of public opinion.",
                                "There are several shades of meaning in that sentence."
                            ]
                        },
                        {
                            "explanation": "slightly: ",
                            "examples": [
                                "Don't you think those trousers are a shade too tight?"
                            ]
                        },
                        {
                            "explanation": "said to mean that something or someone makes you remember something or someone similar: ",
                            "examples": [
                                "In his speech he said - shades of Martin Luther King Jr. - that he had a dream."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃeɪd"
                            ],
                            "us": [
                                "ʃeɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to prevent direct light from shining on something: ",
                            "examples": [
                                "I shaded my eyes from the glare of the sun.",
                                "The broad avenues are shaded by splendid trees."
                            ]
                        },
                        {
                            "explanation": "to gradually change or become: ",
                            "examples": [
                                "At sunset, the sky shaded from pink into dark red.",
                                "Their views shade into the policies of the extreme left of the party."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}