{
    "word": "shadow",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈʃæd.əʊ"
                            ],
                            "us": [
                                "ˈʃæd.oʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an area of darkness, caused by light being blocked by something: ",
                            "examples": [
                                "The children were playing, jumping on each other's shadows.",
                                "Jamie followed his mother around all day like a shadow.",
                                "The sun shone through the leaves, casting/throwing shadows on the lawn.",
                                "This corner of the room is always in shadow (= slight darkness)."
                            ]
                        },
                        {
                            "explanation": "an area of darkness in which people and things cannot be seen: ",
                            "examples": [
                                "Someone jumped out of the shadows and grabbed my handbag."
                            ]
                        },
                        {
                            "explanation": "a small dark area of skin under your eye: ",
                            "examples": [
                                "She put on some make-up to cover the dark shadows under her eyes."
                            ]
                        },
                        {
                            "explanation": "to be very close to a larger building or place: ",
                            "examples": [
                                "His workshop was in the shadow of the great church of San Paolo Maggiore."
                            ]
                        },
                        {
                            "explanation": "to be in a situation in which something unpleasant either seems likely to happen and to have a bad effect on your life, or is already having a bad effect on your life: ",
                            "examples": [
                                "We are all living under the shadow of war."
                            ]
                        },
                        {
                            "explanation": "a small amount: ",
                            "examples": [
                                "It is a tragic story, but there is a shadow of hope.",
                                "There isn't a shadow of doubt that you've made the right decision."
                            ]
                        },
                        {
                            "explanation": "If something is true beyond a shadow of (a) doubt, there is no doubt that it is true: ",
                            "examples": [
                                "This is without a shadow of a doubt the best movie I've seen all year."
                            ]
                        },
                        {
                            "explanation": "someone who follows another person everywhere: ",
                            "examples": [
                                "\"I think we have a shadow on our tail,\" muttered the detective.",
                                "Ever since he was able to walk, Stephen has been his older brother's shadow (= has followed him and copied his actions)."
                            ]
                        },
                        {
                            "explanation": "a person who follows someone else while they are at work in order to learn about that person's job",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈʃæd.əʊ"
                            ],
                            "us": [
                                "ˈʃæd.oʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to follow closely: ",
                            "examples": [
                                "The police think that the robbers shadowed their victims for days before the crime.",
                                "The euro has closely shadowed the dollar."
                            ]
                        },
                        {
                            "explanation": "to follow someone else while they are at work in order to learn about that person's job: ",
                            "examples": [
                                "Your first week in the job will be spent shadowing one of our more experienced employees."
                            ]
                        },
                        {
                            "explanation": "to produce a shadow: ",
                            "examples": [
                                "We came across a glade shadowed by large trees."
                            ]
                        },
                        {
                            "explanation": "to make a person unhappy or to make their life less happy: ",
                            "examples": [
                                "Mental illness had shadowed him for more than a decade."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈʃæd.əʊ"
                            ],
                            "us": [
                                "ˈʃæd.oʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used in the title of important politicians in the main opposition party (= the party not in government): ",
                            "examples": [
                                "the Shadow Foreign Secretary",
                                "the Shadow Cabinet"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}