{
    "word": "shame",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃeɪm"
                            ],
                            "us": [
                                "ʃeɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If something is described as a shame, it is disappointing or not satisfactory: ",
                            "examples": [
                                "It's a (great/real) shame that the event had to be cancelled.",
                                "Have some more vegetables - it would be a shame to waste them.",
                                "\"Douglas had to miss the school concert because he was ill.\" \"Oh, what a shame/that's a shame!\""
                            ]
                        },
                        {
                            "explanation": "an uncomfortable feeling of guilt or of being ashamed because of your own or someone else's bad behaviour: ",
                            "examples": [
                                "He said he felt no shame for what he had done.",
                                "The children hung/bowed their heads in shame.",
                                "The shame of the scandal was so great that he shot himself a few weeks later.",
                                "You can't go out dressed like that - have you no shame (= don't you feel ashamed about being dressed like that)?"
                            ]
                        },
                        {
                            "explanation": "loss of honour and respect: ",
                            "examples": [
                                "He thinks there's great shame in being out of work and unable to provide for his family.",
                                "In some societies, if a woman leaves her husband, it brings shame on her and her family."
                            ]
                        },
                        {
                            "explanation": "to make someone feel ashamed: ",
                            "examples": [
                                "It puts me to shame that I still haven't replied to David's letter."
                            ]
                        },
                        {
                            "explanation": "I feel ashamed because: ",
                            "examples": [
                                "To my shame, I never wrote and thanked Mary for her present."
                            ]
                        },
                        {
                            "explanation": "used to tell someone that they should feel sorry for something they did: ",
                            "examples": [
                                "Shame on you for being so mean."
                            ]
                        },
                        {
                            "explanation": "to make someone or something seem not good by comparison: ",
                            "examples": [
                                "Your cooking puts mine to shame."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃeɪm"
                            ],
                            "us": [
                                "ʃeɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make someone feel ashamed, or to make someone or something lose honour and respect: ",
                            "examples": [
                                "It shames me that I treated her so badly.",
                                "The behaviour of a few children has shamed the whole school."
                            ]
                        },
                        {
                            "explanation": "to publicly criticize and draw attention to something someone has done, especially on the internet: ",
                            "examples": [
                                "A girl has shamed her library for saying she couldn't take part in a \"boys only\" robotics course."
                            ]
                        },
                        {
                            "explanation": "to cause someone to do or not to do something by making them feel ashamed: ",
                            "examples": [
                                "The city council was shamed into taking action after criticism in the national and local media."
                            ]
                        },
                        {
                            "explanation": "to be so much better than something else that the other thing seems of a low standard by comparison: ",
                            "examples": [
                                "The school's exam results shame those of the other schools in the area."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "ʃeɪm"
                            ],
                            "us": [
                                "ʃeɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to express disapproval of something that a public speaker is saying: ",
                            "examples": [
                                "To cries of \"Shame!\", the minister announced that taxes were being increased."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}