{
    "word": "shank",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃæŋk"
                            ],
                            "us": [
                                "ʃæŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, thin, straight part of particular objects, especially one that connects the end of a device or tool that you hold to the end of it that moves or does something: ",
                            "examples": [
                                "the shank of a screwdriver",
                                "the shank of a key/nail"
                            ]
                        },
                        {
                            "explanation": "the leg of a person or animal, especially the part below the knee: ",
                            "examples": [
                                "You can buy ready-to-use beef shanks from your supermarket. ",
                                "As he tottered across the stage I noticed how shrunken were his shanks, how feeble his voice."
                            ]
                        },
                        {
                            "explanation": "an object, for example a sharp piece of metal, that is used as a knife: ",
                            "examples": [
                                "He lost the sight in his right eye after an inmate pierced it with a shank.",
                                "Do I need to start sleeping with a shank under my pillow?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃæŋk"
                            ],
                            "us": [
                                "ʃæŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in golf, to hit a ball with the wrong part of the golf club so that it goes in a direction that you did not intend it to go in: ",
                            "examples": [
                                "Needing par at 18 to force a playoff, he shanked his approach shot from the bunker."
                            ]
                        },
                        {
                            "explanation": "in ball games, to kick or hit a ball in an awkward way so that it goes in a direction that you did not intend it to go in: ",
                            "examples": [
                                "Unfortunately he shanked the ball wide in front of an open goal."
                            ]
                        },
                        {
                            "explanation": "to attack someone with a shank: ",
                            "examples": [
                                "She told police he had a fight with Ben during which he \"shanked\" him."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}