{
    "word": "shape",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃeɪp"
                            ],
                            "us": [
                                "ʃeɪp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the particular physical form or appearance of something: ",
                            "examples": [
                                "Clay can be moulded into almost any shape.",
                                "These bricks are all different shapes.",
                                "Kim's birthday cake was in the shape of a train.",
                                "Our table is oval in shape.",
                                "My bicycle wheel is bent out of shape.",
                                "This T-shirt has been washed so many times that it's lost its shape (= has become loose and lost its form)."
                            ]
                        },
                        {
                            "explanation": "an arrangement that is formed by joining lines together in a particular way or by the line or lines around its outer edge: ",
                            "examples": [
                                "a round/square/circular/oblong shape",
                                "A triangle is a shape with three sides.",
                                "The children made patterns by sticking coloured shapes onto paper."
                            ]
                        },
                        {
                            "explanation": "the physical form or appearance of a particular person or thing: ",
                            "examples": [
                                "In the story, Faust is tempted by the Devil, who has taken the shape of a man.",
                                "Life on earth takes many shapes."
                            ]
                        },
                        {
                            "explanation": "a person or object that you cannot see clearly because it is too dark, or because the person or object is too far away: ",
                            "examples": [
                                "I could see a dark shape in the street outside."
                            ]
                        },
                        {
                            "explanation": "many different types: ",
                            "examples": [
                                "We sell all shapes and sizes of teddy bear."
                            ]
                        },
                        {
                            "explanation": "of any type: ",
                            "examples": [
                                "I'm opposed to war in any shape or form."
                            ]
                        },
                        {
                            "explanation": "the way something is organized, or its general character or nature: ",
                            "examples": [
                                "Technological developments have changed the shape of industry.",
                                "We need to change the whole shape of our campaign."
                            ]
                        },
                        {
                            "explanation": "condition, or state of health: ",
                            "examples": [
                                "He bought up businesses that were in bad/poor shape, and then sold them off piece by piece.",
                                "\"How are you?\" \"Oh, I'm in great shape.\"",
                                "You're in no shape (= not in a good enough state of health) to go to work today."
                            ]
                        },
                        {
                            "explanation": "good physical condition: ",
                            "examples": [
                                "It's taken us five years to get our house into shape.",
                                "She runs six miles every day to help keep herself in shape.",
                                "I haven't had any exercise for weeks, and I'm really out of shape (= not in good physical condition)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃeɪp"
                            ],
                            "us": [
                                "ʃeɪp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to decide or influence the form of something, especially a belief or idea, or someone's character: ",
                            "examples": [
                                "Many people are not able to shape their own destinies.",
                                "My relationship with my father played a major part in shaping my attitude towards men.",
                                "He was very influential in shaping the country's economic policy/strategy."
                            ]
                        },
                        {
                            "explanation": "to make something become a particular shape: ",
                            "examples": [
                                "The skirt has been shaped so that it hangs loosely.",
                                "When you've made the dough, shape it into two loaves."
                            ]
                        },
                        {
                            "explanation": "to make an object from a physical substance: ",
                            "examples": [
                                "Early humans shaped tools out of stone."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}