{
    "word": "share",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃeər"
                            ],
                            "us": [
                                "ʃer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have or use something at the same time as someone else: ",
                            "examples": [
                                "She's very possessive about her toys and finds it hard to share.",
                                "Bill and I shared an office for years.",
                                "I share a house with four other people."
                            ]
                        },
                        {
                            "explanation": "to divide food, money, goods, etc. and give part of it to someone else: ",
                            "examples": [
                                "Will you share your sandwich with me?",
                                "Let's share the sweets (out) among/between everyone.",
                                "We should share (in) the reward."
                            ]
                        },
                        {
                            "explanation": "If two or more people share an activity, they each do some of it: ",
                            "examples": [
                                "Shall we share the driving?",
                                "We shared the preparation for the party between us, so it wasn't too much work."
                            ]
                        },
                        {
                            "explanation": "If two or more people or things share a feeling, quality, or experience, they both or all have the same feeling, quality, or experience: ",
                            "examples": [
                                "We share an interest in sailing.",
                                "All hospitals share some common characteristics.",
                                "I don't share your views/beliefs.",
                                "The management and the union both share in the responsibility for the crisis.",
                                "She knew that he was the person she wanted to share her life with."
                            ]
                        },
                        {
                            "explanation": "to tell someone else about your thoughts, feelings, ideas, etc.: ",
                            "examples": [
                                "He's not very good at sharing his worries.",
                                "It's nice to have someone you can share your problems with.",
                                "Come on, Bob, share the joke (with us)."
                            ]
                        },
                        {
                            "explanation": "to put something on a social media website so that other people can see it, or to let other people see something that someone else has put on a website : ",
                            "examples": [
                                "You might even recommend an article to other readers or share it on Facebook."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃeər"
                            ],
                            "us": [
                                "ʃer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a part of something that has been divided between several people: ",
                            "examples": [
                                "The total bill comes to €80, so our share is €20.",
                                "We ought to make sure that everyone gets equal shares of the food.",
                                "His share of the vote rose by 15 percentage points among Hispanics."
                            ]
                        },
                        {
                            "explanation": "a part of something that several people are involved in: ",
                            "examples": [
                                "She's not doing her share of the work.",
                                "We must all accept some share of the responsibility."
                            ]
                        },
                        {
                            "explanation": "one of the equal parts that the ownership of a company is divided into, and that can be bought by members of the public: ",
                            "examples": [
                                "The value of my shares has risen/fallen by eight percent.",
                                "We have some shares in Apple.",
                                "He invests in stocks and shares.",
                                "share prices"
                            ]
                        },
                        {
                            "explanation": "an occasion when someone shares something on a social media website: ",
                            "examples": [
                                "Her post has had over a thousand shares on Facebook."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}