{
    "word": "shelter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈʃel.tər"
                            ],
                            "us": [
                                "ˈʃel.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(a building designed to give) protection from bad weather, danger, or attack: ",
                            "examples": [
                                "an air-raid shelter",
                                "They opened a shelter to provide temporary housing for the city's homeless.",
                                "The trees gave/provided some shelter from the rain."
                            ]
                        },
                        {
                            "explanation": "to protect yourself from bad weather, danger, or attack: ",
                            "examples": [
                                "We took shelter for the night in an abandoned house."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈʃel.tər"
                            ],
                            "us": [
                                "ˈʃel.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to protect yourself, or another person or thing, from bad weather, danger, or attack: ",
                            "examples": [
                                "We were caught in a thunderstorm, without anywhere to shelter.",
                                "A group of us were sheltering from the rain under the trees."
                            ]
                        },
                        {
                            "explanation": "to give someone a secret hiding place so that they will not be caught by the army, police, etc.: ",
                            "examples": [
                                "Local people risked their own lives to shelter resistance fighters from the army."
                            ]
                        },
                        {
                            "explanation": "to remain in the building that you are in during an emergency such as an extreme weather event or a shooting: ",
                            "examples": [
                                "In most chemical emergencies people are instructed to shelter in place, closing windows and turning off air conditioners to keep out toxic fumes."
                            ]
                        },
                        {
                            "explanation": "to stay at home and only leave when you have to, for example to buy food, especially during an epidemic (= the appearance of a disease in a large number of people at the same time): ",
                            "examples": [
                                "Millions of Californians were told to shelter in place to stop the spread of coronavirus. "
                            ]
                        },
                        {
                            "explanation": "If you shelter income, you legally avoid paying taxes on it: ",
                            "examples": [
                                "Their accountant suggested some novel ways of sheltering their retirement income."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}