{
    "word": "shielding",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈʃiːl.dɪŋ"
                            ],
                            "us": [
                                "ˈʃiːl.dɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a method of protecting yourself from a disease that involves staying at home and having as little contact as possible with people from outside your home, because you are at risk of becoming seriously ill if you get the disease: ",
                            "examples": [
                                "If you’re clinically extremely vulnerable, you’re strongly advised to stay at home as much as possible and keep interactions outside to a minimum. This is called \"shielding\".",
                                "People who have been given a prognosis of less than 6 months to live could decide not to undertake shielding. "
                            ]
                        },
                        {
                            "explanation": "sheets of metal, plastic, etc. used to protect workers or other people from harmful materials, diseases, radiation, etc.: ",
                            "examples": [
                                "The shielding protected the astronaut from the searing temperatures generated by the high-velocity descent.",
                                "The team is examining new shielding materials that block more radiation than aluminium."
                            ]
                        },
                        {
                            "explanation": "the practice of keeping your body between an opponent and the ball, with your back to the other player, to prevent them from getting the ball: ",
                            "examples": [
                                "Shielding allows you to keep the ball but also move forward.",
                                "Shielding is using your arms and body to prevent a defender from taking the ball."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}