{
    "word": "shield",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃiːld"
                            ],
                            "us": [
                                "ʃiːld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in the past, a large, flat object made of metal or leather that soldiers held in front of their bodies to protect themselves",
                            "examples": []
                        },
                        {
                            "explanation": "a large, flat object made of strong plastic that police officers hold in front of their bodies to protect themselves: ",
                            "examples": [
                                "The police held up their riot shields against the flying rocks and bricks."
                            ]
                        },
                        {
                            "explanation": "something or someone used as protection or providing protection: ",
                            "examples": [
                                "The anti-personnel mines were laid as a protective shield around the town.",
                                "Anger can function as a shield against (= a way of avoiding) even more painful emotions of loss and hurt."
                            ]
                        },
                        {
                            "explanation": "a flat object with two straight sides, a rounded or pointed lower edge, and usually a straight top edge, on which there is a coat of arms",
                            "examples": []
                        },
                        {
                            "explanation": "an object shaped like a shield that is used as a symbol or badge: ",
                            "examples": [
                                "The blazer has a shield sewn on the pocket.",
                                "When he retired from the police, he had to turn in his shield."
                            ]
                        },
                        {
                            "explanation": "an object shaped like a shield that is given as a prize: ",
                            "examples": [
                                "Our school won the county basketball shield this year."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃiːld"
                            ],
                            "us": [
                                "ʃiːld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to protect someone or something: ",
                            "examples": [
                                "She held her hand above her eyes to shield them from the sun.",
                                "They are accused of trying to shield the General from US federal investigators."
                            ]
                        },
                        {
                            "explanation": "in football, to keep your body between an opponent and the ball, with your back to the other player, to prevent them from getting the ball: ",
                            "examples": [
                                "We teach young players how to step in front of the defender and use their body to shield the ball."
                            ]
                        },
                        {
                            "explanation": "to protect yourself from a disease by staying at home and having as little contact as possible with people from outside your home, because you are at risk of becoming seriously ill if you get the disease: ",
                            "examples": [
                                "Please contact your GP if you think you should be shielding.",
                                "Cancer patients need to shield from coronovirus. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}