{
    "word": "shift",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃɪft"
                            ],
                            "us": [
                                "ʃɪft"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause something or someone to) move or change from one position or direction to another, especially slightly: ",
                            "examples": [
                                "She shifted (her weight) uneasily from one foot to the other.",
                                "The wind is expected to shift (to the east) tomorrow."
                            ]
                        },
                        {
                            "explanation": "(of an idea, opinion, etc.) to change: ",
                            "examples": [
                                "Society's attitudes towards women have shifted enormously over the last century.",
                                "Media attention has shifted recently onto environmental issues."
                            ]
                        },
                        {
                            "explanation": "to move the gears of a vehicle into different positions in order to make it go faster or slower: ",
                            "examples": [
                                "In cars that are automatics, you don't have to bother with shifting gears."
                            ]
                        },
                        {
                            "explanation": "to leave your home in order to live in a new one; move house: ",
                            "examples": [
                                "I've just shifted house for the third time in three years."
                            ]
                        },
                        {
                            "explanation": "to get rid of something unwanted, or to sell something: ",
                            "examples": [
                                "Modern detergents will shift most stains.",
                                "The people at the toy shop expect to shift a lot of stock in the run-up to Christmas."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃɪft"
                            ],
                            "us": [
                                "ʃɪft"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of workers who do a job for a period of time during the day or night, or the period of time itself: ",
                            "examples": [
                                "As the night shift leave/leaves, the day shift arrive/arrives.",
                                "Are you on the night shift or the day shift? (= Do you work during the night period or the day period?)"
                            ]
                        },
                        {
                            "explanation": "a change in position or direction: ",
                            "examples": [
                                "a shift in the wind/temperature",
                                "The shift in the balance of power in the region has had far-reaching consequences.",
                                "There has been a dramatic shift in public opinion towards peaceful negotiations."
                            ]
                        },
                        {
                            "explanation": "a simple dress that hangs loosely from the shoulders",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}