{
    "word": "shock",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃɒk"
                            ],
                            "us": [
                                "ʃɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(the emotional or physical reaction to) a sudden, unexpected, and usually unpleasant event or experience: ",
                            "examples": [
                                "Her mother's death came as a great shock - it was so unexpected.",
                                "It was such a loud crash - it gave me/I got quite a shock.",
                                "It was a shock to see her looking so ill.",
                                "I was in (a state of) shock for about two weeks after the accident.",
                                "Manchester City suffered a shock defeat (= completely unexpected defeat) at the weekend."
                            ]
                        },
                        {
                            "explanation": "an unpleasant feeling that you experience when something new or unusual happens: ",
                            "examples": [
                                "It's really hard getting back to work after three months off - it's quite a shock to the system."
                            ]
                        },
                        {
                            "explanation": "an \nelectric shock : ",
                            "examples": [
                                "Ow! - I got a shock from that lamp!"
                            ]
                        },
                        {
                            "explanation": "a medical condition caused by severe injury, pain, loss of blood, or fear that slows down the flow of blood around the body: ",
                            "examples": [
                                "Several passengers from the wrecked vehicle were taken to hospital suffering from shock."
                            ]
                        },
                        {
                            "explanation": "the effect of one object violently hitting another, causing damage or a slight movement: ",
                            "examples": [
                                "For running on hard roads, you need shoes with extra cushioning to absorb (= reduce) the shock."
                            ]
                        },
                        {
                            "explanation": "a feeling of being offended or upset by something you consider wrong or unacceptable: ",
                            "examples": [
                                "You should have seen the look of shock on her face when he started swearing!"
                            ]
                        },
                        {
                            "explanation": "a large and noticeable mass of hair: ",
                            "examples": [
                                "The baby had a shock of bright red hair."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃɒk"
                            ],
                            "us": [
                                "ʃɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to offend or upset someone by doing or saying something that they consider is immoral or unacceptable: ",
                            "examples": [
                                "The advertisements were designed to shock - that was the whole point of the campaign.",
                                "I think it shocks him to hear women talking about sex."
                            ]
                        },
                        {
                            "explanation": "to make someone feel upset or surprised: ",
                            "examples": [
                                "The photographs of starving children shocked people into giving money.",
                                "The news of the accident shocked the family deeply."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}