{
    "word": "short",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ʃɔːt"
                            ],
                            "us": [
                                "ʃɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "small in length, distance, or height: ",
                            "examples": [
                                "a short skirt",
                                "Her hair is much shorter than it used to be.",
                                "It's only a short walk to the station.",
                                "I'm fairly short but my brother's very tall."
                            ]
                        },
                        {
                            "explanation": "used to say that a name is used as a shorter form of another name: ",
                            "examples": [
                                "Her name's Jo - it's short for Josephine.",
                                "Her name's Josephine, or Jo for short."
                            ]
                        },
                        {
                            "explanation": "being an amount of time that is less than average or usual: ",
                            "examples": [
                                "a short film/visit",
                                "He's grown so much in such a short time.",
                                "I work much better if I take a short break every hour or so."
                            ]
                        },
                        {
                            "explanation": "Short books, letters, and other examples of writing do not contain many words and do not take much time to read: ",
                            "examples": [
                                "It's a very short book - you'll read it in an hour."
                            ]
                        },
                        {
                            "explanation": "to not have enough of something: ",
                            "examples": [
                                "to be short of space/time",
                                "We're short on coffee - I'd better get some more.",
                                "The bill comes to £85, but we're £15 short.",
                                "I'm a little short (= I do not have much money) this week - could you lend me ten dollars?"
                            ]
                        },
                        {
                            "explanation": "unable to breathe very well, for example because you have been running or doing some type of energetic exercise: ",
                            "examples": [
                                "She's always short of breath when she climbs the stairs."
                            ]
                        },
                        {
                            "explanation": "to be few or not enough in number: ",
                            "examples": [
                                "Free desks are in short supply in this office."
                            ]
                        },
                        {
                            "explanation": "to not have something, especially when it is something you need in order to live: ",
                            "examples": [
                                "My parents didn't have much money, but they made sure we didn't go short (of anything)."
                            ]
                        },
                        {
                            "explanation": "saying little but showing slight impatience or anger in the few words that you say: ",
                            "examples": [
                                "I'm sorry if I was a bit short with you on the phone this morning."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃɔːt"
                            ],
                            "us": [
                                "ʃɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a drink of spirits (= type of strong alcohol) without water or any other liquid added: ",
                            "examples": [
                                "She only drinks shorts, never wine or beer."
                            ]
                        },
                        {
                            "explanation": "a short film, especially one made for showing before the main film at a cinema",
                            "examples": []
                        },
                        {
                            "explanation": "informal for\nshort circuit ",
                            "examples": []
                        },
                        {
                            "explanation": "in baseball, the position on the inner part of the field between second base (= one of the positions on a square that a player must reach in order to score) and third base, or the player at that position: ",
                            "examples": [
                                "a ground ball to short",
                                "Tommy will play short and bat third for us."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃɔːt"
                            ],
                            "us": [
                                "ʃɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "informal for\nshort-circuit : to have or cause a bad electrical connection that makes the current flow in the wrong direction, which often has the effect of stopping the power supply: ",
                            "examples": [
                                "Circuit breakers shorted, which cut off power to safety systems throughout the plant.",
                                "The plumber shorted the washing machine."
                            ]
                        },
                        {
                            "explanation": "to treat someone unfairly, by giving them less than they deserve, or less than what is needed or usual: ",
                            "examples": [
                                "She calculated that many of the state's 176 school districts were being shorted a total of $161 million annually.",
                                "He said the company has shorted him $500 in the past six months."
                            ]
                        },
                        {
                            "explanation": "to sell a share or currency that you have borrowed when you think its price is going to fall, with the intention of buying it back later at a lower price, then keeping the profit after paying back what you borrowed: ",
                            "examples": [
                                "At the time it was the market's most shorted stock - with traders staking more than £100 million on the share price falling.",
                                "One famous example was when George Soros shorted the pound in 1992, and Britain was forced out of the European exchange rate mechanism."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ʃɔːt"
                            ],
                            "us": [
                                "ʃɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "before the arranged or expected time or place: ",
                            "examples": [
                                "We wanted to explain the plans fully, but the chairman stopped us short, as there were other important matters to discuss."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "ʃɔːt-"
                            ],
                            "us": [
                                "ʃɔːrt-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used with adjectives ending in -ed formed from nouns to describe something with a short part: ",
                            "examples": [
                                "a short-haired dog (= a dog with short hair)",
                                "a short-sleeved shirt (= a shirt with short sleeves)"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}