{
    "word": "shot",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃɒt"
                            ],
                            "us": [
                                "ʃɑːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of shoot",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃɒt"
                            ],
                            "us": [
                                "ʃɑːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a kick, hit, or throw of the ball that is intended to score points in a sport such as cricket, football, tennis, or golf: ",
                            "examples": [
                                "And that was a great shot by Márquez!",
                                "Murray drove a forehand shot down the line to win the match."
                            ]
                        },
                        {
                            "explanation": "the action of firing a gun or another weapon: ",
                            "examples": [
                                "He fired four shots at the car as it drove off."
                            ]
                        },
                        {
                            "explanation": "someone who is skilled/not skilled at aiming and firing a gun: ",
                            "examples": [
                                "I didn't know you were such a good shot!"
                            ]
                        },
                        {
                            "explanation": "an attempt to do or achieve something that you have not done before: ",
                            "examples": [
                                "I thought I'd have a shot at making my own wine.",
                                "I've never tried bowling before, but I thought I'd give it a shot."
                            ]
                        },
                        {
                            "explanation": "a photograph: ",
                            "examples": [
                                "I got/took some really good shots of the harbour at sunset."
                            ]
                        },
                        {
                            "explanation": "a short piece in a film in which there is a single action or a short series of actions",
                            "examples": []
                        },
                        {
                            "explanation": "a small amount of a strong alcoholic drink: ",
                            "examples": [
                                "Mick poured himself a shot of whisky.",
                                "They were at the bar doing shots (= drinking many small, strong alcoholic drinks)."
                            ]
                        },
                        {
                            "explanation": "a small amount of a non-alcoholic drink with a strong taste or effect: ",
                            "examples": [
                                "He downed a shot of espresso.",
                                "I like my coffee with a shot of vanilla.",
                                "You can make your own healthy orange and turmeric shots."
                            ]
                        },
                        {
                            "explanation": "an injection (= the act of putting a drug or vaccine into someone's body with a needle), or an amount of the drug or vaccine put into the body by a single injection: ",
                            "examples": [
                                "It's important to get regular flu shots.",
                                "The doctor gave him a shot of morphine."
                            ]
                        },
                        {
                            "explanation": "a heavy metal ball thrown in a sports competition",
                            "examples": []
                        },
                        {
                            "explanation": "a mass of small metal balls that are shot from a gun: ",
                            "examples": [
                                "Shotgun cartridges contain lead shot."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ʃɒt"
                            ],
                            "us": [
                                "ʃɑːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of silk) having small threads of a colour in it, so that the main colour appears to change depending on the angle at which the cloth is seen: ",
                            "examples": [
                                "Her evening dress is made of green shot silk."
                            ]
                        },
                        {
                            "explanation": "no longer working or effective: ",
                            "examples": [
                                "It's no good - these gears are shot."
                            ]
                        },
                        {
                            "explanation": "to get rid of or free of something, or to leave something: ",
                            "examples": [
                                "I can't wait to get shot of this office for a week."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}