{
    "word": "shoulder",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈʃəʊl.dər"
                            ],
                            "us": [
                                "ˈʃoʊl.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "one of the two parts of the body at each side of the neck that join the arms to the rest of the body: ",
                            "examples": [
                                "I rested my head on her shoulder.",
                                "Then she put her arm around my shoulder and gave me a kiss.",
                                "She glanced nervously over her shoulder to make sure no one else was listening."
                            ]
                        },
                        {
                            "explanation": "the top part of a person's back: ",
                            "examples": [
                                "He was about six feet tall with broad shoulders.",
                                "\"I don't know what to do about it,\" said Martha, shrugging her shoulders."
                            ]
                        },
                        {
                            "explanation": "the parts of a piece of clothing that cover the wearer's shoulders: ",
                            "examples": [
                                "The shoulders look a little tight. Do you want to try a larger size?",
                                "a jacket with padded shoulders"
                            ]
                        },
                        {
                            "explanation": "the part of a bottle that curves out below its opening",
                            "examples": []
                        },
                        {
                            "explanation": "used to refer to the responsibility that someone has or feels for something: ",
                            "examples": [
                                "A huge burden was lifted from my shoulders (= I became much less worried) when I told my parents about my problem.",
                                "Responsibility for the dispute rests squarely on the shoulders of the president."
                            ]
                        },
                        {
                            "explanation": "a piece of meat that includes the upper part of an animal's front leg: ",
                            "examples": [
                                "I've bought a shoulder of lamb for Sunday lunch."
                            ]
                        },
                        {
                            "explanation": "an area along the side of a main road where cars can stop: ",
                            "examples": [
                                "There were tire tracks left in the soft shoulder (= area of dirt or grass by the road)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈʃəʊl.dər"
                            ],
                            "us": [
                                "ˈʃoʊl.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to accept that you are responsible for something bad or difficult: ",
                            "examples": [
                                "It is women who mainly shoulder responsibility for the care of elderly and disabled relatives.",
                                "Teachers cannot be expected to shoulder all the blame for poor exam results."
                            ]
                        },
                        {
                            "explanation": "to put something on your shoulders to carry it: ",
                            "examples": [
                                "Shouldering her pack, she strode off up the road."
                            ]
                        },
                        {
                            "explanation": "to push something with one of your shoulders: ",
                            "examples": [
                                "She was carrying two suitcases and had to shoulder the door open.",
                                "He shouldered his way (= formed a way through by pushing with his shoulders) to the front of the crowd to get a better look."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}