{
    "word": "shout",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃaʊt"
                            ],
                            "us": [
                                "ʃaʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to speak with a very loud voice, often as loud as possible, usually when you want to make yourself heard in noisy situations, or when the person you are talking to is a long way away or cannot hear very well: ",
                            "examples": [
                                "There's no need to shout, I can hear you.",
                                "\"I'll see you tomorrow,\" shouted Eleni above the noise of the helicopter.",
                                "He shouted from the garage that he'd be finished in about half an hour."
                            ]
                        },
                        {
                            "explanation": "to express strong emotions, such as anger, fear, or excitement, or to express strong opinions, in a loud voice: ",
                            "examples": [
                                "Dad really shouted at me when I broke the window.",
                                "He shouted abuse at the judge after being sentenced to five years' imprisonment.",
                                "The fans were screaming and shouting out the names of the band members.",
                                "I shouted at him to put the gun down.",
                                "\"Stop this childish nonsense at once!\" he shouted furiously."
                            ]
                        },
                        {
                            "explanation": "to try to attract attention in a loud voice: ",
                            "examples": [
                                "I heard them shouting for help, but there was nothing I could do.",
                                "It's the charities that shout loudest (= attract the most public attention) that often get given the most money."
                            ]
                        },
                        {
                            "explanation": "to buy a drink for someone: ",
                            "examples": [
                                "I'll shout you a drink."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃaʊt"
                            ],
                            "us": [
                                "ʃaʊt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of saying something very loudly or making a very loud sound with your voice: ",
                            "examples": [
                                "Her speech was interrupted by angry shouts from the audience."
                            ]
                        },
                        {
                            "explanation": "a set of drinks for a group of people, or a particular person's turn to buy them: ",
                            "examples": [
                                "Would you like another drink? It's my shout since you bought the last ones."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}