{
    "word": "should",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "modal verb",
                        "ipa": {
                            "uk": [
                                "ʃʊd",
                                "ʃəd"
                            ],
                            "us": [
                                "ʃʊd",
                                "ʃəd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to say or ask what is the correct or best thing to do: ",
                            "examples": [
                                "If you're annoyed with him, you should tell him.",
                                "You should take the bus - it's the easiest way to get there.",
                                "\"Should I apologize to him?\" \"Yes, I think you should.\"",
                                "You should be ashamed of yourselves.",
                                "This computer isn't working as it should.",
                                "There should be an investigation into the cause of the disaster.",
                                "He said that I should see a doctor.",
                                "I should have written to her but I haven't had time.",
                                "You shouldn't have said anything.",
                                "Where should (= do you suggest that) we meet tonight?",
                                "It's rather cold in here. Should I (= do you want me to) turn the heating on?"
                            ]
                        },
                        {
                            "explanation": "used to show when something is likely or expected: ",
                            "examples": [
                                "My dry cleaning should be ready this afternoon.",
                                "You should find this guidebook helpful.",
                                "I wonder what's happened to Annie. She should be (= it was expected that she would be) here by now.",
                                "\"Could you have the report ready by Friday?\" \"Yes, I should think so (= it is likely that it will be ready).\"",
                                "This should be good (= this is likely to be interesting or amusing)."
                            ]
                        },
                        {
                            "explanation": "used when referring to a possible event in the future: ",
                            "examples": [
                                "If anyone should ask for me, I'll be in the manager's office.",
                                "Should you (= if you) ever need anything, please don't hesitate to contact me."
                            ]
                        },
                        {
                            "explanation": "used after \"that\" and adjectives or nouns that show an opinion or feeling: ",
                            "examples": [
                                "It's odd that she should think I would want to see her again.",
                                "It's so unfair that she should have died so young."
                            ]
                        },
                        {
                            "explanation": "used after \"that\" to suggest that a situation possibly exists or might come into existence: ",
                            "examples": [
                                "We agreed that we should meet the following week."
                            ]
                        },
                        {
                            "explanation": "used after \"so that\" and \"in order that\" to show purpose: ",
                            "examples": [
                                "He took his umbrella so that he shouldn't get wet."
                            ]
                        },
                        {
                            "explanation": "used after \"for fear that\", \"in case\", and \"lest\": ",
                            "examples": [
                                "He took his umbrella in case it should rain."
                            ]
                        },
                        {
                            "explanation": "used after \"why\" when giving or asking the reason for something: ",
                            "examples": [
                                "Why should anyone want to eat something so horrible?",
                                "Why should she not buy it if she can afford it?"
                            ]
                        },
                        {
                            "explanation": "used instead of \"would\" when the subject is \"I\" or \"we\": ",
                            "examples": [
                                "I should like a cup of tea before I go to bed.",
                                "I shouldn't expect you to pay, of course."
                            ]
                        },
                        {
                            "explanation": "used to express surprise in sentences that are in the form of questions: ",
                            "examples": [
                                "I was just getting off the bus when who should I see but my old school friend Pat!"
                            ]
                        },
                        {
                            "explanation": "used after \"I\" when giving advice: ",
                            "examples": [
                                "I shouldn't worry about it if I were you.",
                                "I shouldn't (= I advise you not to) let it worry you."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}