{
    "word": "shower",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃaʊər"
                            ],
                            "us": [
                                "ˈʃaʊ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a device that releases drops of water through a lot of very small holes and that you stand under to wash your whole body: ",
                            "examples": [
                                "The shower is broken - you'll have to have a bath.",
                                "Many British homes have a shower attachment fixed to the bath taps.",
                                "a shower curtain/cap"
                            ]
                        },
                        {
                            "explanation": "an acting of washing using a shower: ",
                            "examples": [
                                "Do I have time to have a shower before we go out?"
                            ]
                        },
                        {
                            "explanation": "a place, usually in a bathroom, where a shower is situated: ",
                            "examples": [
                                "He's in the shower at the moment. Do you want him to call you back?"
                            ]
                        },
                        {
                            "explanation": "a short period of rain or snow: ",
                            "examples": [
                                "showers of rain, hail and sleet",
                                "You're soaked! Did you get caught in the shower?",
                                "There will be thundery/wintry showers over many parts of the country.",
                                "Snow showers are expected at the end of the week."
                            ]
                        },
                        {
                            "explanation": "a lot of small objects or drops of liquid coming through the air: ",
                            "examples": [
                                "There was a bang and a shower of sparks.",
                                "The pipe burst, sending out a shower of water."
                            ]
                        },
                        {
                            "explanation": "a large amount of something: ",
                            "examples": [
                                "She received a shower of praise from her colleagues."
                            ]
                        },
                        {
                            "explanation": "a party held for a woman just before she gets married or gives birth to a child, when she is given presents for her future home or baby: ",
                            "examples": [
                                "I bought the cutest baby clothes to take to Jacey's baby shower.",
                                "We went to my cousin's bridal shower yesterday."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃaʊər"
                            ],
                            "us": [
                                "ˈʃaʊ.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fall down or come out in a shower, or to make something do this: ",
                            "examples": [
                                "I heard a massive explosion, and seconds later fragments of glass were showering (= falling) down on us.",
                                "She shook the bottle violently and showered us with champagne."
                            ]
                        },
                        {
                            "explanation": "to take a shower: ",
                            "examples": [
                                "I shower every morning."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}