{
    "word": "shuffle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈʃʌf.əl"
                            ],
                            "us": [
                                "ˈʃʌf.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to walk by pulling your feet slowly along the ground rather than lifting them: ",
                            "examples": [
                                "I love shuffling through the fallen leaves.",
                                "He shuffled into the kitchen, leaning on his walking stick.",
                                "Don't shuffle your feet like that! Walk normally."
                            ]
                        },
                        {
                            "explanation": "to move your feet or bottom around, while staying in the same place, especially because you are uncomfortable, nervous, or embarrassed: ",
                            "examples": [
                                "The woman in front of me kept shuffling around in her seat all the way through the performance.",
                                "When I asked him where he'd been, he just looked at the ground and shuffled his feet."
                            ]
                        },
                        {
                            "explanation": "to move similar things from one position or place to another, often to give an appearance of activity when nothing useful is being done: ",
                            "examples": [
                                "She shuffled her papers nervously on her desk.",
                                "Many prisoners have to be shuffled around police stations because of prison overcrowding."
                            ]
                        },
                        {
                            "explanation": "to mix a set of playing cards without seeing their values before beginning a game, so that their order is not known to any of the players: ",
                            "examples": [
                                "It's your turn to shuffle the cards."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈʃʌf.əl"
                            ],
                            "us": [
                                "ˈʃʌf.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of moving things around from one position to another: ",
                            "examples": [
                                "She gave her papers a quick shuffle."
                            ]
                        },
                        {
                            "explanation": "an occasion when the positions of people or things within a particular group are changed : ",
                            "examples": [
                                "We expect a Cabinet shuffle in the summer."
                            ]
                        },
                        {
                            "explanation": "the act of mixing a set of playing cards before giving them out: ",
                            "examples": [
                                "Make sure you give the cards a good shuffle before you deal."
                            ]
                        },
                        {
                            "explanation": "a feature of an MP3 player, mobile phone, etc. that plays songs in a random order: ",
                            "examples": [
                                "I put my iPod on shuffle and drove home.",
                                "a shuffle mode/function"
                            ]
                        },
                        {
                            "explanation": "a way of walking in which you pull your feet slowly along the ground rather than lifting them: ",
                            "examples": [
                                "He's got arthritis and walks with a shuffle."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}