{
    "word": "shunt",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʃʌnt"
                            ],
                            "us": [
                                "ʃʌnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move a train or carriage onto a different track in or near a station using a special railway engine designed for this purpose",
                            "examples": []
                        },
                        {
                            "explanation": "to move someone or something from one place to another, usually because that person or thing is not wanted, and without considering any unpleasant effects: ",
                            "examples": [
                                "I spent most of my childhood being shunted (about) between my parents who had divorced when I was five.",
                                "He shunts his kids off to a camp every summer.",
                                "Viewers are sick of their favourite sitcoms being shunted to later times to make way for live sports coverage."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ʃʌnt"
                            ],
                            "us": [
                                "ʃʌnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a hole or passage that allows liquid to move from one part of the body to another, either found naturally in the body or put into the body in an operation: ",
                            "examples": [
                                "The doctor had trouble finding a vein to insert the shunt. ",
                                "An estimated 50% of all shunts fail within two years, requiring further surgery to replace the shunts."
                            ]
                        },
                        {
                            "explanation": "a car accident in which one vehicle drives into the back of another: ",
                            "examples": [
                                "The accident was his second high-speed shunt.",
                                "He gave me a lift last night because I had a little shunt in my new car."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}