{
    "word": "side",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "saɪd"
                            ],
                            "us": [
                                "saɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a flat outer surface of an object, especially one that is not the top, the bottom, the front, or the back: ",
                            "examples": [
                                "The names of ships are usually painted on their sides.",
                                "The window on the right side of the house was open.",
                                "Please write on one side of the paper only.",
                                "I've already written four sides (= pages of writing) for my essay.",
                                "Canadian coins have a picture of the British Queen's head on one side.",
                                "Please use the side entrance."
                            ]
                        },
                        {
                            "explanation": "an edge or border of something: ",
                            "examples": [
                                "A square has four sides.",
                                "There are trees on both sides of the road.",
                                "They were surrounded on all sides/on every side by curious children."
                            ]
                        },
                        {
                            "explanation": "a place next to something: ",
                            "examples": [
                                "I have a small table at/by the side of (= next to) my bed.",
                                "He stayed at/by her side (= with her) throughout her long illness."
                            ]
                        },
                        {
                            "explanation": "in a restaurant, an extra dish of food, for example vegetables or salad, that is served with the main dish, sometimes on a separate plate: ",
                            "examples": [
                                "I’ll have a side of onion rings."
                            ]
                        },
                        {
                            "explanation": "next to each other: ",
                            "examples": [
                                "The children sat side by side on the sofa watching television."
                            ]
                        },
                        {
                            "explanation": "a part of something, especially in relation to a real or imagined central line: ",
                            "examples": [
                                "He likes to sleep on the right side of the bed.",
                                "In Britain, cars drive on the left side of the road.",
                                "There is no money on my mother's side (of the family).",
                                "I could just see Joan on the far/other side of the room.",
                                "Children came running from all sides (= from all directions)."
                            ]
                        },
                        {
                            "explanation": "the part of the body from under the arm to the top of the leg: ",
                            "examples": [
                                "I have a pain in my side."
                            ]
                        },
                        {
                            "explanation": "a television channel: ",
                            "examples": [
                                "What side is \"Coronation Street\" on?"
                            ]
                        },
                        {
                            "explanation": "from left to right and from right to left: ",
                            "examples": [
                                "The curtains were swinging from side to side in the breeze."
                            ]
                        },
                        {
                            "explanation": "half of an animal's body, considered as meat: ",
                            "examples": [
                                "She bought a side of lamb from the butcher."
                            ]
                        },
                        {
                            "explanation": "one of two or more opposing teams or groups: ",
                            "examples": [
                                "This is a war which neither side can win.",
                                "Our side (= team) lost again on Saturday.",
                                "Which/Whose side are you on (= which team are you playing for/supporting)?",
                                "Don't be angry with me - I'm on your side (= I want to help you)."
                            ]
                        },
                        {
                            "explanation": "to support one person or group rather than another, in an argument or war: ",
                            "examples": [
                                "My mother never takes sides when my brother and I argue."
                            ]
                        },
                        {
                            "explanation": "to support someone in an argument: ",
                            "examples": [
                                "My mother always takes my father's side when I argue with him."
                            ]
                        },
                        {
                            "explanation": "an opinion held in an argument, or a way of considering something: ",
                            "examples": [
                                "There are at least two sides to every question.",
                                "I've listened to your side of the story, but I still think you were wrong to do what you did."
                            ]
                        },
                        {
                            "explanation": "a part of a situation, system, etc. that can be considered or dealt with separately: ",
                            "examples": [
                                "She takes care of the financial side of things.",
                                "Fortunately my boss did see the funny side of the situation."
                            ]
                        },
                        {
                            "explanation": "a part of someone's character: ",
                            "examples": [
                                "She seems quite fierce, but actually she has a gentle side."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "saɪd"
                            ],
                            "us": [
                                "saɪd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not in or at the centre or main part of something: ",
                            "examples": [
                                "We parked the car on a side street/road (= a small road, especially one that joins on to a main road).",
                                "I think that's a side issue (= a subject which is separate from the main one) which we should talk about later.",
                                "I'd like a side dish of potatoes (= some potatoes on a separate plate)."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}