{
    "word": "sight",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "saɪt"
                            ],
                            "us": [
                                "saɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the ability to see: ",
                            "examples": [
                                "If your sight is poor, you should not drive a car.",
                                "The old woman has lost her sight (= has become blind)."
                            ]
                        },
                        {
                            "explanation": "something that is in someone's view: ",
                            "examples": [
                                "The flowers at the annual flower show were a beautiful sight.",
                                "You should always keep sight of your bags (= have them where you can see them) while you're at the airport.",
                                "He was a real sight in his old clothes (= he looked messy or silly).",
                                "The child laughed at the sight of (= when she saw) the new toy.",
                                "The lawyer requested sight of (= to see) the papers.",
                                "I don't dare let the children out of my sight (= go where I cannot see them) at the park.",
                                "The police officer was hidden out of sight (= where he could not be seen) behind a tree.",
                                "The castle came into sight (= started to be able to be seen) as we went round a bend in the road.",
                                "We're looking for a house which is within sight of (= from which it is possible to see) the mountains.",
                                "After three years of campaigning, the end is finally in sight (= will happen soon) for Jon.",
                                "I caught sight of (= saw for a moment) my former teacher while I was out shopping today, but she turned a corner and I lost sight of (= could no longer see) her.",
                                "\"Do you know David Wilson?\" \"I haven't met him, but I know him by sight (= I recognize him, but do not know him).\"",
                                "She hated/loathed the sight of (= hated) her former husband.",
                                "They used to be very good friends, but now they can't bear/stand the sight of (= hate) each other.",
                                "The question seemed easy at first sight (= when they first saw it), but when the students tried to answer it, they discovered how difficult it was."
                            ]
                        },
                        {
                            "explanation": "places of interest, especially to visitors: ",
                            "examples": [
                                "We spent a week in Rome looking at all the sights."
                            ]
                        },
                        {
                            "explanation": "without seeing something first: ",
                            "examples": [
                                "I never buy anything sight unseen."
                            ]
                        },
                        {
                            "explanation": "a lot; much: ",
                            "examples": [
                                "Food is a darn/damn sight more expensive than it used to be.",
                                "He's a sight better than he was yesterday.",
                                "She's a damn sight funnier than most comedians, that's for sure.",
                                "The whole task would have been a damn sight easier if we'd been given proper instructions.",
                                "I mean it's not perfect but it's a darn sight better than it was before."
                            ]
                        },
                        {
                            "explanation": "a part of a gun or other device through which you look to help you aim at something: ",
                            "examples": [
                                "Make sure you line up the sights before you fire the gun."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "saɪt"
                            ],
                            "us": [
                                "saɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to suddenly see something or someone: ",
                            "examples": [
                                "After days at sea, the sailors finally sighted land."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}