{
    "word": "sign",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "saɪn"
                            ],
                            "us": [
                                "saɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to write your name, usually on a written or printed document, to show that you agree with its contents or have written or created it yourself: ",
                            "examples": [
                                "to sign a letter/cheque/contract/lease/agreement",
                                "Sign here, please.",
                                "He signed his name at the end of the letter.",
                                "He signed himself \"Mark Taylor\".",
                                "She said the painting was by Picasso, but it wasn't signed."
                            ]
                        },
                        {
                            "explanation": "in sport, to make a legal written agreement to employ a player: ",
                            "examples": [
                                "The team has just signed a new player."
                            ]
                        },
                        {
                            "explanation": "to give an order or information, or make a request, using hand and body movements: ",
                            "examples": [
                                "He signed for/to the waiter to bring him another drink.",
                                "He signed to the waiter that he wanted another drink."
                            ]
                        },
                        {
                            "explanation": "to use sign language (= language used by people who cannot hear or talk)",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "saɪn"
                            ],
                            "us": [
                                "saɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a notice giving information, directions, a warning, etc.: ",
                            "examples": [
                                "a road sign",
                                "a shop sign"
                            ]
                        },
                        {
                            "explanation": "a movement of the body that gives information or an instruction: ",
                            "examples": [
                                "She pointed to her watch as a sign that it was getting late and she wanted to leave.",
                                "He made/gave a sign to his boyfriend to stop talking.",
                                "The priest made the sign of the cross (= made the shape of a cross by moving his hand between four points on his chest) when he entered the church."
                            ]
                        },
                        {
                            "explanation": "something showing that something else exists or might happen or exist in the future: ",
                            "examples": [
                                "His inability to handle the situation is a sure sign of weakness.",
                                "The fact that he's eating more is a sign that he's feeling better.",
                                "I've searched for my hat, but there's no sign of it anywhere (= I can't find it).",
                                "There was no sign of life in the building (= there seemed to be no one in it).",
                                "Billy's work at school has shown signs of improvement this year.",
                                "There is every sign that/All the signs are that the worst is over."
                            ]
                        },
                        {
                            "explanation": "a written or printed mark that has a standard meaning: ",
                            "examples": [
                                "+ and - are mathematical signs.",
                                "£ is the sign for the British pound."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}