{
    "word": "single-shot",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsɪŋ.ɡəlˌʃɒt"
                            ],
                            "us": [
                                "ˈsɪŋ.ɡəlˌʃɑːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a gun) holding only one bullet or other piece of ammunition so that it has to be loaded again after every time it is used: ",
                            "examples": [
                                "He claimed the single-shot pistol was an antique.",
                                "A single-shot hunting rifle was propped against the wall."
                            ]
                        },
                        {
                            "explanation": "(of a film or part of a film) made in one continuous shot (= a short piece in which there is a single action or a short series of actions): ",
                            "examples": [
                                "Hitchcock's single-shot movie \"Rope\" is one of his best technical achievements.",
                                "One of Sokurov's best-known films is \"Russian Ark\", a single-shot tour of St Petersburg's Hermitage Museum."
                            ]
                        },
                        {
                            "explanation": "(of a drug) given as one injection (= the act of putting a liquid drug into someone's body using a needle and small tube) rather than two or more injections: ",
                            "examples": [
                                "The original vaccine required six injections over several months, but researchers have now developed a single-shot vaccine.",
                                "A variety of needles are used for single-shot epidurals."
                            ]
                        },
                        {
                            "explanation": "(of a drink) made with only one shot (= small amount) of alcoholic drink or espresso (= strong coffee): ",
                            "examples": [
                                "A typical single-shot cocktail contains about 15 grams of alcohol.",
                                "I ordered a single-shot cappuccino."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}