{
    "word": "sink",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɪŋk"
                            ],
                            "us": [
                                "sɪŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause something or someone to) go down below the surface or to the bottom of a liquid or soft substance: ",
                            "examples": [
                                "The Titanic was a passenger ship which sank (to the bottom of the ocean) in 1912.",
                                "The legs of the garden chair sank into the soft ground.",
                                "Enemy aircraft sank two battleships.",
                                "The dog sank her teeth into (= bit) the ball and ran off with it."
                            ]
                        },
                        {
                            "explanation": "to (cause something or someone to) fall or move to a lower level: ",
                            "examples": [
                                "The sun glowed red as it sank slowly below the horizon.",
                                "Student numbers have sunk considerably this year.",
                                "We sank (= drank) a bottle of wine each last night.",
                                "The wounded soldier sank (= fell) to the ground.",
                                "She sank back in her chair and closed her eyes.",
                                "He sank into deep despair (= became very unhappy) when he lost his job."
                            ]
                        },
                        {
                            "explanation": "to hit a ball into a hole or pocket, especially in golf or snooker",
                            "examples": []
                        },
                        {
                            "explanation": "to dig a hole in the ground, or to put something into a hole dug into the ground: ",
                            "examples": [
                                "Sinking more wells is the best way of supplying the population with clean drinking water.",
                                "The first stage of building the fence is sinking the posts into the ground."
                            ]
                        },
                        {
                            "explanation": "to cause something to fail or be in trouble: ",
                            "examples": [
                                "This rain could sink our plans for the barbecue."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sɪŋk"
                            ],
                            "us": [
                                "sɪŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a bowl that is attached to the wall in a kitchen or bathroom in which you wash dishes or your hands, etc.: ",
                            "examples": [
                                "a bathroom/kitchen sink"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}