{
    "word": "sir",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sɜːr"
                            ],
                            "us": [
                                "sɝː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used as a formal and polite way of speaking to a man, especially one who you are providing a service to or who is in a position of authority: ",
                            "examples": [
                                "Would you like to see the menu, sir?",
                                "\"Did you hear what I said?\" \"Yes, Sir.\""
                            ]
                        },
                        {
                            "explanation": "sometimes used by children to address or refer to teachers who are men: ",
                            "examples": [
                                "Can I go to the toilet, sir?"
                            ]
                        },
                        {
                            "explanation": "used after the name of a man, especially one who is in a position of authority, in order to be polite or show respect: ",
                            "examples": [
                                "John Sir"
                            ]
                        },
                        {
                            "explanation": "used to begin a formal letter to a man whose name you do not know. \"Dear Sirs\" is an old fashioned way of beginning a letter to a company: ",
                            "examples": [
                                "Dear Sir, I am writing in response to your recent request for information. "
                            ]
                        },
                        {
                            "explanation": "used to begin a formal letter when you do not know if the person you are writing to is a man or a woman: ",
                            "examples": [
                                "Dear Sir or Madam, I am writing to express my concern over the recent proposal to build housing on Orchard Park. "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sɜːr",
                                "sər"
                            ],
                            "us": [
                                "sɝː",
                                "sɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used as the title of a knight (= a man who has been given a rank of honour by a British king or queen), with a first name or with both first and family names, but never with just the family name: ",
                            "examples": [
                                "Sir Walter (Scott)"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}