{
    "word": "sit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɪt"
                            ],
                            "us": [
                                "sɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause someone to) be in a position in which the lower part of the body is resting on a seat or other type of support, with the upper part of the body vertical: ",
                            "examples": [
                                "to sit at a table/desk",
                                "to sit in an armchair",
                                "to sit on a chair/a horse/the ground",
                                "He came and sat (down) next to me.",
                                "Sit yourself down and have a nice cool drink.",
                                "The child's father sat her (down) on a chair."
                            ]
                        },
                        {
                            "explanation": "to be a model for a painter, photographer, etc.: ",
                            "examples": [
                                "Monet's wife sat for him many times."
                            ]
                        },
                        {
                            "explanation": "(of an animal such as a dog) to move into a position with its back legs bent and its tail end on the ground: ",
                            "examples": [
                                "We're trying to train our dog to sit."
                            ]
                        },
                        {
                            "explanation": "If a bird sits on its eggs, it covers them with its body to keep them warm before they hatch.",
                            "examples": []
                        },
                        {
                            "explanation": "to stay in one place for a long time and not be used: ",
                            "examples": [
                                "The encyclopedia sits on my shelf at home, gathering dust."
                            ]
                        },
                        {
                            "explanation": "to be in a particular position: ",
                            "examples": [
                                "The town sits at/in the bottom of a valley."
                            ]
                        },
                        {
                            "explanation": "(of clothes) to fit someone in a particular way: ",
                            "examples": [
                                "That coat sits very well on you."
                            ]
                        },
                        {
                            "explanation": "to hold an official meeting of a committee, court, etc.: ",
                            "examples": [
                                "The court will sit tomorrow morning.",
                                "The committee sat to hear the arguments for and against the plan."
                            ]
                        },
                        {
                            "explanation": "to be a member of an official group: ",
                            "examples": [
                                "I'm going to be sitting on the committee for one more year.",
                                "All of the federal judges currently sitting (= in office) in Maryland hail from Baltimore."
                            ]
                        },
                        {
                            "explanation": "to take an exam: ",
                            "examples": [
                                "After I've sat my exams, I'm going on holiday.",
                                "I sat for my exams today."
                            ]
                        },
                        {
                            "explanation": "to babysit: ",
                            "examples": [
                                "I'm sitting my sister's kids this Saturday."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}