{
    "word": "skimmer",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈskɪm.ər"
                            ],
                            "us": [
                                "ˈskɪm.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of equipment that records someone's credit card or bank account details so that their bank account can be used illegally: ",
                            "examples": [
                                "They used a card skimmer at a cash machine to clone account details.",
                                "A skimmer is a pager-size device that reads and stores the information from the magnetic strip on a credit card. "
                            ]
                        },
                        {
                            "explanation": "a piece of equipment or vehicle for removing oil from the surface of water: ",
                            "examples": [
                                "Oil skimmers ended up picking up chunks of broken ice, clogging the skimmers and hampering their ability to collect oil.",
                                "Small fishing vessels have moved portable skimmers into place on Unalaska Island's wild northwest coast."
                            ]
                        },
                        {
                            "explanation": "a device for removing something from the surface of a liquid: ",
                            "examples": [
                                "Fat from stock, soups or sauces can be removed using a skimmer.",
                                "Every day they use a pool skimmer to get rid of leaves from the water."
                            ]
                        },
                        {
                            "explanation": "a seabird with long wings that flies low over water : ",
                            "examples": [
                                "Swans destroyed the nesting grounds of the terns and skimmers.",
                                "The Indian skimmer looks a bit like a tern."
                            ]
                        },
                        {
                            "explanation": "someone who reads something quickly in order to understand the main points, without studying it in detail: ",
                            "examples": [
                                "People tend to be skimmers during the week, reading more in depth in the weekend",
                                "The image alone would make any magazine skimmer take a second glance."
                            ]
                        },
                        {
                            "explanation": "a type of flat shoe, similar to a ballet dancer's shoe, worn by women: ",
                            "examples": [
                                "Skimmers are both graceful and comfortable.",
                                "With their barely there heels, these skimmers are very elegant."
                            ]
                        },
                        {
                            "explanation": "a flat stone that can be made to touch and rise off the surface of water several times when it is thrown: ",
                            "examples": [
                                "The stones on the beach are great skimmers."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}