{
    "word": "slash",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "slæʃ"
                            ],
                            "us": [
                                "slæʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut with a sharp blade using a quick, strong movement: ",
                            "examples": [
                                "The museum was broken into last night and several paintings were slashed.",
                                "She tried to commit suicide by slashing her wrists.",
                                "We had to slash (our way) through the long grass to clear a path."
                            ]
                        },
                        {
                            "explanation": "to very much reduce something, such as money or jobs: ",
                            "examples": [
                                "Prices have been slashed by 50 percent!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "slæʃ"
                            ],
                            "us": [
                                "slæʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the symbol / used in writing to separate letters, numbers, or words: ",
                            "examples": [
                                "You often write a slash between alternatives, for example, \"and/or\"."
                            ]
                        },
                        {
                            "explanation": "used to mean \"or\", or to show that something has two uses: ",
                            "examples": [
                                "The room functions as a guest bedroom slash study."
                            ]
                        },
                        {
                            "explanation": "a long, deep cut",
                            "examples": []
                        },
                        {
                            "explanation": "a fast, long movement to hit something: ",
                            "examples": [
                                "Ben took a wild slash at the ball and luckily managed to hit it."
                            ]
                        },
                        {
                            "explanation": "a decorative opening in a piece of clothing, often with a different colour showing through it: ",
                            "examples": [
                                "My new dress is pale blue, with a dark blue slash in the sleeves."
                            ]
                        },
                        {
                            "explanation": "the act of going to the toilet and urinating",
                            "examples": []
                        },
                        {
                            "explanation": "a type of fanfiction (= stories written about TV, film, or book characters by their fans) in which two male characters are imagined to have a sexual relationship: ",
                            "examples": [
                                "Slash focuses on the homoerotic pairing of male characters such as Captain Kirk and Mr. Spock of Star Trek.",
                                "\"Slash for me is ideal fiction because I dislike female characters,\" she said."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}