{
    "word": "slice",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "slaɪs"
                            ],
                            "us": [
                                "slaɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a flat, often thin, piece of food that has been cut from a larger piece: ",
                            "examples": [
                                "a slice of bread/cake",
                                "cucumber/lemon slices",
                                "Would you like another slice of ham/beef?"
                            ]
                        },
                        {
                            "explanation": "a part of something, such as an amount of money: ",
                            "examples": [
                                "We agreed before we did the deal that we'd both take an equal slice of the profit.",
                                "The film presents us with a fascinating slice of history."
                            ]
                        },
                        {
                            "explanation": "a kitchen utensil with a wide blade, used for serving pieces of food: ",
                            "examples": [
                                "a cake/fish slice"
                            ]
                        },
                        {
                            "explanation": "in tennis, the action of hitting the bottom of the ball so that it does not bounce very high when it hits the ground: ",
                            "examples": [
                                "That wonderful backhand slice of Maria's sends the ball where her opponent just can't reach it."
                            ]
                        },
                        {
                            "explanation": "in the sports of golf and baseball, the action of hitting a ball so that it goes to one side rather than straight in front",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "slaɪs"
                            ],
                            "us": [
                                "slaɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cut something into thin, flat pieces: ",
                            "examples": [
                                "Slice the mushrooms thinly and fry in butter.",
                                "Could you slice me a very thin piece of cake/slice a very thin piece of cake for me?"
                            ]
                        },
                        {
                            "explanation": "to easily cut into or through something with a sharp knife: ",
                            "examples": [
                                "He screamed as the blade sliced into his leg.",
                                "She watched his slim strong body as it sliced effortlessly through the water."
                            ]
                        },
                        {
                            "explanation": "in the sports of golf and baseball, to hit a ball so that it goes to one side rather than straight in front: ",
                            "examples": [
                                "Sara sliced the ball, sending it a hundred yards or so to the left."
                            ]
                        },
                        {
                            "explanation": "If you slice the ball in a game of tennis, you hit the bottom of the ball so that it does not bounce very high when it hits the ground.",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}