{
    "word": "slow roll",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌsləʊ ˈrəʊl"
                            ],
                            "us": [
                                "ˌsloʊ ˈroʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when an aircraft rolls through 360 degrees whilst continuing to fly in a straight line: ",
                            "examples": [
                                "His flying instructor tested him on slow rolls and loops.",
                                "The pilot said she did a slow roll on the way down just for the view."
                            ]
                        },
                        {
                            "explanation": "an occasion when you are holding good cards in the game of poker and take a longer time than is necessary to tell the other players your bet (= say how much money you are risking) or to show your winning cards: ",
                            "examples": [
                                "Some poker players use the slow roll to humiliate their opponents."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsləʊˌrəʊl"
                            ],
                            "us": [
                                "ˈsloʊˌroʊl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to intentionally do something more slowly than is necessary, or to intentionally make someone wait longer for something than is necessary: ",
                            "examples": [
                                "They claimed that the report on the spillage of toxic chemicals had been slow rolled. ",
                                "The department's bureaucracy has effectively slow-rolled the president on his campaign promise.",
                                "He said that they were slowrolling and delaying progress in the matter. "
                            ]
                        },
                        {
                            "explanation": "when you are holding good cards in the game of poker, to take a longer time than is necessary to tell the other players your bet (= to say how much money you are risking) or to show your winning cards: ",
                            "examples": [
                                "To slowroll someone is considered incredibly bad poker etiquette. ",
                                "There are some situations where someone is not slow-rolling but others may think they are. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}