{
    "word": "smart",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "smɑːt"
                            ],
                            "us": [
                                "smɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a clean, tidy, and stylish appearance: ",
                            "examples": [
                                "Guy looks very smart in his new suit, doesn't he?",
                                "I need a smart jacket for my interview.",
                                "She works in a very smart new office overlooking the river."
                            ]
                        },
                        {
                            "explanation": "A place or event that is smart attracts fashionable, stylish, or rich people: ",
                            "examples": [
                                "a smart restaurant",
                                "We went to a very smart party on New Year's Eve."
                            ]
                        },
                        {
                            "explanation": "intelligent, or able to think quickly or intelligently in difficult situations: ",
                            "examples": [
                                "Maddy's teacher says she's one of the smartest kids in the class.",
                                "Why don't you fix it if you're so smart?",
                                "I'm not smart enough to understand computers.",
                                "He's smart enough to know he can't run the business without her.",
                                "Quitting that job was the smartest move I ever made."
                            ]
                        },
                        {
                            "explanation": "done quickly with a lot of force or effort: ",
                            "examples": [
                                "She gave him a smart smack on the bottom.",
                                "We'll have to work at a smart pace if we're going to finish on time."
                            ]
                        },
                        {
                            "explanation": "A smart machine, weapon, etc. uses computers to make it work so that it is able to act in an independent way: ",
                            "examples": [
                                "Until the advent of smart weapons, repeated attacks were needed to ensure the destruction of targets."
                            ]
                        },
                        {
                            "explanation": "used to refer to a motorway or other road on which computers are used to watch traffic and change speed limits, close lanes, and show warning signs according to the amount of traffic : ",
                            "examples": [
                                "What should you do if you break down on a smart motorway?",
                                "Smart road technologies are shaping the future of transportation. "
                            ]
                        },
                        {
                            "explanation": "not showing respect, especially when making a funny remark: ",
                            "examples": [
                                "Don't get smart with me, young lady!",
                                "Your smart mouth is going to get you into trouble."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "smɑːt"
                            ],
                            "us": [
                                "smɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a clever and effective way: ",
                            "examples": [
                                "We have to work hard and work smart.",
                                "They are encouraging people to eat smart and adopt a healthy lifestyle."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "smɑːt"
                            ],
                            "us": [
                                "smɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to hurt with a sharp pain: ",
                            "examples": [
                                "My eyes were smarting from the onions."
                            ]
                        },
                        {
                            "explanation": "to feel upset and angry because of failure or criticism: ",
                            "examples": [
                                "The police are still smarting from their failure to prevent the robbery."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}