{
    "word": "smash",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "smæʃ"
                            ],
                            "us": [
                                "smæʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause something to break noisily into a lot of small pieces: ",
                            "examples": [
                                "Rioters ran through the city, smashing windows and looting shops.",
                                "She dropped her cup and watched it smash to pieces/to smithereens on the stone floor."
                            ]
                        },
                        {
                            "explanation": "to cause something to move with great force against something hard, usually causing damage or injury: ",
                            "examples": [
                                "Several boats were smashed against the rocks during the storm.",
                                "He tried to smash the door down to get to me.",
                                "The car was travelling very fast when it smashed into the tree.",
                                "He threatened to smash my face in if I didn't give him the money."
                            ]
                        },
                        {
                            "explanation": "in tennis or volleyball, to hit the ball down towards the ground quickly and forcefully",
                            "examples": []
                        },
                        {
                            "explanation": "to defeat someone or to destroy something completely: ",
                            "examples": [
                                "The country's government said it would do whatever was necessary to smash the rebellion."
                            ]
                        },
                        {
                            "explanation": "to do much better than the best or fastest result recorded previously: ",
                            "examples": [
                                "Petersen smashed the 400 metres record by over half a second."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "smæʃ"
                            ],
                            "us": [
                                "smæʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the sound of something being smashed: ",
                            "examples": [
                                "I was woken by the smash of glass."
                            ]
                        },
                        {
                            "explanation": "the sound of something smashing against something: ",
                            "examples": [
                                "The cars collided with a loud smash."
                            ]
                        },
                        {
                            "explanation": "a road or train accident ",
                            "examples": []
                        },
                        {
                            "explanation": "in tennis or volleyball, a powerful downward hit that sends the ball forcefully over the net",
                            "examples": []
                        },
                        {
                            "explanation": "an extremely popular and successful song, play, or film: ",
                            "examples": [
                                "This CD contains all the latest smash hits.",
                                "Her first movie was an international box-office smash."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}