{
    "word": "smell",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "smel"
                            ],
                            "us": [
                                "smel"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "UK also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have a particular quality that others can notice with their noses: ",
                            "examples": [
                                "My hands smell of onions.",
                                "That cake smells good.",
                                "There's something in the fridge that smells mouldy.",
                                "Your feet smell (= have an unpleasant smell). Why don't you wash them?"
                            ]
                        },
                        {
                            "explanation": "to notice or discover something using the nose: ",
                            "examples": [
                                "Come and smell these flowers!",
                                "Can you smell something burning?",
                                "Didn't you smell (that) the pie was burning?",
                                "I can smell something rotten in the bottom of the fridge."
                            ]
                        },
                        {
                            "explanation": "to know about or be aware of a situation without having to be told about it: ",
                            "examples": [
                                "Brenda can smell trouble a mile off (= a long time in advance)."
                            ]
                        },
                        {
                            "explanation": "to have the ability to notice or discover that a substance is present by using your nose: ",
                            "examples": [
                                "Humans can't smell as well as dogs.",
                                "What I hate most about having a cold is not being able to smell."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "smel"
                            ],
                            "us": [
                                "smel"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the characteristic of something that can be recognized or noticed using the nose: ",
                            "examples": [
                                "What's your favourite smell?",
                                "I love the smell of orange blossoms.",
                                "The marketplace was filled with delightful smells.",
                                "There's a delicious smell in here.",
                                "I wish we could get rid of that smell (= bad smell) in the bathroom."
                            ]
                        },
                        {
                            "explanation": "the particular character or feeling that someone or something has: ",
                            "examples": [
                                "She's still enjoying the sweet smell (= pleasant experience) of success after her victory in the world championships."
                            ]
                        },
                        {
                            "explanation": "the ability to notice or discover that a substance is present by using your nose: ",
                            "examples": [
                                "Smell is one of the five senses.",
                                "Dogs have a very good sense of smell."
                            ]
                        },
                        {
                            "explanation": "the act of putting your nose near something and breathing in so that you can discover its characteristics with your nose: ",
                            "examples": [
                                "Have a smell of this perfume."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}