{
    "word": "smoke",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sməʊk"
                            ],
                            "us": [
                                "smoʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the grey, black, or white mixture of gas and very small pieces of carbon that is produced when something burns: ",
                            "examples": [
                                "Her clothes smelled of cigarette smoke.",
                                "The age of the smoke-filled bar is over.",
                                "The fire produced a pall (= large mass) of smoke visible 20 miles away.",
                                "Plumes of smoke billowed from the chimney.",
                                "She leaned back thoughtfully and blew a puff of (= a small amount of) smoke into the air."
                            ]
                        },
                        {
                            "explanation": "to be destroyed by burning: ",
                            "examples": [
                                "Because of the fire, hundreds of houses went up in smoke."
                            ]
                        },
                        {
                            "explanation": "Something that goes up in smoke fails to produce the result that was wanted: ",
                            "examples": [
                                "When the business went bankrupt, 20 years of hard work went up in smoke."
                            ]
                        },
                        {
                            "explanation": "the act of smoking a cigarette: ",
                            "examples": [
                                "I really enjoy a smoke at the end of a meal."
                            ]
                        },
                        {
                            "explanation": "a cigarette: ",
                            "examples": [
                                "Would you buy me some smokes while you're out?"
                            ]
                        },
                        {
                            "explanation": "any large city, especially London, Sydney, or Melbourne: ",
                            "examples": [
                                "He was a young lad of 16 when he first came to the big smoke."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sməʊk"
                            ],
                            "us": [
                                "smoʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to breathe smoke into the mouth and usually lungs from a cigarette, pipe, etc.: ",
                            "examples": [
                                "Do you mind if I smoke?",
                                "I used to smoke a packet of cigarettes a day."
                            ]
                        },
                        {
                            "explanation": "to produce smoke as a result of industrial activity or of something such as an electrical fault: ",
                            "examples": [
                                "The skyline is dominated by smoking factory chimneys.",
                                "Suddenly the TV went blank and started smoking."
                            ]
                        },
                        {
                            "explanation": "to preserve meat, fish, or cheese using smoke from burning wood: ",
                            "examples": [
                                "People in Egypt were salting, drying, and smoking fish and meat 6,000 years ago."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}