{
    "word": "smooth",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "smuːð"
                            ],
                            "us": [
                                "smuːð"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a surface or consisting of a substance that is perfectly regular and has no holes, lumps, or areas that rise or fall suddenly: ",
                            "examples": [
                                "a smooth surface/texture/consistency",
                                "This custard is deliciously smooth and creamy.",
                                "Mix together the butter and sugar until smooth.",
                                "The road ahead was flat and smooth.",
                                "This moisturizer will help to keep your skin smooth."
                            ]
                        },
                        {
                            "explanation": "happening without any sudden changes, interruption, or difficulty: ",
                            "examples": [
                                "We had a very smooth flight with no turbulence at all.",
                                "The car's improved suspension gives a much smoother ride than earlier models.",
                                "An efficient transport system is vital to the smooth running of a country's economy."
                            ]
                        },
                        {
                            "explanation": "having a pleasant flavour that is not sour or bitter: ",
                            "examples": [
                                "This coffee is incredibly smooth and rich."
                            ]
                        },
                        {
                            "explanation": "very polite, confident, and able to persuade people, but in a way that is not sincere: ",
                            "examples": [
                                "The deputy director is so smooth that many of his colleagues distrust him.",
                                "In job interviews, the successful candidates tend to be the smooth talkers who know exactly how to make the right impression."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "smuːð"
                            ],
                            "us": [
                                "smuːð"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move your hands across something in order to make it flat: ",
                            "examples": [
                                "He straightened his tie nervously and smoothed (down) his hair."
                            ]
                        },
                        {
                            "explanation": "to remove difficulties and make something easier to do or achieve: ",
                            "examples": [
                                "We encourage parents to help smooth their children's way through school.",
                                "We must do more to smooth the country's path to democratic reform."
                            ]
                        },
                        {
                            "explanation": "to cover the surface of something with a liquid or soft substance, using gentle rubbing movements: ",
                            "examples": [
                                "Pour some oil into the palm of your hand and then smooth it over your arms and neck."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}