{
    "word": "sneak",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sniːk"
                            ],
                            "us": [
                                "sniːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to go somewhere secretly, or to take someone or something somewhere secretly: ",
                            "examples": [
                                "I managed to sneak in through the back door while she wasn't looking.",
                                "Jan doesn't have a ticket but I thought we might sneak her in.",
                                "I thought I'd sneak up on him (= move close to him without him seeing) and give him a surprise."
                            ]
                        },
                        {
                            "explanation": "to secretly tell someone in authority, especially a teacher, that someone else has done something bad, often in order to cause trouble: ",
                            "examples": [
                                "She was always sneaking on other kids in the class."
                            ]
                        },
                        {
                            "explanation": "to look at someone or something quickly and secretly: ",
                            "examples": [
                                "I noticed him sneak a look at what I was writing."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sniːk"
                            ],
                            "us": [
                                "sniːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who tells people in authority when someone else does something bad: ",
                            "examples": [
                                "You told Mrs Cooper that it was me who tipped the paint over, didn't you - you nasty little sneak!"
                            ]
                        },
                        {
                            "explanation": "a type of light, comfortable shoe that is suitable for playing sports in: ",
                            "examples": [
                                "I like to wear plain white leather sneaks.",
                                "an old pair of sneaks"
                            ]
                        },
                        {
                            "explanation": "in American football, a play (= period of action) in which the quarterback dives or runs a short distance forward with the ball while the offensive line tries to push the defensive linemen back from the line of scrimmage (= the line on which the ball is positioned at the beginning of a period of action): ",
                            "examples": [
                                "They ran a sneak and picked up three yards for a first down. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "done secretly: ",
                            "examples": [
                                "The unit launched a sneak attack under cover of night.",
                                "An investigation was launched into how the paparazzi were able to get sneak photographs of the princess. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}