{
    "word": "snooker",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsnuː.kər"
                            ],
                            "us": [
                                "ˈsnuː.kɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a game played, especially in the UK, by two people in which cues (= long, thin poles) and a cue ball are used to hit 15 red balls and six balls of different colours into six holes around a table covered in soft cloth in a fixed order",
                            "examples": []
                        },
                        {
                            "explanation": "in the game of snooker or pool, a position from which a player cannot make a direct legal shot at any ball: ",
                            "examples": [
                                "Stevens conceded after failing to escape from a series of snookers. "
                            ]
                        },
                        {
                            "explanation": "(in the game of snooker) to need to put your opponent in a position from which they cannot make a direct hit at any ball, in order to have a chance of winning a frame (= part of a match): ",
                            "examples": [
                                "He potted a long yellow ball to leave Davis needing snookers."
                            ]
                        },
                        {
                            "explanation": "(of a player or sports team) to be in a situation in which it is almost impossible for them to win: ",
                            "examples": [
                                "United were left needing snookers.",
                                "Without him England would still need snookers to save the first Test."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsnuː.kər"
                            ],
                            "us": [
                                "ˈsnuː.kɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in the game of snooker, to hit the balls into a position from which your opponent cannot make a direct legal shot at any ball : ",
                            "examples": [
                                "O'Sullivan was snookered in the 13th frame."
                            ]
                        },
                        {
                            "explanation": "to prevent someone from finishing an intended plan of action: ",
                            "examples": [
                                "We had intended to go driving around Scotland, but unless I can get my licence we're snookered.",
                                "He accused Washington of snookering developments that could have helped his brother."
                            ]
                        },
                        {
                            "explanation": "to deceive or trick someone: ",
                            "examples": [
                                "Critics say it is the administration's way of snookering students into paying for more fast-food restaurants."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}