{
    "word": "snowplough",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsnəʊ.plaʊ"
                            ],
                            "us": [
                                "ˈsnoʊ.plaʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a vehicle or device for removing snow from roads or railways: ",
                            "examples": [
                                "Hundreds of gritting lorries and snowploughs are on standby.",
                                "The track is kept clear by a lorry with a snowplough bolted to its bumper."
                            ]
                        },
                        {
                            "explanation": "in skiing, a simple way of turning or stopping in which the points of the skis are turned towards each other: ",
                            "examples": [
                                "I just couldn't get the hang of the snowplough and ended up face down in the snow.",
                                "Taking to the slopes, she learned how to do a snowplough turn."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsnəʊ.plaʊ"
                            ],
                            "us": [
                                "ˈsnoʊ.plaʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in skiing, to turn or stop with the points of the skis turned towards each other: ",
                            "examples": [
                                "We had practised, endlessly, snowploughing to control our speed.",
                                "I was amazed to see my daughter snowploughing her way through a sort of obstacle course."
                            ]
                        },
                        {
                            "explanation": "to remove or deal with problems for a child, so they never have to do anything difficult or never fail, and do not learn how to do things for themselves: ",
                            "examples": [
                                "Are you snowploughing your kid?",
                                "By snowploughing all opposition and doing everything for them, they may be robbing their children of confidence and self-reliance."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsnəʊ.plaʊ"
                            ],
                            "us": [
                                "ˈsnoʊ.plaʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a parent who removes or deals with problems for a child, so they never have to do anything difficult or never fail, and do not learn how to do things for themselves: ",
                            "examples": [
                                "Having a snowplough parent is not good for a child in the long run.",
                                "Snowplough mothers and fathers are criticized for clearing every difficulty from their child’s path."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}