{
    "word": "so",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "səʊ"
                            ],
                            "us": [
                                "soʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "very, extremely, or to such a degree: ",
                            "examples": [
                                "The house is so beautiful.",
                                "Thank you for being so patient.",
                                "Don't be so stupid!",
                                "I didn't know she had so many children!",
                                "You can only do so much to help (= there is a limit to how much you can help).",
                                "She's ever so kind and nice.",
                                "I'm so tired (that) I could sleep in this chair!",
                                "I'm not so desperate as to agree to that.",
                                "The word itself is so rare as to be almost obsolete."
                            ]
                        },
                        {
                            "explanation": "used before a noun or before \"not\" to emphasize what is being said: ",
                            "examples": [
                                "Don't wear that - it's so last year (= it was fashionable last year but not now).",
                                "I'm sorry, but she is so not a size 10 (= she is very much larger than a size 10)."
                            ]
                        },
                        {
                            "explanation": "used at the end of a sentence to mean to a very great degree: ",
                            "examples": [
                                "Is that why you hate him so?",
                                "You worry so!"
                            ]
                        },
                        {
                            "explanation": "used usually before the verbs \"have\", \"be\", or \"do\", and other auxiliary verbs to express the meaning \"in the same way\" or \"in a similar way\": ",
                            "examples": [
                                "\"I've got an enormous amount of work to do.\" \"So have I.\"",
                                "\"I'm allergic to nuts.\" \"So is my brother.\"",
                                "Neil left just after midnight and so did Roz.",
                                "Just as you like to have a night out with the lads, so I like to go out with the girls now and again."
                            ]
                        },
                        {
                            "explanation": "used to avoid repeating a phrase mentioned earlier: ",
                            "examples": [
                                "\"I hope they stay together.\" \"I hope so too.\"",
                                "\"Do you think he's upset?\" \"I don't think so.\"",
                                "James is coming tonight, or so he said."
                            ]
                        },
                        {
                            "explanation": "used to say that a situation mentioned earlier is correct or true: ",
                            "examples": [
                                "\"Is it true that we're not getting a pay increase this year?\" \"I'm afraid so.\"",
                                "\"Anthony and Mia don't get along very well.\" \"Is that so?\"",
                                "\"The forecast says it might rain.\" \"If so, we'll have the party inside.\""
                            ]
                        },
                        {
                            "explanation": "used to say that a fact that has just been stated is certainly true: ",
                            "examples": [
                                "\"My eyes are slightly different colours.\" \"So they are.\"",
                                "\"That's her brother - he looks like James Dean.\" \"So he does.\""
                            ]
                        },
                        {
                            "explanation": "used instead of repeating an adjective that has already been mentioned: ",
                            "examples": [
                                "She's reasonable to work with - more so than I was led to believe.",
                                "He's fairly bright - well, certainly more so than his brother."
                            ]
                        },
                        {
                            "explanation": "used, especially by children, to argue against a negative statement: ",
                            "examples": [
                                "\"You didn't even see the movie.\" \"I did so!\""
                            ]
                        },
                        {
                            "explanation": "to act in the way mentioned: ",
                            "examples": [
                                "Parents must take responsibility for their children. Failure to do so could mean a fine or a jail sentence."
                            ]
                        },
                        {
                            "explanation": "in this way, or like this: ",
                            "examples": [
                                "The pillars, which are outside the building, are so placed in order to provide the maximum space inside.",
                                "I've so arranged my trip that I'll be home on Friday night."
                            ]
                        },
                        {
                            "explanation": "used when you are showing how something is done: ",
                            "examples": [
                                "Just fold this piece of paper back, so, and make a crease here.",
                                "Gently fold in the eggs like so."
                            ]
                        },
                        {
                            "explanation": "used when you are representing the size of something: ",
                            "examples": [
                                "\"How tall is he next to you?\" \"Oh, about so big,\" she said, indicating the level of her neck.",
                                "\"The table that I liked best was about so wide,\" she said, holding her arms out a metre and a half."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "conjunction",
                        "ipa": {
                            "uk": [
                                "səʊ"
                            ],
                            "us": [
                                "soʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used at the beginning of a sentence to connect it with something that has been said or has happened previously: ",
                            "examples": [
                                "So, there I was standing at the edge of the road with only my underwear on ...",
                                "So, just to finish what I was saying earlier..."
                            ]
                        },
                        {
                            "explanation": "used as a way of making certain that you or someone else understand something correctly, often when you are repeating the important points of a plan: ",
                            "examples": [
                                "So we leave on the Thursday and get back the next Tuesday, is that right?"
                            ]
                        },
                        {
                            "explanation": "used to refer to a discovery that you have just made: ",
                            "examples": [
                                "So that's what he does when I'm not around!"
                            ]
                        },
                        {
                            "explanation": "used as a short pause, sometimes to emphasize what you are saying: ",
                            "examples": [
                                "So, here we are again - just you and me."
                            ]
                        },
                        {
                            "explanation": "used before you introduce a subject of conversation that is of present interest, especially when you are asking a question: ",
                            "examples": [
                                "So, who do you think is going to win the election?"
                            ]
                        },
                        {
                            "explanation": "used to show that you agree with something that someone has just said, but you do not think that it is important: ",
                            "examples": [
                                "So the car's expensive - well, I can afford it."
                            ]
                        },
                        {
                            "explanation": "and for that reason; therefore: ",
                            "examples": [
                                "My knee started hurting so I stopped running.",
                                "I was lost so I bought a street map."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "conjunction",
                        "ipa": {
                            "uk": [
                                "səʊ"
                            ],
                            "us": [
                                "soʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used before you give an explanation for the action that you have just mentioned: ",
                            "examples": [
                                "I deliberately didn't have lunch so (that) I would be hungry tonight.",
                                "Leave the keys out so (that) I remember to take them with me."
                            ]
                        },
                        {
                            "explanation": "in order to: ",
                            "examples": [
                                "I always keep fruit in the fridge so as to keep flies off it."
                            ]
                        },
                        {
                            "explanation": "in order not to: ",
                            "examples": [
                                "He did not switch on the light so as not to disturb her."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "səʊ"
                            ],
                            "us": [
                                "soʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "perfectly tidy and well arranged: ",
                            "examples": [
                                "He's a perfectionist - everything has to be just so."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "səʊ"
                            ],
                            "us": [
                                "soʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the musical note \nsoh ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}