{
    "word": "sorry",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsɒr.i"
                            ],
                            "us": [
                                "ˈsɔːr.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "feeling sadness, sympathy, or disappointment, especially because something unpleasant has happened or been done: ",
                            "examples": [
                                "I'm just sorry about all the trouble I've caused her.",
                                "He'd really upset her and he didn't seem at all sorry.",
                                "I'm sorry (that) you had such a difficult journey.",
                                "We were both sorry to hear you've been ill again.",
                                "I feel so sorry for their kids - it must be really hard for them."
                            ]
                        },
                        {
                            "explanation": "to feel sad because you have a problem and you feel that it is not fair that you are suffering so much: ",
                            "examples": [
                                "He sounded very sorry for himself on the phone."
                            ]
                        },
                        {
                            "explanation": "used to show that something that must be said causes sadness or disappointment: ",
                            "examples": [
                                "I'm sorry to say that the project's funding has been cancelled."
                            ]
                        },
                        {
                            "explanation": "used to say that you wish you had not done what you have done, especially when you want to be polite to someone you have done something bad to: ",
                            "examples": [
                                "Oh, I'm sorry - I didn't see you there.",
                                "Tom, I'm so sorry about last night - it was all my fault.",
                                "I've said I'm sorry."
                            ]
                        },
                        {
                            "explanation": "used to show politeness when refusing something or disagreeing: ",
                            "examples": [
                                "I'm sorry, but I think you've made a mistake."
                            ]
                        },
                        {
                            "explanation": "a bad condition or situation: ",
                            "examples": [
                                "He was a sorry sight when he got home - soaking and covered in mud."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "ˈsɒr.i"
                            ],
                            "us": [
                                "ˈsɔːr.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used when apologizing for something: ",
                            "examples": [
                                "\"That's my foot you're stepping on.\" \"Sorry!\""
                            ]
                        },
                        {
                            "explanation": "used to show politeness when refusing something or disagreeing: ",
                            "examples": [
                                "Sorry, you can't go in there."
                            ]
                        },
                        {
                            "explanation": "used when politely asking someone to repeat something or when politely interrupting someone: ",
                            "examples": [
                                "\"He's late.\" \"Sorry?\" \"I said he's late.\"",
                                "Sorry, could you just say that last sentence again please?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}