{
    "word": "sort",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sɔːt"
                            ],
                            "us": [
                                "sɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a group of things that are of the same type or that share similar qualities: ",
                            "examples": [
                                "We both like the same sort of music.",
                                "I'm going to have a salad of some sort.",
                                "What sort of shoes will I need?",
                                "We saw all sorts (= many types) of animals in the park.",
                                "Many sorts of bacteria are resistant to penicillin.",
                                "This sort of camera is very expensive.",
                                "Plants of this sort need shady conditions."
                            ]
                        },
                        {
                            "explanation": "the type of thing or person that you like: ",
                            "examples": [
                                "Hmm, this is my sort of wine!"
                            ]
                        },
                        {
                            "explanation": "used to show that what you have just said is only an example from a much larger group of things: ",
                            "examples": [
                                "They sell souvenirs, postcards, that sort of thing."
                            ]
                        },
                        {
                            "explanation": "a person having the stated or suggested character: ",
                            "examples": [
                                "He seemed like a decent sort to me."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɔːt"
                            ],
                            "us": [
                                "sɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a number of things in an order or to separate them into groups: ",
                            "examples": [
                                "Paper, plastic, and cans are sorted for recycling.",
                                "I'm going to sort these old books into those to be kept and those to be thrown away.",
                                "You can use the computer to sort the newspaper articles alphabetically, by date, or by subject.",
                                "She found the ring while sorting (through) some clothes."
                            ]
                        },
                        {
                            "explanation": "to deal with something by repairing or organizing it: ",
                            "examples": [
                                "Can you sort the car by tomorrow?",
                                "We must get the phone sorted soon.",
                                "I must get this paperwork sorted before I go on holiday next week."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}