{
    "word": "sound",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "saʊnd"
                            ],
                            "us": [
                                "saʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that you can hear or that can be heard: ",
                            "examples": [
                                "They could hear the sound of a bell tolling in the distance.",
                                "She stood completely still, not making a sound.",
                                "Suddenly we heard a loud knocking sound from the engine.",
                                "Sound can travel over very large distances in water."
                            ]
                        },
                        {
                            "explanation": "the activity of recording and broadcasting sound such as from a performance of music or for a film: ",
                            "examples": [
                                "a sound engineer/recording"
                            ]
                        },
                        {
                            "explanation": "the volume or quality of the sound of a television or film: ",
                            "examples": [
                                "Could you turn the sound down/up on the TV?"
                            ]
                        },
                        {
                            "explanation": "the particular quality of the music that a musician or a group of musicians produce: ",
                            "examples": [
                                "The band's sound is a distinctive mixture of funk and rap."
                            ]
                        },
                        {
                            "explanation": "how something seems to be, from what is said or written: ",
                            "examples": [
                                "I like the sound of the beef in red wine sauce."
                            ]
                        },
                        {
                            "explanation": "a passage of sea connecting two larger areas of sea, or an area of sea mostly surrounded by land: ",
                            "examples": [
                                "the Kalmar Sound"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "saʊnd"
                            ],
                            "us": [
                                "saʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to seem good, interesting, strange, etc. from what is said or written: ",
                            "examples": [
                                "Your job sounds really interesting."
                            ]
                        },
                        {
                            "explanation": "to seem like something, from what is said or written: ",
                            "examples": [
                                "That sounds like a good idea."
                            ]
                        },
                        {
                            "explanation": "to seem angry, happy, rude, etc. when you speak: ",
                            "examples": [
                                "He sounded very depressed when we spoke on the phone yesterday."
                            ]
                        },
                        {
                            "explanation": "to make a noise: ",
                            "examples": [
                                "If the alarm sounds, leave the building immediately.",
                                "It sounds like a bird.",
                                "He sounds (= speaks) just like someone I used to work with.",
                                "Sounding the car's horn, she drove at high speed through the crowded streets."
                            ]
                        },
                        {
                            "explanation": "to cause a noise to be made or say or shout a message to warn people about something: ",
                            "examples": [
                                "Quick, sound the alarm - there's a fire in the machine room!"
                            ]
                        },
                        {
                            "explanation": "to measure the depth of a mass of water, such as the sea, usually by sonar",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "saʊnd"
                            ],
                            "us": [
                                "saʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not broken or damaged; healthy; in good condition: ",
                            "examples": [
                                "It's an old building but it's still structurally sound.",
                                "Considering his age, his body is surprisingly sound.",
                                "Was she of sound mind (= not mentally ill) at the time of the incident?"
                            ]
                        },
                        {
                            "explanation": "financially strong and likely to succeed: ",
                            "examples": [
                                "Although the company's share price has declined, its business remains basically sound.",
                                "Government bonds are a sound investment."
                            ]
                        },
                        {
                            "explanation": "showing or based on good judgment: ",
                            "examples": [
                                "She gave me some very sound advice.",
                                "She is a sound judge of character.",
                                "I'm not sure how sound the theoretical basis for this argument is."
                            ]
                        },
                        {
                            "explanation": "able to be trusted because of having a lot of ability or knowledge: ",
                            "examples": [
                                "The book is very sound on the basics.",
                                "How sound is her knowledge of the subject?"
                            ]
                        },
                        {
                            "explanation": "not harmful or wrong: ",
                            "examples": [
                                "Are these pesticides environmentally sound?",
                                "I want our business to operate in an ethically sound way. "
                            ]
                        },
                        {
                            "explanation": "used to say that you like, agree with, or approve of someone or something: ",
                            "examples": [
                                "He's a good guy. He's sound.",
                                "\"Shall we go there now?\" \"Yeah, sound.\""
                            ]
                        },
                        {
                            "explanation": "(of sleep) deep: ",
                            "examples": [
                                "He quickly fell into a sound sleep.",
                                "Her sleep was so sound that she did not wake when they moved her."
                            ]
                        },
                        {
                            "explanation": "used to describe someone who sleeps deeply and well: ",
                            "examples": [
                                "I'm normally a very sound sleeper but this noise kept me awake."
                            ]
                        },
                        {
                            "explanation": "(of a beating or defeat) severe: ",
                            "examples": [
                                "The party was forced to reflect after a sound beating at the ballot box.",
                                "The thief was given a sound thrashing."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "saʊnd"
                            ],
                            "us": [
                                "saʊnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "deeply: ",
                            "examples": [
                                "He was sound asleep within moments of getting into bed."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}