{
    "word": "space",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "speɪs"
                            ],
                            "us": [
                                "speɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an empty area that is available to be used: ",
                            "examples": [
                                "Is there any space for my clothes in that cupboard?",
                                "I need to make (some) space for Mark's things.",
                                "When the roads are wet, you've got to leave plenty of space between you and the car in front.",
                                "The blank space at the end of the form is for your name.",
                                "We found a parking space close to the museum."
                            ]
                        },
                        {
                            "explanation": "the area around everything that exists, continuing in all directions: ",
                            "examples": [
                                "He was absent-mindedly staring/gazing into space (= looking, but seeing nothing).",
                                "Virtual reality gives us artificial worlds to explore, outside normal space and time."
                            ]
                        },
                        {
                            "explanation": "the distance between a football, rugby, etc. player and any opposing players: ",
                            "examples": [
                                "If you give quality players that much space, they will punish you.",
                                "The winger drifted right, creating space for Neymar to run into."
                            ]
                        },
                        {
                            "explanation": "land, especially in a town, that has no buildings on it: ",
                            "examples": [
                                "What I like about this town is that there's so much open space."
                            ]
                        },
                        {
                            "explanation": "an area in a sports field where there are no opponents: ",
                            "examples": [
                                "He found himself in open space as he sprinted down the left wing."
                            ]
                        },
                        {
                            "explanation": "very soon: ",
                            "examples": [
                                "Within a short space of time you could be speaking perfect English!"
                            ]
                        },
                        {
                            "explanation": "during a period of six weeks, three hours, etc.: ",
                            "examples": [
                                "It all happened in the space of ten minutes."
                            ]
                        },
                        {
                            "explanation": "the empty area outside Earth's atmosphere, where the planets and the stars are: ",
                            "examples": [
                                "space exploration/travel",
                                "a space rocket",
                                "Who was the first human being in space/the first to go into space?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "speɪs"
                            ],
                            "us": [
                                "speɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrange things or people so that there is some distance or time between them: ",
                            "examples": [
                                "That page looks badly spaced (= there is too much/too little distance between the lines or words).",
                                "The flowers were spaced (out) evenly (= planted at equal distances) beside the path.",
                                "If you're in financial difficulty, we're happy to let you space (out) your payments (= pay in smaller amounts over a longer period of time) over two years."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}