{
    "word": "spare",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "speər"
                            ],
                            "us": [
                                "sper"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If something is spare, it is available to use because it is extra: ",
                            "examples": [
                                "a spare key/tyre",
                                "spare sheets and blankets",
                                "Do you have a spare pen?",
                                "We have a spare room if you want to stay overnight with us.",
                                "Could I have a word with you when you have a spare moment/minute?",
                                "\"Do you want this cake?\" \"Yes, if it's going spare (= if no one else wants it).\""
                            ]
                        },
                        {
                            "explanation": "time when you are not working: ",
                            "examples": [
                                "I like to paint in my spare time."
                            ]
                        },
                        {
                            "explanation": "tall and thin: ",
                            "examples": [
                                "He had the spare build of a runner."
                            ]
                        },
                        {
                            "explanation": "plain and not decorated: ",
                            "examples": [
                                "The interior is spare, almost minimalist."
                            ]
                        },
                        {
                            "explanation": "to get very upset or angry: ",
                            "examples": [
                                "She goes spare if I'm so much as five minutes late."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "speər"
                            ],
                            "us": [
                                "sper"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to not hurt or destroy something or someone: ",
                            "examples": [
                                "They asked him to spare the women and children."
                            ]
                        },
                        {
                            "explanation": "to prevent someone from having to experience something unpleasant: ",
                            "examples": [
                                "Luckily, I was spared the embarrassment of having to sing in front of everyone.",
                                "It was a nasty accident - but I'll spare you (= I won't tell you) the gruesome details."
                            ]
                        },
                        {
                            "explanation": "to use a lot of effort, expense, etc. to do something: ",
                            "examples": [
                                "We will spare no effort to find out who did this."
                            ]
                        },
                        {
                            "explanation": "to try as hard as you can to achieve something: ",
                            "examples": [
                                "She never spared herself in the pursuit of excellence."
                            ]
                        },
                        {
                            "explanation": "to give time, money, or space to someone, especially when it is difficult for you: ",
                            "examples": [
                                "Could you spare me £20?",
                                "I'd love to come, but I can't spare the time."
                            ]
                        },
                        {
                            "explanation": "to think about someone who is in a difficult or unpleasant situation: ",
                            "examples": [
                                "Spare a thought for me tomorrow, when you're lying on a beach, because I'll still be here in the office!"
                            ]
                        },
                        {
                            "explanation": "left over or more than you need: ",
                            "examples": [
                                "If you have any woolyarn to spare when you've finished the sweater, can you make me some gloves?",
                                "I caught the plane with only two minutes to spare.",
                                "There's no time/We have no time to spare if we want to get the article written by tomorrow."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "speər"
                            ],
                            "us": [
                                "sper"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an extra thing that is not being used and can be used instead of a part that is broken, lost, etc.",
                            "examples": []
                        },
                        {
                            "explanation": "a piece that can be used to replace another similar piece in a car or other device",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}