{
    "word": "spark",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "spɑːk"
                            ],
                            "us": [
                                "spɑːrk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a very small piece of fire that flies out from something that is burning, or one that is made by rubbing two hard things together, or a flash of light made by electricity: ",
                            "examples": [
                                "Sparks were flying out of the bonfire and blowing everywhere.",
                                "You can start a fire by rubbing two dry pieces of wood together until you produce a spark."
                            ]
                        },
                        {
                            "explanation": "a first small event or problem that causes a much worse situation to develop: ",
                            "examples": [
                                "That small incident was the spark that set off the street riots."
                            ]
                        },
                        {
                            "explanation": "a feeling or quality that causes excitement: ",
                            "examples": [
                                "They kept running into each other and eventually realized there was a spark between them.",
                                "The music is mediocre because there's no spark, no thrill, no unpredictability."
                            ]
                        },
                        {
                            "explanation": "an electrician (= a person whose job is to put in and repair electrical wires and equipment): ",
                            "examples": [
                                "You need a brickie and a sparks."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "spɑːk"
                            ],
                            "us": [
                                "spɑːrk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause the start of something, especially an argument or fighting: ",
                            "examples": [
                                "This proposal will almost certainly spark another countrywide debate about immigration.",
                                "The recent interest-rate rises have sparked new problems for small businesses.",
                                "The visit of the G20 leaders sparked off (= caused the start of) mass demonstrations."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}