{
    "word": "speaker",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspiː.kər"
                            ],
                            "us": [
                                "ˈspiː.kɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who gives a speech at a public event: ",
                            "examples": [
                                "He is a clever man, and an entertaining and engaging public speaker. ",
                                "Please join with me in thanking our guest speaker tonight.",
                                "The Democrats have chosen the Texas state treasurer as the keynote (= most important) speaker at their convention."
                            ]
                        },
                        {
                            "explanation": "someone who speaks a particular language: ",
                            "examples": [
                                "a French speaker",
                                "A fluent Spanish speaker, she has translated several of his books. ",
                                "non-English speakers"
                            ]
                        },
                        {
                            "explanation": "the part of a radio, television, or computer, or of a piece of electrical equipment for playing recorded sound, through which the sound is played. A speaker can be part of the radio, etc. or be separate from it: ",
                            "examples": [
                                "There's no sound coming out of the right-hand speaker."
                            ]
                        },
                        {
                            "explanation": "using the function of a phone, computer, etc. that allows other people to hear the person you are talking to : ",
                            "examples": [
                                "He called his attorney and put the phone on speaker.",
                                "You're on speaker, so be careful what you say."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspiː.kər"
                            ],
                            "us": [
                                "ˈspiː.kɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the person who controls the way in which business is done in an organization which makes laws: ",
                            "examples": [
                                "He served for eight years as Speaker of the House of Representatives.",
                                "Mr Speaker, my honourable friend has failed to consider the consequences of his proposal."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}