{
    "word": "specimen",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspes.ə.mɪn"
                            ],
                            "us": [
                                "ˈspes.ə.mɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something shown or examined as an example; a typical example: ",
                            "examples": [
                                "He has a collection of rare insect specimens.",
                                "Museums will pay large amounts of money for good dinosaur fossil specimens.",
                                "Astronauts brought back specimens of moon rock."
                            ]
                        },
                        {
                            "explanation": "a small amount of blood or urine used for testing: ",
                            "examples": [
                                "They took blood and urine specimens for analysis."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈspes.ə.mɪn"
                            ],
                            "us": [
                                "ˈspes.ə.mɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to something that is an example of a particular thing : ",
                            "examples": [
                                "The signature on the letter must be compared with the specimen signature held by the company.",
                                "Specimen papers of the new examinations were released to schools."
                            ]
                        },
                        {
                            "explanation": "used to refer to a container for things collected for medical or scientific use: ",
                            "examples": [
                                "Various bits of bone were laid out in specimen jars.",
                                "The urine is collected in a specimen cup."
                            ]
                        },
                        {
                            "explanation": "used to refer to a plant or tree that is grown as a main point of interest in a garden: ",
                            "examples": [
                                "A specimen tree on the lawn beside the Manor House is 130 years old.",
                                "This lilac thrives in full sun and can be used as a background plant for smaller plants, or as a specimen plant.",
                                "Any type of rose can be used as a specimen shrub."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}