{
    "word": "special",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈspeʃ.əl"
                            ],
                            "us": [
                                "ˈspeʃ.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not ordinary or usual: ",
                            "examples": [
                                "The car has a number of special safety features.",
                                "Is there anything special that you'd like to do today?",
                                "Passengers should tell the airline in advance if they have any special dietary needs.",
                                "I don't expect special treatment - I just want to be treated fairly.",
                                "Full details of the election results will be published in a special edition of tomorrow's newspaper.",
                                "I have a suit for special occasions.",
                                "There's a special offer on peaches (UK also peaches are on special offer) (= they are being sold at a reduced price) this week."
                            ]
                        },
                        {
                            "explanation": "especially great or important, or having a quality that most similar things or people do not have: ",
                            "examples": [
                                "Could I ask you a special favour?",
                                "I'm cooking something special for her birthday."
                            ]
                        },
                        {
                            "explanation": "having a particular purpose: ",
                            "examples": [
                                "Firefighters use special breathing equipment in smoky buildings.",
                                "Some of the children have special educational needs.",
                                "You need special tyres on your car for snow.",
                                "She works as a special adviser to the president."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspeʃ.əl"
                            ],
                            "us": [
                                "ˈspeʃ.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a television programme that is made for a particular reason or occasion and is not part of a series: ",
                            "examples": [
                                "a three-hour election night special"
                            ]
                        },
                        {
                            "explanation": "a dish that is available in a restaurant on a particular day that is not usually available: ",
                            "examples": [
                                "Today's specials are written on the board."
                            ]
                        },
                        {
                            "explanation": "a product that is being sold at a reduced price for a short period: ",
                            "examples": [
                                "Today's specials include T-shirts for only $2.99."
                            ]
                        },
                        {
                            "explanation": "in the UK, a person who is not a paid member of the police force but who wears a police uniform and is trained to act as a police officer in certain situations: ",
                            "examples": [
                                "Police officers are stressing the need for many more specials.",
                                "Two Specials attended the scene."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}