{
    "word": "spike",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "spaɪk"
                            ],
                            "us": [
                                "spaɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a narrow, thin shape with a sharp point at one end, or something, especially a piece of metal, with this shape: ",
                            "examples": [
                                "There were large spikes on top of the railings to stop people climbing over them.",
                                "Some types of dinosaur had sharp spikes on their tails."
                            ]
                        },
                        {
                            "explanation": "a set of short, pointed pieces of metal or plastic, attached to the bottom of shoes worn for particular sports, that stop the person wearing the shoes from sliding on the ground, or shoes with these pointed pieces: ",
                            "examples": [
                                "You will need to wear spikes when we are training."
                            ]
                        },
                        {
                            "explanation": "a very high amount, price, or level, usually before a fall: ",
                            "examples": [
                                "If price spikes continue, people will not be able to afford the new houses they want."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "spaɪk"
                            ],
                            "us": [
                                "spaɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to decide not to publish an article in a newspaper: ",
                            "examples": [
                                "The story was deemed too controversial and so they spiked it."
                            ]
                        },
                        {
                            "explanation": "to make a drink stronger by adding alcohol, or to add flavour or interest to something: ",
                            "examples": [
                                "She claimed that someone had spiked her drink with whisky.",
                                "The pasta was served in a cream sauce spiked with black pepper.",
                                "His writing is spiked with humour."
                            ]
                        },
                        {
                            "explanation": "to put a drug in someone's drink to make them unconscious, extremely tired, or unable to function normally : ",
                            "examples": [
                                "The sedative has been used to spike drinks.",
                                "I realized I'd been spiked."
                            ]
                        },
                        {
                            "explanation": "to inject a drug into someone's body (= put it in using a needle) to make them unconscious, extremely tired, or unable to function normally: ",
                            "examples": [
                                "She ended up in hospital after being spiked with a needle in a nightclub. "
                            ]
                        },
                        {
                            "explanation": "in the sport of volleyball, to hit the ball so that it goes almost straight down on the other side of the net",
                            "examples": []
                        },
                        {
                            "explanation": "in the sport of American football, to throw the ball straight down to the ground, especially after scoring a touchdown (= carrying or throwing the ball over the other team's goal line): ",
                            "examples": [
                                "He never spiked the ball after a touchdown, choosing to hand it to the official.",
                                "He would always hand the ball to teammates to spike after his touchdowns."
                            ]
                        },
                        {
                            "explanation": "to push a sharp point into something or someone: ",
                            "examples": [
                                "She got badly spiked when one of the runners trod on her heel."
                            ]
                        },
                        {
                            "explanation": "to rise to a higher amount, price, or level, usually before going down again: ",
                            "examples": [
                                "The jobless rate in October spiked to a five-year high."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}