{
    "word": "spin",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "spɪn"
                            ],
                            "us": [
                                "spɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) turn around and around, especially fast: ",
                            "examples": [
                                "The earth spins on its axis.",
                                "The roulette players silently watched the wheel spin around/round.",
                                "He was killed when his car hit a tree and spun off the road.",
                                "Spin the ball (= make it turn around and around as you throw it) and it will change direction when it hits the ground."
                            ]
                        },
                        {
                            "explanation": "If your head or the room spins, you feel as if it is turning around and around, and you cannot balance: ",
                            "examples": [
                                "The room started spinning and I felt faint."
                            ]
                        },
                        {
                            "explanation": "to make thread by twisting fibres , or to produce something using thread: ",
                            "examples": [
                                "The final stage of the production of cotton is when it is spun into thread.",
                                "Spiders spin webs."
                            ]
                        },
                        {
                            "explanation": "to tell a story, either to deceive someone or for entertainment: ",
                            "examples": [
                                "He spun some tale about needing to take time off work because his mother was ill."
                            ]
                        },
                        {
                            "explanation": "(of a vehicle) to move quickly, or to move quickly in a vehicle: ",
                            "examples": [
                                "We were spinning along, when suddenly one of our tyres burst.",
                                "Chris spun past in a flashy new car."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "spɪn"
                            ],
                            "us": [
                                "spɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the movement of something turning round very quickly: ",
                            "examples": [
                                "I hit something on the road, which sent the car into a spin.",
                                "Suddenly, the plane went into a spin.",
                                "These clothes need another spin (= to be turned round very fast in a machine to get water out of them) - they're still very wet.",
                                "She put a lot of spin on the ball (= threw or hit it in a way that made it spin)."
                            ]
                        },
                        {
                            "explanation": "a way of describing an idea or situation that makes it seem better than it really is, especially in politics: ",
                            "examples": [
                                "They have tried to put a positive spin on the situation.",
                                "This report puts a different spin on the issue."
                            ]
                        },
                        {
                            "explanation": "a short journey in a car for pleasure: ",
                            "examples": [
                                "Rupert took me for a spin in his new car."
                            ]
                        },
                        {
                            "explanation": "another word for \nSpinning ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}