{
    "word": "spirit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspɪr.ɪt"
                            ],
                            "us": [
                                "ˈspɪr.ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a particular way of thinking, feeling, or behaving, especially a way that is typical of a particular group of people, an activity, a time, or a place: ",
                            "examples": [
                                "The players have a very strong team spirit (= loyalty to each other).",
                                "As rock musicians in the 1960s, they were very much part of the spirit of the age/times.",
                                "We acted in a spirit of cooperation."
                            ]
                        },
                        {
                            "explanation": "the way a person is feeling: ",
                            "examples": [
                                "I've been in high/low spirits (= feeling happy/sad) lately."
                            ]
                        },
                        {
                            "explanation": "the principle that a law, rule, etc. was created to make stronger, rather than the particular things it says you must or must not do: ",
                            "examples": [
                                "They followed neither the spirit nor the letter of the law."
                            ]
                        },
                        {
                            "explanation": "to show enthusiasm and enjoyment: ",
                            "examples": [
                                "They went to the tennis club a few times but never really got into the spirit of it."
                            ]
                        },
                        {
                            "explanation": "used to approve or encourage someone's positive attitude (= way of thinking) or action: ",
                            "examples": [
                                "\"Come on, we can win this game.\" \"That's the spirit.\""
                            ]
                        },
                        {
                            "explanation": "the characteristics of a person that are considered as being separate from the body, and that many religions believe continue to exist after the body dies: ",
                            "examples": [
                                "Although he's now living in America, I feel he's with me in spirit (= I feel he is present and is influencing me, in a way that is not physical)."
                            ]
                        },
                        {
                            "explanation": "the form of a dead person, similar to a ghost, or the feeling that a dead person is present although you cannot see them: ",
                            "examples": [
                                "an evil spirit",
                                "The spirits of long-dead warriors seemed to haunt the area."
                            ]
                        },
                        {
                            "explanation": "enthusiasm, energy, or courage: ",
                            "examples": [
                                "The orchestra performed The Rite of Spring with great spirit.",
                                "The torture failed to break the prisoner's spirit."
                            ]
                        },
                        {
                            "explanation": "a strong alcoholic drink: ",
                            "examples": [
                                "Vodka is a type of spirit.",
                                "Spirits are more expensive than beer, but they get you drunk faster."
                            ]
                        },
                        {
                            "explanation": "Some types of spirit are alcoholic liquids used especially for cleaning, mixing with paint, etc.: ",
                            "examples": [
                                "Thin the paint with white spirit."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈspɪr.ɪt"
                            ],
                            "us": [
                                "ˈspɪr.ət"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move someone or something out of or away from a place secretly: ",
                            "examples": [
                                "Somehow the prisoners managed to spirit news out to the world outside.",
                                "We managed to spirit her away to the countryside for a few days.",
                                "Criminals bought the jewels and spirited them off the island.",
                                "My task was to get hold of the documents and spirit them out of the country.",
                                "The only way to protect the boy was to spirit him away from his home town."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}