{
    "word": "splash",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "splæʃ"
                            ],
                            "us": [
                                "splæʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a liquid splashes or if you splash a liquid, it falls on or hits something or someone: ",
                            "examples": [
                                "Water was splashing from a hole in the roof.",
                                "Unfortunately some paint splashed onto the rug.",
                                "She splashed her face with cold water.",
                                "She poured a large gin and splashed soda into it from a siphon."
                            ]
                        },
                        {
                            "explanation": "to move in water so that drops of it go in all directions: ",
                            "examples": [
                                "The kids were splashing (about/around) in the shallow end of the swimming pool."
                            ]
                        },
                        {
                            "explanation": "to print or show something, or be printed or shown, in a very noticeable way: ",
                            "examples": [
                                "Several newspapers splashed colour pictures of the star across their front pages.",
                                "The story has splashed all over Canadian newspapers. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "splæʃ"
                            ],
                            "us": [
                                "splæʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small amount of a liquid that has fallen or been dropped: ",
                            "examples": [
                                "There were several splashes of white paint on the carpet."
                            ]
                        },
                        {
                            "explanation": "the noise of something hitting or moving in water: ",
                            "examples": [
                                "We heard a splash and then saw that Toni had fallen in the river."
                            ]
                        },
                        {
                            "explanation": "something or someone bright or very noticeable: ",
                            "examples": [
                                "The little girl in her flowery dress provides the only splash of colour in the picture."
                            ]
                        },
                        {
                            "explanation": "a shocking or exciting news story that is given a lot of attention in a newspaper or news programme: ",
                            "examples": [
                                "The revelation would have been a splash in every newspaper.",
                                "She came to me because there's been a big splash in the newspaper. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}