{
    "word": "split",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "splɪt"
                            ],
                            "us": [
                                "splɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) divide into two or more parts, especially along a particular line: ",
                            "examples": [
                                "The prize was split between Susan and Kate.",
                                "Split the aubergines in half and cover with breadcrumbs.",
                                "The teacher split the children (up) into three groups.",
                                "I'll split (= share) this croissant with you.",
                                "His trousers split when he tried to jump the fence.",
                                "The woman had split her head open (= got a long, deep wound in her head) when she was thrown off the horse."
                            ]
                        },
                        {
                            "explanation": "to form cracks: ",
                            "examples": [
                                "The wooden floor had cracked and split in the heat."
                            ]
                        },
                        {
                            "explanation": "If the people in an organization or group split, or if something splits them, they disagree and form smaller groups: ",
                            "examples": [
                                "The childcare issue has split the employers' group.",
                                "The union executive has split down the middle (= divided into two equal-sized groups who disagree with each other) on what to do next.",
                                "A group of extremists split (off) from the Labour Party to form a new \"Workers Party\"."
                            ]
                        },
                        {
                            "explanation": "If you split the difference, you agree on a number or amount that is exactly in the middle of the difference between two other numbers or amounts: ",
                            "examples": [
                                "I suggested that we split the difference between his current salary and what we had initially offered for the job."
                            ]
                        },
                        {
                            "explanation": "to tell other people secret and damaging information about someone: ",
                            "examples": [
                                "They knew Josie wouldn't split on them to the teacher."
                            ]
                        },
                        {
                            "explanation": "to leave a place",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "splɪt"
                            ],
                            "us": [
                                "splɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, thin hole in something where it has broken apart: ",
                            "examples": [
                                "Rain was getting in through a split in the plastic sheeting."
                            ]
                        },
                        {
                            "explanation": "a situation in which a group of people is divided into smaller groups because they disagree about something: ",
                            "examples": [
                                "There is a widening split between senior managers and the rest of the workforce.",
                                "The tax issue has caused a split in/within the government.",
                                "There was a 75/25 split in the voting."
                            ]
                        },
                        {
                            "explanation": "the action of sitting on the floor with your legs straight out and flat along the floor in opposite directions: ",
                            "examples": [
                                "Can you do the splits?"
                            ]
                        },
                        {
                            "explanation": "the time that is recorded after part of a race, or the part of a race itself: ",
                            "examples": [
                                "If you look at the splits of the other boats, it looks like the race will be close.",
                                "She swam the fastest split in U.S. relay history.",
                                "At the split time on the first descent he was in 5th place. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}