{
    "word": "sponsor",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈspɒn.sər"
                            ],
                            "us": [
                                "ˈspɑːn.sɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of a business or other organization) to pay for someone to do something or for something to happen: ",
                            "examples": [
                                "The participants' employers sponsor them for the six-month training program.",
                                "His organization sponsored the study."
                            ]
                        },
                        {
                            "explanation": "(of a business or other organization) to pay the costs of a sports event, concert, etc., or of a sportsperson, in return for advertising: ",
                            "examples": [
                                "BMW has plenty of practice sponsoring golf tournaments in Europe.",
                                "The team is sponsored by JVC, so the players wear the letters JVC on their shirts."
                            ]
                        },
                        {
                            "explanation": "to agree to give money to someone who is taking part in an event to raise money for a special reason, especially to help people who are suffering: ",
                            "examples": [
                                "Eva said she was doing a ten-mile walk for charity and asked if I'd sponsor her.",
                                "Get your friends and family to sponsor you."
                            ]
                        },
                        {
                            "explanation": "to write a bill (= a formal statement of a planned new law) and try to get people to vote for it: ",
                            "examples": [
                                "A bill is normally sponsored by the cabinet and introduced into Parliament by a cabinet minister."
                            ]
                        },
                        {
                            "explanation": "to organize talks between different groups: ",
                            "examples": [
                                "The World Health Organization sponsored talks on an international convention meant to reduce smoking and tobacco-related disease.",
                                "It was the first time that the USA had officially sponsored negotiations between the two sides."
                            ]
                        },
                        {
                            "explanation": "to officially take responsibility for someone else's actions: ",
                            "examples": [
                                "In general, immigrants qualified by having a close relative or employer sponsor them for a visa. "
                            ]
                        },
                        {
                            "explanation": "(in the Christian church) to be someone's godparent at a baptism ceremony: ",
                            "examples": [
                                "The children are very close to the godparents who sponsored them at baptism."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspɒn.sər"
                            ],
                            "us": [
                                "ˈspɑːn.sɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person or company that supports a person, organization, or activity by giving money: ",
                            "examples": [
                                "All the major theatres now have sponsors, especially for high-cost productions.",
                                "The players wore shirts with the sponsor's logo on the front."
                            ]
                        },
                        {
                            "explanation": "a person who agrees to give money to someone who is taking part in an event to raise money for a special reason, especially to help people who are suffering: ",
                            "examples": [
                                "How many sponsors have you got?",
                                "The children have been collecting sponsors for their swimathon."
                            ]
                        },
                        {
                            "explanation": "someone who writes a bill (= a formal statement of a planned new law) and tries to get people to vote for it: ",
                            "examples": [
                                "I commend the bill 's sponsor for introducing such necessary legislation.",
                                "The Senator is listed as a sponsor on all five bills."
                            ]
                        },
                        {
                            "explanation": "a person who officially takes responsibility for someone else's actions: ",
                            "examples": [
                                "Under the program, family members would act as sponsors for addicts.",
                                "For immigrants without a sponsor, marriage to a U. S. citizen can be the fastest route to legal status. "
                            ]
                        },
                        {
                            "explanation": "(in the Christian religion) a person who, at a baptism ceremony, promises to help a new member of the religion, usually a child, in religious and moral matters: ",
                            "examples": [
                                "He was a sponsor at the baptism of Richard and Eliza's daughter Elizabeth in 1837."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}