{
    "word": "spotter",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈspɒt.ər"
                            ],
                            "us": [
                                "ˈspɑː.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who is good at noticing or finding something: ",
                            "examples": [
                                "As a spotter of current and emergent trends, he has few competitors.",
                                "She's a great talent spotter."
                            ]
                        },
                        {
                            "explanation": "someone who watches a place, looking for someone or something, especially in order to warn people : ",
                            "examples": [
                                "Organized racers have become harder to catch, with spectators monitoring police radios and spotters posted down the road watching for patrol cars."
                            ]
                        },
                        {
                            "explanation": "someone who works on a building site (= an area of land where something is being built) whose job is to make sure that vehicles and heavy machinery are used correctly and safely: ",
                            "examples": [
                                "Using spotters to control traffic is common, according to a Maryland construction safety consultant."
                            ]
                        },
                        {
                            "explanation": "someone who watches weather patterns, especially as a job : ",
                            "examples": [
                                "Together with other chasers and spotters, he can assess the storm from every angle.",
                                "Tornado warnings in the U. S. are issued when twisters are witnessed by spotters or signs are detected by radar."
                            ]
                        },
                        {
                            "explanation": "in weight training and gymnastics, someone who stands next to the person lifting weights or doing particular movements in order to make sure they do not injure themselves : ",
                            "examples": [
                                "All he does in the gym is stand around and talk to his spotter."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -spɒt.ər"
                            ],
                            "us": [
                                " -spɑː.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a person whose job or interest is to notice people or things of the type mentioned: ",
                            "examples": [
                                "a talent-spotter",
                                "a train-spotter"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}