{
    "word": "squash",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skwɒʃ"
                            ],
                            "us": [
                                "skwɑːʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to crush something into a flat shape: ",
                            "examples": [
                                "He accidentally sat on her hat and squashed it."
                            ]
                        },
                        {
                            "explanation": "to push yourself, a person, or thing into a small space: ",
                            "examples": [
                                "The room was so full you couldn't squash another person in.",
                                "If you all squashed up (= moved closer together), we could fit an extra person in the car.",
                                "He tried to squash his ripped jeans into the suitcase while his mother wasn't looking."
                            ]
                        },
                        {
                            "explanation": "to stop something from continuing to exist or happen, by forceful action: ",
                            "examples": [
                                "Rumours of a possible takeover of the company were soon squashed by the management."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skwɒʃ"
                            ],
                            "us": [
                                "skwɑːʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a situation when there is not much room: ",
                            "examples": [
                                "There are over two hundred people coming to the party so it might be a bit of a squash."
                            ]
                        },
                        {
                            "explanation": "a game played between two or four people on a special closed playing area that involves hitting a small rubber ball against a wall",
                            "examples": []
                        },
                        {
                            "explanation": "a drink made by adding water to a very strong liquid made from fruit juice and sugar or sweetener, or the strong liquid itself: ",
                            "examples": [
                                "She won't drink water, only squash.",
                                "Most fizzy drinks, squashes, and fruit juices contain vast amounts of sugar.",
                                "orange/blackcurrant/lemon squash",
                                "a bottle of squash"
                            ]
                        },
                        {
                            "explanation": "a type of large vegetable with a hard skin and a lot of seeds at its centre",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}