{
    "word": "square",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skweər"
                            ],
                            "us": [
                                "skwer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a flat shape with four sides of equal length and four angles of 90°: ",
                            "examples": [
                                "First draw a square.",
                                "It's a square-shaped room."
                            ]
                        },
                        {
                            "explanation": "any square-shaped object: ",
                            "examples": [
                                "When cooled, cut the chocolate brownies into squares."
                            ]
                        },
                        {
                            "explanation": "an area of approximately square-shaped land in a city or a town, often including the buildings that surround it: ",
                            "examples": [
                                "Are they still living at 6 Eaton Square?",
                                "A band were playing in the town square."
                            ]
                        },
                        {
                            "explanation": "a particular space on a board used for playing games: ",
                            "examples": [
                                "She moved her castle forward three squares."
                            ]
                        },
                        {
                            "explanation": "a tool for drawing or testing a right angle",
                            "examples": []
                        },
                        {
                            "explanation": "a boring person who does not like new and exciting ideas: ",
                            "examples": [
                                "He's a bit of a square."
                            ]
                        },
                        {
                            "explanation": "the result of multiplying a number by itself: ",
                            "examples": [
                                "The square of 7 is 49."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "skweər"
                            ],
                            "us": [
                                "skwer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having the shape of a square: ",
                            "examples": [
                                "The recipe recommends that you use a square cake tin.",
                                "He's got that square-jawed masculinity that a lot of women seem to find attractive."
                            ]
                        },
                        {
                            "explanation": "used with units of measurement of length to express the total size of an area: ",
                            "examples": [
                                "The floor is 3 m wide by 5 m long, so its total area is 15 sq m.",
                                "The city itself covers 13 square miles.",
                                "Ensure that the exposed area is less than 2 cm2."
                            ]
                        },
                        {
                            "explanation": "Square is used immediately after measurements of length when expressing the length of the four sides of a square-shaped area: ",
                            "examples": [
                                "So you want carpet for a room that's eight metres square (= eight metres long and eight metres wide)."
                            ]
                        },
                        {
                            "explanation": "equal or level: ",
                            "examples": [
                                "Could you stand back from these shelves and tell me if they're square (= level)?"
                            ]
                        },
                        {
                            "explanation": "If two people are all square, one of them has paid off a debt to the other and neither now owes or is owed any money: ",
                            "examples": [
                                "If you give me £25, I think we'll be all square.",
                                "You paid for the meal, so we're all square now.",
                                "Just one more payment to go, then we'll be all square.",
                                "Are we all square, or do I still owe you for the work you did on Friday?",
                                "Once Rob had given Joe the money from the logs, they were all square."
                            ]
                        },
                        {
                            "explanation": "If two teams or players are (all) square, they have an equal number of goals or points: ",
                            "examples": [
                                "They're all square at 30 points each.",
                                "When they reached the last tee, the match was all square.",
                                "We were all square with just three more holes to play.",
                                "At the end of the first day, Britain and France were all square.",
                                "Torquay and Plymouth ended all square at 1-1."
                            ]
                        },
                        {
                            "explanation": "in a straight line",
                            "examples": []
                        },
                        {
                            "explanation": "used to describe a person who is boring and does not like new and exciting things: ",
                            "examples": [
                                "Do you think my new haircut makes me look a bit square?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skweər"
                            ],
                            "us": [
                                "skwer"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to multiply a number by itself: ",
                            "examples": [
                                "10 squared equals a hundred.",
                                "42 means four squared, and equals 16."
                            ]
                        },
                        {
                            "explanation": "to pull your shoulders up and back because you feel determined to do something: ",
                            "examples": [
                                "He squared his shoulders and took a deep breath before diving into the pool."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}