{
    "word": "squeezing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nsqueeze ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skwiːz"
                            ],
                            "us": [
                                "skwiːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to press something firmly, especially from all sides in order to change its shape, reduce its size, or remove liquid from it: ",
                            "examples": [
                                "Cut the lemon in half and squeeze the juice into the bowl.",
                                "As she waited to go into the exam, he squeezed her hand (= pressed it affectionately with his hand) and wished her good luck.",
                                "Once he had finished cleaning the floor, he squeezed the cloth out.",
                                "He reloaded the gun, took aim, and then squeezed (= pulled back) the trigger.",
                                "The studio is using all sorts of marketing tricks to squeeze as much profit from the movie as they can."
                            ]
                        },
                        {
                            "explanation": "to give someone a quick, tight hug (= an act of holding someone close to your body with your arms): ",
                            "examples": [
                                "She squeezed him tight and kissed him on both cheeks.",
                                "\"Oh, Andrew,\" she said, as she squeezed him in her tight embrace. "
                            ]
                        },
                        {
                            "explanation": "to get in, through, under, etc. with difficulty: ",
                            "examples": [
                                "She squeezed through the crowd and found a seat at the front.",
                                "They managed to squeeze under the fence and get into the festival without paying."
                            ]
                        },
                        {
                            "explanation": "If you are squeezed by financial demands, they cause you financial problems: ",
                            "examples": [
                                "Small businesses are being squeezed by heavy taxation."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}