{
    "word": "squeeze",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "skwiːz"
                            ],
                            "us": [
                                "skwiːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to press something firmly, especially from all sides in order to change its shape, reduce its size, or remove liquid from it: ",
                            "examples": [
                                "Cut the lemon in half and squeeze the juice into the bowl.",
                                "As she waited to go into the exam, he squeezed her hand (= pressed it affectionately with his hand) and wished her good luck.",
                                "Once he had finished cleaning the floor, he squeezed the cloth out.",
                                "He reloaded the gun, took aim, and then squeezed (= pulled back) the trigger.",
                                "The studio is using all sorts of marketing tricks to squeeze as much profit from the movie as they can."
                            ]
                        },
                        {
                            "explanation": "to give someone a quick, tight hug (= an act of holding someone close to your body with your arms): ",
                            "examples": [
                                "She squeezed him tight and kissed him on both cheeks.",
                                "\"Oh, Andrew,\" she said, as she squeezed him in her tight embrace. "
                            ]
                        },
                        {
                            "explanation": "to get in, through, under, etc. with difficulty: ",
                            "examples": [
                                "She squeezed through the crowd and found a seat at the front.",
                                "They managed to squeeze under the fence and get into the festival without paying."
                            ]
                        },
                        {
                            "explanation": "If you are squeezed by financial demands, they cause you financial problems: ",
                            "examples": [
                                "Small businesses are being squeezed by heavy taxation."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "skwiːz"
                            ],
                            "us": [
                                "skwiːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of pressing something firmly: ",
                            "examples": [
                                "She gave the present a quick squeeze and tried to guess what was inside.",
                                "Garnish the fish with some fresh parsley and a squeeze of lemon."
                            ]
                        },
                        {
                            "explanation": "a short, tight hug (= an act of holding someone close to your body with your arms): ",
                            "examples": [
                                "She hugged him in a gentle squeeze.",
                                "He gave his daughter one last squeeze and jumped onto the train."
                            ]
                        },
                        {
                            "explanation": "a reduction or limit: ",
                            "examples": [
                                "The squeeze on profits in the oil industry has led to thousands of redundancies.",
                                "The squeeze on local spending means that many services will have to be cut."
                            ]
                        },
                        {
                            "explanation": "a period in which the supply of money is limited by the government because of economic difficulties: ",
                            "examples": [
                                "The government has imposed a sharp credit squeeze in an attempt to hold down inflation."
                            ]
                        },
                        {
                            "explanation": "a situation in which people or things are pushed or forced into a small space: ",
                            "examples": [
                                "I can give you a lift, but it'll be a tight squeeze as I'm taking four other people as well."
                            ]
                        },
                        {
                            "explanation": "someone's girlfriend or boyfriend: ",
                            "examples": [
                                "She turned up arm in arm with her latest squeeze.",
                                "She was never his squeeze, only his business partner."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}