{
    "word": "stacker",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈstæk.ər"
                            ],
                            "us": [
                                "ˈstæk.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone whose job is putting goods or other things on shelves, or putting things on top of each other: ",
                            "examples": [
                                "The supermarket is recruiting checkout clerks and shelf stackers.",
                                "I got a job as a crate stacker for a brewery.",
                                "He worked as a stacker at the public library."
                            ]
                        },
                        {
                            "explanation": "a machine for putting things on top of each other: ",
                            "examples": [
                                "Devices are fed from automatic tray stackers.",
                                "All warehouse equipment (order pickers, stackers, lifting devices conveyors, fork lift trucks, etc.) must be fire resistant."
                            ]
                        },
                        {
                            "explanation": "a set of containers that are designed to be put on top of each other: ",
                            "examples": [
                                "To keep nappies and other baby products out of the way, invest in one of these pretty stackers for the nursery."
                            ]
                        },
                        {
                            "explanation": "a child's toy in which similar items of different sizes must be put on top of each other : ",
                            "examples": [
                                "A stacker makes a great first \"puzzle\" for a baby or toddler.",
                                "Toddlers will develop their motor skills and coordination with this bunny stacker toy."
                            ]
                        },
                        {
                            "explanation": "a type of sandwich with several different types of food on top of each other: ",
                            "examples": [
                                "Their Italian deli-style stackers are the best in the city."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}