{
    "word": "stage",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "steɪdʒ"
                            ],
                            "us": [
                                "steɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a part of an activity or a period of development: ",
                            "examples": [
                                "The project is in its final stages and should be completed by August.",
                                "They did the last stage of their journey on foot.",
                                "Our marriage is going through a difficult stage at the moment.",
                                "Their youngest child is at the stage where she can say individual words but not full sentences.",
                                "I'm not tired at the moment but I will need a rest at some stage (= at some time) during the walk.",
                                "Andrew spends all his spare time playing with his computer but it's probably just a stage he's going through (= a period of development that will end soon)."
                            ]
                        },
                        {
                            "explanation": "If you do something in stages, you divide the activity into parts and complete each part separately: ",
                            "examples": [
                                "We're decorating the house in stages so it won't be ready for another couple of months."
                            ]
                        },
                        {
                            "explanation": "one of the separate parts of a rocket, each part having its own engine: ",
                            "examples": [
                                "Once its fuel supply runs out, each stage separates from the main part of the rocket and falls back to earth."
                            ]
                        },
                        {
                            "explanation": "the area in a theatre that is often raised above ground level and on which actors or entertainers perform: ",
                            "examples": [
                                "Hamlet is on stage for most of the act.",
                                "The orchestra went on/off stage to great applause.",
                                "The play is a stage adaptation of William Golding's novel.",
                                "The singer returns to the Oslo stage (= will perform again in Oslo) this summer."
                            ]
                        },
                        {
                            "explanation": "a particular area of public life: ",
                            "examples": [
                                "The president was extremely popular on the world stage but was disliked in his own country."
                            ]
                        },
                        {
                            "explanation": "to go onto the stage and start to perform: ",
                            "examples": [
                                "She was waiting to take the stage at a rally in Ohio."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "steɪdʒ"
                            ],
                            "us": [
                                "steɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to arrange and perform a play or show: ",
                            "examples": [
                                "The local drama group is staging a production of the musical \"Grease\"."
                            ]
                        },
                        {
                            "explanation": "to organize an event: ",
                            "examples": [
                                "London staged the Olympic Games in 2012."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}