{
    "word": "stain",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "steɪn"
                            ],
                            "us": [
                                "steɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to leave a mark on something that is difficult to remove: ",
                            "examples": [
                                "Tomato sauce stains terribly - it's really difficult to get it out of clothes.",
                                "While she was changing the wheel on her car, her coat had become stained with oil."
                            ]
                        },
                        {
                            "explanation": "If a material stains, it absorbs substances easily, causing it to become covered with marks, or coloured by a chemical: ",
                            "examples": [
                                "This carpet is ideal for the kitchen because it doesn't stain easily."
                            ]
                        },
                        {
                            "explanation": "to change the colour of something using a chemical: ",
                            "examples": [
                                "She stripped the floorboards and stained them dark brown."
                            ]
                        },
                        {
                            "explanation": "to permanently spoil something such as someone's reputation: ",
                            "examples": [
                                "Several important politicians have had their reputations stained by this scandal.",
                                "The country's history is stained with the blood of (= the country is guilty of killing) millions of innocent men and women."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "steɪn"
                            ],
                            "us": [
                                "steɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a dirty mark on something that is difficult to remove: ",
                            "examples": [
                                "a blood/grass stain",
                                "You can remove a red wine stain from a carpet by sprinkling salt over it."
                            ]
                        },
                        {
                            "explanation": "a chemical for changing the colour of something",
                            "examples": []
                        },
                        {
                            "explanation": "permanent damage to someone's reputation or character: ",
                            "examples": [
                                "His solicitor said, \"He leaves this court without a stain on his character.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}