{
    "word": "stake",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "steɪk"
                            ],
                            "us": [
                                "steɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a share or a financial involvement in something such as a business: ",
                            "examples": [
                                "He holds (= owns) a 40 percent stake in/of the company."
                            ]
                        },
                        {
                            "explanation": "If you have a stake in something, it is important to you because you have a personal interest or involvement in it: ",
                            "examples": [
                                "Employers have a stake in the training of their staff."
                            ]
                        },
                        {
                            "explanation": "the amount of money that you risk on the result of something such as a game or competition: ",
                            "examples": [
                                "She spent two weeks in Las Vegas playing high-stakes blackjack at the casinos."
                            ]
                        },
                        {
                            "explanation": "In an activity or competition, the stakes are the reward for the person who wins or succeeds in it: ",
                            "examples": [
                                "The team is playing for enormous stakes - the chance to play in the final."
                            ]
                        },
                        {
                            "explanation": "used in the names of horse races in which the prize money is provided by all the owners of the horses that are competing in the race",
                            "examples": []
                        },
                        {
                            "explanation": "a situation where someone is judged on how much of a particular quality they have: ",
                            "examples": [
                                "The prime minister is not very high in the popularity stakes (= he is not very popular) at the moment."
                            ]
                        },
                        {
                            "explanation": "to increase the prize or reward in a competition or any activity in which you are competing",
                            "examples": []
                        },
                        {
                            "explanation": "to make a situation more urgent or more difficult to ignore: ",
                            "examples": [
                                "The stowaways are trying to raise the stakes by refusing to eat until they are given money and aid."
                            ]
                        },
                        {
                            "explanation": "a strong stick or metal bar with a pointed end: ",
                            "examples": [
                                "The stakes are pushed or hammered into the ground and can be used for supporting a plant or forming part of a fence."
                            ]
                        },
                        {
                            "explanation": "in the past, a wooden post to which people were tied before being burned to death as a punishment: ",
                            "examples": [
                                "In medieval Europe, many women were accused of being witches and were burned at the stake."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "steɪk"
                            ],
                            "us": [
                                "steɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to risk an amount of money: ",
                            "examples": [
                                "At the roulette table, he staked $10,000 on number 21."
                            ]
                        },
                        {
                            "explanation": "to hold up and support something by fastening it to stakes: ",
                            "examples": [
                                "Tomato plants should be staked."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}