{
    "word": "stall",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stɔːl"
                            ],
                            "us": [
                                "stɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large table or a small shop with an open front from which goods are sold in a public place: ",
                            "examples": [
                                "In the village market, the stalls are piled high with local vegetables."
                            ]
                        },
                        {
                            "explanation": "a small closed area within a farm building in which there is space for one animal to be kept",
                            "examples": []
                        },
                        {
                            "explanation": "a small area of a room that is separated from the main part of the room by walls or curtains: ",
                            "examples": [
                                "There was one bathroom with a shower stall in the corner."
                            ]
                        },
                        {
                            "explanation": "rows of fixed seats in a church, often with the sides and backs connected: ",
                            "examples": [
                                "Members of the public were invited to sit in the choir stalls."
                            ]
                        },
                        {
                            "explanation": "the seats on the main floor of a theatre or cinema, not at a higher level: ",
                            "examples": [
                                "As he came onto the stage, a woman threw flowers from the stalls."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stɔːl"
                            ],
                            "us": [
                                "stɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If an engine stalls, or if you stall it, it stops working suddenly and without you intending it to happen: ",
                            "examples": [
                                "A car may stall due to the driver braking too suddenly.",
                                "I stalled the car twice during my driving test but still managed to pass."
                            ]
                        },
                        {
                            "explanation": "to delay taking action or avoid giving an answer in order to have more time to make a decision or get an advantage: ",
                            "examples": [
                                "She says she'll give me the money next week but I think she's just stalling (for time)."
                            ]
                        },
                        {
                            "explanation": "If you stall a person, you delay them or prevent them from doing something for a period of time: ",
                            "examples": [
                                "I managed to stall him for a few days until I'd got enough money to pay back the loan.",
                                "The thief broke into the office while his accomplice stalled off the security guard."
                            ]
                        },
                        {
                            "explanation": "to stop making progress: ",
                            "examples": [
                                "Japan's economic growth has stalled, with industrial production contracting in June for the fourth straight month."
                            ]
                        },
                        {
                            "explanation": "If you stall an event, you delay it or prevent it from making progress: ",
                            "examples": [
                                "Commandos stalled the enemy attack by destroying three bridges.",
                                "Fears are growing that a tax increase may stall economic recovery."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}