{
    "word": "stamp",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stæmp"
                            ],
                            "us": [
                                "stæmp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small piece of paper with a picture or pattern on it that is stuck onto a letter or package before it is posted, to show that the cost of sending it has been paid: ",
                            "examples": [
                                "I stuck a 50p stamp on the envelope."
                            ]
                        },
                        {
                            "explanation": "a tool for putting a mark on an object either by printing on it or pushing into it, or the mark made in this way: ",
                            "examples": [
                                "A date stamp inside the front cover of a library book shows when it should be returned."
                            ]
                        },
                        {
                            "explanation": "a small piece of paper worth a particular amount of money that you can buy several of, as a way of paying for something over a period of time: ",
                            "examples": [
                                "vehicle licence stamps"
                            ]
                        },
                        {
                            "explanation": "a particular quality in something or someone, or a quality in something that shows it was done by a particular person or group of people: ",
                            "examples": [
                                "Although this painting clearly bears the stamp of genius, we don't know who painted it.",
                                "Each manager has left his or her own stamp on the way the company has evolved."
                            ]
                        },
                        {
                            "explanation": "an act of putting the foot down on the ground hard, or the noise made in doing so: ",
                            "examples": [
                                "With a stamp of her foot she stormed out."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stæmp"
                            ],
                            "us": [
                                "stæmp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put a mark on an object either by printing on it or pushing into it with a small tool: ",
                            "examples": [
                                "It is necessary to stamp your passport.",
                                "Every carton of yogurt is stamped with a sell-by date."
                            ]
                        },
                        {
                            "explanation": "to put a foot down on the ground hard and quickly, making a loud noise, often to show anger: ",
                            "examples": [
                                "The little boy was stamping his foot and refusing to take his medicine.",
                                "She stood by the road, stamping her feet to stay warm.",
                                "I wish those people upstairs would stop stamping (about/around).",
                                "Why did you stamp on that insect?"
                            ]
                        },
                        {
                            "explanation": "to mark with a particular quality or show that someone has a particular quality: ",
                            "examples": [
                                "Our new administrator seems to be trying to stamp her authority on every aspect of the department."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}