{
    "word": "standard",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈstæn.dəd"
                            ],
                            "us": [
                                "ˈstæn.dɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a level of quality: ",
                            "examples": [
                                "This essay is not of an acceptable standard - do it again.",
                                "This piece of work is below standard/is not up to standard.",
                                "We have very high safety standards in this laboratory.",
                                "Not everyone judges success by the same standards - some people think happiness is more important than money.",
                                "Her technique became a standard against which all future methods were compared."
                            ]
                        },
                        {
                            "explanation": "a moral rule that should be obeyed: ",
                            "examples": [
                                "Most people agree that there are standards (of behaviour) that need to be upheld."
                            ]
                        },
                        {
                            "explanation": "a pattern or model that is generally accepted: ",
                            "examples": [
                                "This program is an industry standard for computers."
                            ]
                        },
                        {
                            "explanation": "a song or other piece of music that has been popular and often played over a long period of time",
                            "examples": []
                        },
                        {
                            "explanation": "a car with gears that are changed by hand",
                            "examples": []
                        },
                        {
                            "explanation": "a flag, especially a long, narrow one ending with two long points: ",
                            "examples": [
                                "the royal standard"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈstæn.dəd"
                            ],
                            "us": [
                                "ˈstæn.dɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "usual rather than special, especially when thought of as being correct or acceptable: ",
                            "examples": [
                                "White is the standard colour for this model of refrigerator.",
                                "These are standard procedures for handling radioactive waste.",
                                "The metre is the standard unit for measuring length in the SI system.",
                                "Your new TV comes with a two year guarantee as standard."
                            ]
                        },
                        {
                            "explanation": "Language described as standard is the form of that language that is considered acceptable and correct by most educated users of it: ",
                            "examples": [
                                "Most announcers on the BBC speak standard English.",
                                "In Standard American, \"gotten\" is used as a past participle of \"get\"."
                            ]
                        },
                        {
                            "explanation": "A standard book or writer is the one that is most commonly read for information on a particular subject: ",
                            "examples": [
                                "Her book is still a standard text in archaeology, even though it was written more than 20 years ago."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}