{
    "word": "stand-alone",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈstænd.əˌləʊn"
                            ],
                            "us": [
                                "ˈstænd.əˌloʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a computer that can operate on its own, without being connected to a network (= a number of computers connected together): ",
                            "examples": [
                                "At first personal computers were standalone units on employees' desks.",
                                "These concerns are particularly important when searches involve complicated computer networks (as opposed to stand-alone PCs )."
                            ]
                        },
                        {
                            "explanation": "used to refer to electronic equipment that exists as a single device, rather than being combined in another device: ",
                            "examples": [
                                "Small or home offices often don't have space for stand-alone printers, scanners, fax machines, or copiers, so they end up with a multifunction device.",
                                "With standalone DVD recorders, media speed is less critical, since you record television in real time."
                            ]
                        },
                        {
                            "explanation": "used to refer to computer software that works on its own, with no help from the internet or any other computer process: ",
                            "examples": [
                                "An end-user application is stand-alone software that installs directly on the user's system.",
                                "Some of the apps are inferior versions of the company's standalone programs."
                            ]
                        },
                        {
                            "explanation": "used to refer to a business or organization that is not part of a larger one: ",
                            "examples": [
                                "Baylor is one of only nine stand-alone medical schools in the United States.",
                                "The move would break up the firm, leaving its corporate consultancy as a standalone entity."
                            ]
                        },
                        {
                            "explanation": "used to refer to something that is not part of a set or series (= a set of books, broadcasts, films , etc. on the same subject or using the same characters): ",
                            "examples": [
                                "He has written a few stand-alone novels and a couple of series."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}