{
    "word": "standby",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈstænd.baɪ"
                            ],
                            "us": [
                                "ˈstænd.baɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that is always ready for use, especially if a regular one fails: ",
                            "examples": [
                                "Board games are a good standby to keep the children amused if the weather is bad.",
                                "There are standby generators but these usually only have to work for a few hours a year during power cuts."
                            ]
                        },
                        {
                            "explanation": "When a person or a thing is on standby, they are or it is ready to be used if necessary: ",
                            "examples": [
                                "Hospitals are on standby ready to deal with casualties from the crash."
                            ]
                        },
                        {
                            "explanation": "When an electrical device such as a television is on standby, the power is on but the device will not work until a switch, etc. is pressed. : ",
                            "examples": [
                                "Not leaving your TV on standby at night will save you money."
                            ]
                        },
                        {
                            "explanation": "When someone is on standby, they are waiting for a seat that might become available just before a flight or performance: ",
                            "examples": [
                                "I was too late for my flight but I managed get on standby for a later one."
                            ]
                        },
                        {
                            "explanation": "a cheaper ticket sold just before a flight or a performance if there is a seat available: ",
                            "examples": [
                                "Tickets start at about at about £7, with cheap standbys sometimes available to students on the evening of the performance.",
                                "About 850 standby tickets have been given to those hoping to take the place of no-shows."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}