{
    "word": "starting",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈstɑː.tɪŋ"
                            ],
                            "us": [
                                "ˈstɑːr.t̬ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "happening or used at the beginning of a process: ",
                            "examples": [
                                "A lower starting dose is recommended for patients who have moderate or severe liver impairment.",
                                "Children in Britain start school at five or earlier, whereas the starting ages are six in France, Germany, and Italy and seven in Denmark."
                            ]
                        },
                        {
                            "explanation": "The starting players in a team are the ones chosen to start playing at the beginning of a game, rather than the substitutes (= players who are used for part of a game instead of other players): ",
                            "examples": [
                                "He will have to earn his way back into the starting lineup.",
                                "The team's starting fifteen won't be named until tomorrow night."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈstɑː.tɪŋ"
                            ],
                            "us": [
                                "ˈstɑːr.t̬ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of beginning something, or the fact of beginning: ",
                            "examples": [
                                "After two years of starting and stopping, he is now seriously learning to drive.",
                                "They had taken no part in the actual starting of the revolution."
                            ]
                        },
                        {
                            "explanation": "the act of beginning to work or operate, or of making something do this: ",
                            "examples": [
                                "There is a safety button to prevent the accidental starting of the mower.",
                                "Then there was the sound of car doors banging and the starting of engines."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}