{
    "word": "start",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stɑːt"
                            ],
                            "us": [
                                "stɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to begin doing something: ",
                            "examples": [
                                "When do you start your course/your new job?",
                                "We'll be starting (the session) at six o'clock.",
                                "Can you start (= begin a new job) on Monday?",
                                "They started building the house in January.",
                                "I'd just started to write a letter when the phone rang."
                            ]
                        },
                        {
                            "explanation": "If a business or other organization starts, or if someone starts one, it is created and starts to operate: ",
                            "examples": [
                                "She started her own software company.",
                                "A lot of new restaurants have started up in the region."
                            ]
                        },
                        {
                            "explanation": "to begin to happen or to make something begin to happen: ",
                            "examples": [
                                "A new series about wildlife has started on Monday nights.",
                                "Police believe the fire was started by arsonists."
                            ]
                        },
                        {
                            "explanation": "to begin a set of activities with the thing or person mentioned: ",
                            "examples": [
                                "The speaker started with a description of her journey to China.",
                                "Give me your answers one by one, starting with Lucy.",
                                "You could start by weeding the flowerbeds.",
                                "He started his working life as an engineer but later became a teacher."
                            ]
                        },
                        {
                            "explanation": "to begin to complain or be annoying in some way: ",
                            "examples": [
                                "Don't start with me - we're not going and that's that!",
                                "\"It would help if Richard did some work.\" \"Oh, don't get me started on Richard!\""
                            ]
                        },
                        {
                            "explanation": "to begin: ",
                            "examples": [
                                "When can we get started?"
                            ]
                        },
                        {
                            "explanation": "to have your first child: ",
                            "examples": [
                                "At that point, we were thinking of starting a family."
                            ]
                        },
                        {
                            "explanation": "to begin to live in a different way or do things differently: ",
                            "examples": [
                                "A new house gives you the chance to start afresh."
                            ]
                        },
                        {
                            "explanation": "to begin an argument or a fight: ",
                            "examples": [
                                "You could tell the guy wanted to start something, so we just walked away."
                            ]
                        },
                        {
                            "explanation": "to begin being employed: ",
                            "examples": [
                                "He started work at 16 in a bakery."
                            ]
                        },
                        {
                            "explanation": "at the beginning, or as the first of several things: ",
                            "examples": [
                                "We only knew two people in Montreal to start with, but we soon made friends."
                            ]
                        },
                        {
                            "explanation": "to begin at one point and then move to another, in distance or range: ",
                            "examples": [
                                "The run starts at/from the entrance to the park.",
                                "We'll need to start (off/out) early because the journey takes six hours.",
                                "Tell me what happened - start at the beginning.",
                                "Ticket prices start at/from €80 and go up to €500."
                            ]
                        },
                        {
                            "explanation": "to move your body suddenly because something has surprised or frightened you: ",
                            "examples": [
                                "He started at the sound of the phone."
                            ]
                        },
                        {
                            "explanation": "to (cause to) begin to work or operate: ",
                            "examples": [
                                "I'm having trouble starting the car.",
                                "The engine won't start."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stɑːt"
                            ],
                            "us": [
                                "stɑːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the beginning of something: ",
                            "examples": [
                                "We were doubtful about the product's usefulness from the start.",
                                "They announced the start of a new commercial venture.",
                                "The weather was good at the start (= in the first part) of the week.",
                                "The event got off to a shaky/poor start with the stage lights failing in the first few minutes."
                            ]
                        },
                        {
                            "explanation": "the act of beginning to do something: ",
                            "examples": [
                                "We need to make a start on (preparing) the brochure next week."
                            ]
                        },
                        {
                            "explanation": "including all of something, from the beginning to the end: ",
                            "examples": [
                                "The whole party was a disaster from start to finish."
                            ]
                        },
                        {
                            "explanation": "first, or as the first in a set of things: ",
                            "examples": [
                                "We'll take names and phone numbers for a start, then later on we can get more details."
                            ]
                        },
                        {
                            "explanation": "used when giving a first example of something: ",
                            "examples": [
                                "This book is better than her last one. For a start, it's shorter."
                            ]
                        },
                        {
                            "explanation": "an occasion when you are a competitor in a race or one of the team members that plays at the beginning of a game: ",
                            "examples": [
                                "It was her seventh goal of the season in 13 starts. ",
                                "The three-year-old horse is unbeaten in six starts."
                            ]
                        },
                        {
                            "explanation": "an advantage that you have over someone else when you begin something: ",
                            "examples": [
                                "We gave the youngest children a five-second start (= in a race)."
                            ]
                        },
                        {
                            "explanation": "a sudden movement of the body that you make when something has surprised or frightened you: ",
                            "examples": [
                                "He woke with a start.",
                                "She gave a start as I entered."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}