{
    "word": "station",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsteɪ.ʃən"
                            ],
                            "us": [
                                "ˈsteɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a building and the surrounding area where buses or trains stop for people to get on or off: ",
                            "examples": [
                                "a railway station",
                                "a railroad station",
                                "a train/bus/coach station",
                                "Our office is near the station.",
                                "We looked on our map to find the nearest underground/tube (US subway/metro) station."
                            ]
                        },
                        {
                            "explanation": "a company that broadcasts radio or television programmes: ",
                            "examples": [
                                "a radio/television station",
                                "a commercial/foreign station",
                                "The reception is not very good - try to tune in to another station.",
                                "a pirate (= illegal) station"
                            ]
                        },
                        {
                            "explanation": "a building or place used for a particular service or type of work: ",
                            "examples": [
                                "a gas station",
                                "a petrol station",
                                "a police/fire station"
                            ]
                        },
                        {
                            "explanation": "a place where scientific information about the natural world is collected: ",
                            "examples": [
                                "The research station will monitor wildlife, vegetation and the water table.",
                                "The scientists trawl for fish and set gill nets at sampling stations on each beach."
                            ]
                        },
                        {
                            "explanation": "a large farm with animals in Australia and New Zealand: ",
                            "examples": [
                                "a sheep station"
                            ]
                        },
                        {
                            "explanation": "a particular position that someone has been ordered to move into or to stay in: ",
                            "examples": [
                                "The police took up their stations at the edge of the road, holding back the crowd."
                            ]
                        },
                        {
                            "explanation": "someone's position in society, especially the position that they are born into: ",
                            "examples": [
                                "If everyone just meekly accepted their station in life, nothing would ever change.",
                                "She was accused of having ideas above her station.",
                                "Manual work was considered below their station."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsteɪ.ʃən"
                            ],
                            "us": [
                                "ˈsteɪ.ʃən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause especially soldiers to be in a particular place to do a job: ",
                            "examples": [
                                "I hear your son's in the army - where's he stationed?",
                                "The regiment was stationed in Singapore for several years.",
                                "Armed guards were stationed around the airport."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}