{
    "word": "statement",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsteɪt.mənt"
                            ],
                            "us": [
                                "ˈsteɪt.mənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that someone says or writes officially, or an action done to express an opinion: ",
                            "examples": [
                                "The government is expected to issue a statement about the investigation to the press.",
                                "He produced a signed statement from the prisoner.",
                                "He threw paint over the fur coats because he wanted to make a statement about cruelty to animals.",
                                "We were not surprised by their statement that jobs would be cut."
                            ]
                        },
                        {
                            "explanation": "a record of the amounts of money paid into and taken out of your bank account during a particular period of time: ",
                            "examples": [
                                "Check you statement and see if the money has been taken from your bank account.",
                                "He keeps all his bank statements and files them away."
                            ]
                        },
                        {
                            "explanation": "a document that gives details of a the special needs of a child with a particular disability or problem and any extra help he or she should receive at school: ",
                            "examples": [
                                "Around a quarter of the class has a statement.",
                                "Our son, who has a statement of educational needs, goes to a mainstream school."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsteɪt.mənt"
                            ],
                            "us": [
                                "ˈsteɪt.mənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to a piece of clothing, jewellery, etc. that is designed to be very noticeable and stylish: ",
                            "examples": [
                                "People don't mind spending £500 for a statement piece."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsteɪt.mənt"
                            ],
                            "us": [
                                "ˈsteɪt.mənt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to officially give a child with a particular disability or problem a statement of educational needs: ",
                            "examples": [
                                "My five-year-old grandson has a speech impediment for which he has been statemented. ",
                                "She is specially trained to work with statemented children."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}