{
    "word": "stitch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stɪtʃ"
                            ],
                            "us": [
                                "stɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of thread sewn in cloth, or the single movement of a needle and thread into and out of the cloth that produces this: ",
                            "examples": [
                                "Secure the two pieces together with a couple of stitches."
                            ]
                        },
                        {
                            "explanation": "one of the small circles of wool that you make when you are knitting: ",
                            "examples": [
                                "Cast on (= make the first row on the needle) 50 stitches using pink wool.",
                                "Cast off the first four stitches (= take them off the needle and finish the edge).",
                                "If you drop a stitch (= lose a loop of wool from the needle), there's usually someone around who can help you."
                            ]
                        },
                        {
                            "explanation": "a particular type of stitch made in sewing or knitting, or the pattern that this produces: ",
                            "examples": [
                                "a pearl/satin stitch",
                                "The bedspread was embroidered with cross-stitch."
                            ]
                        },
                        {
                            "explanation": "a length of special thread used to join the edges of a deep cut in the flesh: ",
                            "examples": [
                                "Her head wounds needed 50 stitches.",
                                "He got hit with a broken bottle and needed five stitches in his cheek."
                            ]
                        },
                        {
                            "explanation": "without any clothes: ",
                            "examples": [
                                "I don't have a stitch to wear (= I do not have anything suitable to wear) for this party tonight."
                            ]
                        },
                        {
                            "explanation": "a sharp pain in the side of your stomach or chest, often caused by not breathing enough when running or laughing: ",
                            "examples": [
                                "I got a stitch after running for the bus."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stɪtʃ"
                            ],
                            "us": [
                                "stɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to sew two things together, or to repair something by sewing: ",
                            "examples": [
                                "This button needs to be stitched back onto my shirt.",
                                "Stitch the pieces together along the fold."
                            ]
                        },
                        {
                            "explanation": "to make a piece of clothing: ",
                            "examples": [
                                "I must discard these old shirts and stitch some before next summer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}