{
    "word": "stock",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stɒk"
                            ],
                            "us": [
                                "stɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a supply of something for use or sale: ",
                            "examples": [
                                "It is now halfway through winter and food stocks are already low.",
                                "The local shop has a good stock of postcards and guidebooks.",
                                "Much of the city's housing stock (= the number of houses in the city) is over 100 years old."
                            ]
                        },
                        {
                            "explanation": "the total amount of goods or the amount of a particular type of goods available in a shop: ",
                            "examples": [
                                "This shop sells its old stock at very low prices.",
                                "We'll be getting our new stock in on Friday.",
                                "The new edition is in/out of stock (= available/not available) in major bookshops."
                            ]
                        },
                        {
                            "explanation": "the amount of money that a company has through selling shares to people: ",
                            "examples": [
                                "They own 20 percent of the company's stock."
                            ]
                        },
                        {
                            "explanation": "part of the ownership of a company that can be bought by members of the public: ",
                            "examples": [
                                "Stock prices fell yesterday in heavy trading.",
                                "She buys and sells stocks and shares."
                            ]
                        },
                        {
                            "explanation": "money that people invest in the government, producing a fixed rate of interest: ",
                            "examples": [
                                "government stock(s)"
                            ]
                        },
                        {
                            "explanation": "a liquid used to add flavour to food, made by boiling meat or fish bones or vegetables in water: ",
                            "examples": [
                                "vegetable/beef/chicken stock"
                            ]
                        },
                        {
                            "explanation": "animals, such as cows or sheep, kept on a farm",
                            "examples": []
                        },
                        {
                            "explanation": "the degree to which a person or organization is popular and respected: ",
                            "examples": [
                                "At present, the prime minister's stock is high/low."
                            ]
                        },
                        {
                            "explanation": "the family or group that a person or animal comes from: ",
                            "examples": [
                                "He's an American of Irish stock.",
                                "She's of peasant/noble stock.",
                                "Some of the animals will be kept as breeding stock."
                            ]
                        },
                        {
                            "explanation": "the support or handle of a tool, especially the part of a gun that rests against your shoulder",
                            "examples": []
                        },
                        {
                            "explanation": "in the past, a wooden frame that was fixed around someone's feet, hands, and sometimes head, so that they were forced to sit or stand for a long time in public as a punishment: ",
                            "examples": [
                                "Punishments ranged from an hour in the stocks to a public whipping."
                            ]
                        },
                        {
                            "explanation": "a garden plant with small pleasant-smelling, brightly coloured flowers",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stɒk"
                            ],
                            "us": [
                                "stɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a shop or factory stocks something, it keeps a supply of it: ",
                            "examples": [
                                "Most supermarkets stock a wide range of wines."
                            ]
                        },
                        {
                            "explanation": "to fill something such as a cupboard or shelves with food or goods: ",
                            "examples": [
                                "He has a part-time job stocking shelves in the local supermarket.",
                                "I always stock up the fridge before my sister comes to stay."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "stɒk"
                            ],
                            "us": [
                                "stɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of an idea, expression, or action) usual or typical, and used or done so many times that it is no longer original: ",
                            "examples": [
                                "a stock phrase/response",
                                "\"Don't worry - worse things happen at sea\" is her stock expression for whenever anything goes wrong."
                            ]
                        },
                        {
                            "explanation": "(of photographs) supplied by a company or organization for people to use themselves, without having to do their own photography: ",
                            "examples": [
                                "The article was accompanied by two stock photographs.",
                                "Today, stock images can be found in searchable online databases."
                            ]
                        },
                        {
                            "explanation": "(of a product) available for people to buy in a shop and not needing to be ordered: ",
                            "examples": [
                                "Our delivery times on stock items is 2-3 days.",
                                "\"Personal tailoring\" usually means that alterations are made to stock sizes after your measurements are taken."
                            ]
                        },
                        {
                            "explanation": "(of an animal) used for moving other animals such as cows and sheep from one place to another: ",
                            "examples": [
                                "Billy was a great stock dog.",
                                "Ranchers use stock horses to herd animals, or guide them from place to place. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}