{
    "word": "stone",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stəʊn"
                            ],
                            "us": [
                                "stoʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the hard, solid substance found in the ground that is often used for building, or a piece of this: ",
                            "examples": [
                                "a stone wall/floor",
                                "a flight of stone steps",
                                "a primitive stone axe",
                                "They cut enormous blocks of stone out of the hillside.",
                                "Some demonstrators were arrested for throwing stones at the police."
                            ]
                        },
                        {
                            "explanation": "a piece of hard material that can form in some organs in the body and cause severe pain: ",
                            "examples": [
                                "How can I reduce the risk of developing kidney/gall stones?"
                            ]
                        },
                        {
                            "explanation": "a unit of weight equal to 14 pounds or 6.35 kilograms, used especially when talking about a person's weight: ",
                            "examples": [
                                "I weigh ten and a half stone.",
                                "She has put on/lost a stone (= is a stone heavier/lighter)."
                            ]
                        },
                        {
                            "explanation": "a small piece of a hard, valuable substance, such as a diamond, that is found in the ground and used in jewellery: ",
                            "examples": [
                                "They deal in gold, silver, and precious/semiprecious stones.",
                                "The large central diamond is surrounded by eight smaller stones."
                            ]
                        },
                        {
                            "explanation": "a large, hard seed inside some types of fruit: ",
                            "examples": [
                                "Peaches, plums, and olives all contain stones."
                            ]
                        },
                        {
                            "explanation": "another word for \ncurling stone ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stəʊn"
                            ],
                            "us": [
                                "stoʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to throw stones at something or someone: ",
                            "examples": [
                                "Rioters set up barricades and stoned police cars."
                            ]
                        },
                        {
                            "explanation": "to kill someone as a punishment by throwing stones at them: ",
                            "examples": [
                                "The crowd dragged him away and stoned him to death."
                            ]
                        },
                        {
                            "explanation": "to remove the stone from a fruit: ",
                            "examples": [
                                "Could you stone the cherries for me?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}