{
    "word": "strain",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "streɪn"
                            ],
                            "us": [
                                "streɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a force or influence that stretches, pulls, or puts pressure on something, sometimes causing damage: ",
                            "examples": [
                                "The hurricane put such a strain on the bridge that it collapsed.",
                                "As you get older, excess weight puts a lot of strain on the heart.",
                                "Their constant arguments were putting a strain on their marriage.",
                                "The recent decline in the dollar has put a bigger strain on the economic system.",
                                "Migration into the cities is putting a strain on already stretched resources."
                            ]
                        },
                        {
                            "explanation": "an injury to a muscle or similar soft part of the body caused by using that part too much: ",
                            "examples": [
                                "a groin/hamstring strain"
                            ]
                        },
                        {
                            "explanation": "something that makes you feel nervous and worried: ",
                            "examples": [
                                "She's a lot better than she was but she's still not ready to face the stresses and strains of a job.",
                                "He's been under a lot of strain recently."
                            ]
                        },
                        {
                            "explanation": "a particular type or quality: ",
                            "examples": [
                                "A strain of puritanism runs through all her work."
                            ]
                        },
                        {
                            "explanation": "an animal or plant from a particular group whose characteristics are different in some way from others of the same group: ",
                            "examples": [
                                "Scientists have discovered a new strain of the virus which is much more dangerous."
                            ]
                        },
                        {
                            "explanation": "the sound of music being played or performed: ",
                            "examples": [
                                "I could hear the strains of Mozart in the background."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "streɪn"
                            ],
                            "us": [
                                "streɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to separate liquid food from solid food, especially by pouring it through a utensil with small holes in it: ",
                            "examples": [
                                "Could you strain the vegetables, please.",
                                "The oil in which the fish is fried is strained off and used to cook potatoes."
                            ]
                        },
                        {
                            "explanation": "to become stretched or to experience pressure, or to make something do or experience this: ",
                            "examples": [
                                "I've put on such a lot of weight recently - this dress is straining at the seams.",
                                "I strained a muscle in my back playing squash.",
                                "Don't watch TV in the dark - you'll strain your eyes!",
                                "I really had to strain (= try very hard) to reach those top notes.",
                                "I was straining (my ears) (= listening hard) to hear what they were saying."
                            ]
                        },
                        {
                            "explanation": "to cause too much of something to be used, especially money: ",
                            "examples": [
                                "Increases in wholesale oil prices have strained the company's finances."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}