{
    "word": "straight",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "streɪt"
                            ],
                            "us": [
                                "streɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "continuing in one direction without bending or curving: ",
                            "examples": [
                                "a straight line",
                                "She has straight blonde hair.",
                                "Skirts this summer are long and straight.",
                                "Can't you see it? - it's straight ahead (of you)!",
                                "The dog seemed to be coming straight at/for me.",
                                "Go straight along this road and turn left at the traffic lights."
                            ]
                        },
                        {
                            "explanation": "honest: ",
                            "examples": [
                                "Just be straight with her and tell her how you feel.",
                                "Tell me straight, would you rather we didn't go tonight?"
                            ]
                        },
                        {
                            "explanation": "If you tell someone something straight out, you say it directly and honestly, without trying to make what you are saying more pleasant: ",
                            "examples": [
                                "I told her straight out that I didn't love her any more."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "streɪt"
                            ],
                            "us": [
                                "streɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "immediately: ",
                            "examples": [
                                "I got home and went straight to bed.",
                                "We'll go straight to the party after dinner.",
                                "Time is short so I'll get straight to the point (= explain the matter immediately)."
                            ]
                        },
                        {
                            "explanation": "clearly: ",
                            "examples": [
                                "You know you've had too much to drink when you can't see straight.",
                                "I'm so tired I can't think straight any more."
                            ]
                        },
                        {
                            "explanation": "immediately: ",
                            "examples": [
                                "I knew straight away what you were thinking."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "streɪt"
                            ],
                            "us": [
                                "streɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "clear or not complicated: ",
                            "examples": [
                                "It's a straight choice - either you leave him or you stay.",
                                "Let's get this straight - you're travelling to Frankfurt on Monday and Brussels on Tuesday, is that correct?"
                            ]
                        },
                        {
                            "explanation": "level and not sloping to either side: ",
                            "examples": [
                                "This picture's not straight.",
                                "The shelf isn't straight - it sags in the middle."
                            ]
                        },
                        {
                            "explanation": "plain and basic, or without anything added: ",
                            "examples": [
                                "No tonic for me, please, I like my vodka straight.",
                                "Straight pasta is very bland - you need some kind of sauce to make it interesting."
                            ]
                        },
                        {
                            "explanation": "following one after another without an interruption: ",
                            "examples": [
                                "They're the only team to have won ten straight games this season."
                            ]
                        },
                        {
                            "explanation": "tidy, or arranged in order: ",
                            "examples": [
                                "It only took an hour to get the flat straight after the party.",
                                "Do you have a mirror? - I'll just put my hair straight."
                            ]
                        },
                        {
                            "explanation": "traditional or serious: ",
                            "examples": [
                                "He was a nice enough guy, but he was so straight - I always felt I had to be on my best behaviour with him.",
                                "There's a lot of straight theatre at the festival as well as the newer, more experimental stuff."
                            ]
                        },
                        {
                            "explanation": "sexually or romantically attracted to men if you are a woman, and to women if you are a man: ",
                            "examples": [
                                "I was thirteen when I first suspected that I wasn't straight."
                            ]
                        },
                        {
                            "explanation": "involving or relating to women who are sexually or romantically attracted to men, or men who are sexually or romantically attracted to women: ",
                            "examples": [
                                "She ended her straight marriage and came out as a lesbian."
                            ]
                        },
                        {
                            "explanation": "not using illegal drugs or alcohol: ",
                            "examples": [
                                "He's been straight for five months."
                            ]
                        },
                        {
                            "explanation": "neither owing nor owed any money: ",
                            "examples": [
                                "You bought the tickets, so if I pay for the taxi, we'll be straight."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "streɪt"
                            ],
                            "us": [
                                "streɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the straight part of a racetrack (= the track on which competitors race): ",
                            "examples": [
                                "And the runners are just coming up to the finishing straight."
                            ]
                        },
                        {
                            "explanation": "with a series of hits, throws, or kicks of the ball or a series of actions that produce a perfect score in a game or competition: ",
                            "examples": [
                                "I beat him in the final in straights."
                            ]
                        },
                        {
                            "explanation": "in the card game poker, five cards which follow each other in order but are not of the same suit (= colour and type): ",
                            "examples": [
                                "You want five low cards, no pairs, no straights, no flushes, and the lowest hand wins.",
                                "When the pocket cards were shown, both players had identical straights. "
                            ]
                        },
                        {
                            "explanation": "a person who is not gay",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}