{
    "word": "stream",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "striːm"
                            ],
                            "us": [
                                "striːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "water that flows naturally along a fixed route formed by a channel cut into rock or ground, usually at ground level: ",
                            "examples": [
                                "a mountain stream",
                                "underground streams",
                                "There's a bubbling stream that flows through their property."
                            ]
                        },
                        {
                            "explanation": "any current of water or liquid: ",
                            "examples": [
                                "the level of cholesterol in your blood stream"
                            ]
                        },
                        {
                            "explanation": "the direction in which water is moving: ",
                            "examples": [
                                "She stopped rowing and let the boat float with the stream."
                            ]
                        },
                        {
                            "explanation": "a continuous flow of things or people: ",
                            "examples": [
                                "There has been a steady stream of phone calls from worried customers.",
                                "I had a constant stream of visitors while I was ill."
                            ]
                        },
                        {
                            "explanation": "a group of school students with similar ability who are approximately the same age and are taught together: ",
                            "examples": [
                                "I'm in the A stream for maths, and the B stream for English.",
                                "the top/bottom stream"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "striːm"
                            ],
                            "us": [
                                "striːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to flow somewhere or produce liquid, quickly and in large amounts without stopping: ",
                            "examples": [
                                "There were tears streaming down his face.",
                                "One woman was carried from the scene of the accident with blood streaming from her head.",
                                "I've got a terrible cold and my nose has been streaming all week."
                            ]
                        },
                        {
                            "explanation": "to move continuously in one direction: ",
                            "examples": [
                                "We were all very excited as we streamed out of our final exam."
                            ]
                        },
                        {
                            "explanation": "to send or receive sound or video directly over the internet as a continuous flow: ",
                            "examples": [
                                "On YouTube, millions of videos are streamed every day.",
                                "To pick up this signal, you will need a high-speed internet connection to stream it to your computer."
                            ]
                        },
                        {
                            "explanation": "to group and teach together school students with similar abilities who are approximately the same age: ",
                            "examples": [
                                "In Britain, we start to stream the children in year 10."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}