{
    "word": "stretch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stretʃ"
                            ],
                            "us": [
                                "stretʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause something to reach, often as far as possible, in a particular direction: ",
                            "examples": [
                                "I tripped on a piece of wire that someone had stretched across the path.",
                                "She stretched out her hand and helped him from his chair."
                            ]
                        },
                        {
                            "explanation": "to make your body or your arms and legs straight so that they are as long as possible, in order to exercise the joints (= place where two bones are connected) after you have been in the same place or position for a long time: ",
                            "examples": [
                                "\"I'm so tired,\" she said, yawning and stretching.",
                                "It's a good idea to stretch before you do vigorous exercise."
                            ]
                        },
                        {
                            "explanation": "to spread over a large area or distance: ",
                            "examples": [
                                "A huge cloud of dense smoke stretched across the horizon.",
                                "The Andes stretch for 7,250 km along the west coast of South America.",
                                "Unsettled weather will stretch from the middle Mississippi Valley to the southern Middle Atlantic States.",
                                "The refugee camps stretch as far as the eye can see."
                            ]
                        },
                        {
                            "explanation": "to go as far as or past the usual limit of something: ",
                            "examples": [
                                "Many families' budgets are already stretched to breaking point.",
                                "We can't work any harder, Paul. We're already fully stretched.",
                                "This movie really stretches the patience of the audience to the limit.",
                                "Normally, people under 18 aren't allowed, but I guess we can stretch the rules for you as it's your birthday tomorrow."
                            ]
                        },
                        {
                            "explanation": "to (cause a material to) become longer or wider than usual as a result of pulling at the edges: ",
                            "examples": [
                                "an exercise to stretch the leg muscles",
                                "That elastic band will snap if you stretch it too far.",
                                "This substance stretches to any shape you want."
                            ]
                        },
                        {
                            "explanation": "If a material stretches, it can become longer or wider when pulled and then return to its original size: ",
                            "examples": [
                                "to stretch fabrics"
                            ]
                        },
                        {
                            "explanation": "to spread over a long period of time: ",
                            "examples": [
                                "The dispute stretches back over many years.",
                                "Although we were supposed to finish this month, it looks like the work will stretch well into next year."
                            ]
                        },
                        {
                            "explanation": "to make a process or task continue for a longer period of time than was originally planned: ",
                            "examples": [
                                "I'd like to stretch my mortgage payments out over a longer period if possible."
                            ]
                        },
                        {
                            "explanation": "If jobs or tasks stretch you, they make you learn new things that use your skill and experience more than before: ",
                            "examples": [
                                "My present job doesn't stretch me, so I'm looking for something more demanding."
                            ]
                        },
                        {
                            "explanation": "to use the existing name of a brand (= a type of product or service with a particular name) for new products and services that may not seem related: ",
                            "examples": [
                                "Previous attempts by the pharmacy to stretch the brand into areas such as dentistry and botox have failed.",
                                "He said he wanted to stretch the brand into new areas, from selling electronic goods to operating full-service restaurants in stores."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stretʃ"
                            ],
                            "us": [
                                "stretʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a continuous area of land or water: ",
                            "examples": [
                                "This particular stretch of coast is especially popular with hikers.",
                                "Traffic is at a standstill along a five-mile stretch of the ring-road.",
                                "Some very rare birds inhabit our stretch of the river."
                            ]
                        },
                        {
                            "explanation": "a stage in a race, or a part of a racetrack: ",
                            "examples": [
                                "She looked certain to win as she entered the final stretch.",
                                "He fell as he galloped down the home stretch (= towards the finish)."
                            ]
                        },
                        {
                            "explanation": "an act of stretching: ",
                            "examples": [
                                "I always have a good stretch when I get up in the morning.",
                                "This is a really good stretch for your hip flexors."
                            ]
                        },
                        {
                            "explanation": "the fact that something has gone past its usual limits: ",
                            "examples": [
                                "His idea may be a stretch, but it's not outside the realm of possibility."
                            ]
                        },
                        {
                            "explanation": "the degree to which a material can be made longer or wider by pulling: ",
                            "examples": [
                                "This fabric doesn't have much stretch in it, does it?"
                            ]
                        },
                        {
                            "explanation": "a continuous period of time: ",
                            "examples": [
                                "The elderly generally need far less rest than the young, and tend to sleep in several short stretches."
                            ]
                        },
                        {
                            "explanation": "a period of time that a criminal spends in prison: ",
                            "examples": [
                                "Her brother's doing a ten-year stretch for armed robbery."
                            ]
                        },
                        {
                            "explanation": "continuously or without any interruptions: ",
                            "examples": [
                                "There's no way I could work for ten hours at a stretch."
                            ]
                        },
                        {
                            "explanation": "a job, task, or role that is difficult for someone because it is very different from what they usually do: ",
                            "examples": [
                                "Playing a budding opera star was not much of a stretch for this classically trained singer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}