{
    "word": "stress",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stres"
                            ],
                            "us": [
                                "stres"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "great worry caused by a difficult situation, or something that causes this condition: ",
                            "examples": [
                                "People under a lot of stress may experience headaches, minor pains, and sleeping difficulties.",
                                "Yoga is a very effective technique for combating stress.",
                                "How do you recover from the stresses and strains of the day?",
                                "Massage therapy is good for all stress-related conditions."
                            ]
                        },
                        {
                            "explanation": "a difficult situation caused by too much being needed or expected from a system, resource, etc. : ",
                            "examples": [
                                "The city is finding it hard to cope with stress on its housing supply.",
                                "Adding 32 million people is going to put stresses on all of our systems. ",
                                "Emergency food supplies are under stress as a result of widespread famine and war."
                            ]
                        },
                        {
                            "explanation": "the way that a word or syllable is pronounced with greater force than other words in the same sentence or other syllables in the same word: ",
                            "examples": [
                                "The meaning of a sentence often depends on stress and intonation.",
                                "When \"insert\" is a verb, the stress is on the second syllable, but when it is a noun, the stress is on the first syllable."
                            ]
                        },
                        {
                            "explanation": "a force that acts in a way that often changes the shape of an object: ",
                            "examples": [
                                "Computers work out the stresses that such a craft will encounter in flight.",
                                "Jogging puts a lot of stress on your knee joints."
                            ]
                        },
                        {
                            "explanation": "emphasis: ",
                            "examples": [
                                "During his speech, he laid particular stress on the freedom of the press."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stres"
                            ],
                            "us": [
                                "stres"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give emphasis or special importance to something: ",
                            "examples": [
                                "He is careful to stress (that) the laboratory's safety standards are the best in the country.",
                                "I'd just like to stress the importance of neatness and politeness in this job."
                            ]
                        },
                        {
                            "explanation": "to pronounce a word or syllable with greater force than other words in the same sentence or other syllables in the same word, or to play a musical note with greater force than others in a group: ",
                            "examples": [
                                "In the word \"engine\" you should stress the first syllable."
                            ]
                        },
                        {
                            "explanation": "to feel worried and nervous: ",
                            "examples": [
                                "Don't stress over it - we'll soon get it sorted out."
                            ]
                        },
                        {
                            "explanation": "to make a system, resource, etc. experience difficulties by needing or expecting too much from it: ",
                            "examples": [
                                "You can only stress the system so much before it starts to break down.",
                                "Rural landscapes, stressed by drought, are turning brown."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}