{
    "word": "stripping",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈstrɪp.ɪŋ"
                            ],
                            "us": [
                                "ˈstrɪp.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of removing something from somewhere: ",
                            "examples": [
                                "Logging companies were guilty of the stripping of jungle mountains and plains of their natural cover.",
                                "the stripping of the bark from cork oak trees ",
                                "A heat gun is useful if you do a lot of paint stripping."
                            ]
                        },
                        {
                            "explanation": "the act of removing everything that is not part of the structure of a room or building: ",
                            "examples": [
                                "The stripping of the kitchen, and disposal of all units and appliances, was included in the quoted price."
                            ]
                        },
                        {
                            "explanation": "the act of taking something away from someone, usually as a form of punishment: ",
                            "examples": [
                                "The new Act proposed various sanctions, including the stripping of citizenship from Americans. ",
                                "Positive drug tests would lead to retroactive disqualifications, including stripping of any medals, and two-year bans."
                            ]
                        },
                        {
                            "explanation": "the act of taking off all of your clothes, or of taking off all of another person's clothes: ",
                            "examples": [
                                "Everyone has to go through the process of stripping and showering before they can have any contact with the test animals.",
                                "No stripping off was involved — everyone remained fully clothed at all times.",
                                "The report listed a number of abuses including the repeated stripping of prisoners as a punishment. "
                            ]
                        },
                        {
                            "explanation": "the activity or job of taking off your clothes in public in a sexually exciting way, as a form of entertainment: ",
                            "examples": [
                                "She wrote an article about her year as a stripper, and described stripping as a branch of show business.",
                                "Not everyone is suited to a career in stripping."
                            ]
                        },
                        {
                            "explanation": "material in the form of a strip that is placed around something in order to protect it: ",
                            "examples": [
                                "Ways to deter slugs include copper stripping around young shoots or crushed eggshells on the nearby ground. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nstrip  ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}