{
    "word": "stroke",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "strəʊk"
                            ],
                            "us": [
                                "stroʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a sudden change in the blood supply to a part of the brain, sometimes causing a loss of the ability to move particular parts of the body: ",
                            "examples": [
                                "She suffered/had a stroke that left her unable to speak."
                            ]
                        },
                        {
                            "explanation": "(a line or mark made by) a movement of a pen or pencil when writing or a brush when painting: ",
                            "examples": [
                                "a brush stroke",
                                "With a few bold strokes, she signed her name."
                            ]
                        },
                        {
                            "explanation": "used in spoken English to mean an oblique or slash symbol",
                            "examples": []
                        },
                        {
                            "explanation": "an act of hitting a ball when playing a sport: ",
                            "examples": [
                                "She returned the volley with a powerful stroke to win the game."
                            ]
                        },
                        {
                            "explanation": "an act of hitting someone with a weapon: ",
                            "examples": [
                                "The punishment was 20 strokes of the lash."
                            ]
                        },
                        {
                            "explanation": "(a particular movement that is usually repeated in) a method of swimming: ",
                            "examples": [
                                "What's your best stroke when you're swimming?"
                            ]
                        },
                        {
                            "explanation": "something that happens or succeeds suddenly because of luck, intelligence, etc.: ",
                            "examples": [
                                "By a stroke of luck, someone else was walking along the trail and heard my shouts for help."
                            ]
                        },
                        {
                            "explanation": "a small amount of work: ",
                            "examples": [
                                "She's been gossiping and hasn't done a stroke (of work) all morning."
                            ]
                        },
                        {
                            "explanation": "a quick, forceful action: ",
                            "examples": [
                                "Ending negotiations was seen as a bold stroke by many commentators.",
                                "By computerizing we could, at a (single)/in one stroke, improve efficiency and reduce costs."
                            ]
                        },
                        {
                            "explanation": "one of the sounds that some clocks make at particular times, especially by ringing a bell once for each number of the hour: ",
                            "examples": [
                                "How many strokes did you count?"
                            ]
                        },
                        {
                            "explanation": "an act of moving your hand, another part of the body, or an object gently over something or someone, usually repeatedly and for pleasure: ",
                            "examples": [
                                "Don't be frightened, just give the horse a stroke."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "strəʊk"
                            ],
                            "us": [
                                "stroʊk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move a hand, another part of the body, or an object gently over something or someone, usually repeatedly and for pleasure: ",
                            "examples": [
                                "Stroke the dog if you want, he won't bite.",
                                "She lovingly stroked Chris's face with the tips of her fingers."
                            ]
                        },
                        {
                            "explanation": "to hit a ball: ",
                            "examples": [
                                "The batsman stroked the ball effortlessly to the boundary."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}