{
    "word": "strong",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "strɒŋ"
                            ],
                            "us": [
                                "strɑːŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "powerful; having or using great force or control: ",
                            "examples": [
                                "She must be very strong to carry such a weight on her back.",
                                "It is surely the duty of the stronger members in a society to help those who are weak.",
                                "My grandmother had a strong influence/effect on my early childhood.",
                                "Strong winds are forecast in the area for the next few days.",
                                "It's surprising what strong memories a photograph can produce.",
                                "Get Carl to lift it - he's as strong as an ox (= very strong)."
                            ]
                        },
                        {
                            "explanation": "effective; of a good quality or level and likely to be successful: ",
                            "examples": [
                                "We will need strong policies if our economic problems are to be solved.",
                                "I can give you stronger pain-killing drugs if these aren't strong enough.",
                                "Strong trading links exist between us and many South American countries."
                            ]
                        },
                        {
                            "explanation": "skilled or good at doing something: ",
                            "examples": [
                                "Without a doubt, she's the strongest candidate we've interviewed for the job.",
                                "As a guitarist, he's strong on (= good at) technique but lacks feeling in some pieces."
                            ]
                        },
                        {
                            "explanation": "difficult to argue with; firm and determined: ",
                            "examples": [
                                "She has strong opinions about religion.",
                                "He has a strong personality, but don't let him bully you.",
                                "Most of the group have strong views on the subject of divorce."
                            ]
                        },
                        {
                            "explanation": "If a taste, smell, etc. is strong, it is very noticeable or powerful: ",
                            "examples": [
                                "A strong light was shining straight in my eyes.",
                                "There's a really strong smell of bleach in the corridor.",
                                "This coffee is too strong for me.",
                                "The room was decorated in very strong colours.",
                                "What a strong likeness there is between the brothers!"
                            ]
                        },
                        {
                            "explanation": "difficult to break, destroy, or make sick, or able to support a heavy weight or force: ",
                            "examples": [
                                "a strong box/chair",
                                "The window is made from very strong glass - it won't shatter.",
                                "It's a serious disease, but he's very strong - I think he'll pull through."
                            ]
                        },
                        {
                            "explanation": "expressing something in a forceful way, without trying not to offend people: ",
                            "examples": [
                                "He used very strong words about the way the federal officials had behaved. ",
                                "The manager had some strong words to say about the team's defensive play.",
                                "She said that she condemned their actions in the strongest terms."
                            ]
                        },
                        {
                            "explanation": "language that expresses something in a forceful way, without trying not to offend people: ",
                            "examples": [
                                "The State Department also used strong language to deny a US policy shift. "
                            ]
                        },
                        {
                            "explanation": "language that uses a lot of swear words (= rude or offensive words): ",
                            "examples": [
                                "The movie is rated PG for strong language."
                            ]
                        },
                        {
                            "explanation": "very likely to happen: ",
                            "examples": [
                                "There's a strong possibility/likelihood of finding the child within the next few hours.",
                                "The treatment's chances of success are stronger if it is started as soon as the disease is diagnosed."
                            ]
                        },
                        {
                            "explanation": "having the stated number of people, members, etc.: ",
                            "examples": [
                                "The crowd had grown to be several hundred strong."
                            ]
                        },
                        {
                            "explanation": "A strong acid, alkali, or chemical base produces many ions (= atoms with an electrical charge) when it is dissolved in water.",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "strɒŋ"
                            ],
                            "us": [
                                "strɑːŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to behave towards another person in a way that is too severe, or that shows a strong sexual interest that the other person does not want: ",
                            "examples": [
                                "I think you came on a bit strong - it wasn't her fault."
                            ]
                        },
                        {
                            "explanation": "to make an extra effort in order to be successful or to have control in a situation: ",
                            "examples": [
                                "He came on strong in the early rounds to annihilate the competition."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}