{
    "word": "strop",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "strɒp"
                            ],
                            "us": [
                                "strɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a strip of leather or other material that you can rub an old-fashioned razor, knife, etc. on in order to make the blade sharp : ",
                            "examples": [
                                "Use a strop to maintain a sharp edge on your knives and cutting tools.",
                                "a razor strop"
                            ]
                        },
                        {
                            "explanation": "a length of rope, etc., formed into a ring at the end, that is used, for example, for supporting something heavy when it is being moved, or for tying a boat up so that it does not float away: ",
                            "examples": [
                                "The crane was in position, the strops were on, and the boat was lifted high and then lowered gently onto the waiting low-loader.",
                                "The mooring strop allows boats to be moored to buoys."
                            ]
                        },
                        {
                            "explanation": "a bad mood, especially one in which a person will not do as they are asked and is unpleasant to other people: ",
                            "examples": [
                                "Don't go in unless you have to - she's in a (real) strop.",
                                "He's impossible to talk to when he's having one of his strops.",
                                "When she didn't get what she wanted she threw a strop."
                            ]
                        },
                        {
                            "explanation": "to be in a bad mood: ",
                            "examples": [
                                "Why have you got such a strop on - what's happened?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "strɒp"
                            ],
                            "us": [
                                "strɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a blade, etc. sharp by rubbing it on a strip of leather or other material: ",
                            "examples": [
                                "The barber's customers miss the familiar sound of a cut-throat blade being stropped on a leather strap."
                            ]
                        },
                        {
                            "explanation": "to act or go somewhere in a way that shows you are in a bad mood and angry with other people: ",
                            "examples": [
                                "She muttered goodbye and stropped off home.",
                                "All he does is strop around with a grumpy face, complaining about everything."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}