{
    "word": "struggle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈstrʌɡ.əl"
                            ],
                            "us": [
                                "ˈstrʌɡ.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to experience difficulty and make a very great effort in order to do something: ",
                            "examples": [
                                "The dog had been struggling to get free of the wire noose.",
                                "I've been struggling to understand this article all afternoon.",
                                "Fish struggle for survival when the water level drops in the lake."
                            ]
                        },
                        {
                            "explanation": "to move somewhere with great effort: ",
                            "examples": [
                                "He struggled along the rough road holding his son.",
                                "By this time he'd managed to struggle out of bed."
                            ]
                        },
                        {
                            "explanation": "to be in danger of failing or being defeated: ",
                            "examples": [
                                "After the first half, United were really struggling."
                            ]
                        },
                        {
                            "explanation": "to fight, especially with your hands: ",
                            "examples": [
                                "He struggled with his attacker who then ran away."
                            ]
                        },
                        {
                            "explanation": "to use a lot of effort to defeat someone, prevent something, or achieve something: ",
                            "examples": [
                                "For years she struggled with/against the establishment to get her theories accepted."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈstrʌɡ.əl"
                            ],
                            "us": [
                                "ˈstrʌɡ.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a very difficult task that you can do only by making a great effort: ",
                            "examples": [
                                "It was a terrible struggle for him to accept her death.",
                                "The people of this country will continue in their struggle for independence.",
                                "She never gave up the struggle to have her son freed from prison.",
                                "It's going to be an uphill struggle (= very difficult) to get your ideas accepted."
                            ]
                        },
                        {
                            "explanation": "a physical or mental fight: ",
                            "examples": [
                                "a struggle with an armed robber",
                                "the struggle between good and evil",
                                "Clearly there will be a power struggle within the company."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}