{
    "word": "structured",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈstrʌk.tʃəd"
                            ],
                            "us": [
                                "ˈstrʌk.tʃɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "organized so that the parts relate well to each other; having a clear structure: ",
                            "examples": [
                                "In today's competitive climate, success is most likely to come to those who understand the need for a structured approach to job hunting.",
                                "The course provides hands-on experience within a structured programme of study.",
                                "These product reviews are highly structured so that it is easy to make comparisons. "
                            ]
                        },
                        {
                            "explanation": "Structured financial products are designed to be suitable for the particular needs of the person or organization lending or borrowing money, and usually consist of a range of different choices: ",
                            "examples": [
                                "The company did not insure complicated structured products such as bonds backed by mortgages and credit card receipts.",
                                "Until the crisis at least half of the lending in the market consisted of structured credit."
                            ]
                        },
                        {
                            "explanation": "Structured clothes have a definite shape and do not hang loosely: ",
                            "examples": [
                                "Update your wardrobe with a structured jacket. They slim the body and look great over dresses.",
                                "Structured clothes have a distinct shape, and will help you look elegant."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}