{
    "word": "stuff",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "stʌf"
                            ],
                            "us": [
                                "stʌf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a substance, especially when you do not know or say exactly what it is: ",
                            "examples": [
                                "There's sticky stuff all over the chair.",
                                "What's this black stuff?",
                                "He drinks gallons of tea - he loves the stuff."
                            ]
                        },
                        {
                            "explanation": "things that someone says or does, when you are referring to them in a general way without saying exactly what they are: ",
                            "examples": [
                                "All that stuff she has been saying about Lee is just not true.",
                                "We did some really interesting stuff today.",
                                "I have to go now - I've got stuff to do.",
                                "I've read all her books - I really like her stuff."
                            ]
                        },
                        {
                            "explanation": "someone's possessions or things that they take somewhere with them: ",
                            "examples": [
                                "We'll have to carry all our camping stuff.",
                                "Do you want help bringing your stuff in from the van?",
                                "We can't move to a smaller place - we've got too much stuff."
                            ]
                        },
                        {
                            "explanation": "used to refer to more things of a similar kind to ones you have mentioned, when you do not say exactly what they are: ",
                            "examples": [
                                "This is the drawer where I keep paper and envelopes and stuff.",
                                "The classrooms all have computers and interactive whiteboards and stuff.",
                                "I was embarrassed because he wanted to talk about love and stuff."
                            ]
                        },
                        {
                            "explanation": "someone's skill or great abilities: ",
                            "examples": [
                                "Avery had great stuff, total command of all three of his pitches.",
                                "An interview is a chance to show your stuff."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "stʌf"
                            ],
                            "us": [
                                "stʌf"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to completely fill a container with something: ",
                            "examples": [
                                "Stuff the pillow and then sew up the final seam.",
                                "Under her bed, they found a bag stuffed with money."
                            ]
                        },
                        {
                            "explanation": "to push something into a small space, often quickly or in a careless way: ",
                            "examples": [
                                "This suitcase is absolutely full - I can't stuff another thing into it."
                            ]
                        },
                        {
                            "explanation": "to fill the body of a dead animal with special material so that it looks as if it is still alive",
                            "examples": []
                        },
                        {
                            "explanation": "(of a man) to have sex with a woman",
                            "examples": []
                        },
                        {
                            "explanation": "to fill food with stuffing: ",
                            "examples": [
                                "Stuff the turkey, then put it into a pre-heated oven."
                            ]
                        },
                        {
                            "explanation": "to eat a lot: ",
                            "examples": [
                                "They'd been stuffing themselves with snacks all afternoon, so they didn't want any dinner."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}