{
    "word": "subject",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsʌb.dʒekt"
                            ],
                            "us": [
                                "ˈsʌb.dʒekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the thing that is being discussed, considered, or studied: ",
                            "examples": [
                                "Our subject for discussion is homelessness.",
                                "She has made a series of documentaries on the subject of family relationships.",
                                "The guest lecturer took as her subject (= decided to speak about) \"punishment and imprisonment in modern society\".",
                                "The number of planes flying over the town has been the subject of (= has caused) concern since last summer."
                            ]
                        },
                        {
                            "explanation": "an area of knowledge that is studied in school, college, or university: ",
                            "examples": [
                                "My favourite subjects at school were history and English.",
                                "Her subject (= special area of study) is low-temperature physics."
                            ]
                        },
                        {
                            "explanation": "to start talking about a different subject: ",
                            "examples": [
                                "I'd tried to explain the situation, but he just changed the subject."
                            ]
                        },
                        {
                            "explanation": "a person, thing, or situation that is written about in a book, article, etc. or shown in a picture, etc.: ",
                            "examples": [
                                "The mill by the bridge was the subject of an unfinished painting by J. M. W. Turner."
                            ]
                        },
                        {
                            "explanation": "the person or thing that performs the action of a verb, or is joined to a description by a verb: ",
                            "examples": [
                                "\"Bob\" is the subject of the sentence \"Bob threw the ball.\""
                            ]
                        },
                        {
                            "explanation": "a person who lives in or who has the right to live in a particular country, especially a country with a king or queen: ",
                            "examples": [
                                "He is a British subject."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "səbˈdʒekt"
                            ],
                            "us": [
                                "səbˈdʒekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to defeat people or a country and then control them against their wishes and limit their freedom: ",
                            "examples": [
                                "The invaders quickly subjected the local tribes."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈsʌb.dʒekt"
                            ],
                            "us": [
                                "ˈsʌb.dʒekt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have or experience a particular thing, especially something unpleasant: ",
                            "examples": [
                                "Cars are subject to a high domestic tax."
                            ]
                        },
                        {
                            "explanation": "only able to happen if something else happens: ",
                            "examples": [
                                "We plan to go on Wednesday, subject to your approval."
                            ]
                        },
                        {
                            "explanation": "under the political control of another country or state: ",
                            "examples": [
                                "subject peoples/states"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}