{
    "word": "substitute",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈsʌb.stɪ.tʃuːt"
                            ],
                            "us": [
                                "ˈsʌb.stə.tuːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use something or someone instead of another thing or person: ",
                            "examples": [
                                "You can substitute oil for butter (= use oil instead of butter) in this recipe.",
                                "You can substitute the wheat flour with almond flour (= use almond flour instead of wheat flour).",
                                "He made his film debut when he was substituted for the actor who was originally cast.",
                                "I took out the words \"he\" and \"his\" and substituted them with \"they\" and \"their\"."
                            ]
                        },
                        {
                            "explanation": "to perform the same job as another thing or person or to take their place: ",
                            "examples": [
                                "Gas-fired power stations will substitute for less efficient coal-fired equipment."
                            ]
                        },
                        {
                            "explanation": "in sports, to use a player for part of a game after removing another player from the game: ",
                            "examples": [
                                "Ronaldo was substituted early in the second half.",
                                "Dayton was substituted for Williams in the second half of the game.",
                                "I don't know why the coach substituted me."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈsʌb.stɪ.tʃuːt"
                            ],
                            "us": [
                                "ˈsʌb.stə.tuːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a thing or person that is used instead of another thing or person: ",
                            "examples": [
                                "Tofu can be used as a meat substitute in vegetarian recipes.",
                                "Vitamins should not be used as a substitute for a healthy diet."
                            ]
                        },
                        {
                            "explanation": "in sports, a player who is used for part of a game instead of another player: ",
                            "examples": [
                                "Johnson came on as a substitute towards the end of the game.",
                                "The manager brought on another substitute in the final minutes of the game."
                            ]
                        },
                        {
                            "explanation": "nothing is as good as the stated thing: ",
                            "examples": [
                                "You can read about other countries, but there's no substitute for visiting them yourself."
                            ]
                        },
                        {
                            "explanation": "a \nsubstitute teacher ",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}