{
    "word": "suit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "suːt",
                                "sjuːt"
                            ],
                            "us": [
                                "suːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a jacket and trousers or a jacket and skirt that are made from the same material: ",
                            "examples": [
                                "All the businessmen were wearing pinstripe suits.",
                                "She wore a dark blue suit."
                            ]
                        },
                        {
                            "explanation": "a set of clothes or a piece of clothing to be worn in a particular situation or while doing a particular activity: ",
                            "examples": [
                                "a diving/protective/ski, etc. suit",
                                "a swimsuit",
                                "a spacesuit",
                                "a suit of armour"
                            ]
                        },
                        {
                            "explanation": "a problem taken to a law court by an ordinary person or an organization rather than the police in order to obtain a legal decision: ",
                            "examples": [
                                "He brought (US also filed) a $12 million libel suit against the newspaper, claiming his reputation had been damaged.",
                                "a malpractice/negligence/paternity suit"
                            ]
                        },
                        {
                            "explanation": "any of the four types of card in a set of playing cards, each having a different shape printed on it: ",
                            "examples": [
                                "The four suits in a pack of cards are hearts, spades, clubs, and diamonds."
                            ]
                        },
                        {
                            "explanation": "a man who works in an office and wears a suit, especially a man with a high position in a company who is considered not to have human feelings and good ideas",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "suːt",
                                "sjuːt"
                            ],
                            "us": [
                                "suːt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be right for a particular person, situation, or occasion: ",
                            "examples": [
                                "A lot of corn is grown in this area - the soil seems to suit it very well.",
                                "The city lifestyle seems to suit her - she looks great."
                            ]
                        },
                        {
                            "explanation": "(usually of a colour or style of clothes) to make someone look more attractive: ",
                            "examples": [
                                "You should wear more red - it suits you.",
                                "Short skirts don't really suit me - I don't have the legs for them."
                            ]
                        },
                        {
                            "explanation": "to be convenient and cause the least difficulty for someone: ",
                            "examples": [
                                "We could go now or this afternoon - whatever time suits you best.",
                                "\"How about eight o'clock at the cinema?\" \"That suits me fine.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}