{
    "word": "super-conservative",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˌsuː.pə.kənˈsɜː.və.tɪv"
                            ],
                            "us": [
                                "ˌsuː.pɚ.kənˈsɝː.və.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "Actions or decisions that are super-conservative are made extremely carefully, without taking any risks: ",
                            "examples": [
                                "The currency is a super-conservative investment with good potential for growth.",
                                "Investments in the stock market can be either very risky or superconservative.",
                                "We have a super conservative budget for the project."
                            ]
                        },
                        {
                            "explanation": "A super-conservative guess or calculation is likely to be much less than the real amount. : ",
                            "examples": [
                                "I'm going to be superconservative and assume that sales growth will slow down this year."
                            ]
                        },
                        {
                            "explanation": "strongly disliking or not trusting change, especially sudden change: ",
                            "examples": [
                                "Our parents were superconservative with very strict rules.",
                                "Her family is super-conservative and didn't approve of their marriage."
                            ]
                        },
                        {
                            "explanation": "strongly supporting business and opposing high taxes and government involvement in industry, or strongly supporting a political party that believes in these ideas: ",
                            "examples": [
                                "She is a registered Republican, but is not super conservative.",
                                "The soldiers mostly come from poor, super-conservative areas of the country."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌsuː.pə.kənˈsɜː.və.tɪv"
                            ],
                            "us": [
                                "ˌsuː.pɚ.kənˈsɝː.və.t̬ɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "someone who strongly supports business and opposes high taxes and government involvement in industry, or who supports a political party that believes in these ideas. Super-conservatives often also support traditional ideas about family, behaviour, punishment, etc. : ",
                            "examples": [
                                "He was a superconservative who opposed divorce. ",
                                "He seemed to become a superconservative overnight."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}