{
    "word": "supply",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "səˈplaɪ"
                            ],
                            "us": [
                                "səˈplaɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to provide something that is wanted or needed, often in large quantities and over a long period of time: ",
                            "examples": [
                                "Electrical power is supplied by underground cables.",
                                "Three people have been arrested for supplying arms to the terrorists.",
                                "The company has supplied the royal family (= provided them with something they need) for years.",
                                "At the beginning of termthe semester, students are supplied with a list of books that they are expected to read."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "səˈplaɪ"
                            ],
                            "us": [
                                "səˈplaɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an amount of something that is available for use: ",
                            "examples": [
                                "Whenever she goes out with her baby, she always takes a large supply of baby food with her.",
                                "In the capital, demand for cheap housing far outstrips supply (= what is provided)."
                            ]
                        },
                        {
                            "explanation": "food or other things necessary for living: ",
                            "examples": [
                                "The refugees are urgently in need of food and medical supplies."
                            ]
                        },
                        {
                            "explanation": "an amount of something available: ",
                            "examples": [
                                "Extensive mining has reduced the supplies of coal in the area."
                            ]
                        },
                        {
                            "explanation": "the system used for supplying gas, electricity, etc. to people: ",
                            "examples": [
                                "Someone has turned off the electricity supply."
                            ]
                        },
                        {
                            "explanation": "If something is in short supply, there is little of it available: ",
                            "examples": [
                                "Strawberries are in short supply this summer."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}