{
    "word": "suppose",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "səˈpəʊz"
                            ],
                            "us": [
                                "səˈpoʊz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to think that something is likely to be true: ",
                            "examples": [
                                "Dan didn't answer his phone, so I suppose (that) he's busy.",
                                "He found it a lot more difficult to get a job than he supposed it would be.",
                                "Do you suppose (that) Gillian will marry him?",
                                "It is widely supposed (that) the CEO will be forced to resign.",
                                "We all supposed him to be German, but in fact he was Swiss.",
                                "Her new book is supposed to be (= generally people think it is) very good."
                            ]
                        },
                        {
                            "explanation": "used to show that you think something is true, although you wish that it were not: ",
                            "examples": [
                                "I suppose (that) all the tickets will be sold by now."
                            ]
                        },
                        {
                            "explanation": "used when you are annoyed: ",
                            "examples": [
                                "I suppose (that) you're going to be late again.",
                                "I suppose (that) you think that's funny. Well, I certainly don't."
                            ]
                        },
                        {
                            "explanation": "used to show unwillingness to agree: ",
                            "examples": [
                                "\"Can I go out tonight?\" \"Oh, I suppose so.\"",
                                "I don't agree with it, but I suppose (that) it's for the best."
                            ]
                        },
                        {
                            "explanation": "used in making polite requests: ",
                            "examples": [
                                "I don't suppose (that) you could lend me £5 till tomorrow?"
                            ]
                        },
                        {
                            "explanation": "to expect and need: ",
                            "examples": [
                                "Investment of this kind supposes (= would not be possible without) an increase in the company's profits this year."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "conjunction",
                        "ipa": {
                            "uk": [
                                "səˈpəʊz"
                            ],
                            "us": [
                                "səˈpoʊz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used at the beginning of a sentence or clause to mean 'what would happen if': ",
                            "examples": [
                                "Suppose we miss the train - what will we do then?",
                                "We'd love to come and see you on Saturday, supposing (= if) I don't have to work that day."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}