{
    "word": "support",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "səˈpɔːt"
                            ],
                            "us": [
                                "səˈpɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to agree with and give encouragement to someone or something because you want him, her, or it to succeed: ",
                            "examples": [
                                "My father supported the Labour Party all his life.",
                                "The majority of people in the town strongly support the plans to build a new school.",
                                "I think it's important to support local businesses by buying locally.",
                                "We will always do our best to support our students to succeed."
                            ]
                        },
                        {
                            "explanation": "If you support a sports team or a sports player, you want them to win, and might show it by going to watch them play: ",
                            "examples": [
                                "Which team do you support?"
                            ]
                        },
                        {
                            "explanation": "to help someone emotionally or in a practical way: ",
                            "examples": [
                                "Alcoholics Anonymous is a group which supports people who are trying to stop drinking too much alcohol.",
                                "My family has always supported me in whatever I've wanted to do."
                            ]
                        },
                        {
                            "explanation": "to give a person the money they need in order to buy food and clothes and pay for somewhere to live: ",
                            "examples": [
                                "He has a wife and four children to support."
                            ]
                        },
                        {
                            "explanation": "If you support an activity or a habit, you provide the money needed to pay for it: ",
                            "examples": [
                                "The drug company is supporting cancer research.",
                                "I don't know how they manage to support their expensive lifestyle.",
                                "Some drug addicts turn to crime in order to support their habit."
                            ]
                        },
                        {
                            "explanation": "to provide the right conditions, such as enough food and water, for life: ",
                            "examples": [
                                "The land is so poor here that it cannot support any crops."
                            ]
                        },
                        {
                            "explanation": "to hold something firmly or carry its weight, especially from below to stop it from falling: ",
                            "examples": [
                                "The church dome is supported by/on marble pillars.",
                                "When babies first learn to stand, they hold on to something to support themselves (= to stop themselves from falling).",
                                "My ankle is weak, so I always put a bandage on it to support it when I play tennis.",
                                "The Bank of England has taken measures to support the pound (= to stop it from being reduced in value)."
                            ]
                        },
                        {
                            "explanation": "to help to show something to be true: ",
                            "examples": [
                                "These figures support my argument.",
                                "You can't make a statement like that without any supporting documentation."
                            ]
                        },
                        {
                            "explanation": "to accept something and allow it to happen: ",
                            "examples": [
                                "The headteacher told the boys that he would not support that kind of behaviour."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "səˈpɔːt"
                            ],
                            "us": [
                                "səˈpɔːrt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "agreement with and encouragement for an idea, group, or person: ",
                            "examples": [
                                "Environmental groups are fast gaining support among young people.",
                                "We've succeeded in drumming up a lot of local support for our attempt to stop the superstore being built.",
                                "I signed a petition in support of the campaign to end the marketing of baby formula in developing countries."
                            ]
                        },
                        {
                            "explanation": "emotional or practical help: ",
                            "examples": [
                                "Liz gave me a lot of support when I lost my job.",
                                "You've been a great support to my mum in this difficult time."
                            ]
                        },
                        {
                            "explanation": "the money someone needs in order to buy food and clothes and pay for somewhere to live: ",
                            "examples": [
                                "He is dependent on his father for support ."
                            ]
                        },
                        {
                            "explanation": "something that holds something firmly or carries its weight, especially from below to stop it from falling: ",
                            "examples": [
                                "The floor is held up by wooden supports.",
                                "I've hurt my wrist, so I've bandaged it to give it some support."
                            ]
                        },
                        {
                            "explanation": "a device worn to hold part of the body, especially a weak part, firmly in position: ",
                            "examples": [
                                "Jim always wears a knee support when he goes running."
                            ]
                        },
                        {
                            "explanation": "something that shows that a fact is true: ",
                            "examples": [
                                "This new evidence lends support to the theory that she was murdered.",
                                "We had to send a doctor's report in support of our claim to the insurance company."
                            ]
                        },
                        {
                            "explanation": "a performer or band (= group of musicians) that performs before the main one in a concert or other performance: ",
                            "examples": [
                                "The band toured Australia in December 2001 as the support for Judas Priest.",
                                "The concert will start at 8pm prompt and there is no support. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}