{
    "word": "swallowed",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nswallow ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈswɒl.əʊ"
                            ],
                            "us": [
                                "ˈswɑː.loʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause food, drink, pills, etc. to move from your mouth into your stomach by using the muscles of your throat: ",
                            "examples": [
                                "My throat is so sore that it really hurts when I swallow.",
                                "He put a grape into his mouth and swallowed it whole."
                            ]
                        },
                        {
                            "explanation": "to use the muscles of your throat, as if moving something from your mouth into your stomach, because you are nervous or frightened, or are about to say something: ",
                            "examples": [
                                "He swallowed hard and said, \"Dad, I have something to tell you.\""
                            ]
                        },
                        {
                            "explanation": "If something large swallows (up) another thing, it makes it disappear or stop existing separately by making it part of itself: ",
                            "examples": [
                                "An increasing amount of the countryside is being swallowed (up) by the town.",
                                "Many small businesses have been swallowed (up) by large companies."
                            ]
                        },
                        {
                            "explanation": "to use or take away a large part of something valuable: ",
                            "examples": [
                                "Taxes have swallowed up nearly half of my pay increase."
                            ]
                        },
                        {
                            "explanation": "to accept something without question or without expressing disagreement: ",
                            "examples": [
                                "Not surprisingly, this excuse was too much for them to swallow.",
                                "He swallowed her story whole.",
                                "She swallowed his sales pitch hook, line, and sinker (= believed it completely)."
                            ]
                        },
                        {
                            "explanation": "to not express or show something: ",
                            "examples": [
                                "She swallowed her disappointment, saying, \"That's OK, it doesn't matter.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}