{
    "word": "swash",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "swɒʃ"
                            ],
                            "us": [
                                "swɑːʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a narrow area of water in a sandbank or between the sandbank and the shore: ",
                            "examples": [
                                "The areas that would be affected the most would be low-lying places that are already prone to flooding now - such as some of the swashes at Garden City Beach."
                            ]
                        },
                        {
                            "explanation": "the movement of liquid, especially the water that moves up a beach as a wave comes in, or the sound that it makes: ",
                            "examples": [
                                "They studied the entire range of waves in shallow water from breakers to swash.",
                                "When a wave breaks, water is washed up the beach and this is known as the swash."
                            ]
                        },
                        {
                            "explanation": "an extra line that is added to a letter or other symbol when it is written or printed, to make it look more impressive: ",
                            "examples": [
                                "Swashes were inspired by handwriting and were used as decorative elements.",
                                "Swash characters are decorative letters that have an extended stroke, usually at their beginning or end."
                            ]
                        },
                        {
                            "explanation": "confident and brave behaviour, like that of a fighter in the past: ",
                            "examples": [
                                "You could not ask for a better actor to play Lancelot - he's full of swash and bold self-confidence."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "swɒʃ"
                            ],
                            "us": [
                                "swɑːʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(of liquid, especially water flowing up or down a beach) to move: ",
                            "examples": [
                                "It was a sound rather like that of the sea swashing back over pebbles."
                            ]
                        },
                        {
                            "explanation": "to move like liquid, or to make something move like liquid: ",
                            "examples": [
                                "The passengers on the boat swashed from side to side.",
                                "The candle fell to the floor, swashing hot wax over my dress."
                            ]
                        },
                        {
                            "explanation": "to move your arm, or something that you are holding in your hand, in a powerful and uncontrolled way, in order to hit something: ",
                            "examples": [
                                "He swashed at the ball but missed."
                            ]
                        },
                        {
                            "explanation": "to fight with a sword in a confident way, like a fighter in the past: ",
                            "examples": [
                                "The actor Errol Flynn swashed on screen like no other of his time.",
                                "On the Pirates of the Caribbean ride little boats glide around a series of caves where 100 animatronic figures swash and buckle their way through a piece of harmless fun."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}