{
    "word": "swastika",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈswɒs.tɪ.kə"
                            ],
                            "us": [
                                "ˈswɑː.stɪ.kə"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a symbol in the form of a cross with each of its arms bent at a 90° angle halfway along, used as the symbol of the Nazi party and by people who support the ideas of the Nazi party, particularly antisemitism (= cruel and unfair treatment of Jewish people) and white supremacy (= the belief that white people are better than people of other races): ",
                            "examples": [
                                "Since its adoption by the National Socialist Party of Adolf Hitler, the swastika has been associated with Nazism, fascism, racism, and white supremacy.",
                                "The display of swastikas and other Nazi symbols is prohibited in Germany.",
                                "Four people were accused of hate crimes after swastikas and racial epithets were found painted on the walls of the school."
                            ]
                        },
                        {
                            "explanation": "a symbol in the form of a cross with each of its arms bent at a 90° angle halfway along, used as a religious symbol or symbol of good luck in some cultures and religions, including Hinduism, Buddhism and Jainism: ",
                            "examples": [
                                "It might be disconcerting to see the swastika motif on these textiles, but in Bhutanese Buddhism, this symbol means eternity.",
                                "In India, the right-angled swastika is commonly seen as a sign of good luck.",
                                "The word swastika comes from a Sanskrit word meaning a lucky or auspicious object."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}