{
    "word": "sweat",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "swet"
                            ],
                            "us": [
                                "swet"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the clear, salty liquid that you pass through your skin: ",
                            "examples": [
                                "The dancers were dripping with/pouring with sweat after a morning's rehearsal.",
                                "By the time we'd climbed to the top of the hill, we were covered in sweat.",
                                "She wiped the beads (= drops) of sweat from her forehead.",
                                "The cathedral was built by human toil and sweat (= effort)."
                            ]
                        },
                        {
                            "explanation": "a loose top and trousers, worn either by people who are training for a sport or exercising, or as informal clothing: ",
                            "examples": [
                                "Sweats are certainly comfortable, but you can get bored with wearing them every day."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "swet"
                            ],
                            "us": [
                                "swet"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to pass sweat through the skin because you are hot, ill, or frightened: ",
                            "examples": [
                                "It was so hot when we arrived in Tripoli that we started to sweat as soon as we got off the plane.",
                                "The prisoners were sweating with fear.",
                                "I was so afraid, I was sweating like a pig (= sweating a lot)."
                            ]
                        },
                        {
                            "explanation": "If something sweats, it produces drops of liquid on the outside: ",
                            "examples": [
                                "The walls in older houses sometimes sweat with damp."
                            ]
                        },
                        {
                            "explanation": "to work very hard to achieve something: ",
                            "examples": [
                                "Volunteers sweated to get the room ready for the dance."
                            ]
                        },
                        {
                            "explanation": "to worry about something: ",
                            "examples": [
                                "He is a great boss, focused on managing the big picture and rarely sweating the details."
                            ]
                        },
                        {
                            "explanation": "used to tell someone not to worry about something: ",
                            "examples": [
                                "Can't make the gig? Don't sweat it; you'll have plenty more chances."
                            ]
                        },
                        {
                            "explanation": "to worry about things that are not important: ",
                            "examples": [
                                "Be positive, don't sweat the small stuff, and stop doing things you don't like."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}