{
    "word": "sync",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "sɪŋk"
                            ],
                            "us": [
                                "sɪŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "moving or happening at the same time and speed as someone or something else: ",
                            "examples": [
                                "The robot moves in sync with the doctor's motions.",
                                "These types of investments don't move in sync with stocks and bonds.",
                                "Throughout the album, the music struggles to get in synch with the words.",
                                "The birds winter apart, but return in sync.",
                                "The camerawork is jerky and the dialogue is never in synch."
                            ]
                        },
                        {
                            "explanation": "agreeing with or the same as something or someone else: ",
                            "examples": [
                                "The changes will put the US in sync with Europe and Asia.",
                                "He's putting himself forward as a president whose ideas are in sync with a nation demanding change.",
                                "When it comes to upholding international law, our two nations are totally in synch.",
                                "As a couple we are very much in sync."
                            ]
                        },
                        {
                            "explanation": "not moving or happening at the same time and speed as someone or something else: ",
                            "examples": [
                                "The brass section was out of sync with the rest of the orchestra.",
                                "As the bells rang, one of them seemed completely out of synch.",
                                "If the two generators get out of sync, they will both be damaged."
                            ]
                        },
                        {
                            "explanation": "not agreeing with or not the same as someone or something else: ",
                            "examples": [
                                "After looking on the internet I quickly realized it was my attitudes, not my daughter's, that were out of sync with society.",
                                "We've been feeling a little out of synch with each other lately.",
                                "Their words and their deeds are badly out of sync. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "sɪŋk"
                            ],
                            "us": [
                                "sɪŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "informal for \nsynchronize : ",
                            "examples": [
                                "The action on the screen syncs perfectly with the music."
                            ]
                        },
                        {
                            "explanation": "to connect two electronic devices so that they both have the latest information or files: ",
                            "examples": [
                                "How do I sync my phone to my computer?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}