{
    "word": "tagging",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtæɡ.ɪŋ"
                            ],
                            "us": [
                                "ˈtæɡ.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of putting a small piece of paper, cloth, or metal on something in order to identify it (= say what it is): ",
                            "examples": [
                                "The tagging of baggage to and from Macau will provide guests a convenient check-in experience. ",
                                "The individual tagging of sheep would result in an annual bill of around £20m. "
                            ]
                        },
                        {
                            "explanation": "the act of putting electronic devices on goods, etc., or animals, in order to know where they are: ",
                            "examples": [
                                "The electronic tagging of household items such as lawn mowers and power drills would enable them to be searchable via the internet."
                            ]
                        },
                        {
                            "explanation": "the act of attaching an electronic device to a person who is guilty of a crime to make sure they do not leave an area or go to a particular place: ",
                            "examples": [
                                "The case will bring into question the efficacy of electronic tagging of offenders.",
                                "We support the tagging of certain prisoners."
                            ]
                        },
                        {
                            "explanation": "the activity of marking computer information to be processed dealt with in a particular way: ",
                            "examples": [
                                "XML tagging of manuscripts"
                            ]
                        },
                        {
                            "explanation": "the activity of marking digital information with a name, etc. to show that it is of a particular type or is connected with a particular person, group, or subject: ",
                            "examples": [
                                "Of the three programs, this one let me do the most extensive tagging of my tracks before exporting them.",
                                "Are you confused by Facebook's tagging feature? Not sure you want to even be tagged at all? Here's everything you need to know."
                            ]
                        },
                        {
                            "explanation": "the illegal act of writing your name or a special mark on buildings, or the writing and marks that are put on buildings: ",
                            "examples": [
                                "The walls have stayed clean because in the tagging culture murals are respected as art.",
                                "It costs the city $250,000 a year to remove tagging. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}