{
    "word": "tank",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tæŋk"
                            ],
                            "us": [
                                "tæŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a container that holds liquid or gas: ",
                            "examples": [
                                "a water tank",
                                "a fuel/petrol tank"
                            ]
                        },
                        {
                            "explanation": "a large military fighting vehicle designed to protect those inside it from attack, driven by wheels that turn inside moving metal belts",
                            "examples": []
                        },
                        {
                            "explanation": "an artificial pool or lake, especially a lake for supplying water to an area",
                            "examples": []
                        },
                        {
                            "explanation": "a \ntank top ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tæŋk"
                            ],
                            "us": [
                                "tæŋk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to quickly go down in price, value, etc., or to suddenly become less successful: ",
                            "examples": [
                                "The state was expecting an increase in tax revenues, but that was before the economy tanked.",
                                "Car exports in the year to April tanked 23 percent."
                            ]
                        },
                        {
                            "explanation": "to make something suddenly fail or become less successful: ",
                            "examples": [
                                "They were so opposed to the change in policy that they tanked the whole deal.",
                                "People need real answers from the investment firms that tanked the economy."
                            ]
                        },
                        {
                            "explanation": "to intentionally lose a game or sports event: ",
                            "examples": [
                                "He said, although it is difficult to prove who has tanked a match, everyone knows that it happens. ",
                                "Just because he lost the match does not mean that he tanked."
                            ]
                        },
                        {
                            "explanation": "to cover a wall, etc. with a special substance or material in order to keep it dry: ",
                            "examples": [
                                "Our company has been tanking basement and cellar walls for decades."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}