{
    "word": "taste",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "teɪst"
                            ],
                            "us": [
                                "teɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the flavour of something, or the ability of a person or animal to recognize different flavours: ",
                            "examples": [
                                "I love the taste of garlic.",
                                "Olives are usually an acquired taste (= you only like them after you have become familiar with their taste).",
                                "When you have a cold you often lose your sense of taste."
                            ]
                        },
                        {
                            "explanation": "the fact of liking or enjoying something: ",
                            "examples": [
                                "She came home from Europe with a taste for art and the finer things in life."
                            ]
                        },
                        {
                            "explanation": "a small amount of food: ",
                            "examples": [
                                "Have a taste of the sauce and tell me if it needs salt."
                            ]
                        },
                        {
                            "explanation": "a person's approval of and liking for particular things: ",
                            "examples": [
                                "I'm not really into new cars - old vintage cars are more to my taste (= what I like)."
                            ]
                        },
                        {
                            "explanation": "a person's ability to judge and recognize what is good or suitable, especially relating to such matters as art, style, beauty, and behaviour: ",
                            "examples": [
                                "He has terrible taste so you can probably imagine what his house looks like.",
                                "His taste in clothes leaves a little to be desired."
                            ]
                        },
                        {
                            "explanation": "the things a person likes: ",
                            "examples": [
                                "I have expensive tastes (= I like expensive things) so I need to have a well-paid job."
                            ]
                        },
                        {
                            "explanation": "a short experience of something: ",
                            "examples": [
                                "I had a taste of office work during the summer and that was enough."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "teɪst"
                            ],
                            "us": [
                                "teɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put food or drink in your mouth to find out what flavour it has: ",
                            "examples": [
                                "Taste this sauce and tell me if it needs seasoning.",
                                "What is this? I've never tasted anything like it."
                            ]
                        },
                        {
                            "explanation": "to have a particular flavour: ",
                            "examples": [
                                "This sauce tastes strange."
                            ]
                        },
                        {
                            "explanation": "to experience something for a short time: ",
                            "examples": [
                                "Once you've tasted luxury it's very hard to settle for anything else."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}