{
    "word": "technical school",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtek.nɪ.kəl ˌskuːl"
                            ],
                            "us": [
                                "ˈtek.nɪ.kəl ˌskuːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in many countries, a school that specializes in teaching technical and practical subjects: ",
                            "examples": [
                                "In the 1930s the film director attended a technical school in Osaka.",
                                "Guangzhou Technical School"
                            ]
                        },
                        {
                            "explanation": "in the United States, a two-year college that prepares students for work in areas such as business, finance, computing, engineering, etc. : ",
                            "examples": [
                                "The scholarships are to encourage students to attend technical schools and training programs for skills such as software development. ",
                                "She incurred $11,000 debt to enable her to attend a technical school and learn computer and business skills.",
                                "Orlando Technical School"
                            ]
                        },
                        {
                            "explanation": "in England and Wales in the past, a secondary school that specialized in teaching scientific and technical subjects: ",
                            "examples": [
                                "In the Education Act, a tripartite system was decided on: children were selected by tests either for one of the old grammar schools, or for a technical school, or for a secondary modern school.",
                                "The secondary technical schools planned in 1944 were not created in significant numbers."
                            ]
                        },
                        {
                            "explanation": "in Australia, especially in the past, a school where students learn skills that involve working with their hands: ",
                            "examples": [
                                "Each of the Australian territories developed technical schools that grew out of the Mechanics Institutes.",
                                "Thebarton Technical School: this technical school was established in 1919 and was located in the Torrensville district of Adelaide, South Australia.",
                                "Today across Australia there are universities that grew out of technical colleges, and secondary schools that started life as technical schools."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}