{
    "word": "tech",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "tek"
                            ],
                            "us": [
                                "tek"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "short for \ntechnical : relating to the knowledge, machines, or methods used in science and industry : ",
                            "examples": [
                                "We offer 24-hour online tech support for your device. ",
                                "Configuration refers to the technical specifications, known as \"tech specs\" of the computers and it includes processor speed, the amount of RAM, etc.",
                                "He was worried that the tech rehearsal had been too brief - for example, the smoke machine wasn't working correctly."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tek"
                            ],
                            "us": [
                                "tek"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "short for \ntechnology , used especially to refer to digital technology, and the activities and businesses connected with it : ",
                            "examples": [
                                "The company produces an annual report on the state of European tech.",
                                "the tech sector/industry",
                                "tech entrepreneurs/start-ups/companies/stocks",
                                "He worked for several years at one of the Silicon Valley tech giants.",
                                "The recession and the bursting of the tech bubble account for many of the job losses."
                            ]
                        },
                        {
                            "explanation": "devices that use computer technology: ",
                            "examples": [
                                "They have all the latest tech.",
                                "wearable tech such as fitness trackers",
                                "It's wise to pack all your tech in your carry-on baggage."
                            ]
                        },
                        {
                            "explanation": "short for \ntechnician : a worker trained in special skills, especially in science or engineering : ",
                            "examples": [
                                "He ended up as a lab tech in the department, using his chemistry degree from Alabama State College. ",
                                "Most vet techs work in veterinary clinics caring for domestic animals.",
                                "Many pharmacy techs gain this certification because the added knowledge can give them an advantage when applying for jobs."
                            ]
                        },
                        {
                            "explanation": "short for \ntechnical school : a school or college that specializes in teaching technical or practical subjects: ",
                            "examples": [
                                "I did my A level exams at the local tech. ",
                                "You could take a plumbing course at the tech."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}