{
    "word": "term",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tɜːm"
                            ],
                            "us": [
                                "tɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the fixed period of time that something lasts for: ",
                            "examples": [
                                "He served a short term for drunk driving.",
                                "He was sentenced to a 150-year prison term for cheating thousands of ordinary people out of their savings. ",
                                "The government's term of office (= the period in which they have power) expires at the end of the year."
                            ]
                        },
                        {
                            "explanation": "one of the periods into which a year is divided at school, college, or university: ",
                            "examples": [
                                "In Britain, the spring term starts in January and ends just before Easter.",
                                "Our college has three terms that we call trimesters.",
                                "We're very busy in term-time (= during the term)."
                            ]
                        },
                        {
                            "explanation": "the period of time that a legal agreement lasts for: ",
                            "examples": [
                                "The lease on our house is near the end of its term."
                            ]
                        },
                        {
                            "explanation": "the end of a pregnancy when a baby is expected to be born: ",
                            "examples": [
                                "Her last pregnancy went to term (= the baby was born after the expected number of weeks).",
                                "a full-term pregnancy"
                            ]
                        },
                        {
                            "explanation": "for a long, medium, or short period of time in the future: ",
                            "examples": [
                                "This decision will cost us more in the short term, but will be beneficial in the long term."
                            ]
                        },
                        {
                            "explanation": "a word or expression used in relation to a particular subject, often to describe something official or technical: ",
                            "examples": [
                                "\"Without let or hindrance\" is a legal term that means \"freely\"."
                            ]
                        },
                        {
                            "explanation": "a number or symbol used in a mathematical series or calculation: ",
                            "examples": [
                                "We then use the same rule to compute the terms of the equation. ",
                                "The terms of a geometric series form a geometric progression, meaning that the ratio of successive terms in the series is constant. "
                            ]
                        },
                        {
                            "explanation": "an unkind or unpleasant name to call someone: ",
                            "examples": [
                                "In the playground, this was about the worst term of abuse you could use."
                            ]
                        },
                        {
                            "explanation": "a kind or friendly name to call someone: ",
                            "examples": [
                                "It was certainly meant as a term of endearment."
                            ]
                        },
                        {
                            "explanation": "used to describe which particular area of a subject you are discussing: ",
                            "examples": [
                                "In financial terms, the project was not a success."
                            ]
                        },
                        {
                            "explanation": "in a very clear way: ",
                            "examples": [
                                "She told him what she thought of his behaviour in no uncertain terms (= she made her disapproval very clear)."
                            ]
                        },
                        {
                            "explanation": "using language that clearly shows your feelings: ",
                            "examples": [
                                "He complained in the strongest terms."
                            ]
                        },
                        {
                            "explanation": "the conditions that control an agreement, arrangement, or activity: ",
                            "examples": [
                                "Under the terms of their contract, employees must give three months' notice if they leave."
                            ]
                        },
                        {
                            "explanation": "If you buy something on easy terms, you pay for it over a period of time: ",
                            "examples": [
                                "Loans were given on easy terms, with very low interest charges and up to 50 years to repay."
                            ]
                        },
                        {
                            "explanation": "having the same rights, treatment, etc.: ",
                            "examples": [
                                "All companies will compete for the government contract on equal terms."
                            ]
                        },
                        {
                            "explanation": "the matters to which a study or report is limited: ",
                            "examples": [
                                "There were complaints that the work that had been done did not fit the terms of reference."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tɜːm"
                            ],
                            "us": [
                                "tɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give something a name or to describe it with a particular expression: ",
                            "examples": [
                                "Technically, a horse that is smaller than 1.5 metres at the shoulder is termed a pony."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -tɜːm"
                            ],
                            "us": [
                                " -tɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "lasting a long/medium/short time: ",
                            "examples": [
                                "The project will have long-term benefits."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}