{
    "word": "textured",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈteks.tʃəd"
                            ],
                            "us": [
                                "ˈteks.tʃɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a surface that is not smooth but has a raised pattern: ",
                            "examples": [
                                "The hallway has textured wallpaper.",
                                "She uses a lot of textured fabrics such as tweed and corduroy.",
                                "The textured surface of the handle makes it easier to grip."
                            ]
                        },
                        {
                            "explanation": "(of hair) curly or slightly curly rather than straight: ",
                            "examples": [
                                "Textured hair can be more time-consuming to take care of than straight hair."
                            ]
                        },
                        {
                            "explanation": "(of hair) cut or styled (= arranged) so that it has shape and does not lie flat: ",
                            "examples": [
                                "Ask your hairdresser to add some textured layers for body and fullness.",
                                "Drying the hair roughly can give it a more textured and modern look."
                            ]
                        },
                        {
                            "explanation": "(of paint) containing something such as sand so that the surface it is used on is not completely smooth: ",
                            "examples": [
                                "The outside walls are painted with a textured masonry paint. ",
                                "The textured coating should last for 10 years or more."
                            ]
                        },
                        {
                            "explanation": "(of food) containing thick or hard parts rather than being completely smooth: ",
                            "examples": [
                                "Blend the ingredients until they are well combined but still a little textured. ",
                                "Granita is granular and textured, and much less smooth than sorbet."
                            ]
                        },
                        {
                            "explanation": "(of food or drink) having an interesting taste because of containing several different flavours at the same time: ",
                            "examples": [
                                "This is a delicious textured wine.",
                                "Nothing beats the richly textured flavours of this dish. "
                            ]
                        },
                        {
                            "explanation": "(of a computer object) having had a pattern or image added to it to make it look more real: ",
                            "examples": [
                                "A simple textured sphere is the standard object for graphics demos.",
                                "16Mb of RAM is the minimum you will need for handling textured 3-D data."
                            ]
                        },
                        {
                            "explanation": "(of music) combining different parts, instruments, etc. to form an interesting sound: ",
                            "examples": [
                                "The music is richly textured.",
                                "I love the rich, textured sound you get in a larger orchestra. "
                            ]
                        },
                        {
                            "explanation": "interesting or important because of having many different qualities: ",
                            "examples": [
                                "It is an extremely rich and textured film.",
                                "This is a valuable and textured piece of analysis. ",
                                "The Miami depicted in the media is almost nothing like the more textured and complicated Miami that I know."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -teks.tʃəd"
                            ],
                            "us": [
                                " -teks.tʃɚd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a texture of the stated type: ",
                            "examples": [
                                "coarse-textured"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}