{
    "word": "texture",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈteks.tʃər"
                            ],
                            "us": [
                                "ˈteks.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the quality of something that can be decided by touch, for example whether it is rough or smooth, or soft or hard: ",
                            "examples": [
                                "a smooth/rough/coarse texture",
                                "This artificial fabric has the texture of silk.",
                                "Different rocks have different textures."
                            ]
                        },
                        {
                            "explanation": "the quality of food that you can feel in your mouth, for example whether it is rough or smooth, or soft or hard: ",
                            "examples": [
                                "Fried food usually has a crisp texture.",
                                "The spread is similar to peanut butter in taste and texture.",
                                "Young children can be fussy about food, so introduce new textures and flavours gradually."
                            ]
                        },
                        {
                            "explanation": "(of food) the quality of containing thick or hard parts rather than being completely smooth: ",
                            "examples": [
                                "The nuts added texture to the cake.",
                                "I prefer seeded bread because it has more texture and flavour."
                            ]
                        },
                        {
                            "explanation": "the quality of wine that you can feel in your mouth, for example whether it is smooth, creamy, or oily: ",
                            "examples": [
                                "This wine lacks flavour and texture.",
                                "A special process is used to give the wines smooth textures."
                            ]
                        },
                        {
                            "explanation": "(of hair) the quality of having shape and not lying flat, especially because of the way it is cut and styled (= arranged): ",
                            "examples": [
                                "You can add texture to hair by adding layers. ",
                                "To create all-over texture, she applies mousse and lets her hair dry naturally."
                            ]
                        },
                        {
                            "explanation": "a pattern or image that can be added to the surface of a 3-D object (= one that looks real and solid rather than flat) on a computer to make it look more real: ",
                            "examples": [
                                "A brick wall texture can used to make a building look more realistic. ",
                                "Textures are used to add detail to 3-D objects."
                            ]
                        },
                        {
                            "explanation": "the character of a piece of writing or music: ",
                            "examples": [
                                "The writing has a rich texture.",
                                "The film has the texture of a nightmare.",
                                "Stravinsky relied heavily on the textures of early choral music. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈteks.tʃər"
                            ],
                            "us": [
                                "ˈteks.tʃɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a surface rough or raised rather than smooth: ",
                            "examples": [
                                "The machine can texture or polish slabs of any material.",
                                "The artist's thumb prints texture the whole of the painting's surface.",
                                "I work with wood and do a lot of carving and texturing."
                            ]
                        },
                        {
                            "explanation": "to combine different parts, instruments, etc. in a piece of music to form an interesting sound: ",
                            "examples": [
                                "This producer knows how to texture sound, how to fill a room with layer upon layer of voices and keyboards and drums and guitars.",
                                "The band textures songs with many layers, often letting individual instruments come in and out of prominence."
                            ]
                        },
                        {
                            "explanation": "to add a pattern or image to a 3-D object (= one that looks real or solid rather than flat) on a computer: ",
                            "examples": [
                                "She textured the closed end of the cylinder with an image of a wheel."
                            ]
                        },
                        {
                            "explanation": "to add different qualities to something in order to make it more interesting or important: ",
                            "examples": [
                                "For decades, bodegas have textured the backdrop of New York.",
                                "The work of the American composer was used to texture their video installations."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}