{
    "word": "thermal",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈθɜː.məl"
                            ],
                            "us": [
                                "ˈθɝː.məl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "connected with heat: ",
                            "examples": [
                                "thermal conductivity (= ability of a substance to carry heat)",
                                "It was the Romans who first recognized the medicinal benefits of Hungary's thermal springs (= ones which produce hot water)."
                            ]
                        },
                        {
                            "explanation": "(of clothes or coverings) made of a material that is especially designed to keep you warm: ",
                            "examples": [
                                "Typical layers can include thermal underwear, a sweater or sweatshirt, a jacket, snow pants, a scarf, a hat, two pairs of warm socks, boots, and gloves.",
                                "Many passengers slept in the airport overnight with emergency thermal blankets.",
                                "I was wearing a long-sleeved thermal vest under my jumper."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈθɜː.məl"
                            ],
                            "us": [
                                "ˈθɝː.məl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a large column of hot air rising from the ground: ",
                            "examples": [
                                "Paragliders can catch rides on these currents, hopping from thermal to thermal and covering many miles in a single day.",
                                "You will learn how to steer the glider into rising currents of warm air (thermals) to gain altitude and extend flying time.",
                                "The birds are magnificent fliers, capable of riding thermals for miles, like a glider."
                            ]
                        },
                        {
                            "explanation": "clothes made of a material that is especially designed to keep you warm, especially those that are worn under other clothes : ",
                            "examples": [
                                "It'll be really cold so remember to bring your thermals.",
                                "I'm okay - I have my thermals on.",
                                "You'll need your thermals.",
                                "You'll need several layers, starting with thermals."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}