{
    "word": "thing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "θɪŋ"
                            ],
                            "us": [
                                "θɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer in an approximate way to an object or to avoid naming it: ",
                            "examples": [
                                "What's that thing over there?",
                                "There are some nice things in the shops this summer.",
                                "I don't eat sweet things (= sweet food).",
                                "How does this stupid thing work?"
                            ]
                        },
                        {
                            "explanation": "your possessions or a particular set of your possessions: ",
                            "examples": [
                                "All their things were destroyed in the fire.",
                                "Bring your swimming things if the weather's nice."
                            ]
                        },
                        {
                            "explanation": "a particular set of objects: ",
                            "examples": [
                                "Let me help you clear away the tea things (= cups, plates, etc. that are used for having tea)."
                            ]
                        },
                        {
                            "explanation": "used to refer in an approximate way to an idea, subject, event, action, etc.: ",
                            "examples": [
                                "That was an unkind thing to say.",
                                "I've got so many things to do I don't know where to start.",
                                "Your information is correct but you left out one thing.",
                                "\"What's the matter?\" \"It's this insurance thing. I'm really worried about it.\""
                            ]
                        },
                        {
                            "explanation": "the exact fact, object, idea, event, etc.: ",
                            "examples": [
                                "The article was exactly the thing I needed for my research."
                            ]
                        },
                        {
                            "explanation": "something that is not false or a copy: ",
                            "examples": [
                                "The fire alarm goes off accidentally so often that when it's the real thing (= when it really does happen) nobody will take any notice."
                            ]
                        },
                        {
                            "explanation": "the same: ",
                            "examples": [
                                "Training isn't the same thing as education."
                            ]
                        },
                        {
                            "explanation": "everything that has been planned or discussed: ",
                            "examples": [
                                "Let's call the whole thing off.",
                                "I want to forget the whole thing."
                            ]
                        },
                        {
                            "explanation": "more than everything else: ",
                            "examples": [
                                "I value my freedom above all things."
                            ]
                        },
                        {
                            "explanation": "in every situation or subject; in everything: ",
                            "examples": [
                                "Be true to yourself in all things."
                            ]
                        },
                        {
                            "explanation": "said before describing what it is that you especially want to know: ",
                            "examples": [
                                "If there's one thing I want to know, it's where he goes on Thursday afternoons."
                            ]
                        },
                        {
                            "explanation": "used to refer to the general situation: ",
                            "examples": [
                                "Things have been going very well recently."
                            ]
                        },
                        {
                            "explanation": "If it's a good thing that something happened, it is lucky that it happened: ",
                            "examples": [
                                "It's a good thing (that) we booked our tickets early."
                            ]
                        },
                        {
                            "explanation": "in the present situation: ",
                            "examples": [
                                "The way things are, I'll never have this ready by June."
                            ]
                        },
                        {
                            "explanation": "used instead of \"anything\" to emphasize what you are saying: ",
                            "examples": [
                                "Don't worry about a thing. I'll take care of it."
                            ]
                        },
                        {
                            "explanation": "not anything: ",
                            "examples": [
                                "After the guests had gone, there wasn't a thing left to eat."
                            ]
                        },
                        {
                            "explanation": "to have no clothes that are suitable for an occasion: ",
                            "examples": [
                                "I'm going to a wedding on Saturday and I don't have a thing to wear."
                            ]
                        },
                        {
                            "explanation": "you cannot do anything: ",
                            "examples": [
                                "He broke his promise and there wasn't a thing we could do about it."
                            ]
                        },
                        {
                            "explanation": "used to talk about a particular action, agreement, etc.: ",
                            "examples": [
                                "I went by plane, a thing I hardly ever do.",
                                "One thing you'll have to agree to is working in the evenings."
                            ]
                        },
                        {
                            "explanation": "used to make noun phrases with particular adjectives and adverbs: ",
                            "examples": [
                                "The first thing (to do) is to write your name at the top of the paper."
                            ]
                        },
                        {
                            "explanation": "used to introduce a reason for something: ",
                            "examples": [
                                "\"Why won't you come to New York with me?\" \"For one thing, I don't like flying, and for another, I can't afford it.\""
                            ]
                        },
                        {
                            "explanation": "used after an adjective to refer to a person or animal with love or sympathy: ",
                            "examples": [
                                "The poor things were kept in small cages without room to move.",
                                "I can't believe you won - you lucky thing!"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}