{
    "word": "threatened",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈθret.ənd"
                            ],
                            "us": [
                                "ˈθret.ənd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in danger, or likely to stop existing: ",
                            "examples": [
                                "The Congo rainforest is one of the world's most threatened ecosystems.",
                                "The panda is the best known of our threatened species.",
                                "People do not realize how very threatened these landscapes that we cherish are."
                            ]
                        },
                        {
                            "explanation": "used to describe something unpleasant or bad that someone has said might happen: ",
                            "examples": [
                                "The police reported 932 incidents of actual or threatened violence in this period. ",
                                "The threatened strikes by airport check-in staff and baggage handlers have been called off."
                            ]
                        },
                        {
                            "explanation": "feeling that something bad might happen, or that someone might do something bad to you: ",
                            "examples": [
                                "There should be proper policing so children can walk home from school without feeling threatened. ",
                                "Under the stress of questioning, he would have felt very threatened and been likely to make untrue admissions."
                            ]
                        },
                        {
                            "explanation": "feeling that someone or something might cause you to be less respected or less admired, or cause you to lose your authority or position: ",
                            "examples": [
                                "Doctors shouldn't feel threatened by their patients asking for a medicine by name.",
                                "At that time the church was feeling very threatened and uncomfortable with non-religious society.",
                                "\"Why are you so threatened by my ideas?\" he asks."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}