{
    "word": "thread",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "θred"
                            ],
                            "us": [
                                "θred"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(a length of) a very thin fibre: ",
                            "examples": [
                                "Have you got a needle and thread I could borrow?",
                                "loose threads"
                            ]
                        },
                        {
                            "explanation": "a long, thin line of something such as light or smoke: ",
                            "examples": [
                                "A thin thread of light made its way through the curtains."
                            ]
                        },
                        {
                            "explanation": "The thread of a book, discussion, speech, etc. is its story or the way that it develops, one part connecting with another: ",
                            "examples": [
                                "One of the main threads of the film is the development of the relationship between the boy and his uncle.",
                                "The sound distracted me and I lost the thread of (= forgot) what I was saying."
                            ]
                        },
                        {
                            "explanation": "a connected group of pieces of writing on the internet, where people are talking about a particular subject: ",
                            "examples": [
                                "I was so glad to find this thread, and to know that lots of people have the same problem as me!"
                            ]
                        },
                        {
                            "explanation": "a continuous raised line, such as the one that goes around the outside of a screw or bolt or the inside of a hole",
                            "examples": []
                        },
                        {
                            "explanation": "clothes: ",
                            "examples": [
                                "I love walking down the street and seeing someone in my threads."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "θred"
                            ],
                            "us": [
                                "θred"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something long and thin such as string or thread through a narrow hole or into a small space: ",
                            "examples": [
                                "Could you thread this needle for me, please?",
                                "The sari had gold strands threaded through the material."
                            ]
                        },
                        {
                            "explanation": "to put things such as beads (= small, round objects with a hole through the middle) onto a string or thread: ",
                            "examples": [
                                "She sat threading beads, which fell with a faint, decisive click. ",
                                "The olives are threaded onto wooden cocktail sticks for garnish."
                            ]
                        },
                        {
                            "explanation": "to move forwards, often changing direction in order to avoid people or things: ",
                            "examples": [
                                "The little car threaded dangerously through the traffic.",
                                "She threaded her way through the crowded market place."
                            ]
                        },
                        {
                            "explanation": "to kick or throw a ball to another player, especially between players from the other team: ",
                            "examples": [
                                "Messi threaded a pass through to Suarez.",
                                "He used his strong left arm, threading the ball between helpless defenders."
                            ]
                        },
                        {
                            "explanation": "to remove hair from someone's face using a long piece of thread: ",
                            "examples": [
                                "Have you ever had your eyebrows threaded?"
                            ]
                        },
                        {
                            "explanation": "to arrange an email, text message, or internet post or a series of these so that connected messages dealing with the same subject follow each other in a group: ",
                            "examples": [
                                "We are launching some changes to how the system threads messages.",
                                "If we can find any similar conversations, we'll thread the incoming message to the existing conversation."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}