{
    "word": "ticket",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtɪk.ɪt"
                            ],
                            "us": [
                                "ˈtɪk.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small piece of paper or card given to someone, usually to show that they have paid for an event, journey, or activity: ",
                            "examples": [
                                "a concert ticket",
                                "a train/bus/plane ticket",
                                "a lottery/raffle ticket",
                                "a ticket office",
                                "a ticket collector"
                            ]
                        },
                        {
                            "explanation": "a piece of card or paper that is put on an object to show its size or price: ",
                            "examples": [
                                "a price ticket"
                            ]
                        },
                        {
                            "explanation": "a note telling you that you must pay some money as a punishment for not obeying a rule or law: ",
                            "examples": [
                                "a parking ticket"
                            ]
                        },
                        {
                            "explanation": "a list of the people representing a particular political party in an election: ",
                            "examples": [
                                "the Republican/Democratic ticket",
                                "In this election there will definitely be a woman on the Democratic ticket.",
                                "Bush and Cheney won re-election in 2004 against a Democratic ticket of John Kerry and John Edwards. "
                            ]
                        },
                        {
                            "explanation": "the policies that are supported by a political party or a person competing in an election: ",
                            "examples": [
                                "The President was elected on a ticket of restoring the rule of law.",
                                "Twice he stood for parliament on an educational reform ticket."
                            ]
                        },
                        {
                            "explanation": "a request sent online or by phone for help with a problem with a website, computer system, etc.: ",
                            "examples": [
                                "If you still need assistance after reading the information in this section, simply raise a ticket in the CONTACT US section of the website.",
                                "Two weeks ago I put in a ticket asking if I could change my caller ID. ",
                                "They are pretty good about replying to you if you have emailed them and/or opened a ticket. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtɪk.ɪt"
                            ],
                            "us": [
                                "ˈtɪk.ɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to sell tickets for an event; to provide someone with a ticket: ",
                            "examples": [
                                "Only passengers who were ticketed on that particular flight will receive a refund.",
                                "It's an all-ticketed game."
                            ]
                        },
                        {
                            "explanation": "to give a ticket to someone who has broken a traffic law: ",
                            "examples": [
                                "Charles was ticketed for speeding."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}