{
    "word": "tie",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "taɪ"
                            ],
                            "us": [
                                "taɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fasten together two ends of a piece of string or other long, thin material, or to (cause to) hold together with a long, thin piece of string, material, etc.: ",
                            "examples": [
                                "Could you tie this piece of string for me?",
                                "This skirt ties at the waist.",
                                "She tied the ribbon tightly in a bow/knot.",
                                "I tie my hair back when it's hot.",
                                "Tie (up) your shoelaces, or you'll trip over them."
                            ]
                        },
                        {
                            "explanation": "to force someone to stay in a place: ",
                            "examples": [
                                "I felt tied to the job while I had a mortgage to pay.",
                                "Her job ties her to the east coast."
                            ]
                        },
                        {
                            "explanation": "to relate to or connect to: ",
                            "examples": [
                                "Is the allergy tied to dairy products, for example?",
                                "Can you tie his behaviour up with anything that's happened recently?",
                                "The Republicans are trying to tie the funding up with this bill."
                            ]
                        },
                        {
                            "explanation": "to finish at the same time or score the same number of points, etc. in a competition as someone or something else: ",
                            "examples": [
                                "Jane and I tied (for first place) in the spelling test.",
                                "We tied with a team from the south in the championships."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "taɪ"
                            ],
                            "us": [
                                "taɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a long, thin piece of material that is worn under a shirt collar, especially by men, and tied in a knot at the front: ",
                            "examples": [
                                "He always wears a jacket and tie to work."
                            ]
                        },
                        {
                            "explanation": "any piece of string, plastic, metal, etc. that is used to fasten or hold together something: ",
                            "examples": [
                                "Can you see the ties for the rubbish bags in the cupboard?"
                            ]
                        },
                        {
                            "explanation": "the friendly feelings that people have for other people, or special connections with places: ",
                            "examples": [
                                "Family ties are weaker if you move a long way away.",
                                "I no longer feel any ties with my home town.",
                                "He urged governments worldwide to break diplomatic ties with the new regime."
                            ]
                        },
                        {
                            "explanation": "a situation in which two or more people finish at the same time or score the same number of points: ",
                            "examples": [
                                "It's a tie for first place.",
                                "They have changed the scoring system because there have been too many ties."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}