{
    "word": "tightness",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtaɪt.nəs"
                            ],
                            "us": [
                                "ˈtaɪt.nəs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the quality of fitting the body too closely: ",
                            "examples": [
                                "the tightness of the waistband"
                            ]
                        },
                        {
                            "explanation": "an uncomfortable feeling of pressure in the chest, throat, or a muscle: ",
                            "examples": [
                                "One of the typical symptoms of anxiety is a feeling of tightness in the chest."
                            ]
                        },
                        {
                            "explanation": "the quality of looking or sounding as if you are angry, frightened, or nervous, and not relaxed: ",
                            "examples": [
                                "There was a strange tightness in her voice."
                            ]
                        },
                        {
                            "explanation": "the quality of being held or kept together firmly: ",
                            "examples": [
                                "Check the tightness of the screw."
                            ]
                        },
                        {
                            "explanation": "the quality of being pulled or stretched firmly: ",
                            "examples": [
                                "Pegs are used to adjust the tightness of the strings."
                            ]
                        },
                        {
                            "explanation": "the situation when people in a competition, race, etc. are of a similar standard so it is difficult to know who will win: ",
                            "examples": [
                                "the tightness of the presidential race"
                            ]
                        },
                        {
                            "explanation": "the quality of curving sharply, not gradually or loosely: ",
                            "examples": [
                                "the tightness of the curls"
                            ]
                        },
                        {
                            "explanation": "the quality of having a close relationship and knowing each other very well: ",
                            "examples": [
                                "the tightness of the military community"
                            ]
                        },
                        {
                            "explanation": "the fact that there is not much of something such as money, space, or time: ",
                            "examples": [
                                "We are constrained by the tightness of the budget."
                            ]
                        },
                        {
                            "explanation": "(of controls, rules) the quality of severely limiting what can happen: ",
                            "examples": [
                                "the tightness of food hygiene regulations"
                            ]
                        },
                        {
                            "explanation": "(of a performance or band) the quality of being exact and of a high standard because people work well together: ",
                            "examples": [
                                "The orchestra played with the tightness and precision of a military band."
                            ]
                        },
                        {
                            "explanation": "the quality of being unwilling to spend money: ",
                            "examples": [
                                "She left, fed up with his affairs and his tightness with their household money. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}