{
    "word": "tight",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "taɪt"
                            ],
                            "us": [
                                "taɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(held or kept together) firmly or closely: ",
                            "examples": [
                                "I can't untie the knot - it's too tight.",
                                "This lid is on very tight.",
                                "The people stood talking in tight groups.",
                                "Hold on tight when we go around the corner.",
                                "Check that windows and doors are shut tight (= completely closed) before you leave.",
                                "The plastic cover was stretched tight (= stretched as much as it could be) across the tank.",
                                "It is a tight squeeze on some trains, the General Manager acknowledged (= passengers are packed closely together)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "taɪt"
                            ],
                            "us": [
                                "taɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "Clothes or shoes that are tight fit the body too closely and are uncomfortable: ",
                            "examples": [
                                "That jacket's too tight - you need a bigger size."
                            ]
                        },
                        {
                            "explanation": "A tight feeling is an uncomfortable feeling of pressure in part of your body, caused by illness, fear, etc.: ",
                            "examples": [
                                "Some people experienced tight chests after exercising in areas of high pollution.",
                                "If you have any symptoms such as itchy mouth or tight throat after eating nuts, stop."
                            ]
                        },
                        {
                            "explanation": "Tight muscles feel stiff and difficult to move: ",
                            "examples": [
                                "If you sit for long periods, it can make your hamstring muscles very tight on the back of your thighs.",
                                "Calf stretches can alleviate tight calves when walking."
                            ]
                        },
                        {
                            "explanation": "looking or sounding as if you are angry, frightened, or nervous, and not relaxed: ",
                            "examples": [
                                "In a small, tight voice, she said, \"Help me, please.\""
                            ]
                        },
                        {
                            "explanation": "Tight controls or rules severely limit what can happen: ",
                            "examples": [
                                "Rules on what can be taken on board an aircraft have become tighter.",
                                "tight security"
                            ]
                        },
                        {
                            "explanation": "curving sharply, not gradually or loosely: ",
                            "examples": [
                                "He lost control of his car on a tight bend. ",
                                "The whales were swimming in a tight circle. ",
                                "She was instantly recognizable with her short, tight curls."
                            ]
                        },
                        {
                            "explanation": "If a race, competition, election, etc. is tight, the people, teams, or organizations involved are of a similar standard and equally likely to be successful. : ",
                            "examples": [
                                "The new governor was elected after an unexpectedly tight race.",
                                "The race was extremely tight with the lead changing twice in the last 250m."
                            ]
                        },
                        {
                            "explanation": "If time or money is tight, there is only just enough of it: ",
                            "examples": [
                                "I'm sorry I can't stay for a chat, time's really tight.",
                                "They're raising three kids on one small salary so money is very tight."
                            ]
                        },
                        {
                            "explanation": "unwilling to spend money: ",
                            "examples": [
                                "He was too tight to pay for a taxi so we had to walk."
                            ]
                        },
                        {
                            "explanation": "having drunk too much alcohol: ",
                            "examples": [
                                "Jim, you're tight!"
                            ]
                        },
                        {
                            "explanation": "If two people are tight, they know each other very well and like each other a lot: ",
                            "examples": [
                                "The two of them were pretty tight at school."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}