{
    "word": "time",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "taɪm"
                            ],
                            "us": [
                                "taɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the part of existence that is measured in minutes, days, years, etc., or this process considered as a whole: ",
                            "examples": [
                                "He wants to spend more time with his family.",
                                "Time passes so quickly when you're having fun.",
                                "She grew more and more fascinated by the subject as time went on/by.",
                                "The curtains have faded over/with time (= as years have gone past).",
                                "You'll forget her in time (= in the future).",
                                "Over the course of time (= as years have gone past), holes have formed in the rock.",
                                "When Paula was ill, I took her some magazines to help her pass the time.",
                                "If you'd taken more time with/over (= spent more time doing) this essay, you could have done it much better.",
                                "It takes a long time (= many hours are needed) to get from London to Sydney.",
                                "We'd save time on our journey (= it would be quicker) if we went by train.",
                                "I only worked there for a short period of time.",
                                "The kitchen clock is gaining/losing time (= is going fast/slow).",
                                "My watch has never kept very good time (= been correct)."
                            ]
                        },
                        {
                            "explanation": "continuously: ",
                            "examples": [
                                "I wish you'd stop criticizing me all the time."
                            ]
                        },
                        {
                            "explanation": "very quickly or very soon: ",
                            "examples": [
                                "The kids ate their dinner in no time."
                            ]
                        },
                        {
                            "explanation": "If you say there is or that you have no time to lose, it means that you must do quickly whatever it is that you want to do: ",
                            "examples": [
                                "Come on, there's no time to lose - we have to get home before John finds out."
                            ]
                        },
                        {
                            "explanation": "always: ",
                            "examples": [
                                "I will love you for all time."
                            ]
                        },
                        {
                            "explanation": "that has ever lived or existed: ",
                            "examples": [
                                "She's been called the greatest singer of all time."
                            ]
                        },
                        {
                            "explanation": "the system of recording hours used in different parts of the world: ",
                            "examples": [
                                "Greenwich Mean Time",
                                "daylight saving time"
                            ]
                        },
                        {
                            "explanation": "an amount of time that you have available to do something: ",
                            "examples": [
                                "I don't know how you find time to do all the things you do.",
                                "I thought we'd give her a little more time (= allow her more time) to get the job done.",
                                "I'd like to visit all the museums but time is short (= there is little time left)."
                            ]
                        },
                        {
                            "explanation": "If you have time, you have enough time to do something: ",
                            "examples": [
                                "We don't have much time before the train leaves."
                            ]
                        },
                        {
                            "explanation": "to not make good use of the hours, etc. that you have available: ",
                            "examples": [
                                "If you'd done your work instead of wasting time on your phone, you'd be finished by now."
                            ]
                        },
                        {
                            "explanation": "to not have enough hours, etc. available to finish something you are trying to do: ",
                            "examples": [
                                "She ran out of time and didn't finish the last question."
                            ]
                        },
                        {
                            "explanation": "to not have enough minutes, etc. available: ",
                            "examples": [
                                "I'd like to continue this discussion but we're all out of time."
                            ]
                        },
                        {
                            "explanation": "there are no more minutes, hours, etc. available: ",
                            "examples": [
                                "OK, everyone, time's up for this week."
                            ]
                        },
                        {
                            "explanation": "a period of time added to the end of a football match because play was stopped during the game, usually to take care of players who were hurt: ",
                            "examples": [
                                "His goal in the third minute of time added on sealed the match."
                            ]
                        },
                        {
                            "explanation": "a particular period of time for which something has been happening, or that is needed for something: ",
                            "examples": [
                                "After a time, it became clear that nobody was interested in coming to the meetings.",
                                "They stayed with us for a short time.",
                                "That was the best restaurant I've been to for/in a long time (= a long period has gone past since I went to such a good restaurant).",
                                "It was some time ago that I last heard from her.",
                                "We're going on holiday in two weeks' time (= after two weeks have passed).",
                                "During her time (= while she was) in office, the prime minister introduced a large number of changes.",
                                "What do you like doing in your spare/free time (= when you are not working)?"
                            ]
                        },
                        {
                            "explanation": "to stop work, in order to do something else: ",
                            "examples": [
                                "I asked my boss if I could have some time off from work to go to the dentist."
                            ]
                        },
                        {
                            "explanation": "for a short period: ",
                            "examples": [
                                "For a time, we all thought that Sheila and Frank would get married."
                            ]
                        },
                        {
                            "explanation": "for a fairly long period of time: ",
                            "examples": [
                                "I've been doing yoga for some time."
                            ]
                        },
                        {
                            "explanation": "for a limited period: ",
                            "examples": [
                                "Leave the ironing for the time being - I'll do it later."
                            ]
                        },
                        {
                            "explanation": "used to refer to someone's period (= the bleeding from the womb that happens once a month when a person is not pregnant), especially when you want to avoid saying the word \"period\": ",
                            "examples": [
                                "She often gets stomach pain when it's her time of the month."
                            ]
                        },
                        {
                            "explanation": "a particular point in the day, as expressed in hours and minutes or shown on a clock, or a particular point in time: ",
                            "examples": [
                                "What time is it?",
                                "\"What's the time?\" \"It's ten o'clock.\"",
                                "What time do you finish work?",
                                "Have you got the time? (= Do you know what time it is?)",
                                "He's teaching his daughter to tell the time (= to recognize what time it is by looking at a clock).",
                                "Did you find out the times of the trains to Kiev?",
                                "The estimated time of arrival/departure of this flight is 11.15.",
                                "Oh dear, is that the (right) time? (= is it really so late?)",
                                "We always have dinner at the same time every day.",
                                "I was exhausted by the time (= when) I got home.",
                                "When would be a good time for me to call you?",
                                "\"What would be the best time of day for us to deliver the table?\" \"Oh, any time will be OK.\"",
                                "Today's temperatures will be normal for the time of year (= will be as they are expected to be in this season).",
                                "Just think, this time (= at the same particular point during) next week we'll be in Aruba.",
                                "We regret that at the present time we are unable to supply the products you ordered.",
                                "We regret that we are unable to supply the products you ordered at this time.",
                                "The time is fast drawing near/approaching (= it will soon be the time) when we'll have to make a decision."
                            ]
                        },
                        {
                            "explanation": "at the particular point when something was thought of or done: ",
                            "examples": [
                                "It seemed like a good idea at the time."
                            ]
                        },
                        {
                            "explanation": "If two things happen at the same time, they happen together: ",
                            "examples": [
                                "We arrived at the same time."
                            ]
                        },
                        {
                            "explanation": "at a person's present age, especially when that person is older: ",
                            "examples": [
                                "At his time of life, he ought to be taking things easy."
                            ]
                        },
                        {
                            "explanation": "a particular point of the day, year, etc. that is suitable for a particular activity, or at which something is expected to happen: ",
                            "examples": [
                                "holiday time",
                                "party time",
                                "Put your toys away now - it's time for bed.",
                                "It's time (that) I was leaving.",
                                "Is it time (for us) to go home yet?",
                                "This is not the time (= not a suitable moment) to be thinking about buying a house.",
                                "This is no time (= not a suitable moment) to change your mind.",
                                "I feel that the time has come (= now is a suitable moment) for me to move on.",
                                "The repairs to the road were finished two weeks ahead of time (= sooner than was expected).",
                                "Why is it that the buses never run on time (= make their journeys in the expected number of hours, etc.)?",
                                "She's grown old before her time (= sooner than she might have been expected to have done)."
                            ]
                        },
                        {
                            "explanation": "early enough: ",
                            "examples": [
                                "I got home just in time - it's starting to rain."
                            ]
                        },
                        {
                            "explanation": "happening or done at the particular moment that it was expected to happen or be done: ",
                            "examples": [
                                "My parents got to the house right on time."
                            ]
                        },
                        {
                            "explanation": "earlier than a particular moment: ",
                            "examples": [
                                "Let's meet for lunch. I'll call you ahead of time to decide exactly when and where."
                            ]
                        },
                        {
                            "explanation": "If it is about time/high time that someone did something, it should have been done sooner or a long time ago: ",
                            "examples": [
                                "It's about time that the school improved its food service."
                            ]
                        },
                        {
                            "explanation": "said when someone does something or something happens that you think should have been done or have happened much sooner: ",
                            "examples": [
                                "\"So Ben's finally found a job.\" \"Yeah, it's about time.\""
                            ]
                        },
                        {
                            "explanation": "it is the most suitable moment to do something or for something to happen: ",
                            "examples": [
                                "I haven't told him yet, but I will when the time is right."
                            ]
                        },
                        {
                            "explanation": "an occasion when something happens, or the experience connected with it: ",
                            "examples": [
                                "The last time we went to Paris, it rained every day.",
                                "Every time/Each time I ask you to do something you say you're busy.",
                                "They go swimming three or four times a week.",
                                "There are times when I wish I didn't live where I do.",
                                "The four-times champion (= the champion on four occasions in the past) was defeated in the second round.",
                                "If I'd known at the time (= then) that she was his former wife, I'd never have said what I did.",
                                "Sometimes I enjoy my English classes, but at other times I find them really boring.",
                                "For the umpteenth/hundredth/thousandth time, (= I've told you on many occasions to) stop teasing your sister.",
                                "Did you have a bad/good time (= an unpleasant/enjoyable experience) at the conference?",
                                "She had an easy/hard time of it (= a comfortable/uncomfortable experience) with the birth of her second baby."
                            ]
                        },
                        {
                            "explanation": "sometimes, but not often: ",
                            "examples": [
                                "From time to time I still think of her."
                            ]
                        },
                        {
                            "explanation": "again and again: ",
                            "examples": [
                                "Time after time she gets involved in relationships with the wrong men."
                            ]
                        },
                        {
                            "explanation": "very often: ",
                            "examples": [
                                "I've told you time and time again - look before you cross the road."
                            ]
                        },
                        {
                            "explanation": "continuously: ",
                            "examples": [
                                "When you're at the airport, you should make sure you have your luggage with you at all times."
                            ]
                        },
                        {
                            "explanation": "at or during any particular point or moment in the day: ",
                            "examples": [
                                "Only a certain number of people are allowed in the building at any one time."
                            ]
                        },
                        {
                            "explanation": "sometimes: ",
                            "examples": [
                                "You can be really annoying at times, you know."
                            ]
                        },
                        {
                            "explanation": "used in negative sentences instead of \"ever\": ",
                            "examples": [
                                "Parking is not allowed here at any time.",
                                "The door was marked \"No entrance at any time\" but he tried to open it anyway.",
                                "Prisoners are not permitted in the yard unsupervised at any time.",
                                "You may not, at any time, use someone else's login to access our website."
                            ]
                        },
                        {
                            "explanation": "whenever; at any point while something is happening: ",
                            "examples": [
                                "An attack could occur at any time.",
                                "Contracts such as these can be terminated at any time.",
                                "You may unsubscribe at any time using the link below.",
                                "Savings can be withdrawn at any time.",
                                "Accidents like this can happen anywhere and at any time."
                            ]
                        },
                        {
                            "explanation": "on many occasions: ",
                            "examples": [
                                "The times I've told you, ask before you borrow my clothes."
                            ]
                        },
                        {
                            "explanation": "a period in history: ",
                            "examples": [
                                "\"A Tale of Two Cities\" is set at the time of the French Revolution.",
                                "In/During medieval times, women thought to be witches were burned at the stake.",
                                "In times gone by, all crops were harvested by hand.",
                                "Times were hard (= living conditions were not good) when I was a boy.",
                                "He is widely regarded as one of the best writers of modern/our times (= the present or very recent past).",
                                "I never thought it would happen in my time (= before I died).",
                                "We sat and talked about old times (= things that had happened to us in the past.)",
                                "Times have changed and many more women now have executive jobs than in the past."
                            ]
                        },
                        {
                            "explanation": "in the past: ",
                            "examples": [
                                "At one time, George Eliot lived here."
                            ]
                        },
                        {
                            "explanation": "having new ideas, opinions, or ways of living long before most other people do: ",
                            "examples": [
                                "The documentary shows a modern woman years ahead of her time."
                            ]
                        },
                        {
                            "explanation": "If something is before your time, it happened or existed before you were born or were old enough to remember it: ",
                            "examples": [
                                "I don't remember the Beatles - they were before my time."
                            ]
                        },
                        {
                            "explanation": "said to mean that there was a period in the past when something used to happen or be true: ",
                            "examples": [
                                "Time was when you could buy a loaf of bread for sixpence."
                            ]
                        },
                        {
                            "explanation": "Your time in a race is the number of minutes, hours, etc. you take to complete it: ",
                            "examples": [
                                "Her time for the marathon was just under three hours.",
                                "He ran the 100 metres in record time."
                            ]
                        },
                        {
                            "explanation": "the number of beats in a bar of music, or the speed at which a piece of music is intended to be played: ",
                            "examples": [
                                "This piece is written in 4/4 time.",
                                "Small children often have difficulty singing in time with the music (= at the same speed at which the music is being played).",
                                "It seemed to me as if the violins were playing out of time (= at a different speed from the other instruments playing the same piece of music).",
                                "To beat time is to make a regular series of sounds at the same speed as a piece of music is played.",
                                "Tapping your foot will help you to keep time (= to play the music at the correct speed)."
                            ]
                        },
                        {
                            "explanation": "to spend a period of time in prison: ",
                            "examples": [
                                "It's not always easy to find a job after you've done time."
                            ]
                        },
                        {
                            "explanation": "the particular point in the day at which people who are drinking in a bar in the UK have to finish their drinks and leave: ",
                            "examples": [
                                "\"Time, please!\" called the landlord.",
                                "Is it time already?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "taɪm"
                            ],
                            "us": [
                                "taɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to decide that something will happen at a particular time: ",
                            "examples": [
                                "We timed our trip to coincide with my cousin's wedding."
                            ]
                        },
                        {
                            "explanation": "to arrange something so that it happens at the best possible time: ",
                            "examples": [
                                "If you time your departure carefully, you should be able to miss the worst of the traffic.",
                                "The girls' basketball team won the game with a perfectly timed shot (= one played at exactly the right moment), just before the buzzer."
                            ]
                        },
                        {
                            "explanation": "to measure how long it takes for something to happen or for someone to do something: ",
                            "examples": [
                                "Will you time me to see how long it takes me to swim a length?"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -taɪm"
                            ],
                            "us": [
                                " -taɪm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the stated period of time during the year, day, etc.: ",
                            "examples": [
                                "springtime",
                                "Christmas-time",
                                "daytime",
                                "night-time"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}