{
    "word": "title",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtaɪ.təl"
                            ],
                            "us": [
                                "ˈtaɪ.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the name of a film, book, painting, piece of music, etc.: ",
                            "examples": [
                                "The title of Evelyn Waugh's first novel was \"Decline and Fall\".",
                                "And this next record is the title track from the album \".The Red Shoes\". (= the piece of music and the record are both called \"The Red Shoes\")."
                            ]
                        },
                        {
                            "explanation": "the information given at the end or beginning of a film or television programme, stating the names of the people who acted in it or were involved in its production: ",
                            "examples": [
                                "That's the bridge that features in the opening titles.",
                                "I switched it off after the opening titles.",
                                "We all clapped as the closing titles rolled.",
                                "He always sits there until the end of the closing titles.",
                                "Eventually, the lights dimmed and the titles started to roll."
                            ]
                        },
                        {
                            "explanation": "a book: ",
                            "examples": [
                                "Last year we published over a hundred new titles."
                            ]
                        },
                        {
                            "explanation": "a word that is used before someone's name, stating their social rank, qualifications, position in an organization, gender, etc.: ",
                            "examples": [
                                "What's her title - is she Professor or Doctor?",
                                "He will retain the honorary title of non-executive chairman.",
                                "What's your job title now - are you managing director?",
                                "Jones prefers the gender-neutral title Mx.",
                                "\"Ms\" was meant to be a title that says nothing about a woman's marital status, unlike \"Mrs\" and \"Miss\"."
                            ]
                        },
                        {
                            "explanation": "the position you get by beating all other competitors in a sports competition: ",
                            "examples": [
                                "Joe Louis won the heavyweight boxing title in 1937."
                            ]
                        },
                        {
                            "explanation": "the legal right to own a piece of land or a building, or a document that proves this right: ",
                            "examples": [
                                "If you wish to sell the property, you will first have to prove your title to it."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtaɪ.təl"
                            ],
                            "us": [
                                "ˈtaɪ.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give a title to a book, movie, play, song, or work of art: ",
                            "examples": [
                                "He titled his autobiography \"Beneath the Underdog\"."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}