{
    "word": "to",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "tuː",
                                "tʊ",
                                "tu",
                                "tə"
                            ],
                            "us": [
                                "tuː",
                                "tə",
                                "t̬ə",
                                "tu"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used before a verb to show that it is in the infinitive",
                            "examples": []
                        },
                        {
                            "explanation": "used after some verbs, especially when the action described in the infinitive will happen later: ",
                            "examples": [
                                "She agreed to help.",
                                "I'll have to tell him.",
                                "Sadly, she didn't live to see her grandchildren."
                            ]
                        },
                        {
                            "explanation": "used after many verbs of agreeing, needing, and wanting: ",
                            "examples": [
                                "I need to eat something first.",
                                "I'd love to live in New York.",
                                "That child ought to be in bed."
                            ]
                        },
                        {
                            "explanation": "used instead of repeating a verb clause: ",
                            "examples": [
                                "\"Are you going tonight?\" \"I'm certainly hoping to.\""
                            ]
                        },
                        {
                            "explanation": "used in phrases where there are reported orders and requests: ",
                            "examples": [
                                "He told me to wait.",
                                "Did anyone ask Daniel to reserve the room?"
                            ]
                        },
                        {
                            "explanation": "used after some adjectives: ",
                            "examples": [
                                "It's not likely to happen.",
                                "Three months is too long to wait.",
                                "She's not strong enough to go hiking up mountains."
                            ]
                        },
                        {
                            "explanation": "used after some nouns: ",
                            "examples": [
                                "He has this enviable ability to ignore everything that's unpleasant in life.",
                                "This will be my second attempt to make flaky pastry."
                            ]
                        },
                        {
                            "explanation": "A clause containing to + infinitive can be used as the subject of a sentence: ",
                            "examples": [
                                "To go overseas on your own is very brave.",
                                "My plan was to get it all arranged before I told anyone."
                            ]
                        },
                        {
                            "explanation": "used after question words: ",
                            "examples": [
                                "I don't know what to do.",
                                "Can you tell me how to get there?"
                            ]
                        },
                        {
                            "explanation": "used with an infinitive to express use or purpose: ",
                            "examples": [
                                "I'm going there to see my sister.",
                                "This tool is used to make holes in leather.",
                                "To make this cake, you'll need two eggs, 175 grams of sugar, and 175 grams of flour.",
                                "He works to get paid, not because he enjoys it."
                            ]
                        },
                        {
                            "explanation": "You can introduce a clause with a phrase containing to + infinitive: ",
                            "examples": [
                                "To be honest (= speaking honestly), Becky, I like thegrey shirt better.",
                                "To tell you the truth, I never really liked the man."
                            ]
                        },
                        {
                            "explanation": "used with an infinitive after 'there is' or 'there are' and a noun: ",
                            "examples": [
                                "There's an awful lot of work to be done."
                            ]
                        },
                        {
                            "explanation": "To be going on with means in order to continue with the present activity or situation: ",
                            "examples": [
                                "Do we have enough paint to be going on with, or should I get some more while I'm out?"
                            ]
                        },
                        {
                            "explanation": "in the direction of: ",
                            "examples": [
                                "We're going to town on the bus, okay?",
                                "We went to Prague last year.",
                                "I asked someone the way to the town centre.",
                                "You can walk from here to the school in under ten minutes.",
                                "I asked Kirsten and Kai to dinner (= invited them to come and eat dinner with me) next week.",
                                "We received another invitation to a wedding this morning.",
                                "I had my back to them, so I couldn't see what they were doing.",
                                "She walked over to the window.",
                                "He went up to a complete stranger and started talking.",
                                "You've got your sweater on back to front (= with the back of the sweater on the chest)."
                            ]
                        },
                        {
                            "explanation": "used for showing who receives something or who experiences an action: ",
                            "examples": [
                                "I lent my bike to my brother.",
                                "I told that to Alex and he just laughed.",
                                "Who's the letter addressed to?"
                            ]
                        },
                        {
                            "explanation": "With many verbs that have two objects, 'to' can be used before the indirect object: ",
                            "examples": [
                                "Give me that gun./Give that gun to me."
                            ]
                        },
                        {
                            "explanation": "until a particular time, state, or level is reached: ",
                            "examples": [
                                "It's only two weeks to Christmas.",
                                "Unemployment has risen to almost eight million.",
                                "He drank himself to death.",
                                "She nursed me back to health."
                            ]
                        },
                        {
                            "explanation": "used when saying the time, to mean before the stated hour: ",
                            "examples": [
                                "It's twenty to six."
                            ]
                        },
                        {
                            "explanation": "used to suggest an extreme state: ",
                            "examples": [
                                "Look at your shirt - it's torn to shreds!",
                                "She was thrilled to bits.",
                                "I was bored to tears."
                            ]
                        },
                        {
                            "explanation": "in connection with: ",
                            "examples": [
                                "What was their response to your query?",
                                "She was so mean to me.",
                                "There's a funny side to everything."
                            ]
                        },
                        {
                            "explanation": "used to say where something is fastened or connected: ",
                            "examples": [
                                "The paper was stuck to the wall with tape.",
                                "A fast rail service connects us to the city."
                            ]
                        },
                        {
                            "explanation": "used before an infinitive, usually with 'be', to indicate a future action: ",
                            "examples": [
                                "The government announced today that it is to cut funding for the arts for next year."
                            ]
                        },
                        {
                            "explanation": "used in this pattern to say what someone should do or to give an order: ",
                            "examples": [
                                "You're not to (= you must not) bite your nails like that."
                            ]
                        },
                        {
                            "explanation": "Newspapers often use to + infinitive without 'be' in their headlines (= titles of articles) when reporting planned future events: ",
                            "examples": [
                                "Russia to send troops in."
                            ]
                        },
                        {
                            "explanation": "causing a particular feeling in a particular person: ",
                            "examples": [
                                "That's when I found out, to my amazement, that she was coming here."
                            ]
                        },
                        {
                            "explanation": "considered by: ",
                            "examples": [
                                "I realize it may sound strange to you.",
                                "I mean, £50 is nothing to him (= he would not consider it a large amount).",
                                "\"I hear you've been going out with Ella.\" \"Yeah, so? What's it to you?\" (= It should not interest you, and you have no right to ask about it.)"
                            ]
                        },
                        {
                            "explanation": "serving: ",
                            "examples": [
                                "As a personal trainer to the rich and famous, he earns over a million dollars a year."
                            ]
                        },
                        {
                            "explanation": "against or very near: ",
                            "examples": [
                                "Stand back to back.",
                                "They were dancing cheek to cheek."
                            ]
                        },
                        {
                            "explanation": "matching or belonging to: ",
                            "examples": [
                                "My dad gave me the keys to his car.",
                                "I've lost the trousers to this jacket."
                            ]
                        },
                        {
                            "explanation": "having as a characteristic feature: ",
                            "examples": [
                                "She has a mean side to her.",
                                "There is a very moral tone to this book."
                            ]
                        },
                        {
                            "explanation": "used to show the position of something or someone in comparison with something or someone else: ",
                            "examples": [
                                "John's standing to the left of Adrian in the photo.",
                                "The Yorkshire Dales are twenty miles to the north of the city."
                            ]
                        },
                        {
                            "explanation": "in honour or memory of: ",
                            "examples": [
                                "I proposed a toast to the bride and the groom.",
                                "The record is dedicated to her mother, who died recently."
                            ]
                        },
                        {
                            "explanation": "for each: ",
                            "examples": [
                                "How many dollars are there to the pound?",
                                "This car does about 40 miles to the gallon.",
                                "When we go swimming together I do six lengths to her twelve."
                            ]
                        },
                        {
                            "explanation": "used in phrases that show a range: ",
                            "examples": [
                                "There were probably 30 to 35 (= a number between 30 and 35) people there."
                            ]
                        },
                        {
                            "explanation": "at the same time as music or other sound: ",
                            "examples": [
                                "I like exercising to music.",
                                "He left the stage to the sound of booing."
                            ]
                        },
                        {
                            "explanation": "relating to a positive reaction or result: ",
                            "examples": [
                                "When the pasta is done to your liking, drain the water.",
                                "I think being at the meeting would be to your advantage."
                            ]
                        },
                        {
                            "explanation": "compared with: ",
                            "examples": [
                                "She's earning a reasonable wage, but nothing to what she could if she was in the private sector.",
                                "Paul beat me by three games to two (= he won three and I won two).",
                                "He was old enough to be her father - she looked about 30 to his 60."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "tuː"
                            ],
                            "us": [
                                "tuː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "into a closed position: ",
                            "examples": [
                                "I'll just push the door to."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}