{
    "word": "together",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "təˈɡeð.ər"
                            ],
                            "us": [
                                "təˈɡeð.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "with each other: ",
                            "examples": [
                                "We used to go to yoga together.",
                                "We worked together on a project a couple of years back.",
                                "Could you add these numbers together for me?",
                                "You mix all the dry ingredients together before you add the milk.",
                                "I like both flavours separately but I don't like them together.",
                                "You could stick that back together (= join the separate parts to each other) with some glue.",
                                "She said, \"Never trust a man whose eyes are so close together!\"",
                                "The waiter asked if we were all together, so I explained that we were two separate parties.",
                                "We should get together (= meet each other socially) some time and have a drink."
                            ]
                        },
                        {
                            "explanation": "If two people are described as together, they have a close romantic and often sexual relationship with each other: ",
                            "examples": [
                                "Mira and Ellis have been together now for almost five years."
                            ]
                        },
                        {
                            "explanation": "If two people get together or get it together, they start a sexual relationship with each other: ",
                            "examples": [
                                "We'd seen each other a few times as part of a group, but we didn't really get it together till Rachel's party."
                            ]
                        },
                        {
                            "explanation": "at the same time: ",
                            "examples": [
                                "The packages were sent separately, but they all came together. ",
                                "We can deal with the next two items on the list together."
                            ]
                        },
                        {
                            "explanation": "combined: ",
                            "examples": [
                                "Together they must earn over $300,000 a year.",
                                "She's got more sense than the rest of you put together."
                            ]
                        },
                        {
                            "explanation": "in one place: ",
                            "examples": [
                                "I'll just gather my stuff together, and then we can go."
                            ]
                        },
                        {
                            "explanation": "in addition to; and also: ",
                            "examples": [
                                "The money that I owe you for the phone together with the rent equals £300."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "təˈɡeð.ər"
                            ],
                            "us": [
                                "təˈɡeð.ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "organized, confident of your abilities, and able to use them to achieve what you want: ",
                            "examples": [
                                "For a sixteen-year-old, he seems pretty together."
                            ]
                        },
                        {
                            "explanation": "to get something organized: ",
                            "examples": [
                                "We were going to go skiing over Christmas but we never got it together."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}