{
    "word": "token",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtəʊ.kən"
                            ],
                            "us": [
                                "ˈtoʊ.kən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "something that you do, or a thing that you give someone, that expresses your feelings or intentions, although it might have little practical effect: ",
                            "examples": [
                                "As a token of our gratitude for all that you have done, we would like you to accept this small gift.",
                                "It doesn't have to be a big present - it's just a token."
                            ]
                        },
                        {
                            "explanation": "a piece of paper, a card, or an electronic document with a particular amount of money shown on it that can be exchanged in a shop or online for goods of that value: ",
                            "examples": [
                                "a £20 record token",
                                "He always bought me tokens for a department store for my birthday."
                            ]
                        },
                        {
                            "explanation": "a round metal or plastic disc that can be used instead of money : ",
                            "examples": [
                                "Metal tokens are used instead of cash in some slot machines in casinos.",
                                "First they had to queue up to receive a small plastic token, which they could then exchange for food."
                            ]
                        },
                        {
                            "explanation": "a piece of data that is used to represent and replace another one, in order to prevent private information being seen by someone who is not allowed to do so: ",
                            "examples": [
                                "When we receive the transaction securely, we tokenize it and send back a token to the merchant so they never have to see a card number for settlement. "
                            ]
                        },
                        {
                            "explanation": "a unit of language that is used in a particular text : ",
                            "examples": [
                                "The participants produced 1,564 linguistic tokens, of which 1,021 (65%) were marked for plural.",
                                "Types are the distinct words in a text, whereas tokens are all the words, including repeats."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈtəʊ.kən"
                            ],
                            "us": [
                                "ˈtoʊ.kən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe an action, an amount, etc. that is intended to represent something or to show that you are doing something, even if is very small or has a small effect: ",
                            "examples": [
                                "The troops in front of us either surrendered or offered only token (= not much) resistance.",
                                "The company was bought by the government for a token 1p a share."
                            ]
                        },
                        {
                            "explanation": "used to refer to something that is done to in order to appear to support, help, or represent a particular group of people, but that does not help that group of people in a lasting or important way: ",
                            "examples": [
                                "The truth is that they appoint no more than a token number of women to managerial jobs.",
                                "When just one woman is on a company's board she may be dismissed as the token female.",
                                "I felt like a token Black person on the committee. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}