{
    "word": "tone",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "təʊn"
                            ],
                            "us": [
                                "toʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a quality in the voice that expresses the speaker's feelings or thoughts, often towards the person being spoken to: ",
                            "examples": [
                                "I tried to use a sympathetic tone of voice.",
                                "Don't speak to me in that tone of voice (= angrily), young lady!",
                                "It wasn't so much what she said that annoyed me - it was her tone."
                            ]
                        },
                        {
                            "explanation": "the quality of someone's voice: ",
                            "examples": [
                                "She recounted the story to me in shocked tones (= in a shocked voice)."
                            ]
                        },
                        {
                            "explanation": "a change in how high or low the voice is that can change the meaning of a word or sentence",
                            "examples": []
                        },
                        {
                            "explanation": "the general mood or main qualities of something: ",
                            "examples": [
                                "I didn't like the jokey tone of the article - I thought it was inappropriate.",
                                "Trust you to lower the tone of the evening by telling disgusting jokes, Mark!",
                                "Both candidates need to raise the tone of the campaign, as the electorate is tired of negative campaigning.",
                                "He was in a very bad mood when he arrived, and that set the tone for the whole meeting."
                            ]
                        },
                        {
                            "explanation": "a form or degree of a colour: ",
                            "examples": [
                                "warm tones of brown and yellow"
                            ]
                        },
                        {
                            "explanation": "the healthy tightness of the body, especially the muscles: ",
                            "examples": [
                                "After you've had a baby you lose the muscle tone in your stomach."
                            ]
                        },
                        {
                            "explanation": "the largest difference in pitch between two notes that are next to each other in the western musical scale, equal to two semitones: ",
                            "examples": [
                                "The interval from G to A is a whole tone."
                            ]
                        },
                        {
                            "explanation": "the quality of sound of a musical instrument or singing voice: ",
                            "examples": [
                                "the beautiful rich tones of his tenor voice"
                            ]
                        },
                        {
                            "explanation": "one of the continuous sounds that you hear on a phone that tell you if the other phone is ringing, if it is busy, etc.: ",
                            "examples": [
                                "I've called him several times but I keep getting the engaged tone.",
                                "Please wait until you hear the dialling tone (= the sound that a phone makes when it is ready to be used)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "təʊn"
                            ],
                            "us": [
                                "toʊn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you tone a part of the body, you make it firmer and stronger, usually by doing physical exercise: ",
                            "examples": [
                                "This is a good exercise for toning up the thighs."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}