{
    "word": "topper",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtɒp.ər"
                            ],
                            "us": [
                                "ˈtɑː.pɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an object that goes on top of something in order to decorate it: ",
                            "examples": [
                                "An illuminated star topper is a great way of finishing off your Christmas tree.",
                                "Their wedding cake topper was a cute sculpture of the couple.",
                                "We sell a range of stick-on card toppers."
                            ]
                        },
                        {
                            "explanation": "a type of food that is put on top of another food: ",
                            "examples": [
                                "Tofu makes a great salad topper.",
                                "The spread is perfect as a sandwich filler or toast topper. "
                            ]
                        },
                        {
                            "explanation": "a thick cover that goes on top of a mattress (= the soft part of a bed that you lie on) in order to make it more comfortable: ",
                            "examples": [
                                "You can add this memory foam topper to help minimize aches and pains."
                            ]
                        },
                        {
                            "explanation": "the person, group, organization, etc. in the highest position on a list: ",
                            "examples": [
                                "The Spice Girls were chart toppers in the 90s.",
                                "The team now sit just one point below the table toppers."
                            ]
                        },
                        {
                            "explanation": "the last in a series of good or bad events, remarks, actions, etc., especially when this is even better or worse than everything that has gone before: ",
                            "examples": [
                                "Going to his concert was definitely the topper of our trip to Nashville.",
                                "The topper was when a physician told me I'd just have to live with the pain.",
                                "The next day, his wife filed for divorce. This is the topper on the mayor's string of recent difficulties. "
                            ]
                        },
                        {
                            "explanation": "the best student in a class or school",
                            "examples": []
                        },
                        {
                            "explanation": "a woman's short loose coat: ",
                            "examples": [
                                "A whole new take on a classic denim jacket, this crisp white topper features vibrant floral embroidery and lace details."
                            ]
                        },
                        {
                            "explanation": "informal for\ntop hat : ",
                            "examples": [
                                "They were wearing grey toppers and standard wedding gear."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}