{
    "word": "tortoiseshell",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtɔː.təʃ.ʃel"
                            ],
                            "us": [
                                "ˈtɔːr.t̬əs.ʃel"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the hard shell of a turtle that is yellow, orange, and brown and that is used to make decorative objects, or an artificial substance made to look like this: ",
                            "examples": [
                                "Nowadays, jewellery that is marketed as \"tortoiseshell\" is actually plastic.",
                                "This area is the centre of a deadly illegal trade in tortoiseshell and turtle meat."
                            ]
                        },
                        {
                            "explanation": "a cat with black, brown, and orange fur: ",
                            "examples": [
                                "Ella, a seven-year-old tortoiseshell, disappeared from her home three months ago.",
                                "The tortoiseshell cat was found injured and frightened and was taken to an animal sanctuary. "
                            ]
                        },
                        {
                            "explanation": "a type of butterfly (= an insect with large, often brightly coloured wings) that has reddish-orange, black and yellow marks on its wings: ",
                            "examples": [
                                "From the shape of its wings and manner of flight, the butterfly was almost certainly a small tortoiseshell. ",
                                "The food plant for the tortoiseshell butterfly is the stinging nettle."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈtɔː.təʃ.ʃel"
                            ],
                            "us": [
                                "ˈtɔːr.t̬əs.ʃel"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "made of tortoiseshell or of a material that has been made to look like tortoiseshell: ",
                            "examples": [
                                "One of her presents was a tortoiseshell brush, comb, and mirror set.",
                                "glasses with tortoiseshell frames"
                            ]
                        },
                        {
                            "explanation": "(of a cat or its fur) black, brown, and orange in colour: ",
                            "examples": [
                                "They had adopted a tortoiseshell kitten.",
                                "Male cats are almost never tortoiseshell."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}