{
    "word": "touch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʌtʃ"
                            ],
                            "us": [
                                "tʌtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put your hand or another part of your body lightly onto and off something or someone: ",
                            "examples": [
                                "That paint is wet - don't touch (it).",
                                "He touched the girl on the arm to get her attention.",
                                "The boy touched the worm with (= using, in his hand) a twig.",
                                "The setting sun touched the trees with red (= made them appear red for a short time)."
                            ]
                        },
                        {
                            "explanation": "(of two or more things) to be so close together that there is no space between; to be in contact: ",
                            "examples": [
                                "He fell asleep as soon as his head touched the pillow.",
                                "She pushed the two bookcases together until they touched/were touching."
                            ]
                        },
                        {
                            "explanation": "to harm someone, or use or damage something: ",
                            "examples": [
                                "Please don't touch any of my stuff while I'm away."
                            ]
                        },
                        {
                            "explanation": "(usually used in negative sentences) to eat or drink something: ",
                            "examples": [
                                "They didn't touch any of the food we left for them.",
                                "Honestly, I haven't touched a drop (= drunk any alcohol) all night."
                            ]
                        },
                        {
                            "explanation": "to influence someone or something emotionally, or cause feelings of sympathy in someone: ",
                            "examples": [
                                "Tragedy touched their lives when their son was 16.",
                                "The TV report about the children's work for charity touched thousands of people's hearts."
                            ]
                        },
                        {
                            "explanation": "(usually used in negative sentences) to have or reach the same standard (= level of quality) as someone or something: ",
                            "examples": [
                                "Her novels can't touch (= are not as good as) those of her sister.",
                                "There's no one to touch him as an illustrator of children's books."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʌtʃ"
                            ],
                            "us": [
                                "tʌtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small amount: ",
                            "examples": [
                                "\"Would you like milk?\" \"Just a touch.\"",
                                "There was a touch of irony/humour in her voice."
                            ]
                        },
                        {
                            "explanation": "To show that an illness is not too serious, you can say you have had a touch of it: ",
                            "examples": [
                                "I had a touch of flu/hay fever."
                            ]
                        },
                        {
                            "explanation": "a small addition or detail that makes something better: ",
                            "examples": [
                                "The speech had several comic touches.",
                                "Using a sailing ship as the company logo was a touch of genius (= a good/clever idea or action).",
                                "The flowers on the table provided the finishing touch."
                            ]
                        },
                        {
                            "explanation": "slightly: ",
                            "examples": [
                                "The weather has turned a touch too cold for my liking.",
                                "For me, the first course was just a touch bland.",
                                "It's a touch ironic.",
                                "It seems a touch premature to start celebrating now.",
                                "The meat was a touch overcooked.",
                                "Isn't that a touch hypocritical?",
                                "She talks, perhaps a touch optimistically, about retiring by the age of 35."
                            ]
                        },
                        {
                            "explanation": "the ability to know what something is like by feeling it with the fingers: ",
                            "examples": [
                                "the sense of touch",
                                "I found the right coin in the dark by touch."
                            ]
                        },
                        {
                            "explanation": "used after an adjective to express how something feels when you put your hand on it: ",
                            "examples": [
                                "The material was soft to the touch."
                            ]
                        },
                        {
                            "explanation": "a quick, light movement of one thing, especially a hand, onto and off another thing: ",
                            "examples": [
                                "I felt a cold touch on my arm.",
                                "At a/the touch of a button, the door opened."
                            ]
                        },
                        {
                            "explanation": "to communicate or continue to communicate with someone by using a phone or writing to them: ",
                            "examples": [
                                "Are you still in touch with any of your old school friends?"
                            ]
                        },
                        {
                            "explanation": "to stop communicating with someone, usually because they do not live near you now: ",
                            "examples": [
                                "We lost touch over the years."
                            ]
                        },
                        {
                            "explanation": "an ability to do things in the stated, especially positive, way: ",
                            "examples": [
                                "He has a deft touch with tricky painting jobs.",
                                "She gave the job her own special/magic/professional/personal touch.",
                                "I admire her lightness/sureness of touch as a cook.",
                                "He used to be a good writer but I think he's losing his touch."
                            ]
                        },
                        {
                            "explanation": "in sports such as football, a player's ability to control the ball and make it do what they want, or an occasion when a player controls the ball with their foot: ",
                            "examples": [
                                "Salah squandered the chance to score when his touch let him down in front of goal. ",
                                "Hazard took several touches before crossing."
                            ]
                        },
                        {
                            "explanation": "the area outside either of the long edges of the space on which football, rugby, and other sports are played: ",
                            "examples": [
                                "Playing for safety, he kicked the ball into touch.",
                                "He clearly catches the ball with both feet in touch. "
                            ]
                        },
                        {
                            "explanation": "If you are in touch/out of touch with a subject, activity, or situation, your knowledge about it is recent/not recent: ",
                            "examples": [
                                "He's not really in touch with what young people are interested in."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}