{
    "word": "touchpoint",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtʌtʃ.pɔɪnt"
                            ],
                            "us": [
                                "ˈtʌtʃ.pɔɪnt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when a business or an organization is in contact (= communication) with its customers, etc. or meets them, or a method of communicating: ",
                            "examples": [
                                "The updated logo will be visible across all guest touchpoints, from check-in to boarding gate and on to the aircraft.",
                                "Touch points are possible opportunities for interacting with customers and prospects, whether using call centres, salespeople, direct contact in shops or shows, company websites, or e-mail. ",
                                "With the increase of digital touch points, retailers have been able to collect more and more data about their customers.",
                                "Today, Nasa.gov is the main touch point for millions of people around the world regarding the agency's space exploration and aeronautics mission."
                            ]
                        },
                        {
                            "explanation": "an area on a computer or other electronic device that you can touch in order to carry out a particular action: ",
                            "examples": [
                                "The mouse is a touchpoint which is found in the middle of the keyboard.",
                                "If the touchpoint on the touchscreen is within any of the boxes on the menu, then the box touched is lit up.",
                                "This is the touch point - the point on the screen underneath the user's finger."
                            ]
                        },
                        {
                            "explanation": "an influence on the development of something: ",
                            "examples": [
                                "Aldous Huxley 's Brave New World (1932) has become a touchpoint for debate of Western consumerist societies.",
                                "The conflict ended more than three decades ago but has remained an emotional touch point. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}