{
    "word": "tour",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʊər",
                                "tɔːr"
                            ],
                            "us": [
                                "tʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a visit to a place or area, especially one during which you look around the place or area and learn about it: ",
                            "examples": [
                                "We went on a guided tour of the cathedral/museum/factory.",
                                "A bus took us on a sightseeing tour of the city.",
                                "a tour guide"
                            ]
                        },
                        {
                            "explanation": "a journey made for pleasure, especially as a holiday, visiting several different places in an area: ",
                            "examples": [
                                "a cycling tour of Provence",
                                "They've just come back from a tour of (UK also round) California's wine country.",
                                "Tour operators (= companies which arrange holidays for people) have reported a drop in sales."
                            ]
                        },
                        {
                            "explanation": "a planned visit to several places in a country or area made for a special purpose, such as one made by a politician, sports team, or group of performers: ",
                            "examples": [
                                "a lecture/concert tour",
                                "The Queen is making a two-week tour of Australia.",
                                "She is performing in Birmingham tonight, on the third leg of (= stage of) her nationwide tour.",
                                "The England cricket team is on tour in Pakistan."
                            ]
                        },
                        {
                            "explanation": "a \ntour of duty ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʊər",
                                "tɔːr"
                            ],
                            "us": [
                                "tʊr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to go on a tour somewhere: ",
                            "examples": [
                                "We spent a month touring (around/round/in) Kenya.",
                                "The New Zealand team will be touring (in) Europe this winter.",
                                "The president toured US military bases yesterday.",
                                "The band is currently touring to promote the new album."
                            ]
                        },
                        {
                            "explanation": "If a play tours a particular area, it is performed in several places there: ",
                            "examples": [
                                "The play will be performed first in the capital, and will then tour the rest of the country."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}