{
    "word": "track",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "træk"
                            ],
                            "us": [
                                "træk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the pair of long metal bars fixed on the ground at an equal distance from each other, along which trains travel: ",
                            "examples": [
                                "a ten-mile stretch of track",
                                "Passengers are requested not to walk across the tracks."
                            ]
                        },
                        {
                            "explanation": "a path or rough road that is made of soil rather than having a surface covered with stone or other material: ",
                            "examples": [
                                "The house is at the end of a dirt/an unmade track."
                            ]
                        },
                        {
                            "explanation": "a type of path or road, often in the shape of a ring, that has been specially designed and built for sports events, especially racing: ",
                            "examples": [
                                "an all-weather track",
                                "a dog/horse track",
                                "The runners are now on their final lap of the track."
                            ]
                        },
                        {
                            "explanation": "a sport in which people compete with each other by running a race on a specially prepared circular path: ",
                            "examples": [
                                "a track event",
                                "Sam runs track on the high school team."
                            ]
                        },
                        {
                            "explanation": "the general name for a particular group of sports in which people compete, including running, jumping, and throwing",
                            "examples": []
                        },
                        {
                            "explanation": "a mark or line of marks left on the ground or on another surface by an animal, person, or vehicle that has moved over it, showing the direction they moved in: ",
                            "examples": [
                                "Police found tyre tracks in the mud.",
                                "The hunters followed the tracks of the deer for hours.",
                                "The burglars were careful not to leave any tracks behind them."
                            ]
                        },
                        {
                            "explanation": "to be examining marks or pieces of information that show where a person or animal has gone, in order to catch him, her, or it: ",
                            "examples": [
                                "The police are on the track of the killer.",
                                "Once again, he plays a cop on the track of a serial killer.",
                                "I feel sure we're on the track of something big here.",
                                "He's like a police dog on the track of a criminal.",
                                "In her next novel, the amateur sleuth discovers a stash of money and finds herself on the track of a criminal gang."
                            ]
                        },
                        {
                            "explanation": "the direction that something has taken or will take through the air: ",
                            "examples": [
                                "People living in the track of the hurricane have been advised to leave their homes until it has passed."
                            ]
                        },
                        {
                            "explanation": "the direction in which someone's job or education develops: ",
                            "examples": [
                                "She was a lawyer, but then she changed track completely and became a doctor."
                            ]
                        },
                        {
                            "explanation": "the way in which a thought or idea has developed or might develop: ",
                            "examples": [
                                "I found it difficult to follow the track of his argument."
                            ]
                        },
                        {
                            "explanation": "to start talking about something that is not part of what you should be talking about: ",
                            "examples": [
                                "I think we're getting off the track here - we're supposed to be discussing our advertising campaign.",
                                "Anyway, we're getting off the track and need to be a bit more focused.",
                                "Sorry, I'm getting off the track.",
                                "Aren't we getting off the track here? ",
                                "We're getting off the track a little and I'm aware that we don't have long to make a decision.",
                                "Abbie always lets us know if we get off the track at any point."
                            ]
                        },
                        {
                            "explanation": "a set of classes for school students with similar ability who are approximately the same age and are taught together: ",
                            "examples": [
                                "Students who do well in their 8th grade classes will qualify for the honors track in high school.",
                                "the top/bottom track"
                            ]
                        },
                        {
                            "explanation": "an arrangement in which a group of students attends school at a particular time when another group at the same school is on holiday: ",
                            "examples": [
                                "This is a year-round school and parents with several children may have to place them on different tracks.",
                                "In a school with a single track, the entire student body is on the same calendar."
                            ]
                        },
                        {
                            "explanation": "one of several songs or pieces of music on a CD or other musical recording: ",
                            "examples": [
                                "The album includes four previously unreleased tracks."
                            ]
                        },
                        {
                            "explanation": "a part of a magnetic strip onto which sound can be recorded, with several tracks on one magnetic strip: ",
                            "examples": [
                                "When a piece of music is recorded, each instrument is recorded separately on a 24 or 48-track tape."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "træk"
                            ],
                            "us": [
                                "træk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to follow a person or animal by looking for proof that they have been somewhere, or by using electronic equipment: ",
                            "examples": [
                                "It's difficult to track an animal over stony ground.",
                                "The military use radar satellites to track targets through clouds and at night.",
                                "The terrorists were tracked to (= found in) Amsterdam."
                            ]
                        },
                        {
                            "explanation": "to record the progress or development of something over a period: ",
                            "examples": [
                                "The study tracked the careers of 1,226 doctors who trained at the Medical School."
                            ]
                        },
                        {
                            "explanation": "If a film or video camera tracks in a particular direction, it moves along while it is filming: ",
                            "examples": [
                                "The movie ends with a long tracking shot around the deserted house."
                            ]
                        },
                        {
                            "explanation": "If a moving part of a recording machine tracks, it gets into the correct position for operating: ",
                            "examples": [
                                "Our VCR tracks automatically."
                            ]
                        },
                        {
                            "explanation": "to follow the level of an interest rate, share price, etc.: ",
                            "examples": [
                                "The mortgage deal will track the Bank of England base rate plus 0.75 percent.",
                                "Tony is putting £500 a month into a a savings account that tracks the FTSE All-Share index."
                            ]
                        },
                        {
                            "explanation": "to group and teach together school students with similar abilities who are approximately the same age: ",
                            "examples": [
                                "We start to track the children in the third form."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}