{
    "word": "traffic",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtræf.ɪk"
                            ],
                            "us": [
                                "ˈtræf.ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the number of vehicles moving along roads, or the amount of aircraft, trains, or ships moving along a route: ",
                            "examples": [
                                "There was heavy/a lot of traffic on the roads this morning.",
                                "We got stuck in traffic for several hours.",
                                "New measures have been introduced to try and ease traffic congestion in the city.",
                                "Five people were injured in a traffic accident (= one involving vehicles).",
                                "I heard about the accident on the traffic report on the radio this morning.",
                                "Air traffic has increased 30 percent in the last decade."
                            ]
                        },
                        {
                            "explanation": "people or goods transported by road, air, train, or ship, as a business: ",
                            "examples": [
                                "The airline halved its overseas service because of a sharp reduction in traffic.",
                                "Environmental groups want more passenger and freight traffic moved off the roads and onto trains."
                            ]
                        },
                        {
                            "explanation": "illegal trade: ",
                            "examples": [
                                "to cut down the traffic in drugs/the drug traffic",
                                "Police are looking for ways of curbing the traffic in guns."
                            ]
                        },
                        {
                            "explanation": "the activity of data and messages passing through an online communication system or the number of visits to a particular website: ",
                            "examples": [
                                "internet traffic",
                                "Twitter traffic",
                                "web/website/site traffic",
                                "We can give you advice on how to improve your site traffic and generate sales."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtræf.ɪk"
                            ],
                            "us": [
                                "ˈtræf.ɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to buy and sell goods illegally: ",
                            "examples": [
                                "They were arrested for trafficking in the eggs of protected species of birds."
                            ]
                        },
                        {
                            "explanation": "to illegally buy or sell people, or make money from work they are forced to do, such as sex work: ",
                            "examples": [
                                "It is estimated that between 700,000 and 2 million women and children are trafficked globally each year."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}