{
    "word": "traffic light",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtræf.ɪk ˌlaɪt"
                            ],
                            "us": [
                                "ˈtræf.ɪk ˌlaɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "one of a set of red, yellow, and green lights that control the movement of vehicles, usually at a point where two or more roads join: ",
                            "examples": [
                                "The police pulled him over for failing to stop at a red traffic light.",
                                "Turn left at the traffic lights.",
                                "The traffic lights changed to/turned green as we approached the junction."
                            ]
                        },
                        {
                            "explanation": "in the UK, one of a set of red, yellow, and green symbols used on some products, especially food, to show how much of a particular substance they contain: ",
                            "examples": [
                                "Do manufacturers have to legally show the traffic lights on their products?",
                                "Cheese generally has a red traffic light for fat."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈtræf.ɪk ˌlaɪt"
                            ],
                            "us": [
                                "ˈtræf.ɪk ˌlaɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "especially in the UK, used to describe a system in which the colours red, yellow, and green are used to show different amounts or rates: ",
                            "examples": [
                                "The Food Standards Agency (FSA) is producing advertisements promoting its traffic light labelling system for packaged foods.",
                                "They are planning a traffic light system that rates countries as red, amber, or green based on Covid infection rates.",
                                "A \"traffic-light\" system was applied to cleaning standards in the hospital, with green for \"good\", yellow for \"acceptable\" and red for \"poor\". "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}