{
    "word": "trail",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "treɪl"
                            ],
                            "us": [
                                "treɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a path through a countryside, mountain, or forest area, often made or used for a particular purpose: ",
                            "examples": [
                                "a forest/mountain trail",
                                "a walking/snowshoeing/cross-country skiing trail"
                            ]
                        },
                        {
                            "explanation": "the smell or series of marks left by a person, animal, or thing as it moves along: ",
                            "examples": [
                                "The dogs are trained to follow the trail left by the fox.",
                                "He left a trail of muddy footprints behind him."
                            ]
                        },
                        {
                            "explanation": "various pieces of information that together show where someone you are searching for has gone: ",
                            "examples": [
                                "The police admit that the robbers have left no trail for them to follow up."
                            ]
                        },
                        {
                            "explanation": "to be searching for someone or something by examining information you find about where they went: ",
                            "examples": [
                                "The three men went to the Bahamas, on the trail of a sunken 17th-century galleon full of treasure."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "treɪl"
                            ],
                            "us": [
                                "treɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (allow something to) move slowly along the ground or through the air or water, after someone or something: ",
                            "examples": [
                                "Katherine, your skirt's trailing in the mud!",
                                "As the boat moved along, he trailed his hand in the water."
                            ]
                        },
                        {
                            "explanation": "to move slowly and without energy or enthusiasm: ",
                            "examples": [
                                "The delegates trailed back into the conference room for the afternoon session.",
                                "After a mile or two the youngest children were trailing behind."
                            ]
                        },
                        {
                            "explanation": "to be losing to your competitor in a competition: ",
                            "examples": [
                                "The Canadian team is trailing by six points."
                            ]
                        },
                        {
                            "explanation": "to follow the trail of someone or something",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}