{
    "word": "transit",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtræn.zɪt"
                            ],
                            "us": [
                                "ˈtræn.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the movement of goods or people from one place to another: ",
                            "examples": [
                                "It is possible to make an insurance claim for any goods lost or damaged in transit.",
                                "The question is whether road transit is cheaper than rail.",
                                "We booked tickets on the rapid-transit train."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtræn.zɪt"
                            ],
                            "us": [
                                "ˈtræn.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to pass through or across a place, an area, or a country on the way to somewhere else: ",
                            "examples": [
                                "Millions of passengers transit through Dubai airport every year.",
                                "We assume that mammoths habitually transited areas colder than many other creatures could tolerate."
                            ]
                        },
                        {
                            "explanation": "(of a planet or other object in space) to pass across another heavenly body (= a planet, star, moon, etc.) or a meridian (= an imaginary line or circle passing through the poles): ",
                            "examples": [
                                "The course offers skilled amateur astronomers the opportunity to help in the search for planets transiting stars.",
                                "Astronomers are searching for possible signs of a planet transiting across the distant Sun's face."
                            ]
                        },
                        {
                            "explanation": "in astrology, to move towards or pass across a particular star sign: ",
                            "examples": [
                                "We are transiting into the sign of Aquarius, the sign of the water-carrier.",
                                "Neptune will transit Pisces for a short period between April 4 and August 5 and this may affect your emotional balance."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtræn.zɪt"
                            ],
                            "us": [
                                "ˈtræn.zɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a brand name for a type of road vehicle used especially for carrying goods: ",
                            "examples": [
                                "He was seen driving a white Transit van near Leeds."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}