{
    "word": "transition",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "trænˈzɪʃ.ən"
                            ],
                            "us": [
                                "trænˈzɪʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a change from one form or type to another, or the process by which this happens: ",
                            "examples": [
                                "The health-care system is in transition at the moment.",
                                "There will be an interim government to oversee the transition to democracy."
                            ]
                        },
                        {
                            "explanation": "changes, which may be social, legal, or medical, that lead to someone living their life as a person of a different gender to the one they were said to have at birth: ",
                            "examples": [
                                "She began her transition from male to female almost seven years ago."
                            ]
                        },
                        {
                            "explanation": "in basketball and other sports, the act of changing from playing on defence to offence, or from offence to defence, after a player scores or when there is a change in possession, including running to the correct new positions on the court (= playing area): ",
                            "examples": [
                                "After Delmon grabbed the rebound, the team made a quick transition up the court. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "trænˈzɪʃ.ən"
                            ],
                            "us": [
                                "trænˈzɪʃ.ən"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change, or make someone or something change, from one form or situation to another: ",
                            "examples": [
                                "Some National Guard members experienced financial difficulties when they transitioned from state to federal control.",
                                "Texas schools have traditionally transitioned students from Spanish to English in elementary school."
                            ]
                        },
                        {
                            "explanation": "If someone transitions, they make changes, which may be social, legal, or medical, that lead to them living as a person of a different gender to the one they were said to have at birth: ",
                            "examples": [
                                "Louise transitioned from male to female almost 20 years ago.",
                                "It wasn't easy transitioning gender in the military."
                            ]
                        },
                        {
                            "explanation": "in basketball and other sports, to change from playing on defence to offence, or from offence to defence, after a player scores or when there is a change in possession, for example by running to the correct new positions on the court (= playing area): ",
                            "examples": [
                                "After scoring, the team transitioned too slowly and left a lane open for Mowry to score an easy layup. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}