{
    "word": "travel",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtræv.əl"
                            ],
                            "us": [
                                "ˈtræv.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US usually"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make a journey, usually over a long distance: ",
                            "examples": [
                                "Between school and university, she spent a year travelling, mostly in Africa and Asia.",
                                "I travel to work by train.",
                                "He travelled over 1,000 miles to be at the wedding.",
                                "As a young man he had travelled (= been to many parts of) the world."
                            ]
                        },
                        {
                            "explanation": "If something travels well/badly, it does/does not stay in good condition if it is moved long distances: ",
                            "examples": [
                                "Some wines don't travel well."
                            ]
                        },
                        {
                            "explanation": "to make a journey without taking a lot of heavy things with you: ",
                            "examples": [
                                "I always try to travel light."
                            ]
                        },
                        {
                            "explanation": "to move or go from one place to another: ",
                            "examples": [
                                "Supersonic planes can travel faster than the speed of sound.",
                                "With wooden-bat baseball, the ball doesn't travel as far as it does with aluminium bats. ",
                                "Signals at this wavelength can travel easily through buildings."
                            ]
                        },
                        {
                            "explanation": "to move very fast: ",
                            "examples": [
                                "That bike can really travel!"
                            ]
                        },
                        {
                            "explanation": "in basketball, to move three or more steps with the ball without dribbling it (= hitting it against the floor repeatedly), which is against the rules: ",
                            "examples": [
                                "The coach argued to the referee that the player travelled before he took the shot. "
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtræv.əl"
                            ],
                            "us": [
                                "ˈtræv.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the activity of travelling: ",
                            "examples": [
                                "air/space travel",
                                "business travel",
                                "We share a love of literature, food and travel.",
                                "I heard on the travel news that there'd been an accident."
                            ]
                        },
                        {
                            "explanation": "journeys: ",
                            "examples": [
                                "a record of her travels in/around the Far East"
                            ]
                        },
                        {
                            "explanation": "the distance, speed, or direction that an object moves or is able to move: ",
                            "examples": [
                                "The calendar is based on the orbital travel of Earth around the Sun.",
                                "The arrows show the ball's direction of travel.",
                                "The bicycle's fork has a total travel of about 4 inches."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [],
                            "us": [
                                "ˈtræv.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "describing a sport that is played by organized teams of young people, often involving the best players who travel to play in different parts of the country: ",
                            "examples": [
                                "Hauptman played travel soccer when he was younger.",
                                "Jake gave up playing travel baseball so he could play in his hometown with his friends.",
                                "They're looking for coaches for their girls travel team."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}