{
    "word": "tremble",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtrem.bəl"
                            ],
                            "us": [
                                "ˈtrem.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to shake slightly in a way that you cannot control, for example because you are frightened, angry, or excited, or because of illness: ",
                            "examples": [
                                "I was trembling with fear, panicking that I had not made the right decision.",
                                "At her side Michael trembled uncontrollably. He was so distraught he could not speak.",
                                "I could see them coming for me. I was already trembling in anticipation when they grabbed me.",
                                "Her bottom lip trembled, and tears welled up in her eyes.",
                                "His voice started to tremble, and I thought he was going to cry."
                            ]
                        },
                        {
                            "explanation": "of the ground or an object, to shake slightly: ",
                            "examples": [
                                "The pair remained calm as the earth trembled beneath their feet.",
                                "I could tell the wind was rising - the leaves were trembling on the trees."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtrem.bəl"
                            ],
                            "us": [
                                "ˈtrem.bəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an act of shaking slightly in a way that you cannot control, for example because you are frightened, angry, or excited, or because of illness: ",
                            "examples": [
                                "There was a slight tremble in her voice as she recalled her husband.",
                                "The first symptom of the illness was a tremble in his right hand."
                            ]
                        },
                        {
                            "explanation": "a slight shaking movement of the ground or an object: ",
                            "examples": [
                                "I was on the other side of the building when the mortar hit and I actually felt the tremble of the ground."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}