{
    "word": "trick",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "trɪk"
                            ],
                            "us": [
                                "trɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an action that is intended to deceive, either as a way of cheating someone, or as a joke or form of entertainment: ",
                            "examples": [
                                "She played a really nasty trick on me - she put syrup in my shampoo bottle!",
                                "My niece was showing me all the tricks that she's learned to do with her new magic set.",
                                "It's trick photography - she's supposed to look like she's walking on water."
                            ]
                        },
                        {
                            "explanation": "to be an effect caused by light, making something appear different: ",
                            "examples": [
                                "For a moment I thought you had a patch of grey hair, but it's just a trick of the light."
                            ]
                        },
                        {
                            "explanation": "what children say when they go \ntrick-or-treating  at Halloween: ",
                            "examples": [
                                "I thought I heard kids shouting \"Trick or treat!\""
                            ]
                        },
                        {
                            "explanation": "an effective or quick way of doing something: ",
                            "examples": [
                                "What's the trick to getting this chair to fold up?",
                                "On page 21, some tricks to speed up your beauty routine."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "trɪk"
                            ],
                            "us": [
                                "trɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to deceive someone, often as a part of a plan: ",
                            "examples": [
                                "Dean tricked the old lady into giving him eight hundred dollars."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "trɪk"
                            ],
                            "us": [
                                "trɪk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to deceive someone, either as a joke or form of entertainment or so that they make a mistake: ",
                            "examples": [
                                "a trick question"
                            ]
                        },
                        {
                            "explanation": "A trick part of the body, especially a joint (= place where two bones are connected), sometimes feels weak suddenly and unexpectedly: ",
                            "examples": [
                                "I have a trick ankle that gives me problems if I run too much."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}