{
    "word": "trouble",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtrʌb.əl"
                            ],
                            "us": [
                                "ˈtrʌb.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "problems or difficulties: ",
                            "examples": [
                                "The tax forms were complicated and I had a lot of trouble with them.",
                                "Their problems seem to be over for the moment, but there could be more trouble ahead.",
                                "The trouble started/began when my father came to live with us.",
                                "Parents often have trouble finding good carers for their children.",
                                "We started holding meetings by phone, as travelling in and out of the city became too much trouble.",
                                "I should get it finished over the weekend without too much trouble.",
                                "You'll only be storing up trouble for the future if you don't go to the dentist now.",
                                "She thought her troubles would be over once she'd got divorced.",
                                "His birthday is the least of my troubles at the moment - I don't even have enough money to pay the rent.",
                                "Most of the current troubles stem from (= are caused by) our new computer system."
                            ]
                        },
                        {
                            "explanation": "a situation in which you experience problems, usually because of something you have done wrong or badly: ",
                            "examples": [
                                "He's never been in trouble with his teachers before.",
                                "She'll be in big trouble if she scratches Sam's car.",
                                "He got into financial trouble after his divorce.",
                                "I hope you won't get into trouble because of what I said to your dad.",
                                "The camp is a great way of getting kids off the street and keeping them out of trouble.",
                                "I hope I haven't landed you in trouble with your boss.",
                                "The marriage ran into trouble because of her husband's heavy drinking.",
                                "The company will be in serious/real trouble if we lose this contract.",
                                "He's stayed out of trouble since he was released from jail last year."
                            ]
                        },
                        {
                            "explanation": "a characteristic of someone or something that is considered a disadvantage or problem: ",
                            "examples": [
                                "The trouble with this carpet is that it gets dirty very easily.",
                                "It's a brilliant idea. The only trouble is that we don't know how much it will cost.",
                                "Ron's trouble is that he's too impatient."
                            ]
                        },
                        {
                            "explanation": "problems or difficulties caused by something failing to operate as it should: ",
                            "examples": [
                                "The plane developed engine trouble shortly after take-off.",
                                "They have a good reputation for building reliable trouble-free cars.",
                                "Her knee trouble is expected to keep her out of the game for the rest of the season."
                            ]
                        },
                        {
                            "explanation": "problems in the form of arguments, fighting, or violence: ",
                            "examples": [
                                "Listen, I don't want any trouble in here, so please just finish your drink and leave.",
                                "My parents said we had to leave at the first sign of trouble.",
                                "My little brother's always trying to stir up (= create) trouble between me and my boyfriend."
                            ]
                        },
                        {
                            "explanation": "slight problems or effort: ",
                            "examples": [
                                "I didn't mean to cause you any trouble.",
                                "\"I'd love some more coffee, if it isn't too much trouble.\" \"Oh, it's no trouble at all.\"",
                                "I don't want to put you to any trouble (= create any work for you).",
                                "If you took the trouble to listen to what I was saying, you'd know what I was talking about.",
                                "They went to a lot of trouble (= made a lot of effort) for their dinner party, but half the guests didn't bother to turn up.",
                                "It's annoying, but I don't think I'll go to the trouble of making an official complaint."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈtrʌb.əl"
                            ],
                            "us": [
                                "ˈtrʌb.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to cause someone to be worried or nervous: ",
                            "examples": [
                                "I asked her what was troubling her, but she didn't want to talk.",
                                "Many of us are deeply troubled by the chairman's decision.",
                                "It troubles me (that) you didn't discuss your problems with me earlier."
                            ]
                        },
                        {
                            "explanation": "to cause someone to have a problem or difficulties: ",
                            "examples": [
                                "He has been troubled by a knee injury for most of the season."
                            ]
                        },
                        {
                            "explanation": "to cause someone a small amount of effort: ",
                            "examples": [
                                "May I trouble you for (= please give me) some more wine, please?",
                                "Could I trouble you to open that window? I can't reach it.",
                                "Let's not trouble ourselves (= make the effort to think) about the details at the moment."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}