{
    "word": "true",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "truː"
                            ],
                            "us": [
                                "truː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(especially of facts or statements) right and not wrong; correct: ",
                            "examples": [
                                "Is it true that Mariana and Mark are getting married?",
                                "The allegations, if true, could lead to her resignation.",
                                "Her story is only partly true.",
                                "Would it be true to say that you've never liked Jim?",
                                "I suspect she gave a true picture (= accurate description) of what had happened.",
                                "I don't believe these exam results are a true reflection of your abilities.",
                                "The movie is based on the true story of a London gangster.",
                                "She has since admitted that her earlier statement was not strictly (= completely) true.",
                                "It used to be very cheap but that's no longer true (= that situation does not now exist).",
                                "Alcohol should be consumed in moderation, and this is particularly true for pregnant women.",
                                "Parents of young children often become depressed, and this is especially true of single parents."
                            ]
                        },
                        {
                            "explanation": "correct or accurate but not completely explaining something: ",
                            "examples": [
                                "It's true enough that he had doubts about the project, but we have to look further to understand why he resigned."
                            ]
                        },
                        {
                            "explanation": "being what exists, rather than what was thought, intended, or stated: ",
                            "examples": [
                                "In his seventh decade he has finally found true love.",
                                "a true friend",
                                "There cannot be true democracy without reform of the electoral system.",
                                "The true horror of the accident did not become clear until the morning."
                            ]
                        },
                        {
                            "explanation": "If a hope, wish, or dream comes true, it happens although it was unlikely that it would: ",
                            "examples": [
                                "I'd always dreamed of owning my own house, but I never thought it would come true."
                            ]
                        },
                        {
                            "explanation": "sincere or loyal, and likely to continue to be so in difficult situations: ",
                            "examples": [
                                "There are few true believers in communism left in the party.",
                                "She has vowed to remain true to the president whatever happens.",
                                "He said he'd repay the money the next day, and true to his word (= as he had promised), he gave it all back to me the following morning."
                            ]
                        },
                        {
                            "explanation": "to behave according to your beliefs and do what you think is right: ",
                            "examples": [
                                "I mean in the end, you have to be true to yourself."
                            ]
                        },
                        {
                            "explanation": "Someone who does something true to form or type behaves as other people would have expected from previous experience: ",
                            "examples": [
                                "True to form, when it came to his turn to buy the drinks, he said he'd left his wallet at home."
                            ]
                        },
                        {
                            "explanation": "having all the characteristics necessary to be accurately described as something: ",
                            "examples": [
                                "Only true deer have antlers.",
                                "It was said that the portrait was a very true likeness of her (= looked very much like her).",
                                "In true Hollywood style (= in a way that is typical of Hollywood), she's had four marriages and three facelifts."
                            ]
                        },
                        {
                            "explanation": "fitted or positioned accurately: ",
                            "examples": [
                                "None of the drawers were true."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "truː"
                            ],
                            "us": [
                                "truː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to not be in the correct position or to be slightly bent out of the correct shape: ",
                            "examples": [
                                "This door won't shut. I think the frame must be out of true."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "truː"
                            ],
                            "us": [
                                "truː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "straight and without moving to either side: ",
                            "examples": [
                                "Make sure you hit the nails in true."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}