{
    "word": "trust",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "trʌst"
                            ],
                            "us": [
                                "trʌst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to believe that someone is good and honest and will not harm you, or that something is safe and reliable: ",
                            "examples": [
                                "My sister warned me not to trust him.",
                                "Trust me - I know about these things.",
                                "Trust your instincts, and do what you think is right.",
                                "I don't trust air travel - it's unnatural.",
                                "I trust him to make the right decision.",
                                "That man is not to be trusted.",
                                "I wouldn't trust him with my car.",
                                "Sometimes you have to trust in the goodness of human nature.",
                                "However much you plan an expedition like this, you still have to trust to luck to a certain extent."
                            ]
                        },
                        {
                            "explanation": "to hope and expect that something is true: ",
                            "examples": [
                                "I trust (that) you slept well?",
                                "The meeting went well, I trust."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "trʌst"
                            ],
                            "us": [
                                "trʌst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the belief that you can trust someone or something: ",
                            "examples": [
                                "a relationship based on trust and understanding",
                                "We were obviously wrong to put our trust in her.",
                                "He's in a position of trust (= a position with responsibilities, especially to the public)."
                            ]
                        },
                        {
                            "explanation": "to believe that something is true although you have no proof",
                            "examples": []
                        },
                        {
                            "explanation": "a legal arrangement in which a person or organization controls property and/or money for another person or organization: ",
                            "examples": [
                                "Under the terms of the trust he receives interest on the money, but he cannot get at the money itself.",
                                "The money that her father left her is being held/kept in trust (= being controlled) for her until she's 30."
                            ]
                        },
                        {
                            "explanation": "an organization that controls property and/or money for another person: ",
                            "examples": [
                                "He works for a charitable trust.",
                                "Housing trusts help to provide houses for people who are not well off."
                            ]
                        },
                        {
                            "explanation": "used in the name of some banks: ",
                            "examples": [
                                "Morgan Guaranty Trust"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}