{
    "word": "try",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "traɪ"
                            ],
                            "us": [
                                "traɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to attempt to do something: ",
                            "examples": [
                                "Keep trying and you'll find a job eventually.",
                                "If I don't get into the academy this year, I'll try again next year.",
                                "I've tried really hard but I can't convince him to come.",
                                "I'm trying my best/hardest, but I just can't do it.",
                                "I tried to open the window.",
                                "Maybe you should try getting up (= you should get up) earlier."
                            ]
                        },
                        {
                            "explanation": "to test something to see if it is suitable or useful or if it works: ",
                            "examples": [
                                "I tried that recipe you gave me last night.",
                                "We don't sell newspapers - have you tried the coffee shop on the corner?",
                                "Try using a different shampoo.",
                                "I'd like to try parachuting.",
                                "I forgot my door-keys - we'd better try the window (= test it to see if it is open)."
                            ]
                        },
                        {
                            "explanation": "used by many people and proved to be effective: ",
                            "examples": [
                                "Most people would prefer to stick to tried and tested methods of birth control."
                            ]
                        },
                        {
                            "explanation": "to examine a person accused of committing a crime in a law court by asking them questions and considering known facts, and then decide if they are guilty: ",
                            "examples": [
                                "Because of security implications the officers were tried in secret.",
                                "They are being tried for murder."
                            ]
                        },
                        {
                            "explanation": "to worry or annoy someone or upset a person's patience with many, often slight, difficulties: ",
                            "examples": [
                                "The demands of the job have tried him sorely.",
                                "He's been trying my patience all morning with his constant questions.",
                                "Her endless demands would try the patience of a saint (= are very annoying)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "traɪ"
                            ],
                            "us": [
                                "traɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an attempt to do something: ",
                            "examples": [
                                "They might still have tickets left - why don't you give it a try?",
                                "This will be her third try at jumping the bar.",
                                "You could ask him if he's willing - it's worth a try."
                            ]
                        },
                        {
                            "explanation": "(in the game of rugby) the act of a player putting the ball on the ground behind the opposing team's goal line, which scores points for the player's team",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}