{
    "word": "tune",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tʃuːn"
                            ],
                            "us": [
                                "tuːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a series of musical notes, especially one that is pleasant and easy to remember: ",
                            "examples": [
                                "He was humming a tune as he dried the dishes.",
                                "a theme tune",
                                "That's a very catchy tune (= easy to remember and pleasant)."
                            ]
                        },
                        {
                            "explanation": "singing or playing notes that are at the right pitch (= level) or that agree with others being sung or played: ",
                            "examples": [
                                "She can't even sing in tune."
                            ]
                        },
                        {
                            "explanation": "singing or playing notes that are at the wrong pitch (= level) or that do not agree with others being sung or played: ",
                            "examples": [
                                "The piano is out of tune."
                            ]
                        },
                        {
                            "explanation": "If you are in tune with people or ideas, you understand or agree with them, and if you are out of tune with them, you do not: ",
                            "examples": [
                                "Much of his success comes from being in tune with what his customers want."
                            ]
                        },
                        {
                            "explanation": "to the stated amount: ",
                            "examples": [
                                "The City Council had financed the new building to the tune of over four million pounds."
                            ]
                        },
                        {
                            "explanation": "a \ntune-up ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tʃuːn"
                            ],
                            "us": [
                                "tuːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to change a part of a musical instrument so that the instrument produces the correct sounds when played: ",
                            "examples": [
                                "Get into the habit of tuning your guitar every day before you practise.",
                                "She tuned (up) her violin before the concert."
                            ]
                        },
                        {
                            "explanation": "to move the controls on a radio, television, etc. so that it receives programmes broadcast from a particular station: ",
                            "examples": [
                                "Press this button and the video will automatically tune itself to the next channel.",
                                "His radio is constantly tuned to KROQ-FM, the local rock station."
                            ]
                        },
                        {
                            "explanation": "to make slight changes to an engine so that it works as well as possible: ",
                            "examples": [
                                "The engine needs tuning, but there's nothing wrong with the car.",
                                "Could you tune (up) the engine for me, please?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}