{
    "word": "turn",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "tɜːn"
                            ],
                            "us": [
                                "tɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to (cause to) move in a circle around a fixed point or line: ",
                            "examples": [
                                "The earth turns on its axis once every 24 hours.",
                                "She turned on her toes, holding out her skirt.",
                                "The wheels started to turn (around).",
                                "Turn the steering wheel as quickly as you can.",
                                "She turned the doorknob and quietly opened the door.",
                                "Slowly, I turned the door handle."
                            ]
                        },
                        {
                            "explanation": "to perform a movement in which your body moves around in a circle: ",
                            "examples": [
                                "She turned a full somersault in the air. ",
                                "They turned cartwheels down the catwalk."
                            ]
                        },
                        {
                            "explanation": "to (cause to) change the direction in which you are facing or moving: ",
                            "examples": [
                                "Turn right at the traffic lights.",
                                "The path twists and turns for the next half mile.",
                                "We have to turn down/into/up the next road on the right.",
                                "Plants tend to turn towards the source of light.",
                                "She turned to face him.",
                                "He turned on his heel (= turned quickly to face the opposite direction) and left the room.",
                                "The person on my left turned to me and whispered \"Not another speech!\"",
                                "His wife tried to speak to him, but he turned his back (on her)/ (= moved so that his back, not his face, was towards her to show his anger).",
                                "She turned away (from him) to hide her tears. ",
                                "At about three o'clock, the tide started to turn (= the sea started to come closer to or move away from the beach).",
                                "He turned his head to me to listen.",
                                "I'll just turn the car round and go back the way we came.",
                                "We watched until the car had turned (= gone around) the corner.",
                                "The army turned their guns on (= pointed them at and started to shoot at) the protesters."
                            ]
                        },
                        {
                            "explanation": "In cricket, if a ball turns, it changes direction suddenly when it hits the ground: ",
                            "examples": [
                                "On this pitch, the ball turns and our batsmen have had to learn a new technique",
                                "The totals became lower as the day wore on, and the ball turned more."
                            ]
                        },
                        {
                            "explanation": "to move, or to move an object or page, so that a different side or surface is on the top: ",
                            "examples": [
                                "Now turn the page, please, and start work on Exercise 2.",
                                "She turned the vase over to look for the price.",
                                "He turned over two or three pages.",
                                "She put out the light, turned over (= rolled in order to face in another direction) and went to sleep.",
                                "Now turn to (= open the book at) page 23 and look at the first paragraph."
                            ]
                        },
                        {
                            "explanation": "to (cause to) become, change into, or come to be something: ",
                            "examples": [
                                "The weather has suddenly turned cold.",
                                "When I refused to pay, he turned nasty.",
                                "She turned pale and started to shiver.",
                                "The mood of the meeting turned solemn when the extent of the problem became known.",
                                "The companies worked well together for a while, but eventually the relationship turned sour (= became bad).",
                                "Keele, pop star turned business tycoon, has launched a new range of cosmetics.",
                                "The dry weather turned the soil into/to concrete.",
                                "By the end of September, the leaves have started to turn (= become brown).",
                                "Her attitude turned from politely interested to enthusiastic during the course of our conversation."
                            ]
                        },
                        {
                            "explanation": "to become a particular age: ",
                            "examples": [
                                "She turned 18 last year."
                            ]
                        },
                        {
                            "explanation": "to become a particular time: ",
                            "examples": [
                                "It's just turned ten o'clock."
                            ]
                        },
                        {
                            "explanation": "to use a control to switch a piece of equipment or a power or water supply on or off, or to increase or reduce what it is producing: ",
                            "examples": [
                                "I got into bed, turned off/out the light, and fell asleep.",
                                "Who turned the TV on?",
                                "I asked him to turn down the heating.",
                                "Turn the sound up - I can't hear what they're saying.",
                                "The heater turns off (= can be switched off) using this switch."
                            ]
                        },
                        {
                            "explanation": "to damage the muscles in the foot by suddenly twisting it too strongly: ",
                            "examples": [
                                "She turned her ankle on the rocks and had to hobble back to camp."
                            ]
                        },
                        {
                            "explanation": "to shape a piece of wood while it is attached to a machine that spins it: ",
                            "examples": [
                                "a turned bowl"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "tɜːn"
                            ],
                            "us": [
                                "tɝːn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an opportunity or a duty to do something at a particular time or in a particular order, before or after other people: ",
                            "examples": [
                                "Is it my turn yet?",
                                "I waited so long for my turn to see the careers adviser that I missed my bus.",
                                "It's your turn to do the dishes!",
                                "In this game if you give the wrong answer you have to miss a turn."
                            ]
                        },
                        {
                            "explanation": "When a number of people take turns, they do the same thing one after the other: ",
                            "examples": [
                                "We take turns answering the phone."
                            ]
                        },
                        {
                            "explanation": "one after the other in an agreed order: ",
                            "examples": [
                                "Each of us takes a break in turn."
                            ]
                        },
                        {
                            "explanation": "not following the agreed order: ",
                            "examples": [
                                "You are not allowed to play a card out of turn."
                            ]
                        },
                        {
                            "explanation": "an action that causes something to move in a circle round a fixed point: ",
                            "examples": [
                                "Give the screw a couple of turns to make sure it's tight."
                            ]
                        },
                        {
                            "explanation": "a change in the direction in which you are moving or facing: ",
                            "examples": [
                                "When you see the school on the left, make a right turn.",
                                "The path was full of twists and turns."
                            ]
                        },
                        {
                            "explanation": "starting to change direction: ",
                            "examples": [
                                "The tide is on the turn."
                            ]
                        },
                        {
                            "explanation": "starting to become better or worse: ",
                            "examples": [
                                "There are fears that the housing market is on the turn.",
                                "The world economy would appear to be on the turn.",
                                "Some say the club's fortunes might be on the turn.",
                                "I had a feeling my luck was on the turn."
                            ]
                        },
                        {
                            "explanation": "(of food or drink) starting to decay: ",
                            "examples": [
                                "This milk smells funny – I think it's on the turn.",
                                "Often the fruit is so ripe that it is on the turn."
                            ]
                        },
                        {
                            "explanation": "the point at which something changes or moves in a different direction: ",
                            "examples": [
                                "the turn of the tide"
                            ]
                        },
                        {
                            "explanation": "the middle point in a round of golf, usually after the ninth hole: ",
                            "examples": [
                                "He was six under at the turn.",
                                "She reached the turn in 39."
                            ]
                        },
                        {
                            "explanation": "to develop in a particular way: ",
                            "examples": [
                                "The battle for control of the company took an interesting turn today."
                            ]
                        },
                        {
                            "explanation": "to suddenly become better or worse: ",
                            "examples": [
                                "Their relationship took a turn for the worse when he lost his job."
                            ]
                        },
                        {
                            "explanation": "a stage act or performance: ",
                            "examples": [
                                "The first couple of turns were children singing and dancing."
                            ]
                        },
                        {
                            "explanation": "a slight illness, a strange feeling, or a nervous shock: ",
                            "examples": [
                                "After the accident I started having funny turns.",
                                "It gave me quite a turn to see him after all these years."
                            ]
                        },
                        {
                            "explanation": "a sign above a note in a piece of written music that means four notes, including the note written and notes above and below this note, should be played: ",
                            "examples": [
                                "Ornamental turns are a common feature of baroque music."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}