{
    "word": "turtle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtɜː.təl"
                            ],
                            "us": [
                                "ˈtɝː.t̬əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a reptile that lives in the sea and has a thick shell covering its body into which it can move its head and legs for protection. Turtles come onto land in order to lay their eggs: ",
                            "examples": [
                                "Thousands of turtles emerged from the waves and crawled across the sand on unsteady flippers.",
                                "The world's population of sea turtles has now become dangerously small. "
                            ]
                        },
                        {
                            "explanation": "a reptile that lives in rivers and lakes and has a thick shell covering its body into which it can move its head and legs for protection. Turtles come onto land in order to lay their eggs: ",
                            "examples": [
                                "Large portions of the river are disappearing, leaving dry gravel beds where mud turtles and minnows once swam.",
                                "The snapping turtle is the world's biggest freshwater turtle, and can grow to nearly 100kg."
                            ]
                        },
                        {
                            "explanation": "any reptile of the group that includes turtles, terrapins, and tortoises (= reptiles with thick shells that live on land): ",
                            "examples": [
                                "The state is moving to stop a recent increase in the illegal sale of pet turtles.",
                                "In some North American regions, the word turtle is used for all three of these reptiles (turtles, terrapins, and tortoises)."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to turn and hide one's face and body when fighting instead of making a lot of punches: ",
                            "examples": [
                                "He had been taunting the defender for the whole game, and then when the guy went to fight him, he turtled. ",
                                "If you turtle during a fight, you'll be viewed as a coward and lose the respect of other players. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}