{
    "word": "twist",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "twɪst"
                            ],
                            "us": [
                                "twɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to turn something, especially repeatedly, or to turn or wrap one thing around another: ",
                            "examples": [
                                "The path twists and turns for over a mile.",
                                "She sat there nervously twisting the ring around on her finger.",
                                "She twisted her head (round) so she could see what was happening.",
                                "Twist the rope tightly round that post over there."
                            ]
                        },
                        {
                            "explanation": "If you twist a part of your body, such as your ankle, you injure it by suddenly turning it: ",
                            "examples": [
                                "She slipped on the ice and twisted her knee."
                            ]
                        },
                        {
                            "explanation": "to change information so that it gives the message you want it to give, especially in a way that is dishonest: ",
                            "examples": [
                                "This report shows how she twisted the truth to claim successes where none, in fact, existed.",
                                "You're twisting my words - that's not what I said at all."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "twɪst"
                            ],
                            "us": [
                                "twɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an act of twisting something: ",
                            "examples": [
                                "She gave the cap another twist to make sure it was tight.",
                                "an Elvis-style twist of the hips"
                            ]
                        },
                        {
                            "explanation": "the shape of or a piece of something that has been twisted: ",
                            "examples": [
                                "Long twists of grey hair fell over her face.",
                                "a twist of lemon"
                            ]
                        },
                        {
                            "explanation": "a tight bend: ",
                            "examples": [
                                "a path with many twists and turns"
                            ]
                        },
                        {
                            "explanation": "in sports such as diving and gymnastics, a movement in which a person turns their whole body while in the air : ",
                            "examples": [
                                "The dive includes two-and-a-half somersaults with two-and-a-half twists.",
                                "Gymnasts perform a series of turns, twists, and somersaults on the trampoline."
                            ]
                        },
                        {
                            "explanation": "a change in the way in which something happens: ",
                            "examples": [
                                "The story took a surprise twist today with media reports that the doctor had resigned.",
                                "The incident was the latest twist in the continuing saga of fraud and high scandal in banks and stock brokerages.",
                                "But for a cruel twist of fate/fortune, he could now be running his own business.",
                                "There's an unexpected twist in/to the plot towards the end of the film."
                            ]
                        },
                        {
                            "explanation": "a complicated situation or plan of action: ",
                            "examples": [
                                "the twists and turns of fate",
                                "It has proved very difficult to unravel the twists and turns and contradictions of the evidence."
                            ]
                        },
                        {
                            "explanation": "a dance in which people stay in one place and twist their bodies from side to side to music",
                            "examples": []
                        },
                        {
                            "explanation": "a hairstyle in which the hair is divided into many sections, then each section divided into two parts that are twisted around each other to form a type of braid: ",
                            "examples": [
                                "She went to the salon and had her hair done up in twists."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}