{
    "word": "twittering",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈtwɪt.ər.ɪŋ"
                            ],
                            "us": [
                                "ˈtwɪt̬.ɚ.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a series of short, high sounds made by a bird: ",
                            "examples": [
                                "They were soothed by the gentle rush of wind, the lapping of water and the twittering of birds.",
                                "The chatter rose like the twitterings of starlings."
                            ]
                        },
                        {
                            "explanation": "the act of talking quickly and nervously, saying things of very little importance or interest, or something that is said in this way: ",
                            "examples": [
                                "The chief executive bursts into the room and the twittering stops.",
                                "I'll just ignore his ridiculous twitterings about me."
                            ]
                        },
                        {
                            "explanation": "the activity of publishing something on the social media service Twitter, or something that is published: ",
                            "examples": [
                                "Don't forget that in this age of texting, twittering, and blogs, there still are small companies that don't offer their wares online.",
                                "Many people follow his twitterings."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈtwɪt.ər.ɪŋ"
                            ],
                            "us": [
                                "ˈtwɪt̬.ɚ.ɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "of a bird or a musical instrument, making a series of short, high sounds: ",
                            "examples": [
                                "We fell asleep to the muted sounds of twittering birds and the soft rustle of the leaves.",
                                "the sound of the twittering flutes"
                            ]
                        },
                        {
                            "explanation": "talking quickly and nervously, saying things of very little importance or interest: ",
                            "examples": [
                                "She admitted she was only too keen to leave behind the twittering gossips of Oxford."
                            ]
                        },
                        {
                            "explanation": "using the social media service Twitter: ",
                            "examples": [
                                "Once the weekend had passed, the Twittering Mums were moving on to new tweets.",
                                "You need to get off Twitter. Your twittering days are done."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}