{
    "word": "type",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "taɪp"
                            ],
                            "us": [
                                "taɪp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a particular group of people or things that share similar characteristics and form a smaller division of a larger set: ",
                            "examples": [
                                "There were so many different types of bread that I didn't know which to buy.",
                                "What type of clothes does she wear?",
                                "It was dark so I didn't notice what type of car it was.",
                                "He's the type of man you could take home to your mother.",
                                "He's very attractive, if you like the blond, athletic type.",
                                "They sell dried flowers and baskets and that type of thing.",
                                "We have a range of moisturizers for all different skin types.",
                                "She was young and she was wearing student-type clothes, so I assumed she was studying here.",
                                "He took me to a bar full of actor types trying to get noticed."
                            ]
                        },
                        {
                            "explanation": "a person who seems to represent a particular group of people, having all the qualities that you usually connect with that group: ",
                            "examples": [
                                "He doesn't use fully rounded characters in his plays - he uses types."
                            ]
                        },
                        {
                            "explanation": "to be the type of person that someone thinks is attractive: ",
                            "examples": [
                                "He's a nice enough guy - he's just not my type."
                            ]
                        },
                        {
                            "explanation": "the style and size of printed letters used in a piece of printed writing such as in a newspaper, book, or article: ",
                            "examples": [
                                "Use bold type for your headings.",
                                "The software allows you to choose from over 20 styles of typeface."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "taɪp"
                            ],
                            "us": [
                                "taɪp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to write using a machine, either a computer keyboard or a typewriter: ",
                            "examples": [
                                "She asked me to type a couple of letters.",
                                "He can type very quickly.",
                                "I was typing away into the early hours of the morning just to get it done."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}