{
    "word": "under",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "ˈʌn.dər"
                            ],
                            "us": [
                                "ˈʌn.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in or to a position below or lower than something else, often so that one thing covers the other: ",
                            "examples": [
                                "He hid under the bed.",
                                "In AD 79 the city of Pompei was buried under a layer of ash seven metres deep.",
                                "She put the thermometer under my tongue.",
                                "She was holding a folder under her arm (= between her upper arm and the side of her body).",
                                "They stood under a tree (= below its branches) to avoid getting wet."
                            ]
                        },
                        {
                            "explanation": "If a piece of land is under a particular type of plant, that plant is growing on the whole of that area: ",
                            "examples": [
                                "The main fields are under wheat."
                            ]
                        },
                        {
                            "explanation": "If a book, article, or piece of information is under a particular title, you can find it below or following that title in a list, book, library, etc.: ",
                            "examples": [
                                "Books on Ansel Adams will probably be under Art or Photography.",
                                "Custard? That comes under Desserts."
                            ]
                        },
                        {
                            "explanation": "less than: ",
                            "examples": [
                                "All items cost/are under a pound.",
                                "The discount applies only to children under (the age of) ten (= younger than ten).",
                                "If you get under 50 percent, you fail the exam."
                            ]
                        },
                        {
                            "explanation": "happening during, as a result of, or according to a particular situation, event, rule, etc.: ",
                            "examples": [
                                "The work was completed under very difficult conditions.",
                                "Now that the deadline is approaching we all feel under pressure.",
                                "The chair broke under his weight (= because he was too heavy for it).",
                                "Under the current rules, you need the agreement of at least 6 out of 10 committee members."
                            ]
                        },
                        {
                            "explanation": "in the process of being attacked, considered, discussed, etc.: ",
                            "examples": [
                                "The town is under fire (= is being attacked) from the air.",
                                "The proposals are now under consideration by the Board of Governors.",
                                "The situation is still not under control."
                            ]
                        },
                        {
                            "explanation": "treated in the way mentioned: ",
                            "examples": [
                                "The patient is being kept under heavy sedation.",
                                "She'll have to go under anaesthetic for the operation.",
                                "She's been under the doctor for a viral infection."
                            ]
                        },
                        {
                            "explanation": "to believe something, often wrongly: ",
                            "examples": [
                                "He was under the mistaken belief that I was in charge."
                            ]
                        },
                        {
                            "explanation": "controlled or governed by a particular person, organization, or force: ",
                            "examples": [
                                "He's a Colonel, with hundreds of soldiers under him (= obeying his orders).",
                                "I wonder what Britain was like under the Romans (= during the time when the Romans controlled Britain).",
                                "People born under (= during the period of) the zodiac sign Pisces are supposed to be dreamy and artistic."
                            ]
                        },
                        {
                            "explanation": "to have been ordered to do something: ",
                            "examples": [
                                "They're under strict orders not to discuss the situation.",
                                "He's under doctor's orders (= has been told by a doctor) to cut down on fatty food and to drink no alcohol for at least six months."
                            ]
                        },
                        {
                            "explanation": "using a particular name, especially one that is not your real name: ",
                            "examples": [
                                "He writes under the name (of) John le Carré.",
                                "For his own safety, he has to operate under a false name/an alias."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈʌn.dər"
                            ],
                            "us": [
                                "ˈʌn.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "below the surface of something: ",
                            "examples": [
                                "Because I'm a bad swimmer, I often go under and swallow a lot of water."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "ʌn.dər-"
                            ],
                            "us": [
                                "ʌn.dɚ-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not enough or not done as well or as much as is necessary: ",
                            "examples": [
                                "undercooked potatoes",
                                "underprivileged children",
                                "We're all overworked and underpaid.",
                                "His boss says he's under-performing (= not doing as well as he should) at work."
                            ]
                        },
                        {
                            "explanation": "below: ",
                            "examples": [
                                "underwear",
                                "an underpass"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}