{
    "word": "unfreeze",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʌnˈfriːz"
                            ],
                            "us": [
                                "ʌnˈfriːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to stop (something such as pay or prices) being fixed at a particular level and allow them to increase: ",
                            "examples": [
                                "About one-third of employers plan to unfreeze salaries.",
                                "The company sprang a surprise on its customers by unfreezing its prices."
                            ]
                        },
                        {
                            "explanation": "to make an economy or market active again, or to become active again, after a period of no activity: ",
                            "examples": [
                                "The loan was intended to help unfreeze Iceland's economy.",
                                "Unless global credit markets unfreeze and start lending again, there will be a recession."
                            ]
                        },
                        {
                            "explanation": "to make money available again after it was previously not allowed to be used: ",
                            "examples": [
                                "The first initiative is aimed at unfreezing loans for homeowners.",
                                "The loan would provide an important first step towards unfreezing the deposits of approximately 300,000 customers who have been unable to withdraw money."
                            ]
                        },
                        {
                            "explanation": "to end an official and legal rule preventing money or property from being used or moved: ",
                            "examples": [
                                "The supreme court cleared him of any wrongdoing and unfroze his assets.",
                                "Unless bank accounts are unfrozen, production could be disrupted."
                            ]
                        },
                        {
                            "explanation": "to raise the temperature of something so that it is no longer frozen, or to become no longer frozen: ",
                            "examples": [
                                "He uses his father's blowtorch to unfreeze the pipes. ",
                                "Spring is the time when the earth unfreezes and life returns to the ground."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}