{
    "word": "unionist",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈjuː.njə.nɪst"
                            ],
                            "us": [
                                "ˈjuː.njə.nɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who supports the policy that the countries of the UK should remain united, especially that Northern Ireland should remain part of the United Kingdom of Great Britain and Northern Ireland: ",
                            "examples": [
                                "The deal was opposed by the hardline unionists.",
                                "The Ulster Unionists called for a full inquiry into the case.",
                                "In elections five years later, his Democratic Unionists became Northern Ireland's biggest Protestant party.",
                                "I should have liked to have seen Scottish unionists better represented on the panel."
                            ]
                        },
                        {
                            "explanation": "at the time of the American Civil War, a supporter of the Union (= the states that did not leave the United States): ",
                            "examples": [
                                "The article examines the conflict between unionists and secessionists in the state prior to the Civil War.",
                                "There were many Unionists living in the Border States who opposed secession and supported the Union. "
                            ]
                        },
                        {
                            "explanation": "a person who supports the political principle that a country or state should remain united with others in a largerunion: ",
                            "examples": [
                                "Catalan unionists have removed pro-independence posters in the streets.",
                                "They were unionists who advocated the unification of Romania and Moldova."
                            ]
                        },
                        {
                            "explanation": "a person who is a member of a trade union (= a workers' organization that represents the people who work in a particular industry): ",
                            "examples": [
                                "The march was attended by several thousand unionists and international socialists.",
                                "In the months immediately following the earthquake, both industrialists and unionists in Tokyo were working to get work places restored."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈjuː.njə.nɪst"
                            ],
                            "us": [
                                "ˈjuː.njə.nɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "supporting or relating to the policy that the countries of the UK should remain united, especially that Northern Ireland should remain part of the United Kingdom of Great Britain and Northern Ireland: ",
                            "examples": [
                                "The announcement came days after the US Secretary of State met unionist and republican leaders in Belfast.",
                                "Several of the Unionist politicians accused the minister of hypocrisy.",
                                "the formation of the Scottish Unionist party"
                            ]
                        },
                        {
                            "explanation": "at the time of the American Civil War, supporting or relating to the Union (= the states that did not leave the United States): ",
                            "examples": [
                                "The Northern (\"Unionist\") states, led by Abraham Lincoln, were determined to force the Southern (\"Confederate\") states back into the Union."
                            ]
                        },
                        {
                            "explanation": "supporting the political principle that a country or state should remain united with others in a largerunion: ",
                            "examples": [
                                "A Spanish unionist rally mocked the separatist movement."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}