{
    "word": "unionism",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈjuː.njə.nɪ.zəm"
                            ],
                            "us": [
                                "ˈjuː.njə.nɪ.zəm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "support for the policy that the countries of the UK should remain united, especially that Northern Ireland should remain part of the United Kingdom of Great Britain and Northern Ireland: ",
                            "examples": [
                                "He saw himself as the unrivalled defender of unionism.",
                                "the progressive wing of Ulster Unionism",
                                "This was a period that marked the decline of Scottish unionism and a rise in Scottish nationalism. "
                            ]
                        },
                        {
                            "explanation": "at the time of the American Civil War, support for the Union (= the states that did not separate from the United States): ",
                            "examples": [
                                "See the documents listed below for examples of antislavery unionism in the border states.",
                                "He came from East Tennessee, that bastion of Unionism from the days of Andrew Johnson."
                            ]
                        },
                        {
                            "explanation": "the general political principle that a country or state should remain united with others in a larger union: ",
                            "examples": [
                                "She was one of the leading figures of Catalan unionism.",
                                "Spanish unionism opposed independence for the Basque and Catalan regions."
                            ]
                        },
                        {
                            "explanation": "the beliefs, policies, and practices of trade unions (= workers' organizations that represent the people who work in a particular industry): ",
                            "examples": [
                                "The city, whose economy depended on tourism rather than manufacturing and mining, was never a hotbed of unionism."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}