{
    "word": "unlock",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʌnˈlɒk"
                            ],
                            "us": [
                                "ʌnˈlɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to open something, especially a door that is locked (= fastened with a lock) using a key or an electronic device: ",
                            "examples": [
                                "I think I left the garage door unlocked."
                            ]
                        },
                        {
                            "explanation": "to enter a password or number in order to be able to use a mobile phone: ",
                            "examples": [
                                "You need to know the secret PIN to unlock your mobile phone upon power up."
                            ]
                        },
                        {
                            "explanation": "to make a mobile phone able to be used on any mobile phone network: ",
                            "examples": [
                                "Once your phone is unlocked, you can buy and change SIM cards as you travel."
                            ]
                        },
                        {
                            "explanation": "to discover important new facts about something and make them known to people: ",
                            "examples": [
                                "A chemical has been discovered that may be the key to unlocking the mysteries of Parkinson's disease.",
                                "Exploring these asteroids may help unlock the secrets of the early solar system.",
                                "He was part of a team that unlocked the human genetic blueprint."
                            ]
                        },
                        {
                            "explanation": "to make it possible for something to be used well, when previously it may not have been used enough: ",
                            "examples": [
                                "We must unlock the potential of all our people, not just some of our people.",
                                "The company's mission is to unlock the value of images and videos produced everyday across the web and social media."
                            ]
                        },
                        {
                            "explanation": "to get extra features in a computer game, for example by successfully completing a challenge: ",
                            "examples": [
                                "You need to find specific artefacts to unlock almost all of the game's functions.",
                                "Sometimes living here is like playing an adventure game - every problem solved unlocks two new quests."
                            ]
                        },
                        {
                            "explanation": "to make the imagination more active, producing interesting ideas and images: ",
                            "examples": [
                                "One of poetry's functions is to unlock the imagination."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}