{
    "word": "unravel",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʌnˈræv.əl"
                            ],
                            "us": [
                                "ʌnˈræv.əl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US usually"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If a piece of knitted or woven cloth, a knot, or a mass of thread unravels, it separates into a single thread, and if you unravel it, you separate it into a single thread: ",
                            "examples": [
                                "You'd better mend that hole before the whole sweater starts to unravel.",
                                "I had to unravel one of the sleeves because I realized I'd knitted it too small."
                            ]
                        },
                        {
                            "explanation": "If you unravel a mysterious, unknown, or complicated subject, you make it known or understood, and if it unravels, it becomes known or understood: ",
                            "examples": [
                                "We have a long way to go before we unravel the secrets of genetics."
                            ]
                        },
                        {
                            "explanation": "If a process or achievement that was slow and complicated unravels or is unravelled, it is destroyed: ",
                            "examples": [
                                "As talks between the leaders broke down, several months of careful diplomacy were unravelled."
                            ]
                        },
                        {
                            "explanation": "If a person or their life unravels, they are no longer able to control their emotions or what is happening to them: ",
                            "examples": [
                                "Stress caused by the loss of a loved one, financial problems, or job loss can cause people to unravel.",
                                "Those who help the homeless see people whose lives have unravelled completely.",
                                "In the waiting room of the clinic a woman was unravelling — she sat rocking from side to side and talking to herself. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}