{
    "word": "unscreened",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ʌnˈskriːnd"
                            ],
                            "us": [
                                "ʌnˈskriːnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "Unscreened people or things have not been checked or tested to discover if anything is wrong or not wanted: ",
                            "examples": [
                                "These workers are untrained, unscreened, and unsupervised.",
                                "In these areas the disease was spreading through unscreened blood transfusions."
                            ]
                        },
                        {
                            "explanation": "An unscreened film or programme has not been shown or broadcast to the public: ",
                            "examples": [
                                "The documentary included unscreened film from his video diaries.",
                                "He directed the unscreened pilot of the show."
                            ]
                        },
                        {
                            "explanation": "not hidden, separated, or covered by a screen (= a vertical structure that is used to separate one area from another or to cover a door or window) : ",
                            "examples": [
                                "Prisoners shared cramped cells with an unscreened toilet.",
                                "The seats in these rows will be left unscreened. ",
                                "In malarial areas, sleep in rooms with properly screened doors and windows - but if you are in an unscreened room, use a net impregnated with insecticide."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ʌnˈskriːnd"
                            ],
                            "us": [
                                "ʌnˈskriːnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "with no checks or tests being done to discover if anything is wrong or not wanted: ",
                            "examples": [
                                "The men were able to pass unscreened through security checkpoints in several buildings.",
                                "The parasite passed unscreened through an aging water treatment plant."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}