{
    "word": "unserved",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ʌnˈsɜːvd"
                            ],
                            "us": [
                                "ʌnˈsɝːvd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If people or areas are unserved, something that people need has not been provided in these areas: ",
                            "examples": [
                                "A huge proportion of the population is still unserved.",
                                "Many of the banks closed their smaller branches, leaving communities unserved."
                            ]
                        },
                        {
                            "explanation": "Unserved food or drink has not been given to people, for example by putting it on plates or in cups: ",
                            "examples": [
                                "After the event, unserved food is taken to food banks and homeless shelters.",
                                "We recover perishable and unserved foods and deliver them to soup kitchens and crisis centrescentres."
                            ]
                        },
                        {
                            "explanation": "If a legal document or order is unserved, or if the person affected by it is unserved, the person has not received the legal document or order: ",
                            "examples": [
                                "The audit found that a large number of arrest warrants were going unserved.",
                                "They said they did not represent the unserved defendants."
                            ]
                        },
                        {
                            "explanation": "If time is unserved, it has not been spent as a prisoner or working in an organization or system: ",
                            "examples": [
                                "The remaining unserved sentence was commuted to time served.",
                                "Under this system, foster children worked unpaid for their foster parents, and could leave only if the foster parents were paid compensation for each unserved year."
                            ]
                        },
                        {
                            "explanation": "If a female animal is unserved, a male animal has not had sex with it. : ",
                            "examples": [
                                "The heifer was unserved."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}