{
    "word": "unspool",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʌnˈspuːl"
                            ],
                            "us": [
                                "ʌnˈspuːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If something that is wrapped tightly around itself unspools, or someone unspools it, it becomes or is made straight: ",
                            "examples": [
                                "The fishing line got caught on my glove as it was unspooling.",
                                "The records were destroyed when staff tried to unspool the rolls of film."
                            ]
                        },
                        {
                            "explanation": "When a film unspools, or someone unspools it, it is shown on a screen: ",
                            "examples": [
                                "This autumn, film adaptations of the two novels will unspool in cinemas.",
                                "An open-air screen on the public beach unspools old Hollywood classics each evening."
                            ]
                        },
                        {
                            "explanation": "When a story or an event unspools, or someone unspools it, it develops or becomes known to people: ",
                            "examples": [
                                "Her new novel unspools deep in the English Lake District.",
                                "The plot unspools slowly, over several different timelines.",
                                "I think I have unspooled my rambling thoughts enough for one day. ",
                                "They will wait to see how the legal battle unspools before taking a decision."
                            ]
                        },
                        {
                            "explanation": "to become, or to make something become, less strong or less under control: ",
                            "examples": [
                                "Our carefully laid plans to get fit are starting to unspool in the face of chocolate cake and back-to-work stress. ",
                                "As his biography shows, alcohol did unspool his mind a bit at the end."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}