{
    "word": "up",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ʌp"
                            ],
                            "us": [
                                "ʌp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "towards a higher position; towards a higher value, number, or level: ",
                            "examples": [
                                "Put those books up on the top shelf.",
                                "A gravel road leads through the jungle and up into the Andes.",
                                "Pushing the number of unit sales up every quarter can't be continued indefinitely.",
                                "The water was up to/had come up to the level of the windows."
                            ]
                        },
                        {
                            "explanation": "out of the ground: ",
                            "examples": [
                                "He spent the afternoon digging carrots up."
                            ]
                        },
                        {
                            "explanation": "from a higher to a lower position repeatedly: ",
                            "examples": [
                                "My little girl started jumping up and down with rage when she heard she couldn't go."
                            ]
                        },
                        {
                            "explanation": "in or into a vertical position: ",
                            "examples": [
                                "Would you stand up for a minute? I want to see how tall you are."
                            ]
                        },
                        {
                            "explanation": "in a high position; at the top: ",
                            "examples": [
                                "Our boardroom is up on the 23rd floor.",
                                "You can tell which way up the crates have to be because they all say \"TOP\"."
                            ]
                        },
                        {
                            "explanation": "very near: ",
                            "examples": [
                                "Carrying a gun, he walked up to the cashier and demanded money.",
                                "A limousine drew up (= parked) outside the hotel."
                            ]
                        },
                        {
                            "explanation": "to a greater degree; in order to increase: ",
                            "examples": [
                                "The fire heats the room up (= makes it warmer) within minutes.",
                                "Grandma always turns the TV up really loud because she can't hear very well.",
                                "Try not to get worked up (= increasingly excited or angry) - I'm sure we can resolve this."
                            ]
                        },
                        {
                            "explanation": "If a level or amount is up, it has increased: ",
                            "examples": [
                                "The cost of car insurance is up, but not very much.",
                                "Last year the company's turnover was $240 billion, up three percent on (= compared with) the previous year."
                            ]
                        },
                        {
                            "explanation": "not in bed: ",
                            "examples": [
                                "It's time to get up now!",
                                "I was up all night, finishing my essay."
                            ]
                        },
                        {
                            "explanation": "to be able to get out of bed and move around again after a period of illness, because your health has improved enough: ",
                            "examples": [
                                "I was up and about a few hours after giving birth."
                            ]
                        },
                        {
                            "explanation": "into existence, view, or attention: ",
                            "examples": [
                                "Originally the charity was set up to help orphans in urban areas.",
                                "I'm sorry, but something unexpected has come up (= has happened) at the office, and I'll be home late.",
                                "Coming up (= happening next) after the break, we have a man who claims he can communicate with fish.",
                                "Would this be a good time to bring up the issue of salary?"
                            ]
                        },
                        {
                            "explanation": "so as to be equal in quality, knowledge, or achievement: ",
                            "examples": [
                                "She couldn't go to school for a few weeks because of illness, but she'll be able to catch up (with her work) quickly.",
                                "So much scientific research is being performed that it's virtually impossible to keep up (with all the new developments)."
                            ]
                        },
                        {
                            "explanation": "in a state of being together with other similar things: ",
                            "examples": [
                                "You have half an hour to gather up anything you'll need for the journey.",
                                "Add up the column of numbers in your head and then tell me what the total is."
                            ]
                        },
                        {
                            "explanation": "tightly or firmly in order to keep something safe or in position: ",
                            "examples": [
                                "Tie up the top of the bag so the rubbish doesn't fall out.",
                                "You'd better wrap up (= wear warm clothes) - it's cold outside.",
                                "Can you do my shoelaces up for me?"
                            ]
                        },
                        {
                            "explanation": "broken or cut into smaller pieces; made smaller in area: ",
                            "examples": [
                                "He cut the letter up into a hundred pieces.",
                                "She folded the newspaper up and put it in her bag.",
                                "The car blew up (= exploded) when flames reached its fuel tank."
                            ]
                        },
                        {
                            "explanation": "to a greater age: ",
                            "examples": [
                                "No one said that growing up would be easy or painless.",
                                "Many single parents struggle to bring their children up on a low income."
                            ]
                        },
                        {
                            "explanation": "used when talking or asking about what is happening or wrong: ",
                            "examples": [
                                "Everyone was talking in whispers, and I could tell something was up (= something unusual was happening)."
                            ]
                        },
                        {
                            "explanation": "used to ask what is wrong: ",
                            "examples": [
                                "You seem upset. What's up?"
                            ]
                        },
                        {
                            "explanation": "used to ask what is happening, often as a way of greeting someone: ",
                            "examples": [
                                "What's up, guys?"
                            ]
                        },
                        {
                            "explanation": "used to say that you do not understand something, or to ask for an explanation of something: ",
                            "examples": [
                                "I don't get what's up with all the bad reviews. I actually liked this place! "
                            ]
                        },
                        {
                            "explanation": "When a period of time is up, it is finished: ",
                            "examples": [
                                "When the two hours were up nobody had answered all of the questions.",
                                "Your time is up - it's someone else's turn on the training equipment now."
                            ]
                        },
                        {
                            "explanation": "into an improved position or state: ",
                            "examples": [
                                "By lap 26, Hamilton had moved up into second position.",
                                "Stein had a bad start to the race, but by the ninth lap she was up with the leaders."
                            ]
                        },
                        {
                            "explanation": "to an end, finish, or state of being complete: ",
                            "examples": [
                                "Finish up the old loaf of bread before you start a new one.",
                                "Crime won't help - you'll end up in prison.",
                                "I'd like to round up the meeting by thanking all those who were able to attend at such short notice."
                            ]
                        },
                        {
                            "explanation": "towards the north: ",
                            "examples": [
                                "On Tuesday she'll be travelling up to Atlanta from New Orleans."
                            ]
                        },
                        {
                            "explanation": "towards a more important place, especially a city: ",
                            "examples": [
                                "How often do you go up to London?",
                                "She comes up from her village about once a month on the train."
                            ]
                        },
                        {
                            "explanation": "intended, suggested, or being considered for something: ",
                            "examples": [
                                "That house at the end of our road is up for sale again."
                            ]
                        },
                        {
                            "explanation": "willing and able to do or take part in an activity: ",
                            "examples": [
                                "After a long day at work I wasn't really up for a party."
                            ]
                        },
                        {
                            "explanation": "on trial in a court: ",
                            "examples": [
                                "If he doesn't pay the fine soon, he'll be up before the magistrate.",
                                "Smith is up for armed robbery."
                            ]
                        },
                        {
                            "explanation": "When a road is up, it is being repaired and so is unsuitable for use: ",
                            "examples": [
                                "The council has got the road up because of a broken sewer."
                            ]
                        },
                        {
                            "explanation": "If someone's long hair is up, it is arranged on the top or back of the head: ",
                            "examples": [
                                "You look nice with your hair up."
                            ]
                        },
                        {
                            "explanation": "next to play in a game or sports match, or next to perform, happen, etc.: ",
                            "examples": [
                                "Next up after that is a match against Blackburn Rovers at home. ",
                                "Up next is an untitled Woody Allen film."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "ʌp"
                            ],
                            "us": [
                                "ʌp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to or in a higher level or position: ",
                            "examples": [
                                "We followed her up the stairs to a large meeting room."
                            ]
                        },
                        {
                            "explanation": "at the top of: ",
                            "examples": [
                                "You'll find a dusty attic up these stairs.",
                                "If you want Fred, he's up that ladder."
                            ]
                        },
                        {
                            "explanation": "(further) along: ",
                            "examples": [
                                "The car shot off up the road at high speed.",
                                "They live just up the road."
                            ]
                        },
                        {
                            "explanation": "along the surface of something first in one direction and then in the opposite direction, usually repeatedly: ",
                            "examples": [
                                "He was running up and down the street, shouting."
                            ]
                        },
                        {
                            "explanation": "towards the starting point of something, especially a river or stream: ",
                            "examples": [
                                "Rowing up (the) river against the current was very hard work."
                            ]
                        },
                        {
                            "explanation": "to or at: ",
                            "examples": [
                                "Are you going up the club tonight?"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ʌp"
                            ],
                            "us": [
                                "ʌp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "moving up: ",
                            "examples": [
                                "an up escalator"
                            ]
                        },
                        {
                            "explanation": "When a system, computer, or similar machine is up, it is operating, especially in its usual way: ",
                            "examples": [
                                "Andy, do you know when the network will be up again?"
                            ]
                        },
                        {
                            "explanation": "feeling happy: ",
                            "examples": [
                                "She's been really up since she started her new job."
                            ]
                        },
                        {
                            "explanation": "having more points, goals, etc. than your opponent in a match or competition: ",
                            "examples": [
                                "By half time they could have been six or seven up. ",
                                "With 88 seconds remaining in the game, Hungary was up by five goals."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ʌp"
                            ],
                            "us": [
                                "ʌp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to increase something such as a price: ",
                            "examples": [
                                "We won't be able to make a profit on the deal without upping the sale price.",
                                "It looks like tax rates are going to be upped again."
                            ]
                        },
                        {
                            "explanation": "used with another verb to emphasize that someone left a place or did something in a sudden and possibly unexpected way: ",
                            "examples": [
                                "After dinner they just upped and left/went without saying goodbye."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "prefix",
                        "ipa": {
                            "uk": [
                                "ʌp-"
                            ],
                            "us": [
                                "ʌp-"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "higher or improved: ",
                            "examples": [
                                "uphill",
                                "uplift"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}