{
    "word": "use",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "juːz"
                            ],
                            "us": [
                                "juːz"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to put something such as a tool, skill, or building to a particular purpose: ",
                            "examples": [
                                "This glass has been used - could you get me a clean one?",
                                "Use scissors to cut the shapes out.",
                                "Going on the expedition gives me a chance to use all the training I've had.",
                                "The old hospital isn't used any more.",
                                "These lights are used for illuminating the playing area.",
                                "To use military force against the protesters would be unacceptable."
                            ]
                        },
                        {
                            "explanation": "to reduce the amount of or finish something, by eating it, burning it, writing on it, or by a chemical reaction: ",
                            "examples": [
                                "We've used (up) nearly all of the bread - will you buy some more?",
                                "Does she still use drugs?",
                                "Don't worry if you use the shampoo up (= use all of it) - I'll get more tomorrow."
                            ]
                        },
                        {
                            "explanation": "to say or write a particular word or phrase: ",
                            "examples": [
                                "\"Autumn\" is used in British English and \"fall\" in American English.",
                                "That's an expression she often uses to describe how she feels."
                            ]
                        },
                        {
                            "explanation": "to take advantage of a person or situation; to exploit: ",
                            "examples": [
                                "He's just using you - he'll steal your ideas and then take the credit for them himself.",
                                "It might be possible to use their mistake to help us get what we want."
                            ]
                        },
                        {
                            "explanation": "In negative sentences and questions, \"use to\" replaces \"used to\" when it follows \"did\" or \"didn't\": ",
                            "examples": [
                                "Did he use to be the doctor in \"Star Trek\"?",
                                "We didn't use to go out much during the winter.",
                                "Did you use to stay with your grandparents when you were a kid?",
                                "I didn't use to like mushrooms, but I do now.",
                                "The school didn't use to admit girls."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "juːs"
                            ],
                            "us": [
                                "juːs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a purpose for which something is used: ",
                            "examples": [
                                "A food processor has a variety of uses in the kitchen.",
                                "Don't throw that cloth away - you'll find a use for it one day.",
                                "No, I don't want to buy a boat - I don't have any use for one!"
                            ]
                        },
                        {
                            "explanation": "the act of using something, or a period of time when something is being used or can be used: ",
                            "examples": [
                                "You should be able to put your experience in electronics to (good) use in your new job.",
                                "Don't touch the machine when it's in use.",
                                "a flat-screen TV that becomes a mirror when it is not in use",
                                "It's a name that has almost fallen out of use (= is hardly used now ).",
                                "There has been an increase in the use of migrant workers in recent years.",
                                "Traditional farming methods are going out of/coming into use (= used less and less/more and more) in many areas."
                            ]
                        },
                        {
                            "explanation": "to use something that is available: ",
                            "examples": [
                                "We might as well make use of the hotel's facilities."
                            ]
                        },
                        {
                            "explanation": "permission to use something, or the ability to use something: ",
                            "examples": [
                                "They said we could have the use of their beach house whenever they weren't there."
                            ]
                        },
                        {
                            "explanation": "the process of reducing the amount of something by burning it, eating it, involving it in a chemical reaction, etc.: ",
                            "examples": [
                                "In anaerobic respiration, sugar is broken down to lactic acid without the use of oxygen.",
                                "a more efficient use of resources"
                            ]
                        },
                        {
                            "explanation": "one of the meanings of a word, or the way that a particular word is used: ",
                            "examples": [
                                "Can you list all the uses of the word \"point\"?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}