{
    "word": "utility",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "juːˈtɪl.ə.ti"
                            ],
                            "us": [
                                "juːˈtɪl.ə.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a service that is used by the public, such as an electricity or gas supply: ",
                            "examples": [
                                "The biggest financial worries are mortgages followed by utility bills.",
                                "We each pay £500 in rent plus utilities."
                            ]
                        },
                        {
                            "explanation": "a company that provides a service such as an electricity or gas supply: ",
                            "examples": [
                                "Utilities say they've been deluged by people who are having trouble paying their bills.",
                                "For several years utilities that provide drinking water have kept emergency pumps on standby.",
                                "the administration of public utilities"
                            ]
                        },
                        {
                            "explanation": "the usefulness of something, especially in a practical way: ",
                            "examples": [
                                "The utility of this substance has been proven in a series of tests.",
                                "Under such conditions, a common medium of exchange would have no utility at all."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "juːˈtɪl.ə.ti"
                            ],
                            "us": [
                                "juːˈtɪl.ə.t̬i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "of a sports player, able to play effectively in different positions: ",
                            "examples": [
                                "Jones is a utility infielder, a strong player at every position.",
                                "He functioned as England's utility batsman, the man who could be relied upon to plug any hole in any crisis."
                            ]
                        },
                        {
                            "explanation": "able to do several different things well: ",
                            "examples": [
                                "I recommend this innovative utility tool that can handle all sorts of cutting projects."
                            ]
                        },
                        {
                            "explanation": "designed mainly to be useful rather than attractive or fashionable : ",
                            "examples": [
                                "She wore an outdoorsy utility jacket but somehow managed to make farming look chic.",
                                "After the war material and good design were in short supply and the country produced what was called utility clothing.",
                                "It was a student's room with utility furniture and posters on the walls."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}