{
    "word": "value",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈvæl.juː"
                            ],
                            "us": [
                                "ˈvæl.juː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the amount of money that can be received for something: ",
                            "examples": [
                                "She had already sold everything of value that she possessed.",
                                "What is the value of the prize?",
                                "The value of the pound fell against other European currencies yesterday.",
                                "Property values have fallen since the plans for the airport were published.",
                                "I thought the offer was good value (for money) (= a lot was offered for the amount of money paid).",
                                "I thought the offer was a good value (= a lot was offered for the amount of money paid)."
                            ]
                        },
                        {
                            "explanation": "the importance or worth of something for someone: ",
                            "examples": [
                                "For them, the house's main value lay in its quiet country location.",
                                "They are known to place/put/set a high value on good presentation."
                            ]
                        },
                        {
                            "explanation": "how useful or important something is: ",
                            "examples": [
                                "The photographs are of immense historical value.",
                                "His contribution was of little or no practical value.",
                                "The necklace had great sentimental value.",
                                "It has novelty value because I've never done anything like it before."
                            ]
                        },
                        {
                            "explanation": "the beliefs people have, especially about what is right and wrong and what is most important in life, that control their behaviour: ",
                            "examples": [
                                "family/moral/traditional values"
                            ]
                        },
                        {
                            "explanation": "a number or symbol that represents an amount: ",
                            "examples": [
                                "The modem speeds must be set to a fixed value.",
                                "A number system defines a set of values used to represent quantity."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈvæl.juː"
                            ],
                            "us": [
                                "ˈvæl.juː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to give a judgment about how much money something might be sold for: ",
                            "examples": [
                                "He valued the painting at $2,000.",
                                "The insurance company said I should have my jewellery valued."
                            ]
                        },
                        {
                            "explanation": "to consider something important: ",
                            "examples": [
                                "I've always valued her advice."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}