{
    "word": "vernacular",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "vəˈnæk.jə.lər"
                            ],
                            "us": [
                                "vɚˈnæk.jə.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the form of a language that a particular group of speakers use naturally, especially in informal situations: ",
                            "examples": [
                                "The Spanish I learned at school is very different from the local vernacular of this Mexican village.",
                                "Many Roman Catholics regret the replacing of the Latin mass by the vernacular."
                            ]
                        },
                        {
                            "explanation": "a local style in which ordinary houses are built: ",
                            "examples": [
                                "For most houses concrete is the vernacular.",
                                "We can adapt the house types to fit the vernacular. "
                            ]
                        },
                        {
                            "explanation": "dance, music, art, etc. that is in a style liked or performed by ordinary people: ",
                            "examples": [
                                "The second movement had extremes of refined string sound and robust wind playing, positioning high art next to the vernacular."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "vəˈnæk.jə.lər"
                            ],
                            "us": [
                                "vɚˈnæk.jə.lɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "using the form of a language that a particular group of speakers use naturally, especially in informal situations: ",
                            "examples": [
                                "His lively vernacular style goes down well with younger viewers.",
                                "The folk tale is told in a vernacular dialect."
                            ]
                        },
                        {
                            "explanation": "in the local style of ordinary houses: ",
                            "examples": [
                                "old stone vernacular buildings",
                                "Wright's prairie houses derived from American vernacular traditions. "
                            ]
                        },
                        {
                            "explanation": "in a style that is liked or performed by ordinary people: ",
                            "examples": [
                                "He went on to raise the vernacular practice of animal painting to extraordinary heights.",
                                "B.B. King was a musical genius who soaked up the multiple influences of America's vernacular music."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}