{
    "word": "very",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "ˈver.i"
                            ],
                            "us": [
                                "ˈver.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(used to add emphasis to an adjective or adverb) to a great degree or extremely: ",
                            "examples": [
                                "The situation is very serious.",
                                "We're very, very sorry about what's happened.",
                                "Think about it very carefully before deciding.",
                                "How very childish of her to refuse to speak to me!",
                                "\"Are you tired?\" \"No, not very.\"",
                                "Thank you very much.",
                                "\"Did you enjoy the play?\" \"Very much so.\" (= Yes.)",
                                "I can't very well (= it would not be right for me to) say sorry when I didn't do anything wrong."
                            ]
                        },
                        {
                            "explanation": "used to add force to a superlative adjective or to the adjectives \"own\" or \"same\": ",
                            "examples": [
                                "This is the very best chocolate cake I've ever tasted.",
                                "She always leaves her homework to the very last moment.",
                                "We now have our very own library in the village.",
                                "This is the very same (= exactly the same) place we sat the last time we came."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈver.i"
                            ],
                            "us": [
                                "ˈver.i"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(used to add emphasis to a noun) exact or particular: ",
                            "examples": [
                                "This is the very book I've been looking for all month.",
                                "You're the very person we need for the job.",
                                "What ended up happening was the very thing we feared the most.",
                                "The letter was sent on Monday from Berlin and arrived in Hamburg the very same/next day.",
                                "The very idea/thought of having her friends to stay fills me with dread."
                            ]
                        },
                        {
                            "explanation": "used to describe or emphasize the furthest point of something: ",
                            "examples": [
                                "He found the piece of paper he had lost at the very bottom of the pile.",
                                "We were at the very end of the queue, so we didn't manage to get any tickets."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}