{
    "word": "vibe",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "vaɪb"
                            ],
                            "us": [
                                "vaɪb"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the mood of a place, situation, person, etc. and the way that they make you feel: ",
                            "examples": [
                                "The city is famous for its laid-back vibe.",
                                "I loved the overall vibe of the place but the food wasn't that great.",
                                "The music has a soothing vibe.",
                                "I didn't like the place—it had bad vibes.",
                                "I was getting some weird vibes from him—I don't think he liked me."
                            ]
                        },
                        {
                            "explanation": "to communicate good wishes to someone, which you hope will make them feel better or be more successful: ",
                            "examples": [
                                "Sending vibes for a quick recovery!"
                            ]
                        },
                        {
                            "explanation": "informal for\nvibraphone : a musical instrument consisting of a frame with a set of metal bars in it that you hit. The bars have electrical devices attached to them that make them vibrate (= shake) so that they produce musical notes that seem to shake slightly: ",
                            "examples": [
                                "He would often play the vibes in their recording sessions."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "vaɪb"
                            ],
                            "us": [
                                "vaɪb"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to like someone or something and feel comfortable and happy with them: ",
                            "examples": [
                                "You can tell by the look on my face how much I was enjoying hanging and vibing backstage with the band.",
                                "I just wasn't really vibing with any of the clothes she gave me to wear.",
                                "Consumers might not vibe with the app, especially with so many other sources for news out there.",
                                "If you only speak English, you may be understood but not vibed with."
                            ]
                        },
                        {
                            "explanation": "to enjoy playing, listening to, or dancing to music in a relaxed way: ",
                            "examples": [
                                "Nowadays parents and kids are sometimes vibing to the same artist. ",
                                "He already had the dancefloor vibing to his music."
                            ]
                        },
                        {
                            "explanation": "to send good wishes to someone: ",
                            "examples": [
                                "I'm praying and vibing for you and your family.",
                                "Here's vibing major vibes for the interview!"
                            ]
                        },
                        {
                            "explanation": "to have or create a particular feeling: ",
                            "examples": [
                                "The room vibed with tension."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}