{
    "word": "vintage",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈvɪn.tɪdʒ"
                            ],
                            "us": [
                                "ˈvɪn.t̬ɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "produced in the past, and typical of the period in which it was made: ",
                            "examples": [
                                "a vintage plane",
                                "a vintage comic book"
                            ]
                        },
                        {
                            "explanation": "used to describe clothing, jewellery, etc. that is not new, especially when it is a good example of a style from the past: ",
                            "examples": [
                                "She loves buying vintage clothing.",
                                "The actress turned up at the Oscars in a classic vintage dress.",
                                "To be called vintage the piece should strongly reflect styles and trends associated with that era."
                            ]
                        },
                        {
                            "explanation": "of high quality and lasting value, or showing the best and most typical characteristics of a particular type of thing: ",
                            "examples": [
                                "This film is vintage Disney.",
                                "It has not been a vintage year for the club (= it has not been very successful).",
                                "His performance was not vintage, but it was capable enough."
                            ]
                        },
                        {
                            "explanation": "Vintage wine is of high quality and was made in a particular year and can be kept for several years in order to improve it: ",
                            "examples": [
                                "vintage champagne/port/claret"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈvɪn.tɪdʒ"
                            ],
                            "us": [
                                "ˈvɪn.t̬ɪdʒ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the wine made in a particular year, or a particular year in which wine has been made: ",
                            "examples": [
                                "The 1983 vintage was one of the best.",
                                "What vintage is this wine? (= In what year was it made?)"
                            ]
                        },
                        {
                            "explanation": "a group of things that were produced, or a group of people who were active, during the same particular period: ",
                            "examples": [
                                "Cars of recent vintage may not need inspection.",
                                "You and I are of the same vintage, so we remember this."
                            ]
                        },
                        {
                            "explanation": "clothing, jewellery, etc. that is not new, especially when it is a good example of a style from the past: ",
                            "examples": [
                                "I tend to wear vintage but I have a few new designer pieces.",
                                "If you want a more interesting watch, consider buying vintage."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}