{
    "word": "visor",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈvaɪ.zər"
                            ],
                            "us": [
                                "ˈvaɪ.zɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a part of a helmet that can be pulled down to cover the face: ",
                            "examples": [
                                "A helmet visor protects eyes from falling rain.",
                                "Knights lifted their visors to show they meant no harm."
                            ]
                        },
                        {
                            "explanation": "a curved piece of clear material that is worn over the eyes, nose, and mouth and kept in place by a strap (= a narrow piece of strong material) around the head, worn to protect the face or to help prevent the person wearing it from infecting others or being infected with a virus, etc.: ",
                            "examples": [
                                "The UK Government announced that all hairdressers must wear visors that cover the face from Saturday 15 August.",
                                "The plastic face visor is easy to adjust and wearers can even have their glasses on underneath. "
                            ]
                        },
                        {
                            "explanation": "a piece of stiff material above the front window of a car, etc. that can be pulled down to give protection from strong light from the sun: ",
                            "examples": [
                                "The keys were tucked in the sun visor.",
                                "At the next red light, you can make a note on the Auto Memo Board, which attaches to your visor."
                            ]
                        },
                        {
                            "explanation": "a curved piece of stiff material that is worn above the eyes to give protection from strong light from the sun: ",
                            "examples": [
                                "Many of the tourists were dressed in shorts and sun visors.",
                                "The woman removed her golf visor and shook her hair."
                            ]
                        },
                        {
                            "explanation": "the flat, curved part of a cap that goes above the eyes of the person who is wearing it: ",
                            "examples": [
                                "Greg's eyes were shaded by the visor of his cap."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}