{
    "word": "voice",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "vɔɪs"
                            ],
                            "us": [
                                "vɔɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the sounds that are made when people speak or sing: ",
                            "examples": [
                                "She has a loud/quiet/soft voice.",
                                "a low-pitched/high-pitched voice",
                                "a booming/breathy/clear/deep/fruity/gravelly/husky/squeaky voice",
                                "a baritone/soprano singing voice",
                                "You could tell from her voice that she wasn't pleased.",
                                "\"I don't know what you mean,\" said Fran in a quavering voice.",
                                "She lowered her voice to a whisper.",
                                "You'll have to raise your voice (= speak louder) if you want to be heard in here.",
                                "I have a cold and I think I'm losing my voice (= becoming unable to speak).",
                                "He's at that age when his voice is breaking (= changing from a boy's to a man's).",
                                "She's done a lot of work with voice-activated computers."
                            ]
                        },
                        {
                            "explanation": "to be singing well: ",
                            "examples": [
                                "The choir seems to be in good voice today!"
                            ]
                        },
                        {
                            "explanation": "an expression of opinion, or the right to express your opinion: ",
                            "examples": [
                                "There was only one dissenting voice during the discussion.",
                                "Unfortunately a strike was the only way to make our voices heard.",
                                "The committee represents the voice of the students.",
                                "Developing countries are demanding a stronger voice (= right to express opinions) in the debate.",
                                "Millions of women sit in silence and loneliness. Give them a voice, please.",
                                "Members themselves say being part of a national union gives them a voice to fight for their rights."
                            ]
                        },
                        {
                            "explanation": "an important quality or opinion that someone expresses, or the person who is able to express it: ",
                            "examples": [
                                "She just won't listen to the voice of reason.",
                                "I wouldn't work for Peter if I were you - this is the voice of experience talking!"
                            ]
                        },
                        {
                            "explanation": "the relationship between the subject of the verb and the action described by the verb, or the forms of a verb that show this relationship: ",
                            "examples": [
                                "The verb in the first sentence is in the active/passive voice."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "vɔɪs"
                            ],
                            "us": [
                                "vɔɪs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to say what you think about a particular subject, especially to express a doubt, complaint, etc. that you have about it: ",
                            "examples": [
                                "I have voiced my objections to the plan to management."
                            ]
                        },
                        {
                            "explanation": "to produce a sound by making the vocal cords move very quickly several times",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}