{
    "word": "voodoo",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈvuː.duː"
                            ],
                            "us": [
                                "ˈvuː.duː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a religion, influenced by traditional African religions, that involves magic and attempts to communicate with spirits and dead people, common in parts of the Caribbean, especially Haiti, and in parts of the southern United States : ",
                            "examples": [
                                "About half of Haiti's population is thought to practise voodoo in some form, although many follow other religious beliefs at the same time.",
                                "The musical explores Haiti's rich artistic heritage and the religion of Vodou. ",
                                "She is a Haitian voudou priestess who has lived in New York since the 1960s."
                            ]
                        },
                        {
                            "explanation": "magic or a curse (= magic words that are intended to bring bad luck to someone): ",
                            "examples": [
                                "There’s no voodoo involved in cooking juicy, tender steak—just two simple steps.",
                                "They felt as if there was some sort of voodoo on the band, because everything just went wrong."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈvuː.duː"
                            ],
                            "us": [
                                "ˈvuː.duː"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to or used in the practice of the religion voodoo: ",
                            "examples": [
                                "She claimed that a voodoo curse had forced her to commit the crime.",
                                "They found a spooky voodoo doll with pins stuck into it.",
                                "The room also contains a collection of sequined Vodou dolls.",
                                "I mentioned my trip to Haiti and the voudou ceremonies I saw."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}