{
    "word": "walk",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɔːk"
                            ],
                            "us": [
                                "wɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move along by putting one foot in front of the other, allowing each foot to touch the ground before lifting the next: ",
                            "examples": [
                                "I walked home.",
                                "A cat was walking along the top of the fence.",
                                "He walks two miles to work every morning."
                            ]
                        },
                        {
                            "explanation": "to go with someone to a particular place, for example because you want to protect them from danger, or show them the way: ",
                            "examples": [
                                "He offered to walk her home/to the station."
                            ]
                        },
                        {
                            "explanation": "to take an animal, especially a dog, for a walk: ",
                            "examples": [
                                "She walks the dog for an hour every afternoon."
                            ]
                        },
                        {
                            "explanation": "someone who seems to be a human form of disaster, encyclopedia, etc.: ",
                            "examples": [
                                "You broke another pair of glasses? You're just a walking disaster!"
                            ]
                        },
                        {
                            "explanation": "to not be charged with a crime, or to be allowed to leave a court after being found not guilty of a crime: ",
                            "examples": [
                                "If police don't get the right evidence, he'll walk."
                            ]
                        },
                        {
                            "explanation": "to suddenly leave a job or other situation because you have not been given what you want: ",
                            "examples": [
                                "Pay essential workers $650 a week or we walk.",
                                "\"Get real or we walk\" UK warns Brussels as Brexit trade deal talks resume.",
                                "You give me twenty percent discount on the price or I walk."
                            ]
                        },
                        {
                            "explanation": "In cricket, if a batter (= the player who tries to hit the ball) walks, they choose to leave the field without waiting for the umpire (= the person who makes certain that the rules are obeyed) to make a decision about whether they are out (= their turn to bat is finished): ",
                            "examples": [
                                "He nicked an outswinger to the keeper and walked without waiting for the umpire to lift his finger.",
                                "The batter refused to walk, even though all the fielders knew that he had hit it."
                            ]
                        },
                        {
                            "explanation": "in baseball, to receive four balls outside the hitting area and be allowed to go to first base, or to throw the ball outside the hitting area four times so that the batter is allowed to go to first base: ",
                            "examples": [
                                "The first batters either missed or walked.",
                                "He would have had a perfect game, except he walked a batter in the final inning."
                            ]
                        },
                        {
                            "explanation": "to pass or win something, such as an exam or game, easily: ",
                            "examples": [
                                "She'll walk the interview - the job is practically hers already."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɔːk"
                            ],
                            "us": [
                                "wɑːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a journey that you make by walking, often for enjoyment: ",
                            "examples": [
                                "He went for/took a walk around the block, to get some air.",
                                "They went on a ten-mile walk to raise money for charity.",
                                "Every afternoon she takes her grandfather out for a walk."
                            ]
                        },
                        {
                            "explanation": "a path or route where people can walk for enjoyment: ",
                            "examples": [
                                "Do you know any nice walks around here?"
                            ]
                        },
                        {
                            "explanation": "a way of walking: ",
                            "examples": [
                                "He has a strange waddling sort of walk."
                            ]
                        },
                        {
                            "explanation": "walking speed: ",
                            "examples": [
                                "She slowed the horses to a walk."
                            ]
                        },
                        {
                            "explanation": "a journey that takes a short time, five minutes, ten minutes, etc. when you walk: ",
                            "examples": [
                                "The school is only a five-minute walk away."
                            ]
                        },
                        {
                            "explanation": "in baseball, an occasion when a batter is allowed to go to first base after the pitcher has thrown the ball outside the hitting area four times",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}