{
    "word": "wall",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɔːl"
                            ],
                            "us": [
                                "wɑːl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a vertical structure, often made of stone or brick, that divides or surrounds something: ",
                            "examples": [
                                "The walls in this apartment are so thin you can hear just about every word the neighbours say.",
                                "The walls look a bit bare - can't we put some pictures up?",
                                "We had to climb over a ten-foot wall to get into the garden.",
                                "The Berlin Wall came down in 1989."
                            ]
                        },
                        {
                            "explanation": "any outer part of a hollow structure in the body: ",
                            "examples": [
                                "the wall of the uterus/stomach",
                                "an artery wall"
                            ]
                        },
                        {
                            "explanation": "a mass of people or things formed in such a way that you cannot get through or past them: ",
                            "examples": [
                                "The demonstrators formed a solid wall to stop the police from getting past them."
                            ]
                        },
                        {
                            "explanation": "in football, a row of players who stand ten yards away from where a free kick is taken in order to make scoring directly from the free kick more difficult: ",
                            "examples": [
                                "Rooney curved the free kick past the Newcastle defensive wall and inside the far post."
                            ]
                        },
                        {
                            "explanation": "a large, powerful, usually fast moving mass of something: ",
                            "examples": [
                                "After the rains, the houses were washed away by a wall of mud/water."
                            ]
                        },
                        {
                            "explanation": "a way of feeling or behaving that completely prevents two groups of people from communicating with or understanding each other: ",
                            "examples": [
                                "There is a wall of mistrust between the two groups."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}