{
    "word": "wand",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɒnd"
                            ],
                            "us": [
                                "wɑːnd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a special thin stick waved by a person who is performing magic tricks: ",
                            "examples": [
                                "The fairy godmother waved her wand over the cabbages and they turned into horses.",
                                "He stepped back from the cave wall, pointed his wand at the rock, and commanded the hidden door to open. ",
                                "For the author, the pen is a magician's wand."
                            ]
                        },
                        {
                            "explanation": "an electronic device that is held in the hand and that is used to find metal, for example when checking whether someone is carrying a weapon: ",
                            "examples": [
                                "A security guard uses a metal-detecting wand to check out students entering the school.",
                                "Screeners can detect anything metal with the help of hand-held wands.",
                                "She had ignored a request to stop and be checked with a hand wand."
                            ]
                        },
                        {
                            "explanation": "an electronic device that is held in the hand and that is used, for example, to read data and to enter it onto a computer: ",
                            "examples": [
                                "A wand reader is used as a hand-held scanner.",
                                "Electronic wands are used to check the bar codes on the products."
                            ]
                        },
                        {
                            "explanation": "a thin stick that is used for putting mascara (= a thick dark liquid make-up) onto your eyelashes (= the short hairs that grow along the edges of the eye): ",
                            "examples": [
                                "For the lower lashes, use the point of the mascara wand and work down lashes individually."
                            ]
                        },
                        {
                            "explanation": "a thin stick with a circle at the end that you put into liquid soap and use to blow bubbles: ",
                            "examples": [
                                "Each bottle contains bubble solution and a bubble wand.",
                                "The giant wand will make enormous bubbles."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}