{
    "word": "wandered",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nwander ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈwɒn.dər"
                            ],
                            "us": [
                                "ˈwɑːn.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to walk around slowly in a relaxed way or without any clear purpose or direction: ",
                            "examples": [
                                "We spent the morning wandering around the old part of the city.",
                                "She was found several hours later, wandering the streets, lost.",
                                "He was here a minute ago but he's wandered off somewhere."
                            ]
                        },
                        {
                            "explanation": "If someone's hands or eyes wander, they touch or look in many different places, especially in a sexual way or when they should not do this: ",
                            "examples": [
                                "If his hands start to wander, tell him firmly, \"No, I'm not ready for this.\"",
                                "He was cruelly described as a creepy old man with wandering hands.",
                                "Her gaze wandered around the flat."
                            ]
                        },
                        {
                            "explanation": "to have sexual relationships or experiences outside of your marriage or usual relationship: ",
                            "examples": [
                                "She wrote an article about infidelity called \"Wives who wander\".",
                                "She had enough problems dealing with a wandering husband."
                            ]
                        },
                        {
                            "explanation": "to start talking about a different subject from the one you were originally discussing: ",
                            "examples": [
                                "We've wandered off/from the point somewhat."
                            ]
                        },
                        {
                            "explanation": "If your mind or your thoughts wander, you stop thinking about the subject that you should be giving your attention to and start thinking about other matters: ",
                            "examples": [
                                "Halfway through the meeting my mind started to wander."
                            ]
                        },
                        {
                            "explanation": "If you say that an old person's mind is beginning to wander, you mean that they are starting to get very confused because of their age: ",
                            "examples": [
                                "Her mind is beginning to wander and she doesn't always know who I am."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}