{
    "word": "war",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɔːr"
                            ],
                            "us": [
                                "wɔːr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "armed fighting between two or more countries or groups, or a particular example of this: ",
                            "examples": [
                                "nuclear war",
                                "a war film/grave/hero/poet",
                                "If this country goes to (= starts to fight in a) war we will have to face the fact that many people will die.",
                                "Britain and France declared war on Germany in 1939 as a result of the invasion of Poland.",
                                "War broke out between the two countries after a border dispute.",
                                "They've been at war for the last five years.",
                                "He died in the First World War/the Vietnam war."
                            ]
                        },
                        {
                            "explanation": "a war that is fought over a long period and only ends when one side has neither the soldiers and equipment nor the determination left to continue fighting: ",
                            "examples": [
                                "The war of attrition between the two countries has lasted for decades now."
                            ]
                        },
                        {
                            "explanation": "a situation, often before a competition or battle, in which each opposing side attempts to frighten or discourage the other by making threats or by showing how strong it is: ",
                            "examples": [
                                "Protestors are waging a war of nerves with the police."
                            ]
                        },
                        {
                            "explanation": "any situation in which there is strong competition between opposing sides or a great fight against something harmful: ",
                            "examples": [
                                "The past few months have witnessed a price war between leading supermarkets.",
                                "The president vowed to wage war on/against terrorism.",
                                "For thirty years, the war on drugs has used up enormous human and financial resources."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}