{
    "word": "waste",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "weɪst"
                            ],
                            "us": [
                                "weɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an unnecessary or wrong use of money, substances, time, energy, abilities, etc.: ",
                            "examples": [
                                "That meeting achieved absolutely nothing - it was a complete waste of time.",
                                "She's been unemployed for two years and it's such a waste of her talents.",
                                "My mother couldn't stand waste - she always made us eat everything on our plates."
                            ]
                        },
                        {
                            "explanation": "to not be used, eaten, etc.: ",
                            "examples": [
                                "You can even make stock from the bones, so that nothing goes to waste.",
                                "Each year, the leftover flu vaccine goes to waste.",
                                "It's not fair to say that all the money and hard work went to waste.",
                                "A lot of time and money have gone to waste because of a flawed design.",
                                "We really don't want all this food to go to waste."
                            ]
                        },
                        {
                            "explanation": "unwanted matter or material of any type, especially what is left after useful substances or parts have been removed: ",
                            "examples": [
                                "This city produces 20 million tons of household waste each year.",
                                "He opposes any kind of nuclear waste being dumped at sea.",
                                "Millions of gallons of untreated human waste (= excrement) flow into the river every day.",
                                "Oil spills are common, as is the dumping of toxic industrial wastes.",
                                "The Japanese recycle more than half of their waste paper."
                            ]
                        },
                        {
                            "explanation": "an area of ground in or near a city that is not built on or used in any way: ",
                            "examples": [
                                "His body had been dumped in an area of waste ground just outside the city."
                            ]
                        },
                        {
                            "explanation": "large areas of land that are not used to grow crops and have few living animals or plants: ",
                            "examples": [
                                "the Arctic wastes of northern Siberia"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "weɪst"
                            ],
                            "us": [
                                "weɪst"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to use too much of something or use something badly when there is a limited amount of it: ",
                            "examples": [
                                "You waste a lot of water by taking a bath instead of a shower.",
                                "Come on, let's get started - we've wasted enough time already.",
                                "Don't waste your money on such junk."
                            ]
                        },
                        {
                            "explanation": "to kill someone",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}