{
    "word": "watch",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɒtʃ"
                            ],
                            "us": [
                                "wɑːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to look at something for a period of time, especially something that is changing or moving: ",
                            "examples": [
                                "I had dinner and watched TV for a couple of hours.",
                                "He spent the entire afternoon watching a cricket match.",
                                "I watched him get into a cab.",
                                "I got the feeling I was being watched.",
                                "I sit by the window and watch people walking past.",
                                "Just watch how he slides that ball in past the goalkeeper.",
                                "Bonner watched helplessly as they drove away without him.",
                                "She'll pretend that she hasn't seen us - you watch."
                            ]
                        },
                        {
                            "explanation": "to stay with someone or something, such as a child, for a short time to make certain that he, she, or it is safe: ",
                            "examples": [
                                "If you want me to watch the kids for a couple of hours while you go out, just let me know.",
                                "Could you watch my bags for me, while I go to the toilet?"
                            ]
                        },
                        {
                            "explanation": "to be careful of something: ",
                            "examples": [
                                "I have to watch my weight (= be careful not to become too heavy) now I'm not exercising so much.",
                                "Watch your language (= do not use rude words), young man!",
                                "Watch (that) you don't get glue on your fingers.",
                                "Watch what you're doing with that knife, Jim, it's sharp.",
                                "You need to watch him - he's a strange character."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɒtʃ"
                            ],
                            "us": [
                                "wɑːtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small clock that is worn on a strap around the wrist or, sometimes, connected to a piece of clothing by a chain: ",
                            "examples": [
                                "My watch seems to have stopped (= stopped working).",
                                "He glanced nervously at his watch."
                            ]
                        },
                        {
                            "explanation": "the activity of watching or giving attention to something or someone, especially to make certain nothing bad happens: ",
                            "examples": [
                                "The police keep a close watch on gang members.",
                                "The soldiers slept at night, except for one who stayed awake on watch/to keep watch."
                            ]
                        },
                        {
                            "explanation": "a person or group of soldiers or guards whose duty is to protect a person, place, or thing from danger or attack",
                            "examples": []
                        },
                        {
                            "explanation": "a particular period of time during which a person or a group of soldiers or guards has the duty of protecting and warning of danger: ",
                            "examples": [
                                "the night watch"
                            ]
                        },
                        {
                            "explanation": "at a time when someone is in charge of a particular situation and responsible for what happens: ",
                            "examples": [
                                "This happened on my watch. And I intend to resolve it. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}