{
    "word": "water",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwɔː.tər"
                            ],
                            "us": [
                                "ˈwɑː.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a clear liquid, without colour or taste, that falls from the sky as rain and is necessary for animal and plant life: ",
                            "examples": [
                                "a bottle/drink/glass of water",
                                "bottled/mineral/tap water",
                                "hot/cold water",
                                "Can I have a drop of water in my whisky, please?",
                                "Is there enough hot water for a bath?",
                                "The human body is about 50 percent water."
                            ]
                        },
                        {
                            "explanation": "an area of water, such as the sea, a lake, or a swimming pool: ",
                            "examples": [
                                "The water's warm - are you coming in?",
                                "I don't like getting my head under (= in) water.",
                                "Dad, I swam a whole length of the pool under water (= with the whole head and body below the surface of the water)!"
                            ]
                        },
                        {
                            "explanation": "the level of an area of water: ",
                            "examples": [
                                "The river is difficult to cross during periods of high water."
                            ]
                        },
                        {
                            "explanation": "a way of referring to urine (= yellowish liquid waste from the body): ",
                            "examples": [
                                "Is there any pain when you pass water?",
                                "If your water is dark, it may mean you are dehydrated."
                            ]
                        },
                        {
                            "explanation": "the area of sea near to and belonging to a particular country: ",
                            "examples": [
                                "St Lucia depends on its clean coastal waters for its income."
                            ]
                        },
                        {
                            "explanation": "the water contained in a particular lake, river, or part of the sea: ",
                            "examples": [
                                "In the shallow waters of the Gulf of Mexico, oil rigs attract fish."
                            ]
                        },
                        {
                            "explanation": "the liquid that surrounds a baby inside a pregnant woman's womb: ",
                            "examples": [
                                "At 3 a.m. her waters broke, and the baby was born soon after."
                            ]
                        },
                        {
                            "explanation": "water from a spring, especially when used in the past for drinking or swimming in, in order to improve the health: ",
                            "examples": [
                                "People used to come to this city to take (= drink or swim in) the waters."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈwɔː.tər"
                            ],
                            "us": [
                                "ˈwɑː.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to pour water on to plants or the soil that they are growing in: ",
                            "examples": [
                                "I've asked my neighbour to water the plants while I'm away."
                            ]
                        },
                        {
                            "explanation": "to give an animal water to drink: ",
                            "examples": [
                                "The horses had been fed and watered."
                            ]
                        },
                        {
                            "explanation": "If your mouth waters, it produces a lot of saliva, usually because you can see or smell some food that you would like to eat: ",
                            "examples": [
                                "The smell of that bread is making my mouth water!"
                            ]
                        },
                        {
                            "explanation": "When your eyes water, they produce tears but not because you are unhappy: ",
                            "examples": [
                                "How do you stop your eyes from watering when you're cutting up onions?"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -wɔː.tər"
                            ],
                            "us": [
                                " -wɑː.t̬ɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to form adjectives: ",
                            "examples": [
                                "freshwater fish",
                                "a saltwater lagoon"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}