{
    "word": "wave",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "weɪv"
                            ],
                            "us": [
                                "weɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to raise your hand and move it from side to side as a way of greeting someone, telling someone to do something, or adding emphasis to an expression: ",
                            "examples": [
                                "I waved to/at him from the window but he didn't see me.",
                                "I was waving my hand like mad but he never once looked in my direction.",
                                "She was so annoyed she wouldn't even wave us goodbye/wave goodbye to us.",
                                "She waves her hands about/around a lot when she's talking."
                            ]
                        },
                        {
                            "explanation": "to make a movement with your hand that tells someone or something to move in a particular direction: ",
                            "examples": [
                                "You'll have to wait till the policeman waves the car on."
                            ]
                        },
                        {
                            "explanation": "to move from side to side, or to make something move like this while holding it in the hand: ",
                            "examples": [
                                "The corn waved gently in the summer breeze.",
                                "A crowd of people ran down the street waving banners.",
                                "He seems to think I can wave a magic wand and everything will be all right."
                            ]
                        },
                        {
                            "explanation": "If hair waves, it curls slightly: ",
                            "examples": [
                                "If she leaves her hair to dry on its own, it just waves naturally."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "weɪv"
                            ],
                            "us": [
                                "weɪv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a raised line of water that moves across the surface of an area of water, especially the sea: ",
                            "examples": [
                                "At night, I listened to the sound of the waves breaking/crashing against the shore."
                            ]
                        },
                        {
                            "explanation": "the action of raising your hand and moving it from side to side as a way of greeting someone, etc.: ",
                            "examples": [
                                "We gave Grandpa a wave from the window."
                            ]
                        },
                        {
                            "explanation": "a wave-like movement made by a crowd watching a sports game, when everyone stands and lifts up their arms and then sits down again one after another: ",
                            "examples": [
                                "The crowd did the Wave."
                            ]
                        },
                        {
                            "explanation": "the pattern in which some types of energy, such as sound, light, and heat, are spread or carried: ",
                            "examples": [
                                "radio waves"
                            ]
                        },
                        {
                            "explanation": "a larger than usual number of events of a similar, often bad, type, happening within the same period: ",
                            "examples": [
                                "a crime wave",
                                "The country was swept by a wave of protests."
                            ]
                        },
                        {
                            "explanation": "a number of events of a particular type that happen again or are repeated after a pause: ",
                            "examples": [
                                "A new wave of job losses is expected this year."
                            ]
                        },
                        {
                            "explanation": "a sudden strong feeling that gets stronger as it spreads: ",
                            "examples": [
                                "A wave of panic swept through the crowd."
                            ]
                        },
                        {
                            "explanation": "a series of slight curves in a person's hair: ",
                            "examples": [
                                "Your hair has a natural wave, but mine's just straight."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}