{
    "word": "way",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "weɪ"
                            ],
                            "us": [
                                "weɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a route, direction, or path: ",
                            "examples": [
                                "Do you know the way to the restaurant?",
                                "I've only been living in Madrid for a couple of weeks so I don't really know my way around it yet.",
                                "We'll have to stop for petrol on the way to the airport.",
                                "Can you find your own way out of the building?",
                                "He elbowed/pushed his way (= hit/pushed people so that he could go past them) to the front of the crowd.",
                                "The bus stopped for us to eat lunch but within half an hour we were on our way/under way (= travelling) again.",
                                "There's no way through here - you'll have to go round.",
                                "They flew from Los Angeles to Toronto by way of Chicago.",
                                "Many people have lost their way (= become lost) in the forest.",
                                "Only local people could find their way through the maze of narrow streets."
                            ]
                        },
                        {
                            "explanation": "used to talk about the direction in which something is facing: ",
                            "examples": [
                                "\"Which way does the room face?\" \"North.\"",
                                "Which way up should this box be? (= Which side should be on top?)",
                                "The numbers are the wrong way round - it should be 71, not 17."
                            ]
                        },
                        {
                            "explanation": "happening in the opposite way: ",
                            "examples": [
                                "I thought the older people would be more offended than the young people, but it was the other way round.",
                                "I think his wife was influencing him, not the other way round.",
                                "This way, you are taking your leaves to the shredder rather than the other way around.",
                                "Sometimes I come up with a lyric then write a tune and sometimes it's the other way round.",
                                "He should be apologizing to me, not the other way round."
                            ]
                        },
                        {
                            "explanation": "happening in the opposite way: ",
                            "examples": [
                                "I thought the older people would be more offended than the young people, but it was the other way around.",
                                "I think his wife was influencing him, not the other way around.",
                                "This way, you are taking your leaves to the shredder rather than the other way around.",
                                "Sometimes I come up with a lyric then write a tune and sometimes it's the other way around.",
                                "He should be apologizing to me, not the other way around."
                            ]
                        },
                        {
                            "explanation": "used in the names of some roads: ",
                            "examples": [
                                "Our offices are at 17 King's Way."
                            ]
                        },
                        {
                            "explanation": "a distance or a period of time: ",
                            "examples": [
                                "We walked a long way yesterday.",
                                "The holiday seems like it's a long way off.",
                                "We managed to pull ourselves all the way from 12th place to first place.",
                                "They still have a ways to go."
                            ]
                        },
                        {
                            "explanation": "a particular choice, opinion, belief, or action, especially from among several possibilities: ",
                            "examples": [
                                "I like the way you've done your hair.",
                                "In some/many ways it would be better if we met on Monday rather than Wednesday.",
                                "In a way (= partly), I would rather they didn't come because it will mean extra work.",
                                "He might have to resign or he might be demoted, but either way, his career is effectively over.",
                                "They don't write songs the way (= as) they used to."
                            ]
                        },
                        {
                            "explanation": "the manner in which someone behaves or thinks, or in which something happens: ",
                            "examples": [
                                "Don't worry - it's just his way.",
                                "He looked at me in a sinister way.",
                                "It's amazing the way she manages to stay so calm.",
                                "The way he was shouting, you'd have thought he was badly hurt.",
                                "To my way of thinking, they shouldn't be building so many roads.",
                                "It's always the way at work - either I have nothing to do or I'm rushed off my feet!"
                            ]
                        },
                        {
                            "explanation": "types of behaviour: ",
                            "examples": [
                                "Over the years we've got used to his funny little ways.",
                                "He's always been lazy and I don't think he's going to change his ways now.",
                                "When I moved to the commune, I found their ways very strange.",
                                "She grew tired of having to explain her family's ways to others.",
                                "If you're not careful, you'll soon slip back into your old ways."
                            ]
                        },
                        {
                            "explanation": "an action that can produce the result you want; a method: ",
                            "examples": [
                                "There are many ways of solving the problem.",
                                "That's not the way to do it - let me show you.",
                                "That method hasn't worked, so let's try your way."
                            ]
                        },
                        {
                            "explanation": "the space needed for a particular movement or action: ",
                            "examples": [
                                "\"Sorry, am I in your way? I'll move.\"",
                                "I couldn't see the stage because there was a pillar in the way (= between me and the stage).",
                                "Make way for some new clothes by clearing out ones you never wear.",
                                "You need to get out of the way of that car.",
                                "She's determined to succeed and she won't let anything get/stand in her way (= prevent her)."
                            ]
                        },
                        {
                            "explanation": "If someone gets or has their way, what they want happens: ",
                            "examples": [
                                "If she doesn't get/have her (own) way, she sulks like a four-year-old."
                            ]
                        },
                        {
                            "explanation": "the bad condition or state of someone or something, especially the state of a person's health: ",
                            "examples": [
                                "He's been in a bad way (= very ill) ever since the operation."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "weɪ"
                            ],
                            "us": [
                                "weɪ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to emphasize degree or separation, especially in space or time: ",
                            "examples": [
                                "After the third lap, she was way behind the other runners.",
                                "She spends way too much money on clothes."
                            ]
                        },
                        {
                            "explanation": "in the direction of: ",
                            "examples": [
                                "I think they live Birmingham way."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}