{
    "word": "weave",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wiːv"
                            ],
                            "us": [
                                "wiːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make cloth by repeatedly crossing a single thread through two sets of long threads on a loom (= special frame): ",
                            "examples": [
                                "This type of wool is woven into fabric which will make jackets."
                            ]
                        },
                        {
                            "explanation": "to twist long objects together, or to make something by doing this: ",
                            "examples": [
                                "We were shown how to roughly weave ferns and grass together to make a temporary shelter.",
                                "It takes great skill to weave a basket from/out of rushes."
                            ]
                        },
                        {
                            "explanation": "to form something from several different things or to combine several different things, in a complicated or skilled way: ",
                            "examples": [
                                "The biography is woven from the many accounts which exist of things she did."
                            ]
                        },
                        {
                            "explanation": "to go or make a path by moving quickly and changing direction often, especially to avoid hitting things: ",
                            "examples": [
                                "The boy weaved through/between/in and out of stationary traffic on a bicycle."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wiːv"
                            ],
                            "us": [
                                "wiːv"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the way in which cloth has been woven, for example with the threads pulled firmly together, or the pattern produced by this process: ",
                            "examples": [
                                "a tight weave",
                                "a striped/traditional weave"
                            ]
                        },
                        {
                            "explanation": "a piece of hair that is added to a person's own hair in order to make the hair thicker or longer: ",
                            "examples": [
                                "To recreate Alexander the Great's mane of hair, the actor had blonde dye and a weave."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}