{
    "word": "wheel",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wiﾋ人"
                            ],
                            "us": [
                                "wiﾋ人"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a circular object connected at the centre to a bar, used for making vehicles or parts of machines move: ",
                            "examples": [
                                "I got my bag caught in the wheel of my bicycle.",
                                "He lost control of his car when a front/rear wheel hit a rock as he approached the first bend."
                            ]
                        },
                        {
                            "explanation": "Something that is on wheels has wheels under it so that it can be pulled or pushed along: ",
                            "examples": [
                                "My suitcase is on wheels so that makes life a little easier."
                            ]
                        },
                        {
                            "explanation": "a steering wheel (= a wheel inside a vehicle that the driver turns to make the vehicle go in a particular direction): ",
                            "examples": [
                                "Keep your hands on the wheel!",
                                "I never feel safe with Richard at the wheel (= driving).",
                                "Who was behind the wheel (= driving) at the time of the accident?",
                                "Do you think you could take the wheel (= drive) for a couple of hours?"
                            ]
                        },
                        {
                            "explanation": "a wooden or metal wheel that is turned to make a ship go in a particular direction",
                            "examples": []
                        },
                        {
                            "explanation": "a car: ",
                            "examples": [
                                "I've got to get some wheels - the buses are way too slow!"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wiﾋ人"
                            ],
                            "us": [
                                "wiﾋ人"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to push an object that has wheels so that it moves in a particular direction: ",
                            "examples": [
                                "I saw her last night wheeling a buggy along Green Lane.",
                                "Halfway through the talk someone wheeled in a trolley laden with drinks.",
                                "Doctors put her on a respirator and wheeled her downstairs to intensive care."
                            ]
                        },
                        {
                            "explanation": "to fly repeatedly in a circular pattern: ",
                            "examples": [
                                "She watched a flock of seagulls wheeling high above her."
                            ]
                        },
                        {
                            "explanation": "to turn round quickly: ",
                            "examples": [
                                "She suddenly wheeled and looked directly at me.",
                                "Mike wheeled on Tom and started shouting."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}