{
    "word": "which",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "determiner",
                        "ipa": {
                            "uk": [
                                "wɪtʃ"
                            ],
                            "us": [
                                "wɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "(used in questions and structures in which there is a fixed or limited set of answers or possibilities) what one or ones: ",
                            "examples": [
                                "Which party would you prefer to go to - Anna's or Dan's ?",
                                "Which doctor did you see - Seward?",
                                "Which time suits you better - 12.30 or one o'clock?",
                                "\"Jacinta was there with her boyfriend.\" \"Which one? She has several.\"",
                                "Which is mine? The smaller one?",
                                "See if you can guess which one is me in my old school photo.",
                                "It's either Spanish or Portuguese that she speaks, but I've forgotten which.",
                                "Which of the desserts did you have?",
                                "Which of your parents do you feel closer to?"
                            ]
                        },
                        {
                            "explanation": "used to add extra information to a previous clause, in writing usually after a comma: ",
                            "examples": [
                                "That bar on Milton Street, which by the way is very nice, is owned by Trevor's brother.",
                                "She says it's Charlotte's fault, which is stupid, and that she blames her.",
                                "Anyway, that evening, which I'll tell you more about later, I ended up staying at Rachel's place.",
                                "It's the third in a sequence of three books, the first of which I really enjoyed.",
                                "He showed me round the town, which was very kind of him.",
                                "The picking of the fruit, for which work they receive no money, takes about a week."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "pronoun",
                        "ipa": {
                            "uk": [
                                "wɪtʃ"
                            ],
                            "us": [
                                "wɪtʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used as the subject or object of a verb to show what thing or things you are referring to, or to add information about the thing just mentioned. It is usually used for things, not people: ",
                            "examples": [
                                "These are principles which we all believe in.",
                                "You know that little Italian restaurant - the one which I mentioned in my letter?",
                                "Is that the film in which he kills his mother?",
                                "The death of his son was an experience from which he never fully recovered.",
                                "It isn't a subject to which I devote a great deal of thought."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}