{
    "word": "whistle-stop",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈwɪs.əl.stɒp"
                            ],
                            "us": [
                                "ˈwɪs.əl.stɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe a series of short visits to a number of different places in a short space of time: ",
                            "examples": [
                                "The candidate's whistle-stop tour chugged through Missouri, Kansas and Colorado before winding down in Arizona. ",
                                "Truman may have come through here in the '40s during one of his whistle-stop campaigns.",
                                "We finally made it north of the border for a delightful whistle-stop tour around Burns country."
                            ]
                        },
                        {
                            "explanation": "used to describe a situation in which a lot of things are described or done, with not much time given to each part: ",
                            "examples": [
                                "Below we offer a whistle-stop guide to Eastern and Northern Europe's city break destinations.",
                                "The first half of the degree course is a whistle-stop tour of multimedia design.",
                                "Tonight's show provides a whistlestop tour of comedy from the 1940s to the present day."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwɪs.əl.stɒp"
                            ],
                            "us": [
                                "ˈwɪs.əl.stɑːp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small town or community on a railway line, or a station in or near a small town where trains only stop if they are given a signal to do so: ",
                            "examples": [
                                "A \"whistle-stop,\" in railroad terms, is a community too small to enjoy regular scheduled service."
                            ]
                        },
                        {
                            "explanation": "one of a series of short visits to various places made by a politician during an election: ",
                            "examples": [
                                "President-elect Nixon mentioned seeing, at a whistle-stop in Deshler, Ohio, a girl carrying a sign reading \"Bring Us Together.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}