{
    "word": "white",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "waɪt"
                            ],
                            "us": [
                                "waɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "of a colour like that of snow, milk, or bone: ",
                            "examples": [
                                "a white T-shirt",
                                "white walls",
                                "a black and white dog",
                                "He's white-haired now."
                            ]
                        },
                        {
                            "explanation": "having a pale face because you are not well, or you are feeling shocked: ",
                            "examples": [
                                "She was white, and her lips were pale."
                            ]
                        },
                        {
                            "explanation": "used in the names of various food and drink products, many of which are not pure white but slightly cream, yellow, grey, or transparent: ",
                            "examples": [
                                "white bread",
                                "white chocolate",
                                "white flour",
                                "white sugar",
                                "white wine"
                            ]
                        },
                        {
                            "explanation": "with milk or cream added: ",
                            "examples": [
                                "I start the day with a cup of white coffee.",
                                "\"How do you like your coffee?\" \"White and no sugar, please.\""
                            ]
                        },
                        {
                            "explanation": "belonging to the group of people with skin that is pale in colour, who come from or whose family originally came from Europe: ",
                            "examples": [
                                "He had a black mother and a white father.",
                                "a predominantly white neighbourhood"
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "waɪt"
                            ],
                            "us": [
                                "waɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a colour like that of snow, milk, or bone: ",
                            "examples": [
                                "In some countries it is traditional for a bride to wear white."
                            ]
                        },
                        {
                            "explanation": "white clothes, either worn for a particular activity or job, or put together to be washed at the same time: ",
                            "examples": [
                                "A girl in tennis whites was hurrying across the grass towards them."
                            ]
                        },
                        {
                            "explanation": "the part of the eye that is white: ",
                            "examples": [
                                "Don't shoot until you see the whites of their eyes (= until the people are very close to you)."
                            ]
                        },
                        {
                            "explanation": "the transparent part of an egg that surrounds the yolk and becomes white when cooked: ",
                            "examples": [
                                "Beat four egg whites into stiff peaks."
                            ]
                        },
                        {
                            "explanation": "a person with skin that is pale in colour, who comes from or whose family originally came from Europe: ",
                            "examples": [
                                "The neighbourhood is populated mainly by whites."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}