{
    "word": "wild",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "waɪld"
                            ],
                            "us": [
                                "waɪld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "uncontrolled, violent, or extreme: ",
                            "examples": [
                                "a wild party",
                                "wild dancing",
                                "The audience burst into wild applause.",
                                "When I told him what I'd done, he went wild (= became very angry).",
                                "The children were wild with excitement (= were extremely excited).",
                                "Her eyes were wild/She had a wild look in her eyes (= her eyes were wide open, as if frightened or mentally ill).",
                                "His hair was wild (= long and untidy) and his clothes full of holes.",
                                "There have been wild (= extreme) variations in the level of spending.",
                                "They get some wild weather (= many severe storms) in the north.",
                                "It was a wild (= stormy or very windy) night, with the wind howling and the rain pouring down."
                            ]
                        },
                        {
                            "explanation": "very unusual, often in a way that is attractive or exciting: ",
                            "examples": [
                                "Those are wild trousers you're wearing, Maddy."
                            ]
                        },
                        {
                            "explanation": "used to refer to plants or animals that live or grow independently of people, in natural conditions and with natural characteristics: ",
                            "examples": [
                                "wild grasses",
                                "a herd of wild horses",
                                "These herbs grow wild in the area."
                            ]
                        },
                        {
                            "explanation": "Wild land is not used to grow crops and has few people living in it: ",
                            "examples": [
                                "a wild, mountainous region"
                            ]
                        },
                        {
                            "explanation": "something that you say that is not based on facts and is probably wrong: ",
                            "examples": [
                                "He's clearly very paranoid and making wild accusations."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "waɪld"
                            ],
                            "us": [
                                "waɪld"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in natural conditions, independent of humans: ",
                            "examples": [
                                "Animals would produce more young in the wild than they do in the zoo.",
                                "This is the only place these huge lizards are found in the wild.",
                                "Tragically, only 5,000 of these magnificent animals survive in the wild.",
                                "In the wild, these creatures range far and wide during breeding season, looking for partners to mate with.",
                                "He wouldn't last long if forced to fend for himself in the wild.",
                                "I would so love to see an elephant in the wild."
                            ]
                        },
                        {
                            "explanation": "in an area that is far from where people usually live and difficult to get to, and that is not considered easy to live in: ",
                            "examples": [
                                "She lives somewhere in the wilds of Borneo."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}