{
    "word": "will",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "modal verb",
                        "ipa": {
                            "uk": [
                                "wɪl"
                            ],
                            "us": [
                                "wɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to talk about what is going to happen in the future, especially things that you are certain about or things that are planned: ",
                            "examples": [
                                "Clare will be five years old next month.",
                                "The train leaves at 8:58, so we'll be in Scotland by lunchtime.",
                                "I'll see him tomorrow./I'll be seeing him tomorrow.",
                                "Will Susie be there?",
                                "It won't be easy to find another secretary.",
                                "There'll be trouble when she finds out."
                            ]
                        },
                        {
                            "explanation": "used to talk about what someone or something is able or willing to do: ",
                            "examples": [
                                "I'll give you a lift.",
                                "Ask Gabriela if she'll take them.",
                                "I've asked her but she won't come.",
                                "The car won't start.",
                                "This lasagne will feed six people."
                            ]
                        },
                        {
                            "explanation": "used to ask someone to do something: ",
                            "examples": [
                                "Will you give me her address?",
                                "Will you give that to Tony when you see him, please?"
                            ]
                        },
                        {
                            "explanation": "used as a polite way of inviting someone to do something, or of offering someone something: ",
                            "examples": [
                                "Will you join us for a cup of coffee, Evie?",
                                "Will you come in for a while?",
                                "You'll have some cake, won't you, Charlie?"
                            ]
                        },
                        {
                            "explanation": "used in conditional sentences with 'if': ",
                            "examples": [
                                "If he's late again, I'll be very angry.",
                                "I'll wait with Christopher if his mother isn't here when you go."
                            ]
                        },
                        {
                            "explanation": "used to refer to what is likely: ",
                            "examples": [
                                "That'll be Scott at the door.",
                                "That'll be his mother with him.",
                                "As you all will know, election day is next week."
                            ]
                        },
                        {
                            "explanation": "used when angry to tell someone to do something: ",
                            "examples": [
                                "Will you stop being such a pain!",
                                "You'll go upstairs and you'll go straight to bed like your father told you!"
                            ]
                        },
                        {
                            "explanation": "used when referring to something that always or usually happens: ",
                            "examples": [
                                "Accidents will happen.",
                                "Fruit will keep longer in the fridge.",
                                "The product with the better-known brand name will always sell better.",
                                "She's 85 now, but she will insist on doing all her own housework."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɪl"
                            ],
                            "us": [
                                "wɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the mental power used to control and direct your thoughts and actions, or a determination to do something, despite any difficulties or opposition: ",
                            "examples": [
                                "From an early age she had a very strong will.",
                                "After six months in hospital she began to lose the will to live (= the desire and determination to stay alive)."
                            ]
                        },
                        {
                            "explanation": "what someone wants to happen: ",
                            "examples": [
                                "It was God's will.",
                                "Against their will (= although they did not want to), they were forced to hand over the money.",
                                "The government has failed to impose its will upon regional communities (= to make them do as it wants)."
                            ]
                        },
                        {
                            "explanation": "an official statement of what a person has decided should be done with their money and property after their death: ",
                            "examples": [
                                "Have you made a will yet?",
                                "She left me some money in her will."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɪl"
                            ],
                            "us": [
                                "wɪl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "If you will something to happen, you try to make it happen by the power of your thoughts: ",
                            "examples": [
                                "She willed herself to remember his name."
                            ]
                        },
                        {
                            "explanation": "to want something: ",
                            "examples": [
                                "Stay or go, as you will."
                            ]
                        },
                        {
                            "explanation": "to arrange to give money or property to others after your death",
                            "examples": []
                        }
                    ]
                }
            ]
        }
    ]
}