{
    "word": "win",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɪn"
                            ],
                            "us": [
                                "wɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "present participle"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to achieve first position and/or get a prize in a competition, election, fight, etc.: ",
                            "examples": [
                                "Which year was it that Italy won the World Cup?",
                                "He won first prize/a bottle of wine in the raffle.",
                                "Who's winning?",
                                "This is the third medal she's won this season.",
                                "Who won the men's finals at the Open?",
                                "They won the war, although it cost them millions of lives.",
                                "If this government win the next election, I'm leaving the country.",
                                "Everyone likes winning an argument.",
                                "It was his goal that won us the match/won the match for us.",
                                "Her firm has just won (= beaten other companies to get) a cleaning contract worth £3 million."
                            ]
                        },
                        {
                            "explanation": "to receive something positive, such as approval, loyalty, or love because you have earned it: ",
                            "examples": [
                                "Her plans have won the support of many local people.",
                                "This is Jamie, the four-year old who won the hearts of the nation (= made everyone love him and/or feel sympathy for him).",
                                "She would do anything to win his love.",
                                "Winning back his trust was the hardest part."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɪn"
                            ],
                            "us": [
                                "wɪn"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an occasion when someone wins a game or competition: ",
                            "examples": [
                                "It was the team's sixth consecutive win this season.",
                                "Everyone was predicting a Republican win at the last election."
                            ]
                        },
                        {
                            "explanation": "something useful or positive that you achieve: ",
                            "examples": [
                                "We need to aim for quick wins - projects that will have an immediate impact.",
                                "Breaking down activities into a number of small wins concentrates your attention on what is possible."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}