{
    "word": "window",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwɪn.dəʊ"
                            ],
                            "us": [
                                "ˈwɪn.doʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a space usually filled with glass in the wall of a building or in a vehicle, to allow light and air in and to allow people inside the building to see out: ",
                            "examples": [
                                "Is it all right if I open/close the window?",
                                "He caught me staring out of the window.",
                                "I saw a child's face at the window.",
                                "She has some wonderful plants in the window (= on a surface at the bottom of the window).",
                                "I was admiring the cathedral's stained-glass windows.",
                                "Have you paid the window cleaner (= person whose job is to clean the outside of windows)?",
                                "window frames",
                                "a window ledge"
                            ]
                        },
                        {
                            "explanation": "something that makes it possible for you to see and learn about a situation or experience that is different from your own: ",
                            "examples": [
                                "The film provides a window on the immigrant experience."
                            ]
                        },
                        {
                            "explanation": "a transparent rectangle on the front of an envelope, through which you can read the address written on the letter inside",
                            "examples": []
                        },
                        {
                            "explanation": "the decorative arrangement of goods behind the window at the front of a shop, in addition to the window itself: ",
                            "examples": [
                                "How much is the jacket in the window?",
                                "The shop windows are wonderful around Christmas time."
                            ]
                        },
                        {
                            "explanation": "a separate area on a computer screen that shows information and can be moved around: ",
                            "examples": [
                                "to minimize/maximize a window"
                            ]
                        },
                        {
                            "explanation": "a period when there is an opportunity to do something: ",
                            "examples": [
                                "I'm busy this week but there might be a window on Friday.",
                                "If a window of opportunity (= an opportunity) should present itself, I'd take advantage of it."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}