{
    "word": "wing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɪŋ"
                            ],
                            "us": [
                                "wɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the flat part of the body that a bird, insect, or bat uses for flying, or one of the flat, horizontal structures that stick out from the side of an aircraft and support it when it is flying: ",
                            "examples": [
                                "the delicacy of a butterfly's wings",
                                "I could see the plane's wing out of my window."
                            ]
                        },
                        {
                            "explanation": "the wing of a chicken eaten as food: ",
                            "examples": [
                                "We sat there eating wings and watching a ball game.",
                                "Wednesday nights at the bar you can get a kilo of hot (= spicy) wings for $5. ",
                                "Cut each chicken wing into 2 pieces at the joint. "
                            ]
                        },
                        {
                            "explanation": "If a bird takes wing, it flies away: ",
                            "examples": [
                                "As I approached the bird, it took wing."
                            ]
                        },
                        {
                            "explanation": "to suddenly develop, freely and powerfully: ",
                            "examples": [
                                "She walked in the hills, letting her thoughts take wing."
                            ]
                        },
                        {
                            "explanation": "A bird that is on the wing is flying: ",
                            "examples": [
                                "When they are on the wing, you can really see their dramatic markings."
                            ]
                        },
                        {
                            "explanation": "a group within a political party or organization whose beliefs are in some way different from those of the main group: ",
                            "examples": [
                                "The president is on the left wing of the Democratic party.",
                                "The extreme right wing of the party has dominated the discussion."
                            ]
                        },
                        {
                            "explanation": "a part of a large building that sticks out from the main part, often having been added at a later date: ",
                            "examples": [
                                "The maternity department will be in the new wing of the hospital.",
                                "The west wing of the house is still lived in by Lord and Lady Carlton, while the rest of the house is open to the public."
                            ]
                        },
                        {
                            "explanation": "one of the four parts at the side of a car that go over the wheels: ",
                            "examples": [
                                "There's a dent in the left wing.",
                                "Look in your wing mirror."
                            ]
                        },
                        {
                            "explanation": "(in various team games, such as football and hockey) either of the two sides of the sports field, or a player whose position is at either of the two sides of the field: ",
                            "examples": [
                                "Zinoli passes the ball to Pereira out there on the wing.",
                                "He played left/right wing for Manchester United."
                            ]
                        },
                        {
                            "explanation": "the sides of a stage that cannot be seen by the people watching the play: ",
                            "examples": [
                                "I was in the wings waiting for my cue to come on stage."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɪŋ"
                            ],
                            "us": [
                                "wɪŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to perform or speak without having prepared what you are going to do or say: ",
                            "examples": [
                                "I didn't have time to prepare for the talk, so I just had to wing it."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}