{
    "word": "wire",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "waɪər"
                            ],
                            "us": [
                                "waɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a piece of thin metal thread that can be bent, used for fastening things and for making particular types of objects that are strong but can bend: ",
                            "examples": [
                                "a wire fence"
                            ]
                        },
                        {
                            "explanation": "(a piece of) thin metal thread with a layer of plastic around it, used for carrying electric current: ",
                            "examples": [
                                "Someone had cut the phone wires.",
                                "Don't touch those wires whatever you do."
                            ]
                        },
                        {
                            "explanation": "a secret recording device hidden worn by a person, especially one that is hidden in their clothes: ",
                            "examples": [
                                "The undercover police officer was wearing a wire during the meeting."
                            ]
                        },
                        {
                            "explanation": "the wire fence around a prison or prison camp: ",
                            "examples": [
                                "During the war he spent three years behind the wire (= in prison)."
                            ]
                        },
                        {
                            "explanation": "a \ntelegram ",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "waɪər"
                            ],
                            "us": [
                                "waɪr"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to fasten two things together using wire: ",
                            "examples": [
                                "She had her jaws wired together so that she wouldn't be able to eat."
                            ]
                        },
                        {
                            "explanation": "to connect a piece of electrical equipment with wires so that it will work: ",
                            "examples": [
                                "The stereo wasn't working because it hadn't been wired up correctly.",
                                "Nearly one home in ten across the country is wired up to receive TV via cable."
                            ]
                        },
                        {
                            "explanation": "to send money using an electrical communication system: ",
                            "examples": [
                                "The insurance company wired millions of dollars to its accounts to cover the payments.",
                                "Luckily my father wired me two hundred bucks."
                            ]
                        },
                        {
                            "explanation": "in the past, to send someone a telegram: ",
                            "examples": [
                                "Janet wired me to say she'd be here a day later than planned."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}