{
    "word": "wishing",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "present participle of \nwish ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɪʃ"
                            ],
                            "us": [
                                "wɪʃ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used with the past simple to express that you feel sorry or sad about a state or situation that exists at the moment: ",
                            "examples": [
                                "I wish (that) I was/were a bit taller.",
                                "I wish (that) you were coming with me, Peter."
                            ]
                        },
                        {
                            "explanation": "used with the past perfect to express that you feel sorry or sad about a particular action in the past: ",
                            "examples": [
                                "I wish (that) I hadn't eaten so much.",
                                "I bet she wishes (that) she'd never got involved in the whole mess."
                            ]
                        },
                        {
                            "explanation": "to want to do something: ",
                            "examples": [
                                "As you wish, Sir. It will be done.",
                                "I wish to make a complaint.",
                                "Passengers wishing to take the Kings Cross train should board now.",
                                "I don't wish to worry you but he did say he'd be back by midnight.",
                                "Sometimes I was so depressed that I wished myself dead."
                            ]
                        },
                        {
                            "explanation": "used to express anger at someone's behaviour: ",
                            "examples": [
                                "I wish she'd shut up for a minute and let someone else talk.",
                                "I wish you'd look at me when I'm trying to talk to you!"
                            ]
                        },
                        {
                            "explanation": "to hope or express hope for another person's success or happiness or pleasure on a particular occasion: ",
                            "examples": [
                                "We wish you every success in the future.",
                                "I didn't even see her to wish her a happy birthday/wish a happy birthday to her.",
                                "I wished her a safe journey and waved her off."
                            ]
                        },
                        {
                            "explanation": "to hope someone will succeed: ",
                            "examples": [
                                "I wished him well with his new venture."
                            ]
                        },
                        {
                            "explanation": "to hope that something you want will be made real because of good luck or magical powers: ",
                            "examples": [
                                "I remember blowing out the candles on my birthday cake and wishing that John Lee would be my boyfriend.",
                                "If I could wish myself anywhere in the world (= go anywhere as a result of making a wish) right now it would be somewhere hot and sunny.",
                                "He's funny, bright, handsome - everything a girl could wish for really.",
                                "\"Your job must be very glamorous.\" \"I wish!\" (= not at all.)",
                                "\"By the time I'm 40, I'll be rich.\" \"You wish!\" (= There is no chance of that happening.)"
                            ]
                        },
                        {
                            "explanation": "to welcome someone with particular words or a particular action: ",
                            "examples": [
                                "He wishes me every morning."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}