{
    "word": "with",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "preposition",
                        "ipa": {
                            "uk": [
                                "wɪð"
                            ],
                            "us": [
                                "wɪð"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to say that people or things are in a place together or are doing something together: ",
                            "examples": [
                                "I was with Sylvia at the time.",
                                "He lives with his grandmother.",
                                "He's impossible to work with.",
                                "I'm going to France with a couple of friends.",
                                "Ingrid Bergman starred with Humphrey Bogart in the movie \"Casablanca\".",
                                "I left my books with Sandra.",
                                "Ice cream with your apple pie?",
                                "Mix the butter with the sugar and then add the egg.",
                                "I'll be with you (= I will give you my attention) in a second.",
                                "She's staying with her parents (= at their house) for a few months.",
                                "He's been with the department (= working in it) since 2010."
                            ]
                        },
                        {
                            "explanation": "using something: ",
                            "examples": [
                                "He was shot at close range with a pistol.",
                                "She wiped her lipstick off with a tissue.",
                                "Join the two pieces together with glue.",
                                "Please handle this package with care.",
                                "They set up a business with the help of a bank loan."
                            ]
                        },
                        {
                            "explanation": "having or including something: ",
                            "examples": [
                                "a tall woman with dark hair",
                                "He's married with three children.",
                                "They were divided into two groups, with no girls in one group and no boys in the other.",
                                "He spoke with a soft Irish accent.",
                                "We're an international company with offices in Paris, New York, and Sydney.",
                                "Two coffees please, one with milk and one without.",
                                "He arrived in Los Angeles with nothing but the clothes he was wearing.",
                                "He woke up with a terrible headache.",
                                "I was second in the race with a time of 14.2 seconds.",
                                "With a bit of luck, we should be back in time for dinner.",
                                "Both their children graduated with degrees in economics."
                            ]
                        },
                        {
                            "explanation": "used at the beginning of various phrases written at the end of a letter: ",
                            "examples": [
                                "With best wishes from Charles.",
                                "With love, Roberta."
                            ]
                        },
                        {
                            "explanation": "including: ",
                            "examples": [
                                "With your contribution, that makes a total of £45."
                            ]
                        },
                        {
                            "explanation": "relating to or in the case of a person or thing: ",
                            "examples": [
                                "How are things with you?",
                                "Russia has just drawn up a trade agreement with Norway.",
                                "This hasn't got anything to do with you (= this is not something you should be interested in).",
                                "The government's policies have not been popular with (= among) the voters.",
                                "He's very careless with his money.",
                                "She talked a lot about her relationship with Charlotte."
                            ]
                        },
                        {
                            "explanation": "used to show what is on or in something: ",
                            "examples": [
                                "She laid the table with the best china.",
                                "Her blouse was spattered with blood.",
                                "The room was littered with toys.",
                                "The trucks were laden with food and medicine.",
                                "She filled the jug up with cream."
                            ]
                        },
                        {
                            "explanation": "because of or caused by someone or something: ",
                            "examples": [
                                "He winced with pain.",
                                "I was trembling with fear.",
                                "She's been at home with a bad cold for the past week.",
                                "I can't work with all that noise going on.",
                                "Hopes were dashed in the war-torn capital with the news that no aid would be arriving that week.",
                                "With exams approaching, it's a good idea to review your class notes.",
                                "(What) with all the excitement and confusion, I forgot to say goodbye to her."
                            ]
                        },
                        {
                            "explanation": "against something: ",
                            "examples": [
                                "I ended up having an argument with her.",
                                "She has fought a constant battle with depression throughout her career.",
                                "The two countries went to war with one another over oil prices.",
                                "A truck had collided with a car."
                            ]
                        },
                        {
                            "explanation": "used with words showing separation: ",
                            "examples": [
                                "I'd rather not part with my cash.",
                                "He decided to put his failed marriage behind him and make a clean break with the past."
                            ]
                        },
                        {
                            "explanation": "and, or followed by: ",
                            "examples": [
                                "I'd like a steak and fries with apple pie for dessert.",
                                "$200 is payable immediately with a further $100 payable on delivery."
                            ]
                        },
                        {
                            "explanation": "used in comparisons: ",
                            "examples": [
                                "I have nothing in common with my brother.",
                                "This cake's very light compared with the last one you made."
                            ]
                        },
                        {
                            "explanation": "supporting someone or something: ",
                            "examples": [
                                "If you want to go for a promotion, I'll be with you all the way.",
                                "You have to decide where you stand on this issue - you're either with me or against me."
                            ]
                        },
                        {
                            "explanation": "in the same direction as something: ",
                            "examples": [
                                "The wind was with me on the home stretch and I ran well."
                            ]
                        },
                        {
                            "explanation": "at the same rate or time as something: ",
                            "examples": [
                                "This wine will improve with age.",
                                "Stopping distances for cars vary with the speed they are travelling at."
                            ]
                        },
                        {
                            "explanation": "to understand what someone is saying: ",
                            "examples": [
                                "You look puzzled - are you with me?"
                            ]
                        },
                        {
                            "explanation": "despite something: ",
                            "examples": [
                                "With all her faults, she's still a really good friend."
                            ]
                        },
                        {
                            "explanation": "used to express a wish or instruction: ",
                            "examples": [
                                "Away with you! (= Go away!)",
                                "Off to bed with you! (= Go to bed!)",
                                "On with the show! (= Let it continue.)",
                                "Down with school! (= We don't want/like it.)"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}