{
    "word": "witness",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwɪt.nəs"
                            ],
                            "us": [
                                "ˈwɪt.nəs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who sees an event happening, especially a crime or an accident: ",
                            "examples": [
                                "Police are appealing for witnesses to the accident to come forward.",
                                "According to (eye) witnesses, the robbery was carried out by two teenage boys."
                            ]
                        },
                        {
                            "explanation": "to see something happen: ",
                            "examples": [
                                "She was witness to the tragic event."
                            ]
                        },
                        {
                            "explanation": "someone who is asked to be present at a particular event and sign their name in order to prove that things have been done correctly: ",
                            "examples": [
                                "He signed the treaty in the presence of two witnesses.",
                                "They were married a year after they first met, with two friends acting as witnesses."
                            ]
                        },
                        {
                            "explanation": "a person in a law court who says what they know about a legal case or a particular person: ",
                            "examples": [
                                "Ten witnesses are expected to testify at the trial today.",
                                "The key witness for the prosecution was offered police protection after she received death threats."
                            ]
                        },
                        {
                            "explanation": "a person who is allowed to give their opinion in a law court because of their knowledge or practical experience of a particular subject: ",
                            "examples": [
                                "A psychiatrist was called as an expert witness for the defence."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈwɪt.nəs"
                            ],
                            "us": [
                                "ˈwɪt.nəs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to see something happen, especially an accident or crime: ",
                            "examples": [
                                "Did anyone witness the attack?",
                                "They were staying in the capital at the time of the riots and witnessed several street battles.",
                                "He arrived home just in time to witness his brother being taken away by the police."
                            ]
                        },
                        {
                            "explanation": "to be present at an event and to sign your name as proof that it happened or that it was done correctly: ",
                            "examples": [
                                "Her will was witnessed by two colleagues."
                            ]
                        },
                        {
                            "explanation": "When a place or period witnesses a particular event, the event happens in that place or during that period: ",
                            "examples": [
                                "This university has witnessed quite a few changes over the years.",
                                "Those years witnessed momentous changes throughout Europe."
                            ]
                        },
                        {
                            "explanation": "to show or give proof of something: ",
                            "examples": [
                                "This year's charity ball was the most successful one ever, as witnessed by the number of tickets sold.",
                                "The programme aroused strong feelings - witness the number of letters received."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}