{
    "word": "wonder",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈwʌn.dər"
                            ],
                            "us": [
                                "ˈwʌn.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to ask yourself questions or express a wish to know about something: ",
                            "examples": [
                                "Shouldn't you phone home? Your parents will be wondering where you are.",
                                "He's starting to wonder whether he did the right thing in accepting this job.",
                                "Will this turkey be big enough for eight, I wonder?",
                                "\"Have you decided where you're going next summer?\" \"I've been wondering about (= considering) going to Florida.\""
                            ]
                        },
                        {
                            "explanation": "used in phrases, at the beginning of a request, to make it more formal and polite: ",
                            "examples": [
                                "We were wondering if/whether you'd like to have dinner with us some time?",
                                "I wonder whether you could pass me the butter?",
                                "I wonder if you could give me some information about places to visit in the area?"
                            ]
                        },
                        {
                            "explanation": "to feel or express great surprise at something: ",
                            "examples": [
                                "I don't wonder (that) she burst into tears after the way you spoke to her."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwʌn.dər"
                            ],
                            "us": [
                                "ˈwʌn.dɚ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a feeling of great surprise and admiration caused by seeing or experiencing something that is strange and new: ",
                            "examples": [
                                "The sight of the Grand Canyon stretching out before them filled them with wonder.",
                                "The boys gazed in wonder at the shiny red Ferrari."
                            ]
                        },
                        {
                            "explanation": "an object that causes a feeling of great surprise and admiration: ",
                            "examples": [
                                "We spent a week visiting the wonders of Ancient Greek civilization.",
                                "With all the wonders of modern technology, why has no one come up with a way to make aircraft quieter?"
                            ]
                        },
                        {
                            "explanation": "an extremely useful or skilful person: ",
                            "examples": [
                                "Our new babysitter's a wonder - she'll come at very short notice and the kids love her."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}