{
    "word": "word",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɜːd"
                            ],
                            "us": [
                                "wɝːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a single unit of language that has meaning and can be spoken or written: ",
                            "examples": [
                                "Your essay should be no more than two thousand words long.",
                                "Some words are more difficult to spell than others.",
                                "What's the word for bikini in French?",
                                "It's sometimes difficult to find exactly the right word to express what you want to say."
                            ]
                        },
                        {
                            "explanation": "used to refer to a word, usually a rude or embarrassing one, by saying only the first letter and not the whole word: ",
                            "examples": [
                                "You're still not allowed to say the F-word on TV in the US",
                                "So how's the diet going - or would you rather I didn't mention the d-word?",
                                "I know Maisie very well and I know that she would never say the C-word.",
                                "Surely he didn't say the F-word?",
                                "Am I allowed to mention the E-word and ask when your exams start?"
                            ]
                        },
                        {
                            "explanation": "a short discussion or statement: ",
                            "examples": [
                                "The manager wants a word.",
                                "Could I have a word (with you) about the sales figures?",
                                "Could you have a quiet word with Mike (= gently explain to him) about the problem?"
                            ]
                        },
                        {
                            "explanation": "discussion, rather than action: ",
                            "examples": [
                                "So far there have been more words than action on the matter of childcare provision."
                            ]
                        },
                        {
                            "explanation": "If two or more people exchange words, they talk to each other for a short time: ",
                            "examples": [
                                "Nurses went busily up and down, sometimes pausing to exchange words.",
                                "We exchanged a few words as we were coming out of the meeting.",
                                "There is no evidence the pair even exchanged words on that occasion, let alone knew each other well."
                            ]
                        },
                        {
                            "explanation": "If two people or groups exchange words, they have an argument with each other: ",
                            "examples": [
                                "Words were exchanged and then someone threw a punch.",
                                "Angry words were exchanged outside the meeting room.",
                                "He became agitated and exchanged words with the man."
                            ]
                        },
                        {
                            "explanation": "If two people or groups have words, they have an argument with each other: ",
                            "examples": [
                                "I think they had words after we left.",
                                "I don't know if Amber is talking to me - we had words this morning."
                            ]
                        },
                        {
                            "explanation": "to speak angrily to someone because they have done something wrong : ",
                            "examples": [
                                "Her father would have had words with her about that.",
                                "At the end of the game I had words with the referee but I immediately apologized afterwards."
                            ]
                        },
                        {
                            "explanation": "a statement of approval and support for someone or something: ",
                            "examples": [
                                "If you see the captain could you put in a good word for me?",
                                "The critics didn't have a good word to say about the performance.",
                                "She doesn't have a good word to say about her hometown.",
                                "No one seemed to have a good word to say for her - even her daughter.",
                                "Beth had evidently put in a good word for us and we were greeted very warmly when we arrived."
                            ]
                        },
                        {
                            "explanation": "news or a message: ",
                            "examples": [
                                "Has there been any word from Paul since he went to New York?",
                                "We got word of their plan from a former colleague.",
                                "Word of the discovery caused a stir among astronomers."
                            ]
                        },
                        {
                            "explanation": "a promise: ",
                            "examples": [
                                "I said I'd visit him and I will keep my word.",
                                "You have my word - I won't tell a soul."
                            ]
                        },
                        {
                            "explanation": "an order: ",
                            "examples": [
                                "We're waiting for the word from head office before making a statement.",
                                "The troops will go into action as soon as their commander gives the word.",
                                "At a word from their teacher, the children started to put away their books."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɜːd"
                            ],
                            "us": [
                                "wɝːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to choose the words you use when you are saying or writing something: ",
                            "examples": [
                                "He worded the reply in such a way that he did not admit making the original error."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "exclamation",
                        "ipa": {
                            "uk": [
                                "wɜːd"
                            ],
                            "us": [
                                "wɝːd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used, especially in African American and hip-hop culture, to say that something is true or that you agree with something : ",
                            "examples": [
                                "\"I just wanna be left alone to do my thing.\" \"Word.\""
                            ]
                        },
                        {
                            "explanation": "used, especially in African American and hip-hop culture, to ask if something is really true: ",
                            "examples": [
                                "\"He got accepted at all three of the schools he applied to.\" \"Word?\" \"Yeah.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}