{
    "word": "workhorse",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwɜːk.hɔːs"
                            ],
                            "us": [
                                "ˈwɝːk.hɔːrs"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a person who does a lot of work, especially of a type that is necessary but not interesting: ",
                            "examples": [
                                "a willing/reliable workhorse",
                                "She's a work horse - you have to be on top of things when you work with her. "
                            ]
                        },
                        {
                            "explanation": "a machine that operates without failing for long periods, although it might not be very interesting or exciting: ",
                            "examples": [
                                "The steam engine was the workhorse of the Industrial Revolution.",
                                "In the convoy were heavy equipment transporters - 48-wheeled Army work horses designed to carry tanks."
                            ]
                        },
                        {
                            "explanation": "a member of a sports team who always does a lot of hard work to help the team: ",
                            "examples": [
                                "He is the squad's main workhorse.",
                                "She was the workhorse of the 2012 Games who won more medals than anyone on her team.",
                                "He is a work horse with a great approach to the game."
                            ]
                        },
                        {
                            "explanation": "a large horse that is used for doing heavy work, such as pulling a cart (= a vehicle used for carrying goods) or a plough (= a large farming tool with blades that digs the soil in fields so that seeds can be planted): ",
                            "examples": [
                                "The two horses were workhorses - they could pull a great deal of weight when they pulled logs out of the forest, but they were slow.",
                                "She grew up around work horses in the Midwest."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}