{
    "word": "worked",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "_",
                        "ipa": {
                            "uk": [],
                            "us": [],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "past simple and past participle of \nwork ",
                            "examples": []
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɜːk"
                            ],
                            "us": [
                                "wɝːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be effective or successful: ",
                            "examples": [
                                "Her idea for reorganizing the department will never work in practice.",
                                "The tablets will start to work in a few minutes.",
                                "Some people think I'm weird doing meditation, but it works for me and that's all that matters.",
                                "Arguably, the monarchy worked well for many centuries."
                            ]
                        },
                        {
                            "explanation": "to do a job, especially the job you do to earn money: ",
                            "examples": [
                                "Where do you work?",
                                "He works at the hospital.",
                                "She worked as a cleaner at the hospital.",
                                "Mike works for a computer company.",
                                "I work in management training.",
                                "Have you any experience of working with children who have learning difficulties?",
                                "It's not unusual for a junior doctor to work a 70 or sometimes an 80-hour week."
                            ]
                        },
                        {
                            "explanation": "to make a person or animal do a job: ",
                            "examples": [
                                "The instructors worked us very hard on the survival course.",
                                "Many of the animals were worked to death."
                            ]
                        },
                        {
                            "explanation": "If a machine or device works, it operates, especially correctly and without failure, and if you work it, you make it operate: ",
                            "examples": [
                                "Our phone isn't working.",
                                "You need a team of about twelve people to work a furnace this size.",
                                "The pump works off/on (= uses) wind power.",
                                "The pump is worked by (= uses to operate) wind power.",
                                "I can't get the radio to work."
                            ]
                        },
                        {
                            "explanation": "to succeed gradually in becoming something or cause a person or thing to become something, either by making an effort or by making many small movements: ",
                            "examples": [
                                "He started as a technician and worked his way up through the company to become managing director.",
                                "Eventually she worked her way through (= read) the huge amount of technical papers.",
                                "Vibration tends to make nuts and screws work themselves loose.",
                                "The screws had worked loose over time."
                            ]
                        },
                        {
                            "explanation": "to arrange for something to happen, especially by not using official methods and/or by being clever: ",
                            "examples": [
                                "I don't know how she worked it, but she retired at 50.",
                                "Can we work things (out) so that there's always someone here to answer the phone during office hours?"
                            ]
                        },
                        {
                            "explanation": "to shape, change, or process a substance: ",
                            "examples": [
                                "Working iron requires higher temperatures than bronze.",
                                "Gently work the butter into the flour until there are no lumps left."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}