{
    "word": "work",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɜːk"
                            ],
                            "us": [
                                "wɝːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an activity, such as a job, that a person uses physical or mental effort to do, usually for money: ",
                            "examples": [
                                "I've got so much work to do.",
                                "Carrying heavy loads around all day is hard work.",
                                "What time do you start/finish work?",
                                "Aileen does most of the work around the house.",
                                "What sort of work are you experienced in?",
                                "She tends to wear quite dressy clothes for work.",
                                "Roger's work involves a lot of travelling."
                            ]
                        },
                        {
                            "explanation": "the material used by someone at work, or what they produce: ",
                            "examples": [
                                "I'll have to take this work home with me and finish it there.",
                                "All the furniture is the work of residents here."
                            ]
                        },
                        {
                            "explanation": "a place where a person goes specially to do their job: ",
                            "examples": [
                                "Do you have far to travel to work each day?",
                                "Thousands of people are seriously injured at work every year.",
                                "When does she leave for work?"
                            ]
                        },
                        {
                            "explanation": "something created as a result of effort, especially a painting, book, or piece of music: ",
                            "examples": [
                                "The museum has many works by Picasso as well as other modern painters.",
                                "the poetic works of Tagore"
                            ]
                        },
                        {
                            "explanation": "surgery (= a medical operation) that is done to improve someone's appearance: ",
                            "examples": [
                                "She denies having had any cosmetic surgery, but I think she's definitely had some work done."
                            ]
                        },
                        {
                            "explanation": "everything that you might want or expect to find in a particular situation: ",
                            "examples": [
                                "The bridegroom was wearing a morning suit, gloves, top hat - the works."
                            ]
                        },
                        {
                            "explanation": "an industrial building, especially one where a lot of people are employed: ",
                            "examples": [
                                "a steel/iron works"
                            ]
                        },
                        {
                            "explanation": "the parts of a machine, especially those that move: ",
                            "examples": [
                                "If you take the back off this clock, you can see its/the works."
                            ]
                        },
                        {
                            "explanation": "force multiplied by distance moved",
                            "examples": []
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɜːk"
                            ],
                            "us": [
                                "wɝːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to be effective or successful: ",
                            "examples": [
                                "Her idea for reorganizing the department will never work in practice.",
                                "The tablets will start to work in a few minutes.",
                                "Some people think I'm weird doing meditation, but it works for me and that's all that matters.",
                                "Arguably, the monarchy worked well for many centuries."
                            ]
                        },
                        {
                            "explanation": "to do a job, especially the job you do to earn money: ",
                            "examples": [
                                "Where do you work?",
                                "He works at the hospital.",
                                "She worked as a cleaner at the hospital.",
                                "Mike works for a computer company.",
                                "I work in management training.",
                                "Have you any experience of working with children who have learning difficulties?",
                                "It's not unusual for a junior doctor to work a 70 or sometimes an 80-hour week."
                            ]
                        },
                        {
                            "explanation": "to have a particular place as your place of work: ",
                            "examples": [
                                "At that time, our New York staff was working out of a former warehouse in Lower Manhattan."
                            ]
                        },
                        {
                            "explanation": "to make a person or animal do a job: ",
                            "examples": [
                                "The instructors worked us very hard on the survival course.",
                                "Many of the animals were worked to death."
                            ]
                        },
                        {
                            "explanation": "If a machine or device works, it operates, especially correctly and without failure, and if you work it, you make it operate: ",
                            "examples": [
                                "Our phone isn't working.",
                                "You need a team of about twelve people to work a furnace this size.",
                                "The pump works off/on (= uses) wind power.",
                                "The pump is worked by (= uses to operate) wind power.",
                                "I can't get the radio to work."
                            ]
                        },
                        {
                            "explanation": "to succeed gradually in becoming something or cause a person or thing to become something, either by making an effort or by making many small movements: ",
                            "examples": [
                                "He started as a technician and worked his way up through the company to become managing director.",
                                "Eventually she worked her way through (= read) the huge amount of technical papers.",
                                "Vibration tends to make nuts and screws work themselves loose.",
                                "The screws had worked loose over time."
                            ]
                        },
                        {
                            "explanation": "to arrange for something to happen, especially by not using official methods and/or by being clever: ",
                            "examples": [
                                "I don't know how she worked it, but she retired at 50.",
                                "Can we work things (out) so that there's always someone here to answer the phone during office hours?"
                            ]
                        },
                        {
                            "explanation": "to shape, change, or process a substance: ",
                            "examples": [
                                "Working iron requires higher temperatures than bronze.",
                                "Gently work the butter into the flour until there are no lumps left."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "suffix",
                        "ipa": {
                            "uk": [
                                " -wɜːk"
                            ],
                            "us": [
                                " -wɝːk"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to work of a particular type: ",
                            "examples": [
                                "homework",
                                "paperwork"
                            ]
                        },
                        {
                            "explanation": "used to refer to a skill or activity using a particular type of material: ",
                            "examples": [
                                "Girls and boys study woodwork and metalwork at this school."
                            ]
                        },
                        {
                            "explanation": "used to name things made of a particular material: ",
                            "examples": [
                                "stonework",
                                "ironwork"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}