{
    "word": "worm",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɜːm"
                            ],
                            "us": [
                                "wɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a small animal with a long, narrow, soft body without arms, legs, or bones: ",
                            "examples": [
                                "The kiwi bird eats worms, other invertebrates, and berries."
                            ]
                        },
                        {
                            "explanation": "the young of particular types of insect: ",
                            "examples": [
                                "It's distressing enough to find a worm in your apple but finding half of one is worse."
                            ]
                        },
                        {
                            "explanation": "a type of worm that lives in an animal's intestine, feeding on the food there, or on an animal's body, feeding off its blood: ",
                            "examples": [
                                "a parasitic worm",
                                "The vet says our dog has worms."
                            ]
                        },
                        {
                            "explanation": "an unpleasant person who does not deserve respect: ",
                            "examples": [
                                "Don't be such a worm. You don't have to lie to me."
                            ]
                        },
                        {
                            "explanation": "a harmful computer program that can copy itself and spread across a number of connected computers: ",
                            "examples": [
                                "The operating system left servers susceptible to viruses and worms.",
                                "The software promises to protect you from the most pervasive worm attacks."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "wɜːm"
                            ],
                            "us": [
                                "wɝːm"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to succeed in moving along in a difficult or crowded situation, by moving your body slowly and carefully: ",
                            "examples": [
                                "Because he was so small, he could worm (his way) through the crowd.",
                                "She wormed herself under the fence."
                            ]
                        },
                        {
                            "explanation": "to give an animal, especially a pet dog or cat, medicine to kill any worms that might be living inside it: ",
                            "examples": [
                                "Has your dog been wormed?"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}