{
    "word": "worship",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈwɜː.ʃɪp"
                            ],
                            "us": [
                                "ˈwɝː.ʃɪp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "US also"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to have or show a strong feeling of respect and admiration for God or a god: ",
                            "examples": [
                                "On the island the people worshipped different gods."
                            ]
                        },
                        {
                            "explanation": "to go to a religious ceremony: ",
                            "examples": [
                                "They socialize together and worship in the same mosque.",
                                "The poll showed that over 40 percent of Americans worship on a weekly basis."
                            ]
                        },
                        {
                            "explanation": "to love, respect, and admire someone or something very much, often without noticing the bad qualities of that person or thing: ",
                            "examples": [
                                "Her parents worship her.",
                                "As a child, I worshipped my older brother."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈwɜː.ʃɪp"
                            ],
                            "us": [
                                "ˈwɝː.ʃɪp"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the act of worshipping God or a god, often through praying or singing: ",
                            "examples": [
                                "Daily acts of worship do not occur in very many schools.",
                                "Christian/Sikh/Muslim worship",
                                "For Jews, the synagogue is the centre for community worship and study.",
                                "Local people have complained about improperly dressed tourists entering places of worship (= buildings for religious ceremonies or private prayer)."
                            ]
                        },
                        {
                            "explanation": "a lot of love or admiration for a particular thing or person, often when this is considered too much: ",
                            "examples": [
                                "We're in an era of fitness and health worship."
                            ]
                        },
                        {
                            "explanation": "used as a title of respect when speaking to or about a mayor or a magistrate: ",
                            "examples": [
                                "His Worship the Mayor will present the awards."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}