{
    "word": "worth",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "wɜːθ"
                            ],
                            "us": [
                                "wɝːθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "having a particular value, especially in money: ",
                            "examples": [
                                "Our house is worth £200,000.",
                                "Heroin worth about $5 million was seized."
                            ]
                        },
                        {
                            "explanation": "having a particular amount of money: ",
                            "examples": [
                                "She must be worth at least half a million."
                            ]
                        },
                        {
                            "explanation": "to be of reasonable or good value for the price: ",
                            "examples": [
                                "Four days' car hire costs £150, which is well worth it for the freedom it gives you."
                            ]
                        },
                        {
                            "explanation": "to be important or interesting enough to receive a particular action: ",
                            "examples": [
                                "I think this matter is worth our attention.",
                                "When you're in Reykjavík, the National Museum is worth a visit."
                            ]
                        },
                        {
                            "explanation": "to be important or useful to have or do: ",
                            "examples": [
                                "There's nothing worth reading in this newspaper.",
                                "If you are a young, inexperienced driver, it is worth having comprehensive insurance.",
                                "It's worth remembering that prices go up in February."
                            ]
                        },
                        {
                            "explanation": "enjoyable enough or producing enough advantages to make the necessary effort, risk, pain, etc. seem acceptable: ",
                            "examples": [
                                "It was a long climb to the top of the hill, but it was worth it for the view from the top.",
                                "Don't tire yourself out, Geri, it's really not worth it.",
                                "After the plastic surgery I had two black eyes and my face was very swollen. But I knew it would be worth it.",
                                "Forget him, sweetheart, - he's just not worth it."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "wɜːθ"
                            ],
                            "us": [
                                "wɝːθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the amount of money that something can be sold for; value: ",
                            "examples": [
                                "The estimated worth of the plastics and petrochemical industry is about $640 billion."
                            ]
                        },
                        {
                            "explanation": "the amount of something that you could buy for £20, $100, etc.: ",
                            "examples": [
                                "$4 million worth of souvenirs and gift items have been produced for the event."
                            ]
                        },
                        {
                            "explanation": "the importance or usefulness of something or someone: ",
                            "examples": [
                                "He felt as though he had no worth.",
                                "She has proved her worth on numerous occasions.",
                                "The study proved that women were paid less than men holding jobs of comparable worth."
                            ]
                        },
                        {
                            "explanation": "an amount of something that will last a month, a year, etc. or that takes a month, a year, etc. to do: ",
                            "examples": [
                                "a month's worth of grocery shopping",
                                "I've done three hour's worth of work this morning."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}