{
    "word": "would",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "modal verb",
                        "ipa": {
                            "uk": [
                                "wʊd",
                                "wəd",
                                "əd"
                            ],
                            "us": [
                                "wʊd",
                                "wəd",
                                "əd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to refer to future time from the point of view of the past: ",
                            "examples": [
                                "He said he would see his brother tomorrow.",
                                "They knew there would be trouble unless the report was finished by the next day.",
                                "We realized it wouldn't be easy to find another secretary."
                            ]
                        },
                        {
                            "explanation": "used to refer back to a time in the past from a point of view in the future: ",
                            "examples": [
                                "We thought they would have got home by five o'clock, but there was no reply when we phoned."
                            ]
                        },
                        {
                            "explanation": "used to refer to an intention from the point of view of the past: ",
                            "examples": [
                                "He said he would always love her .",
                                "They promised that they would help.",
                                "There was nobody left who would (= was willing to) do it.",
                                "I asked him to move his car but he said he wouldn't (= he refused)."
                            ]
                        },
                        {
                            "explanation": "used to refer to a situation that you can imagine happening: ",
                            "examples": [
                                "I would hate to miss the show.",
                                "I'd go myself but I'm too busy.",
                                "It would have been very boring to sit through the whole speech."
                            ]
                        },
                        {
                            "explanation": "used with if in conditional sentences (= sentences that refer to what happens if something else happens): ",
                            "examples": [
                                "What would you do if you lost your job?",
                                "If I'd had time, I would have gone to see Graham."
                            ]
                        },
                        {
                            "explanation": "used in polite requests and offers: ",
                            "examples": [
                                "Would you mind sharing a room?",
                                "Would you like me to come with you?",
                                "Would you like some cake?"
                            ]
                        },
                        {
                            "explanation": "past simple of\nwill : used to talk about what someone was willing to do or what something was able to do: ",
                            "examples": [
                                "The car wouldn't start this morning."
                            ]
                        },
                        {
                            "explanation": "used to talk about things in the past that happened often or always: ",
                            "examples": [
                                "He would always turn and wave at the end of the street."
                            ]
                        },
                        {
                            "explanation": "used to suggest that what happens is expected because it is typical, especially of a person's behaviour: ",
                            "examples": [
                                "\"Madeleine called to say she's too busy to come.\" \"She would - she always has an excuse.\""
                            ]
                        },
                        {
                            "explanation": "used to express an opinion in a polite way without being forceful: ",
                            "examples": [
                                "I would think we need to speak to the headteacher about this first.",
                                "It's not what we would have expected from a professional service."
                            ]
                        },
                        {
                            "explanation": "used after \"I\" when giving advice: ",
                            "examples": [
                                "I wouldn't (= I advise you not to) worry about it, if I were you."
                            ]
                        },
                        {
                            "explanation": "used after \"why\" when giving or asking the reason for something: ",
                            "examples": [
                                "Why would anyone want to eat something so horrible?"
                            ]
                        },
                        {
                            "explanation": "used to refer to what is very likely: ",
                            "examples": [
                                "\"The guy on the phone had a Southern accent.\" \"That would be Tom.\""
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}