{
    "word": "wrangle",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈræŋ.ɡəl"
                            ],
                            "us": [
                                "ˈræŋ.ɡəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "an argument, especially one that continues for a long time: ",
                            "examples": [
                                "a lengthy wrangle about/over costs",
                                "The joint venture ended in a legal wrangle between the two companies.",
                                "I had a wrangle with a web designer who had ignored pretty much everything I told him."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈræŋ.ɡəl"
                            ],
                            "us": [
                                "ˈræŋ.ɡəl"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to argue with someone about something, especially for a long time: ",
                            "examples": [
                                "They had been wrangling with the authorities about parking spaces.",
                                "The two companies are still wrangling over the details of their proposed collaboration."
                            ]
                        },
                        {
                            "explanation": "to take care of, control, or move animals, especially large animals such as cows or horses: ",
                            "examples": [
                                "The young rancher goes wrangling cattle to earn some money.",
                                "He sold most of his belongings and drove to Wyoming to wrangle horses at a ranch."
                            ]
                        },
                        {
                            "explanation": "to move a person or thing somewhere, usually with difficulty or using force: ",
                            "examples": [
                                "She wrangled the children into their seats in the back of the car.",
                                "They were arrested and wrangled into the police car. "
                            ]
                        },
                        {
                            "explanation": "to take care of or deal with someone or something, usually when this is difficult: ",
                            "examples": [
                                "I was raised in a house where my father worked long hours, and my mother stayed home, wrangling kids, cooking, cleaning, washing clothes.",
                                "She has to wrangle classes of over 30 students.",
                                "He was wrangling with the issue of whether to sign the contract or not."
                            ]
                        },
                        {
                            "explanation": "to succeed in getting something by persuading someone or by being clever in some way: ",
                            "examples": [
                                "Breaking with usual hospital practice, he wrangled permission to follow his patients into the operating theatre.",
                                "She managed to wrangle an invitation to the White House concert."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}