{
    "word": "write",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "raɪt"
                            ],
                            "us": [
                                "raɪt"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "old use"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to make marks that represent letters, words, or numbers on a surface, such as paper or a computer screen, using a pen, pencil, or keyboard, or to use this method to record thoughts, facts, or messages: ",
                            "examples": [
                                "When you fill in the form, please write clearly/legibly in black ink.",
                                "\"I hope to see you next Saturday,\" she wrote.",
                                "Why not write (down) your ideas on a piece of paper before you start?"
                            ]
                        },
                        {
                            "explanation": "to send a letter or message to someone, giving them information or expressing your thoughts or feelings: ",
                            "examples": [
                                "She hasn't written to me (US also written me) recently.",
                                "I wrote my sister a letter.",
                                "My mother wrote to give me details about the party.",
                                "The travel company has written giving information about the trip."
                            ]
                        },
                        {
                            "explanation": "to put all the information that is needed on a document: ",
                            "examples": [
                                "Please will you write (out) your name and address in full.",
                                "I wrote him a cheque for £50."
                            ]
                        },
                        {
                            "explanation": "to create and record something, such as a book, poem, song, or computer program, on paper or on a computer: ",
                            "examples": [
                                "She writes children's books/poems.",
                                "Adam designed and wrote the software.",
                                "He wrote music for films and TV shows.",
                                "The book is very well written."
                            ]
                        },
                        {
                            "explanation": "to have the job of creating books, stories, or articles that will be published: ",
                            "examples": [
                                "She writes for a national newspaper."
                            ]
                        },
                        {
                            "explanation": "to say something in a book, newspaper, magazine, or document: ",
                            "examples": [
                                "In the article, he writes that the problems in the refugee camps are getting worse."
                            ]
                        },
                        {
                            "explanation": "to record information in the memory of a computer: ",
                            "examples": [
                                "There was a problem writing to the disk in the A drive."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}