{
    "word": "wrong",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "rɒŋ"
                            ],
                            "us": [
                                "rɑːŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "not correct: ",
                            "examples": [
                                "Three of your answers were wrong.",
                                "That clock is wrong - it's 12.30, not 12.15.",
                                "Some of his facts are questionable, others are plainly (= completely) wrong."
                            ]
                        },
                        {
                            "explanation": "If someone is wrong, they are not correct in their judgment or statement about something: ",
                            "examples": [
                                "You were wrong about the time - the bank closed at 3.30.",
                                "He's wrong in thinking that we will support the project financially."
                            ]
                        },
                        {
                            "explanation": "to show by your actions that someone's judgment of you was not correct: ",
                            "examples": [
                                "I thought she couldn't do it, but she proved me wrong."
                            ]
                        },
                        {
                            "explanation": "not suitable or correct, or not as it should be: ",
                            "examples": [
                                "She's the wrong person for the job.",
                                "We must have taken a wrong turning.",
                                "I'm sorry, you've got the wrong number (= this is not the phone number you wanted)."
                            ]
                        },
                        {
                            "explanation": "Something that is wrong is not considered to be socially acceptable or suitable: ",
                            "examples": [
                                "She got in with the wrong crowd (= a group of people who behaved badly) at university."
                            ]
                        },
                        {
                            "explanation": "If you ask someone what is wrong, you want to know what is worrying or upsetting them: ",
                            "examples": [
                                "You've been quiet all evening. Is there anything wrong?",
                                "What's wrong with you today?"
                            ]
                        },
                        {
                            "explanation": "If something is the wrong way around, the part that should be at the front is at the back: ",
                            "examples": [
                                "You've got your skirt on the wrong way round."
                            ]
                        },
                        {
                            "explanation": "not considered morally acceptable by most people: ",
                            "examples": [
                                "Children should be taught that violence is wrong.",
                                "It was wrong of her to lie to you.",
                                "What's wrong with having a little fun?"
                            ]
                        },
                        {
                            "explanation": "not working correctly: ",
                            "examples": [
                                "Something's wrong with the television - the picture's fuzzy.",
                                "The doctors are still trying to find out what's wrong."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adverb",
                        "ipa": {
                            "uk": [
                                "rɒŋ"
                            ],
                            "us": [
                                "rɑːŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in a way that is not correct: ",
                            "examples": [
                                "You've spelled my name wrong."
                            ]
                        },
                        {
                            "explanation": "to make a mistake in the way you answer or understand something: ",
                            "examples": [
                                "I spent hours doing that problem and I still got the answer wrong.",
                                "You've got it all wrong - it was your boss that she was annoyed with and not you!"
                            ]
                        },
                        {
                            "explanation": "If a situation or event goes wrong, it becomes unpleasant and is not a success: ",
                            "examples": [
                                "Our marriage began to go wrong after we had our first child."
                            ]
                        },
                        {
                            "explanation": "to make a mistake: ",
                            "examples": [
                                "These shelves are very easy to put together - you can't go wrong.",
                                "I thought I'd done this correctly - I just can't understand where I went wrong."
                            ]
                        },
                        {
                            "explanation": "If a machine goes wrong, it stops working correctly: ",
                            "examples": [
                                "Our TV keeps going wrong."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "rɒŋ"
                            ],
                            "us": [
                                "rɑːŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "what is considered to be morally unacceptable: ",
                            "examples": [
                                "He has no sense of right and wrong.",
                                "I was brought up to tell the truth and know right from wrong.",
                                "As far as her parents are concerned, she can do no wrong (= she is perfect in every way)."
                            ]
                        },
                        {
                            "explanation": "an unfair action: ",
                            "examples": [
                                "He has done us a great wrong.",
                                "She was trying to right (= do something to make better) the wrongs of the past."
                            ]
                        },
                        {
                            "explanation": "If someone is in the wrong, they have made a mistake or done something that is bad or illegal: ",
                            "examples": [
                                "The driver was unquestionably in the wrong."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "rɒŋ"
                            ],
                            "us": [
                                "rɑːŋ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to treat someone in an unfair or unacceptable way: ",
                            "examples": [
                                "She felt deeply wronged by his accusations."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}