{
    "word": "yellow card",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˌjel.əʊ ˈkɑːd"
                            ],
                            "us": [
                                "ˌjel.oʊ ˈkɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in football, and some other sports, a small, yellow card that is shown to a player by the referee (= the official who is responsible for making certain the rules are followed) as a warning that the player has not obeyed a rule, and that they will be punished if it happens again: ",
                            "examples": [
                                "He was shown a yellow card for a nasty foul on Vastic.",
                                "Gazza earned a second yellow card in the semi-final against Germany in the 1990 World Cup, so would miss the final if England won - they lost."
                            ]
                        },
                        {
                            "explanation": "a warning to someone that they will be punished or be at a disadvantage if they continue to behave in a particular way: ",
                            "examples": [
                                "Last week's election results can be seen as a yellow card for the party from the electorate."
                            ]
                        },
                        {
                            "explanation": "in the UK a document with which someone can officially report to the medical authorities any side effects (= effects that happen in addition to the main, intended effect) of a drug, medical treatment, or vaccination : ",
                            "examples": [
                                "We collect the yellow cards and enter them onto a database that allows us to process and analyse the reports rapidly.",
                                "Nurses can now report drug side effects using the established Yellow Card system. "
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˌjel.əʊˈkɑːd"
                            ],
                            "us": [
                                "ˈjel.oʊˌkɑːrd"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "in football and some other sports, to show a player who has not obeyed a rule a small, yellow card as a punishment and a warning that they will not be able to continue playing if it happens again: ",
                            "examples": [
                                "Hunt had already been yellow-carded for a similar offence earlier in the game, when he pushed an opponent.",
                                "He was judged to have dived in Chelsea's penalty area and was yellow carded. "
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}