{
    "word": "yo-yo",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "ˈjəʊ.jəʊ"
                            ],
                            "us": [
                                "ˈjoʊ.joʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "a toy consisting of a circular object that can be made to go up and down a long piece of string to which it is tied: ",
                            "examples": [
                                "The scientists were inspired by spinning toys invented before the industrial age, such as yo-yos and tops.",
                                "His hand was going up and down like a yoyo.",
                                "For the most part he is a well-behaved indoor/outdoor cat. Well, he's kind of like a yo yo, wanting in or out every hour or so."
                            ]
                        },
                        {
                            "explanation": "a decoration made from a circular piece of fabric that is stitched around the edge, with the thread then being pulled tight so that there are folds in the fabric: ",
                            "examples": [
                                "Fabric yo-yos, which look something like gathered flowers, are perfect for adorning anything from wearable accessories to home decor items."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "ˈjəʊ.jəʊ"
                            ],
                            "us": [
                                "ˈjoʊ.joʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used to describe something that moves up and down quickly, or something that changes repeatedly between one level and another: ",
                            "examples": [
                                "yo-yo dieting (= in which someone loses weight and then gains it again, repeatedly)",
                                "It’s the yoyo syndrome - they break up, then get scared and run back to each other, only to break up again.",
                                "If you are not ready to change your life then you are just going to begin the yo yo effect."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "verb",
                        "ipa": {
                            "uk": [
                                "ˈjəʊ.jəʊ"
                            ],
                            "us": [
                                "ˈjoʊ.joʊ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "to move up and down quickly, or to change repeatedly between one level and another: ",
                            "examples": [
                                "She said that her weight had yo-yoed over the years.",
                                "They said that the price of fossil fuels is going to yoyo."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}