{
    "word": "yourself",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "pronoun",
                        "ipa": {
                            "uk": [
                                "jɔːˈself",
                                "jəˈself"
                            ],
                            "us": [
                                "jʊrˈself",
                                "jɚˈself"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": "plural"
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "used when the subject of the verb is \"you\" or the person being spoken to, and the object is the same person: ",
                            "examples": [
                                "Be careful with that knife or you'll cut yourself!",
                                "Katie, control yourself!"
                            ]
                        },
                        {
                            "explanation": "used for emphasis when the subject is \"you\": ",
                            "examples": [
                                "Did you make the dress yourself?",
                                "You can do that yourself."
                            ]
                        },
                        {
                            "explanation": "to behave in your usual manner, rather than behaving in a way you think other people might like: ",
                            "examples": [
                                "The best thing you can do is to go into the interview and just be yourself."
                            ]
                        },
                        {
                            "explanation": "alone or without help from anyone else: ",
                            "examples": [
                                "I'm amazed you managed to move those boxes all by yourself.",
                                "Do you like being by yourself sometimes or do you get lonely?"
                            ]
                        },
                        {
                            "explanation": "for your use only: ",
                            "examples": [
                                "So you have the whole house to yourself this weekend?"
                            ]
                        },
                        {
                            "explanation": "not to be, seem, or feel as happy or healthy as usual: ",
                            "examples": [
                                "Why don't you go home early if you're not feeling yourself?"
                            ]
                        },
                        {
                            "explanation": "used when asking someone about their state of mind when they are physically ill: ",
                            "examples": [
                                "I know you must still be uncomfortable, but how are you in yourself?"
                            ]
                        },
                        {
                            "explanation": "used when both the subject and object of the verb are \"you\" and \"you\" is also being used to refer to people generally: ",
                            "examples": [
                                "You tell yourself everything's all right but you know it's not really."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}