{
    "word": "youth",
    "meaning_cases": [
        {
            "word_type_cases": [
                {
                    "head_content": {
                        "word_type": "noun",
                        "ipa": {
                            "uk": [
                                "juːθ"
                            ],
                            "us": [
                                "juːθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "the period of your life when you are young, or the state of being young: ",
                            "examples": [
                                "I was a fairly good football player in my youth.",
                                "The first volume is the author's account of his misspent youth in the bars of Dublin.",
                                "He looks like a man who's found the secret to eternal youth (= staying young).",
                                "You may not have played tennis as often as him, but at least you've got youth on your side (= you are young)."
                            ]
                        },
                        {
                            "explanation": "the time when something is new or not fully developed : ",
                            "examples": [
                                "It's hard to believe that such an influential film could have been made when cinema was still in its youth.",
                                "This wine should be drunk in its youth.",
                                "Because of the relative youth of the internet and the speed of new developments, the legal and ethical codes of conduct are struggling to keep up with the technology."
                            ]
                        },
                        {
                            "explanation": "a boy or a young man: ",
                            "examples": [
                                "Gangs of youths were throwing stones and bottles at the police."
                            ]
                        },
                        {
                            "explanation": "young people, both male and female, considered as a group: ",
                            "examples": [
                                "the youth of today",
                                "the nation's disaffected youth",
                                "The organization's stated aim is to help at-risk youth."
                            ]
                        }
                    ]
                },
                {
                    "head_content": {
                        "word_type": "adjective",
                        "ipa": {
                            "uk": [
                                "juːθ"
                            ],
                            "us": [
                                "juːθ"
                            ],
                            "uk_other_tense": [],
                            "us_other_tense": [],
                            "other_tense": ""
                        }
                    },
                    "body_content": [
                        {
                            "explanation": "relating to, designed for, or consisting of young people: ",
                            "examples": [
                                "The study showed that youth crime is on the rise.",
                                "There was little money available for sports facilities and youth activities.",
                                "With youth unemployment so high, it is not surprising that some school-leavers with qualifications fail to find jobs.",
                                "He played for the state youth orchestra."
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}